{
  "Title": "Security update for haproxy",
  "Tracking": {
    "ID": "openSUSE-SU-2019:2556-1",
    "Status": "Final",
    "Version": "1",
    "InitialReleaseDate": "2019-11-23T19:23:07Z",
    "CurrentReleaseDate": "2019-11-23T19:23:07Z",
    "RevisionHistory": [
      {
        "Number": "1",
        "Date": "2019-11-23T19:23:07Z",
        "Description": "current"
      }
    ]
  },
  "Notes": [
    {
      "Text": "Security update for haproxy",
      "Title": "Topic",
      "Type": "Summary"
    },
    {
      "Text": "\n  \nThis update for haproxy to version 2.0.5+git0.d905f49a fixes the following issues:\n\nSecurity issue fixed:\n\n- CVE-2019-14241: Fixed a cookie memory corruption problem. (bsc#1142529)\n\nThe update to 2.0.5 brings lots of features and bugfixes:\n\n- new internal native HTTP representation called HTX, was already in 1.9 and is now enabled by default in 2.0\n- end-to-end HTTP/2 support including trailers and continuation frames, as needed for gRPC ; HTTP/2 may also be upgraded from HTTP/1.1 using the H2 preface;\n- server connection pooling and more advanced reuse, with ALPN protocol negotiation (already in 1.9)\n- layer 7 retries, allowing to use 0-RTT and TCP Fast Open to the servers as well as on the frontend\n- much more scalable multi-threading, which is even enabled by default on platforms where it was successfully tested ; by default, as many threads are started as the number of CPUs haproxy is allowed to run on. This removes a lot of configuration burden in VMs and containers\n- automatic maxconn setting for the process and the frontends, directly based on the number of available FDs (easier configuration in containers and with systemd)\n- logging to stdout for use in containers and systemd (already in 1.9).  Logs can now provide micro-second resolution for some events\n- peers now support SSL, declaration of multiple stick-tables directly in the peers section, and synchronization of server names, not just IDs\n- In master-worker mode, the master process now exposes its own CLI and can communicate with all other processes (including the stopping ones), even allowing to connect to their CLI and check their state. It is also possible to start some sidecar programs and monitor them from the master, and the master can automatically kill old processes that survived too many reloads\n- the incoming connections are load-balanced between all threads depending on their load to minimize the processing time and maximize the capacity (already in 1.9)\n- the SPOE connection load-balancing was significantly improved in order to reduce high percentiles of SPOA response time (already in 1.9)\n- the 'random' load balancing algorithm and a power-of-two-choices variant were introduced\n- statistics improvements with per-thread counters for certain things, and a prometheus exporter for all our statistics;\n- lots of debugging help, it's easier to produce a core dump, there are new commands on the CLI to control various things, there is a watchdog to fail cleanly when a thread deadlock or a spinning task are detected, so overall it should provide a better experience in field and less round trips between users and developers (hence less stress during an incident).\n- all 3 device detection engines are now compatible with multi-threading and can be build-tested without any external dependencies\n- 'do-resolve' http-request action to perform a DNS resolution on any, sample, and resolvers now support relying on /etc/resolv.conf to match the local resolver\n- log sampling and balancing : it's now possible to send 1 log every 10 to a server, or to spread the logging load over multiple log servers;\n- a new SPOA agent (spoa_server) allows to interface haproxy with Python and Lua programs\n- support for Solaris' event ports (equivalent of kqueue or epoll) which will significantly improve the performance there when dealing with numerous connections\n- some warnings are now reported for some deprecated options that will be removed in 2.1. Since 2.0 is long term supported, there's no emergency to convert them, however if you see these warnings, you need to understand that you're among their extremely rare users and just because of this you may be taking risks by keeping them\n- A new SOCKS4 server-side layer was provided ; it allows outgoing connections to be forwarded through a SOCKS4 proxy (such as ssh -D).\n- priority- and latency- aware server queues : it is possible now to assign priorities to certain requests and/or to give them a time bonus or penalty to refine control of the traffic and be able to engage on SLAs.\n- internally the architecture was significantly redesigned to allow to further improve performance and make it easier to implement protocols that span over multiple layers (such as QUIC). This work started in 1.9 and will continue with 2.1.\n- the I/O, applets and tasks now share the same multi-threaded scheduler, giving a much better responsiveness and fairness between all tasks as is visible with the CLI which always responds instantly even under extreme loads (started in 1.9)\n- the internal buffers were redesigned to ease zero-copy operations, so that it is possible to sustain a high bandwidth even when forwarding HTTP/1 to/from HTTP/2 (already in 1.9)\n\n\nThis update was imported from the SUSE:SLE-15-SP1:Update update project.",
      "Title": "Details",
      "Type": "General"
    },
    {
      "Text": "The CVRF data is provided by SUSE under the Creative Commons License 4.0 with Attribution (CC-BY-4.0).",
      "Title": "Terms of Use",
      "Type": "Legal Disclaimer"
    },
    {
      "Text": "openSUSE-2019-2556",
      "Title": "Patchnames",
      "Type": "Details"
    }
  ],
  "ProductTree": {
    "Relationships": [
      {
        "ProductReference": "haproxy-2.0.5+git0.d905f49a-lp151.2.3.1",
        "RelatesToProductReference": "openSUSE Leap 15.1",
        "RelationType": "Default Component Of"
      }
    ]
  },
  "References": [
    {
      "URL": "https://lists.opensuse.org/archives/list/security-announce@lists.opensuse.org/thread/FUKOGLVYHSIG27DU7HAIRPPNF5XBHVDD/#FUKOGLVYHSIG27DU7HAIRPPNF5XBHVDD",
      "Description": "E-Mail link for openSUSE-SU-2019:2556-1"
    },
    {
      "URL": "https://www.suse.com/support/security/rating/",
      "Description": "SUSE Security Ratings"
    },
    {
      "URL": "https://bugzilla.suse.com/1142529",
      "Description": "SUSE Bug 1142529"
    },
    {
      "URL": "https://www.suse.com/security/cve/CVE-2019-14241/",
      "Description": "SUSE CVE CVE-2019-14241 page"
    }
  ],
  "Vulnerabilities": [
    {
      "CVE": "CVE-2019-14241",
      "Description": "HAProxy through 2.0.2 allows attackers to cause a denial of service (ha_panic) via vectors related to htx_manage_client_side_cookies in proto_htx.c.",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "important"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2019-14241.html",
          "Description": "CVE-2019-14241"
        },
        {
          "URL": "https://bugzilla.suse.com/1142529",
          "Description": "SUSE Bug 1142529"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": [
            "openSUSE Leap 15.1:haproxy-2.0.5+git0.d905f49a-lp151.2.3.1"
          ]
        }
      ],
      "CVSSScoreSets": {}
    }
  ]
}