{
  "Title": "Recommended update for dkgpg, libTMCG",
  "Tracking": {
    "ID": "openSUSE-SU-2019:2007-1",
    "Status": "Final",
    "Version": "1",
    "InitialReleaseDate": "2019-08-24T16:20:14Z",
    "CurrentReleaseDate": "2019-08-24T16:20:14Z",
    "RevisionHistory": [
      {
        "Number": "1",
        "Date": "2019-08-24T16:20:14Z",
        "Description": "current"
      }
    ]
  },
  "Notes": [
    {
      "Text": "Recommended update for dkgpg, libTMCG",
      "Title": "Topic",
      "Type": "Summary"
    },
    {
      "Text": "\n  \nThis update for dkgpg, libTMCG fixes the following issues:\n\nlibTMCG was updated to version 1.3.18\n\n* This release is two-fold: first, it fixes some bugs (e.g. iterated S2K)\n  of the OpenPGP interface, and second, it adds functionality for handling\n  v5 keys and signatures (see RFC 4880bis-07).\n\nUpdate to version 1.3.17\n\n* VTMF,ASTC,DKG,VRHE,EOTP,COM,VSS: make CheckGroup() more robust\n* VSSHE: security bugfix for Verify_[non]interactive_[_publiccoin]\n* mpz_spowm: added check for correct base in fast exponentiation\n* mpz_sqrtm: remove unused parameter in tmcg_mpz_qrmn_p()\n* configure.ac: added compiler option '-Wextra'\n* mpz_sprime: added tmcg_mpz_smprime() with increased B = 80000\n* RFC4880: changed type of tmcg_openpgp_mem_alloc to unsigned long\n\nUpdate to version 1.3.16\n\n* changed constant TMCG_MAX_CARDS (decreased by factor 2)\n* changed formulas for TMCG_MAX_VALUE_CHARS and TMCG_MAX_KEY_CHARS\n* RFC4880: added support of Preferred AEAD Algorithms [RFC 4880bis]\n* RFC4880: added output for key usage 'timestamping' [RFC 4880bis]\n* RFC4880: changed tmcg_openpgp_byte_t: unsigned char -\u003e uint8_t\n* RFC4880: added PacketAeadEncode() [RFC 4880bis]\n* RFC4880: added SymmetricDecryptAEAD() and SymmetricEncryptAEAD()\n* changed formula for TMCG_MAX_KEYBITS (increased by factor 2)\n* mpz_srandom: bugfix in Botan code branch of mpz_grandomb()\n\nUpdate to version 1.3.15:\n\n* This is a maintenance release that fixes some bugs, e.g. in the Botan\n  support of functions from module mpz_srandom. Moreover, some interfaces\n  of the OpenPGP implemenation have been added and removed. For some\n  modules of LibTMCG a basic exception handling has been introduced.\n\nUpdate to version 1.3.14:\n\n* With this release three additional parameters for the control of secure\n  memory allocation have been added to init_libTMCG(). They are explained\n  in the reference manual. Moreover, the OpenPGP interface has been\n  enhanced in several way, e.g., ECDH, ECDSA and EdDSA are supported now.\n\nUpdate to 1.3.13:\n\n* Lots of major improvements for undocumented OpenPGP interface\n* PRNG from Botan is used as additional source of randomness\n* SHA3 is emulated if runtime version of libgcrypt is too old\n\ndkgpg was updated to version 1.1.3: \n\n* This is a bugfix release that includes only three minor improvements: a\n  direct-key signature (0x1f) for the primary key is added by default such\n  that restricting key servers (e.g. keys.openpgp.org) can deliver a\n  cryptographically checkable key without verification of any included\n  user ID or without appended subkey. The command line interface of\n  dkg-decrypt has been improved in order to give users an easy access to\n  the symmetric-key decryption mode. An additional option ('-5') for\n  dkg-sign allows to generate V5 signatures (cf. draft RFC 4880bis).\n\nUpdate to version 1.1.2:\n\n* This release adds a lot of features to some programs: two new options\n  ('-K' and '-f') allow dkg-keysign to read the certification key from a\n  keyring instead of a single key block file. Moreover, with option '-a'\n  an interactive confirmation by the user is required for each signature.\n  Passive support of V5 keys (cf. draft RFC 4880bis) has been added for\n  all programs, however, dkg-generate still generates V4 keys only,\n  because this new feature of the draft is not widely spread. There is\n  also a new encryption capability: an empty KEYSPEC tells dkg-encrypt to\n  create a symmetric-key encrypted session key, i.e., the user has to\n  supply a passphrase for encryption and decryption without any public-key\n  cryptography involved. Last but not least, two bugs have been fixed:\n  First, dkg-decrypt failed on many ZIP-compressed OpenPGP messages with \n  'ZLIB ERROR: -3 invalid block type' due to a bug in decompression logic.\n  Second, dkg-decrypt failed in a special case of symmetric-key encrypted\n  session keys. Finally, the non-installing program dkg-fuzzer (generates\n  fuzzy samples of somehow corrupted OpenPGP stuctures) has been added.\n\nUpdate to version 1.1.1:\n\n* Some small improvements have been applied for dkg-generate: Two new\n  options ('-u' and '-N') allow providing the initial user ID and to\n  disable the passphrase at command line. Moreover, since this release\n  dkg-timestamp and dkg-timestamp-verify require a special key usage flag\n  from recent RFC 4880bis draft to select so-called timestamping keys.\n  Finally, the synchronization time of the internally used broadcast\n  protocol was reduced to a more reasonable amount and in dkg-decrypt the\n  detection of end of data for message and decryption shares was changed.\n\nUpdate to version 1.1.0:\n\n* This release supports Authenticated Encryption with Associated Data (AEAD)\n  in accordance to RFC 4880bis (draft); this can be enforced with the new\n  added option '-a' when  dkg-(d)encrypt is used. For using domain parameters,\n  as described in RFC 7919, one should specify the new option '-r', when\n  dkg-gencrs is used. Last, for key generation (dkg-generate) the timestamp\n  option was added ( '--timestamping') which sets a key usage flag.\n\n- Update to version 1.0.9\n    This release improves the possibilities of DKGPG further. With the new\n    programs dkg-adduid and dkg-revuid an user ID can be added and revoked,\n    respectively. The program dkg-revoke now supports a human-readable\n    reason for revocation (by option '-R') and dkg-decrypt verifies an\n    included signature according to a given key ring (option '-k'). Last\n    but not least, by the program dkg-addrevoker an external revocation\n    key can be specified.\n\nUpdate to version 1.0.8:\n\n* First of all, passive support for ECDSA, ECDH, and EdDSA (cf. RFC 6637\n  and Werner Koch's draft RFC 4880bis) has been added by relying on the\n  most recent version of LibTMCG. The threshold signature scheme and the\n  threshold encryption are still limited to finite field cryptography\n  (i.e. DSA and ElGamal). Moreover, the programs generate and recognize\n  a few other new OpenPGP features (e.g. issuer fingerprint subpackets)\n  from RFC 4880bis. Compressed messages are now decompressed by the\n  program dkg-decrypt using zlib Compression Library (and optionally by\n  library routines from libbzip2). This completes DKGPG's compatibility\n  with other OpenPGP software, however, the prefered compression algorithm\n  (i.e. 'no compression') in self-signatures of generated keys is kept\n  for now. Support for symmetric-key decryption by dkg-decrypt has been\n  added too. The program dkg-verify now reads the signature from a file,\n  if option '-s' is used. To keep track of later protocol changes, all\n  interactive programs include a version identifier in their common ID of\n  the reliable broadcast channel. Thus programs from previous releases\n  will not communicate with those of this release. With the new programs\n  dkg-timestamp and dkg-timestamp-verify a OpenPGP timestamp signature\n  can be generated and verified, respectively. Last but not least, by the\n  new option '-y' some programs (dkg-generate, dkg-decrypt, dkg-sign,\n  dkg-keysign, and dkg-timestamp) will work with regular OpenPGP keys too.\n  The README file contains a configuration sample showing how to replace\n  classic PGP by DKGPG in the famous mail user agent mutt based on this\n  option. Please note that this feature is experimental and semantics\n  may be changed later.\n\nUpdate to 1.0.7:\n\n* Small improvments due to the new OpenPGP structures from libTMCG\n* '-k' option has been added to further programs\n* OpenPGP cleartext signatures can be generated with the '-t' option\n* Output of potentially malicious user IDs has been sanitized in\n    dkg-keycheck, dkg-keyinfo, and dkg-keysign\n\nThis update was imported from the openSUSE:Leap:15.0:Update update project.",
      "Title": "Details",
      "Type": "General"
    },
    {
      "Text": "The CVRF data is provided by SUSE under the Creative Commons License 4.0 with Attribution (CC-BY-4.0).",
      "Title": "Terms of Use",
      "Type": "Legal Disclaimer"
    },
    {
      "Text": "openSUSE-2019-2007",
      "Title": "Patchnames",
      "Type": "Details"
    }
  ],
  "ProductTree": {
    "Relationships": [
      {
        "ProductReference": "dkgpg-1.1.3-bp151.4.3.1",
        "RelatesToProductReference": "SUSE Package Hub 15",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "libTMCG-devel-1.3.18-bp151.4.3.1",
        "RelatesToProductReference": "SUSE Package Hub 15",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "libTMCG18-1.3.18-bp151.4.3.1",
        "RelatesToProductReference": "SUSE Package Hub 15",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "dkgpg-1.1.3-bp151.4.3.1",
        "RelatesToProductReference": "SUSE Package Hub 15 SP1",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "libTMCG-devel-1.3.18-bp151.4.3.1",
        "RelatesToProductReference": "SUSE Package Hub 15 SP1",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "libTMCG18-1.3.18-bp151.4.3.1",
        "RelatesToProductReference": "SUSE Package Hub 15 SP1",
        "RelationType": "Default Component Of"
      }
    ]
  },
  "References": [
    {
      "URL": "https://lists.opensuse.org/archives/list/security-announce@lists.opensuse.org/thread/ZTBELEAK5GQEE7CILTKYEW73BRYISNIK/#ZTBELEAK5GQEE7CILTKYEW73BRYISNIK",
      "Description": "E-Mail link for openSUSE-SU-2019:2007-1"
    },
    {
      "URL": "https://www.suse.com/support/security/rating/",
      "Description": "SUSE Security Ratings"
    }
  ],
  "Vulnerabilities": null
}