{
  "id": "PYSEC-2020-101",
  "modified": "2023-11-08T04:03:53.028377Z",
  "published": "2020-03-23T23:15:00Z",
  "aliases": [
    "CVE-2020-5252",
    "GHSA-7q25-qrjw-6fg2"
  ],
  "details": "The command-line \"safety\" package for Python has a potential security issue. There are two Python characteristics that allow malicious code to “poison-pill” command-line Safety package detection routines by disguising, or obfuscating, other malicious or non-secure packages. This vulnerability is considered to be of low severity because the attack makes use of an existing Python condition, not the Safety tool itself. This can happen if: You are running Safety in a Python environment that you don’t trust. You are running Safety from the same Python environment where you have your dependencies installed. Dependency packages are being installed arbitrarily or without proper verification. Users can mitigate this issue by doing any of the following: Perform a static analysis by installing Docker and running the Safety Docker image: $ docker run --rm -it pyupio/safety check -r requirements.txt Run Safety against a static dependencies list, such as the requirements.txt file, in a separate, clean Python environment. Run Safety from a Continuous Integration pipeline. Use PyUp.io, which runs Safety in a controlled environment and checks Python for dependencies without any need to install them. Use PyUp's Online Requirements Checker.",
  "affected": [
    {
      "package": {
        "ecosystem": "PyPI",
        "name": "safety",
        "purl": "pkg:pypi/safety"
      },
      "ranges": [
        {
          "type": "ECOSYSTEM",
          "events": [
            {
              "introduced": "0"
            },
            {
              "fixed": "1.8.7"
            }
          ]
        }
      ],
      "versions": [
        "0.1.0",
        "0.2.0",
        "0.2.1",
        "0.2.2",
        "0.3.0",
        "0.4.0",
        "0.5.0",
        "0.5.1",
        "0.6.0",
        "1.0.0",
        "1.0.1",
        "1.0.2",
        "1.1.0",
        "1.1.1",
        "1.2.0",
        "1.3.0",
        "1.4.0",
        "1.4.1",
        "1.5.0",
        "1.5.1",
        "1.6.0",
        "1.6.1",
        "1.7.0",
        "1.8.0",
        "1.8.1",
        "1.8.2",
        "1.8.3b0",
        "1.8.3",
        "1.8.4",
        "1.8.5",
        "1.8.6"
      ],
      "database_specific": {
        "source": "https://github.com/pypa/advisory-database/blob/main/vulns/safety/PYSEC-2020-101.yaml"
      }
    }
  ],
  "references": [
    {
      "type": "WEB",
      "url": "https://pyup.io/posts/patched-vulnerability/"
    },
    {
      "type": "WEB",
      "url": "https://github.com/akoumjian/python-safety-vuln"
    },
    {
      "type": "ADVISORY",
      "url": "https://github.com/pyupio/safety/security/advisories/GHSA-7q25-qrjw-6fg2"
    }
  ]
}