{
  "Identifier": "GHSA-vp35-85q5-9f25",
  "PackageSlug": "go/github.com/docker/docker",
  "Title": "Container build can leak any path on the host into the container",
  "Description": "Moby is the open source Linux container runtime and set of components used to build a variety of downstream container runtimes, including Docker CE, Mirantis Container Runtime (formerly Docker EE), and Docker Desktop. Moby allows for building container images using a set of build instructions (usually named and referred to as a \"Dockerfile\"), and a build context, which is not unlike the CWD in which the Dockerfile instructions are executed.\n\nContainers may be built using a variety of tools and build backends available in the Moby ecosystem; in all cases, builds may not include files outside of the build context (such as using absolute or relative-parent paths). This is enforced through both checks in the build backends, and the containerization of the build process itself.\n\nVersions of Git where CVE-2022-39253 is present and exploited by a malicious repository, when used in combination with Moby, are subject to an unexpected inclusion of arbitrary filesystem paths in the build context, without any visible warning to the user.\n\nThis issue was originally reported by Wenxiang Qian of Tencent Blade Team, and the root-cause analysis was performed by Cory Snider of Mirantis, with assistance from Bjorn Neergaard of the same. The issue was then reported to the Git project, and Taylor Blau led the process resolving the root issue in Git.",
  "Date": "2024-07-08",
  "Pubdate": "2022-11-11",
  "AffectedRange": "\u003c20.10.20",
  "FixedVersions": [
    "20.10.20"
  ],
  "AffectedVersions": "All versions before 20.10.20",
  "NotImpacted": "All versions starting from 20.10.20",
  "Solution": "Upgrade to version 20.10.20 or above.",
  "Urls": [
    "https://github.com/advisories/GHSA-vp35-85q5-9f25",
    "https://github.com/moby/moby/security/advisories/GHSA-vp35-85q5-9f25",
    "https://github.blog/2022-10-17-git-security-vulnerabilities-announced",
    "https://github.com/moby/moby",
    "https://github.com/moby/moby/releases/tag/v20.10.20",
    "https://lore.kernel.org/git/xmqq4jw1uku5.fsf@gitster.g/T/#u"
  ],
  "CvssV2": "",
  "CvssV3": "",
  "UUID": "7e6404c8-0a00-4418-857e-c18ac05d07a3"
}