{
  "Title": "Security update for cfengine, cfengine-masterfiles",
  "Tracking": {
    "ID": "SUSE-SU-2023:2126-1",
    "Status": "Final",
    "Version": "1",
    "InitialReleaseDate": "2023-05-08T13:05:38Z",
    "CurrentReleaseDate": "2023-05-08T13:05:38Z",
    "RevisionHistory": [
      {
        "Number": "1",
        "Date": "2023-05-08T13:05:38Z",
        "Description": "current"
      }
    ]
  },
  "Notes": [
    {
      "Text": "Security update for cfengine, cfengine-masterfiles",
      "Title": "Topic",
      "Type": "Summary"
    },
    {
      "Text": "This update for cfengine, cfengine-masterfiles fixes the following issues:\n\nChanges in cfengine:\n\n- cfengine3.target: removed, replaced by upstream cfengine3.service\n- In version 3.15.0, cfengine core split off libutils and libcompat\n  directories as libntech. We include both together as we do not\n  use or plan on using it outside of cfengine.\n\nChanges since 3.7.3 are below, in reverse chronological order:\n\n- Update to version 3.21.0: (jsc#SLE-24222, bsc#1197029, CVE-2021-44215)\n\n  * Added cf-support utility for generating support information\n    (ENT-9037)\n  * Adjusted cf-check and package module code for empty updates list\n    (ENT-9050)\n  * '$(this.promiser)' can now be used in 'files' promise attributes\n    'if', 'ifvarclass' and 'unless' (CFE-2262, ENT-7008)\n  * Fixed storage promise for nfs on MacOS (CFE-4093)\n  * Fixed definition of _low_ldt class from cf-monitord (CFE-4022)\n  * Insertion of contents of a file with blank lines into another\n    file with blank lines no longer results in mixed content (ENT-8788)\n  * Added suggestion to use a negative lookahead when non-convergent edits \n    are attempted (CFE-192)\n  * Unresolved function calls that return scalar values are now\n    considered OK for constraints expecting strings during syntax\n    check (CFE-4094)\n  * cf-monitord now honors monitorfacility in body monitor control\n    (ENT-4492)\n  * cf-serverd now periodically reloads its policy if it contains\n    unresolved variables (e.g. $(sys.policy_hub) in 'allowconnect'). (ENT-8456)\n  * cf-serverd now starts in the network-online.target on systemd-based\n    systems (ENT-8456)\n  * edit_line bundles can now use the new $(edit.empty_before_use)\n    variable mirroring the value of edit_defaults=\u003eempty_before_use\n    of the related files promise (ENT-5866)\n  * Package modules with unresolved variables in their names are\n    now skipped in package queries (ENT-9377)\n  * Removed unsupported name_connect capability for udp_socket class\n    (ENT-8824)\n  * 'meta' attribute can now be used in custom promises (CFE-3440)\n  * Custom promise modules can now support the 'action_policy'\n    feature allowing promises of their custom types to be used\n    in dry-run and simulation modes and in combination with\n    'action_policy =\u003e 'warn''. (CFE-3433)\n  * Use of custom promise modules that don't fully specify protocol\n    now results in warning (CFE-3433)\n  * Warnings are logged if levels of log messages from custom promise\n    modules don't match results of their related promises (CFE-3433)\n  * Adjusted SELinux policy for RHEL 9 (ENT-8824)\n  * Fixed SELinux policy to allow hub to send emails (ENT-9557, ENT-9473)\n  * SELinux no longer breaks SQL queries with large result sets on\n    RHEL 8 hubs (ENT-9496)\n  * Added SELinux LDAP port access for Mission Portal (ENT-9694)\n  * Allowed ciphers are now properly split into TLS 1.3 cipher suites\n    and ciphers used for TLS 1.2 and older (ENT-9018)\n  * Fixed git_cfbs_deploy_refspec in masterfiles_stage leaving temp dir\n\n- Update to version 3.20.0:\n\n  * 'rxdirs' now defaults to 'false'. This means that the read\n    permission bit no longer implies execute bit for directories,\n    by default.\n    Permission bits will be exactly as specified. To restore the\n    old behavior you can still enable 'rxdirs' explicitly. (CFE-951)\n  * 'N' or 'Ns' signal specs can now be used to sleep  between signals\n    sent by 'processes' promises (CFE-2207, ENT-5899)\n  * Directories named .no-distrib are no longer copied from policy\n    server (in bootstrap/failsafe) (ENT-8079)\n  * Files promises using content attribute or template method now\n    create files by default unless create =\u003e 'false' is specified.\n    (CFE-3955, CFE-3916)\n  * template_method mustache and inline_mustache now create file\n    in promiser, if template rendering was successfull and file\n    does not exist. (ENT-4792)\n  * Added support for use of custom bodies in custom promise types\n    (CFE-3574)\n  * Custom promise modules now never get promise data with unresolved\n    variables (CFE-3434)\n  * Custom promises now use standard promise locking and support\n    ifelapsed (CFE-3434)\n  * Enable comment-attribute for custom promise types (CFE-3432)\n  * cf-secret encrypt now encrypts for localhost if no key or host is\n    specified (CFE-3874)\n  * CFEngine now builds with OpenSSL 3 (ENT-8355)\n  * CFEngine now requires OpenSSL 1.0.0 or newer (ENT-8355)\n  * Moved Skipping loading of duplicate policy file messages from\n    VERBOSE to DEBUG (CFE-3934)\n  * CFEngine processes now try to use getent if the builtin user/group\n    info lookup fails (CFE-3937)\n  * No longer possible to undefine reserved hard classes (ENT-7718)\n  * Unspecified 'rxdirs' now produces a warning (CFE-951)\n  * Fixed wrong use of log level in users promises log messages\n    (CFE-3906)\n  * Fixed default for ignore_missing_bundles and ignore_missing_inputs\n    The issue here was that these attributes should default to false,\n    but when they are assigned with an unresolved variable, they\n    would default to true. (ENT-8430)\n  * Added protocol 3 (cookie) to syntax description (ENT-8560)\n  * Moved errors from data_sysctlvalues from inform to verbose\n    (CFE-3818)\n  * Fixed inconsistencies with methods promises and missing bundles\n\n- Update to 3.10.3 (fate#323149, bsc#1086475)\n\n    - Enable Xen hypervisor detection on all x86 platforms (CFE-2203)\n    - cf-execd systemd service now only kills cf-execd itself (ENT-3395)\n    - Ignore commented out entries in fstab when edit_fstab is true.\n      (CFE-2198)\n    - Do not move obstructions in warn policy mode (CFE-2740)\n    - libutils/man.c: allow to override build time\n    - Improve support for Alpine Linux\n    - Promise comments for file changes moved to verbose (ENT-3414)\n    - cf-execd now re-parses augments on policy reload (CFE-2406)\n    - Fix memory leak in cf-execd, triggered when sending email failed.\n      (CFE-2712)\n    - Improve logging of ACL errors (ENT-3455)\n    - Fix bug preventing permission changes on Unix sockets. (CFE-1782)\n    - Do not tag large volatile variables for inventory\n      sys.interfaces_data, sys.inet and sys.inet6 are commonly larger than the\n      maximum data size allowed to be collected by cf-hub. Data larger than 1k\n      is truncated. Instead of reporting truncated data this change stops\n      tagging the variable so that it will not be collected to the Enterprise\n      hub and will not be available in Mission Portal.\n      Do not tag sys.inet and sys.inet6 for inventory (ENT-3483)\n    - Fix mergedata segfault when called on a non-container (CFE-2704)\n    - fix storage mount promise when existing mount point has a similar path\n      (CFE-1960)\n    - Properly redirect init script to systemd on debian systems (ENT-3326)\n    - Do not segfault if policy_server.dat only contains whitespaces and/or line breaks\n    - Fix segfault when cf-promises -p is called against a file with syntax errors.\n      (CFE-2696)\n    - Fix rare cf-execd hang (CFE-2719)\n    - Properly reverse-resolve DNS names longer than 63 chars. (ENT-3379)\n    - Fix segfault on JSON policy files with no bundles and bodies\n      (CFE-2754)\n    - Set the exit value when running cf-key\n      When running cf-key to generate new keys, set the exit value of the\n      program to be 0 on success and 1 on failure. This makes it easier to\n      catch errors during setup of a new machine.\n      Change the default behavior of the program to not write anything to stdout,\n      opting to use the Log() function which can write to stdout and will also\n      allow output to be sent to syslog.\n      Add a --inform option to set the global log level to LOG_LEVEL_INFO.\n      Change the permissions of the randseed file to 600 and catch the exception\n      if the chmod call fails.\n    - Improve misleading verbose message\n      For constraints if/ifvarclass/unless, we now print the whole rval of the constraint.\n      Previously the message was just 'skipping variable because ifvarclass is not defined' while the variable itself was defined.\n      Old message example:\n        verbose: Skipping promise 'mailto' because 'if'/'ifvarclass' is not defined\n      Changed to:\n         verbose: Skipping promise 'mailto' because 'ifvarclass =\u003e not(isvariable('mailto'))' is not defined\n      (CFE-2697)\n    - Suppress output from systemctl based restart of services in bootstrap/failsafe\n      (CFE-1459)\n\n3.10.2:\n\n    - fix cf-execd not exiting immediately with SIGTERM on AIX (ENT-3147)\n    - Fix logic detecting if running under a Xen Hypervisor (CFE-1563)\n    - Fix automatic service stops based on runlevel (redhat/centos)\n      (CFE-2611)\n    - Allow opening symlinks owned by root or by the current user\n      (CFE-2516)\n    - Stop service cfengine3 status from warning on multiple httpd processes\n      (ENT-3123)\n    - fix IPv6 parsing to be un-reversed (CFE-2580)\n\n3.10.1:\n\n    New features/additions:\n\n    - 'make tar-package' should create a tarball with the contents of\n      'make install' (ENT-3041)\n\n    Bugfixes:\n\n    - Fix rare output truncation on Solaris 10/11 (CFE-2527)\n    - Change: Don't error during dry run for proposed execution. (CFE-2561)\n    - prevent LMDB assertion on AIX by ensuring nested DB calls are\n      not occuring during signal handler cleanup (CFE-1996)\n    - Detect Amazon Linux and set 'AmazonLinux' hard class and\n      sys.flavour variable.\n    - Fix 'lastseenexpireafter' 32-bit signed int overflow.\n    - Add missing pcre build flags to cf-key (CFE-2525)\n    - Fix a bug which could cause cf-execd to believe there was\n      an error when sending the email report, when there really wasn't.\n    - cf-serverd: Auto configure max open files ulimit according to\n      maxconnections (CFE-2575)\n    - Added vars and classes for CoreOS (ENT-3043)\n\n3.10.0:\n\n    New features/additions:\n\n    - All new features/additions for 3.8 and 3.9 are also included in 3.10.\n    - Add: Classes body tailored for use with diff\n    - New feature: Classes promise: allow classes without an expression to default to defined.\n    - Support for custom ports and host names as policy hub (CFE-953)\n    - Add: Definition of from_cfexecd for cf-execd initiated runs\n      (CFE-2386)\n    - Add \u003c \u003c= \u003e \u003e= operators to eval().\n    - Add testing jUnit and TAP bundles and include them in stdlib.cf\n    - New function isipinsubnet() (ENT-7949)\n    - LogDebug(): implement module-based debug logging.\n      Now most DEBUG messages are *not* printed even when '-d' is in use, but\n      the specific debug module has to be enabled on the command line. For\n      example to enable all log modules, run:\n      cf-agent -d --log-modules=all\n    - Add: edit_line contains_literal_string to stdlib\n    - add variablesmatching_as_data() function paralleling variablesmatching()\n      (Redmine #7885)\n    - Allow specifying agent maxconnections via def.json (CFE-2461)\n    - Add getuserinfo() function\n    - Add body agent control select_end_match_eof option. (CFE-2390)\n    - Add class to enable post transfer verification during policy updates\n    - Add ability to append to bundlesequnece with def.json (CFE-2460)\n    - policy_server.dat now appends a newline and supports host \u0026 port\n\n    Changes:\n\n    - Rewrite iteration engine to avoid combinatorial explosion with nested variable expansions.\n      This speeds up enormously the execution of policies that included long\n      slists or JSON containers, that in the past didn't even terminate.\n      Change: 'cf_null' string literal was changed to not be something\n              special, and it's now a string that can be used anywhere, like\n              in slists or part of bundlesequence etc.\n      NOTE: Old policy should be grep'ed for 'cf_null' and in case such\n            occurences were handled specially, they should be reworked.\n      Change: '--empty-list--' is now never printed by format(),\n              an empty list is now printed as '{  }'.\n      Change: Order of pre-evaluation was slightly changed, A new 'vars' pass\n              at the beginning of pre-evaluation was added. It used to be\n              classes-vars, but it was changed to vars-classes-vars. As a\n              result some classes or variables might be evaluated at a\n              different time than before. As always try to write policy code that works no matter what the\n              order of execution is.\n              One way is to always *guard* the execution of functions to avoid\n              bogus function results.  For example the following will avoid\n              running execresult() bevore the file has been created:\n                execresult('cmd /path/to/filename') if =\u003e fileexists('/path/to/filename');\n      C internals: NULL Rlist is now perfectly valid, in fact it is the only\n                   way to denote an empty Rlist.\n      C internals: Since a slist variable can be NULL, API of\n                   EvalContextVariableGet() changed: The way to detect if a\n                   variable is found, is not to check return value for NULL,\n                   but to check returned *type* for CF_DATA_TYPE_NONE.\n                   Fixed what I could find as wrong API uses. (CFE-2162)\n    - Allow arbitrary service policies (CFE-2402)\n    - Behaviour change: cf-execd: Do not append -Dfrom_cfexecd to exec_command .\n      (CFE-2386)\n    - Failsafe/Bootstrap no longer copy files starting with .git (like .gitignore) or .mailmap\n      (CFE-2439)\n    - Change: Enable strict transport security\n    - Change: Disable http TRACE method\n    - Change: Verify transfered files during policy update\n    - Allow getvariablemetatags() and getclassmetatags() to get a specific tag key\n    - Change: Use more restrictive unix socket perms (ENT-2705)\n    - Add sys.user_data container for user starting agent.\n    - Pass package promise options to underlying apt-get call (#802)\n      (CFE-2468)\n    - Change: Enable agent component management policy on systemd hosts\n      (CFE-2429)\n    - Change: Switch processes restart_class logging to verbose\n    - Change: Log level for keeping verbatim JSON to DEBUG (CFE-2141)\n    - Change: Require network before cfengine services (CFE-2435)\n    - Behaviour change: getvalues(inexistent_var) returns an empty list.\n      Restores 3.7.x and earlier behaviour. (CFE-2479)\n    - Behaviour change: when used with CFEngine 3.10.0 or greater,\n      bundles set_config_values() and set_line_based() are appending a\n      trailing space when inserting a configuration option with empty value.\n      (CFE-2466)\n    - Behaviour change: getvalues() always returns a list now. Even when v is a simple\n      string (i.e. not an iterable) it will return an slist with one element:\n      the value of the string variable.\n    - Behaviour change: readintlist() now prints an error if the\n      file contains real numbers, not integers, and aborts; previously it was\n      printing an info-level error message, was half-reading an integer out of\n      the real, and was continuing successfully.\n    - Ensure synchronous start and stop with systemctl (ENT-2841)\n    - Change select_region INI_section to match end of section or end of file\n      (CFE-2519)\n\n    Bug fixes:\n\n    - fix files promise not setting ACL properly on directories. (CFE-616)\n    - Upgrade CFEngine dependencies to the following versions:\n      - lixml2 2.9.4\n      - OpenSSL 1.0.2j\n      - LibYAML 0.1.7\n      - Curl 7.50.3\n    - Fix cumulative() to accept up to 1000 years, like it's documented.\n    - Fixed parsing of host name/IP and port number in cf-runagent\n      (CFE-546)\n    - Fix intermittent error message of type:\n      'error: Process table lacks space for last columns: ' (CFE-2371)\n    - storage: Properly initialize the list of current mounts (CFE-1803)\n    - Fix 'contain' attribute 'no_output' having no effect when\n      the 'commands' promise is using 'module =\u003e 'true''. (CFE-2412)\n    - Fix bug which caused empty emails to be sent from cf-execd\n      if there was no previous output log and the new log was fully filtered\n      by email filters. (ENT-2739)\n    - allow ifelse(FALSE, $(x), 'something else') to work. (CFE-2260)\n    - Fix connection cache, reuse connections when possible. (CFE-2447)\n    - Fix rare bug that would sometimes prevent redis-server from launching.\n    - Fix bug in files promise when multiple owners are promised\n      but first one doesn't exist, and improve logging . (CFE-2432)\n    - define kept outcome with action warn if edit_line is as expected\n      (CFE-2424)\n    - Example using getvariablemetatags() and getclassmetatags() to get a specific tag key\n    - Remove 2k limit on strings length when writing JSON policies\n      (CFE-2383)\n    - Fix ttime_range constraint to go higher than 2G as number of seconds.\n    - Change: cronjob bundle tolerates different spacing\n    - Allow editing fields in lines longer than 4k (CFE-2438)\n    - Don't send empty emails for logs where everything is filtered.\n      (ENT-2739)\n    - allow maplist(), maparray(), and mapdata() to evaluate function calls during iteration\n      (ARCHIVE-1619)\n    - insert_lines is no longer implicitly matching EOF as\n      end of the region if 'select_end' pattern is not matched . (CFE-2263)\n    - Change: Remove executable bit from systemd units (CFE-2436)\n    - cf-serverd should reload def.json when reloading policy (CFE-2406)\n    - Fix cf-monitord detection of usernames of the process table on AIX.\n    - Speed up local and remote file copying and fix spurious errors.\n      (ENT-2769)\n    - Fix occasional segfault when running getindices() on a\n      variable that has indices of multiple depths (e.g. both 'a[x]' and\n      'a[x][y]'). (CFE-2397)\n    - When no file is provided when calling cf-promises\n      with cf or json output, use promises.cf by default. This restores the\n      previous behavior. (CFE-2375)\n    - Fix: Services starting or stopping unnecessarily (CFE-2421)\n    - Change: Split systemd units (CFE-2278)\n    - EOF is  matched as an end of the region in edit_line\n      promises only if 'select_end_match_eof' parameter is true. (CFE-2263)\n    - Fix double logging of output_prefix, and log process name for cf-agent syslog messages.\n      (CFE-2225)\n    - Be less verbose if a network interface doesn't have a MAC address.\n      (CFE-1995)\n    - Fix: CFEngine choking on standard services (CFE-2806)\n    - fix insert_lines related memory corruption (CFE-2520)\n    - fix cf-serverd crash when reporting corrupted data. (ENT-3023)\n    - Fix ability to manage INI sections with metachars for\n      manage_variable_values_ini and set_variable_values_ini (CFE-2519)\n    - Fix apt_get package module incorrectly using interactive mode.\n    - Fix crash on Solaris when ps ucb variant is not available. (CFE-2506)\n    - cf-serverd: Do not close connection when file does not exist.\n      (CFE-2532)\n    - getvalues() now behaves correctly for old CFEngine arrays of depth 1.\n      Known issues: getvalues() still misbehaves with double-indexed arrays\n      (see (CFE-2504, CFE-2536)\n\n3.9.0:\n\n    New features/additions:\n\n    - Add optional interface parameter to iprange() to match only one interface.\n    - Allow '=' in symbolic modes (Redmine #7826)\n    - Add: FreeBSD ports package module\n    - New package module for FreeBSD pkg package manager.\n    - Add support for adding/removing fifos in policy\n    - Add Linux parsing of /proc/net/ data.\n      - sys.inet\n      - sys.inet6\n      - sys.interface_data\n      - Data is returned as a data container.\n      - See documentation for more details. (Jira CFE-1991)\n    - sys.ip2iface: new reverse mapping variable from IP to interface name\n    - Namespaced classes can now be specified on the command line.\n    - namespaces can now be passed to cf-runagent -D and --remote-bundles\n      (Redmine #7856)\n    - Add 'cf-full' and 'json-full' to cf-promises '-p' option.\n      They generate output based on the entire policy. The existing 'cf'\n      already behaved this way, and it has now been changed to generate\n      output only for a single file, which the existing 'json' option\n      already does.\n    - New language functions: processexists() and findprocesses()\n      (Redmine #7633)\n    - Implement new regex_replace() function. (Redmine #7346)\n    - Add log rotation policy for state/classes.jsonl log. (Redmine #7951)\n    - Added collect_vars utility bundle to stdlib\n    - Intoduce report_class_log attribute to body agent control.\n      (Redmine #7951)\n    - Add standard_services service_method allowing for explicit usage\n    - cf-promises --show-vars can now show JSON variables.\n    - Add json_pipe mode to mapdata(), which allows piping a\n      JSON container to an external program for manipulation and receiving\n      JSON back. The `jq` tool is a good example where this mode can be\n      useful. A corresponding `$(def.jq)` variable has also been added with\n      a default path to this tool. See documentation for mapdata() for\n      more information and examples. (Jira CFE-2071)\n    - behaviour change: 'true' is always defined and 'false' is never defined in a context expression.\n    - Add: nimclient package module for AIX\n      This module provides basic functionality for using nimclient as a means\n      to ensure packages are either present or absent. It does not support\n      listing package updates available or provide any special caching.\n    - Add callstack_callers() and callstack_promisers() functions.\n    - Log variable definitions in debug output. (Redmine #7137)\n    - Add: Memory information to host info report (Jira CFE-1177)\n    - In Mustache templates, one can now use `` and\n      `` tags to iterate over the top level element in a\n      container. (Redmine #6545)\n    - Add network_connections() function that parses /proc/net\n    - Provide new -w argument to override the workdir for testing\n    - New feature: Emails sent by cf-execd can be filtered to get\n      rid of emails for unwanted log messages. The attributes\n      mailfilter_include and mailfilter_exclude in body executor\n      control control what to include. See documentation for cf-execd for\n      more information. (Jira CFE-2283)\n    - Add: file_make_mustache bundle to render mustache templates\n    - Add '-n' flag to cf-key to avoid host name lookups.\n    - cf-agent, cf-execd, cf-promises, cf-runagent and cf-serverd honor multiple -D, -N and -s arguments\n      (Redmine #7191)\n    - Add 'canonify' mode to mapdata().\n    - Add: printfile bodies to stdlib\n    - Add: New `results` classes body [] (Redmine #7418, #7481)\n    - Implement cf-runagent --remote-bundles and cf-serverd 'bundle' access promise.\n      (Redmine #7581)\n    - Add commands promise arglist attribute, augmenting args attribute.\n    - It's now possible to reference variables in inline JSON,\n      for example: `mergedata('[ thing, { 'mykey': otherthing[123] } ]')`.\n      `thing` and `otherthing[123]` will be resolved as variables, since\n      they are unquoted. See the documentation for more details.\n      (Redmine #7871)\n    - Allow inline JSON to be used in the following function\n      calls:\n      - data_expand()\n      - difference()\n      - every()\n      - filter()\n      - format()\n      - getindices()\n      - getvalues()\n      - grep()\n      - intersection()\n      - join()\n      - length()\n      - makerule()\n      - mapdata()\n      - maplist()\n      - mean()\n      - mergedata()\n      - none()\n      - nth()\n      - parsejson()\n      - product()\n      - regarray()\n      - reglist()\n      - reverse()\n      - shuffle()\n      - some()\n      - sort()\n      - storejson()\n      - string_mustache()\n      - sublist()\n      - sum()\n      - unique()\n      - url_get()\n      - variance()\n      For example: `mergedata('[ 'thing', { 'mykey': 'myvalue' } ]')`\n      See the documentation for more details. (Jira CFE-2253)\n    - Add: edit_line contains_literal_string to stdlib\n    - Add body agent control select_end_match_eof option. (Jira CFE-2390)\n    Changes:\n    - Change: classesmatching(): order of classes changed\n    - Change: getindices(), getvalues(), variablesmatching(), maparray():\n      order of variables returned has changed\n    - Change: set_quoted_values uses bundle scoped classes\n    - Change: set_config_values uses bundle scoped classes\n    - Change: set_variable_values uses bundle scoped classes\n    - Change: set_config_values_matching uses bundle scoped classes\n    - Change: manage_variable_values_ini uses bundle scoped classes\n    - Change: set_line_based should use bundle scoped classes\n      (Jira CFE-1959)\n    - getvalues() will now return a list also for data containers,\n      and will descend recursively into the containers. (Redmine #7116)\n    - Change: Improve git drop user support\n    - Use new package promise as default package promise\n      implementation. (Jira CFE-2332)\n    - Don't follow symbolic links when copying extended attributes.\n    - When a bodydefault:_ body is\n      defined, it will be used by all promises of type \n      unless another body is explicitly used.\n    - cf-serverd no longer appends '-I -Dcfruncommand' to\n                 cfruncommand, this has to be done manually in masterfiles\n                 body server control. (Redmine #7732)\n    - eval() function arguments mode and options are now\n      optional.\n    - sort() function argument mode is now optional.\n    - Change: returnszero() no longer outputs the output of a command.\n      The output can be seen by enabling info mode (-I).\n    - cfruncommand is not executed under shell. (Redmine #7409)\n    - Remove: Apache CGI module\n    - Change: Make maxbytes arg of readjson() and readyaml() optional\n    - Classes matching agent control's abortclasses are\n      now printed before exit, even if they are defined in common bundles.\n      Previously the regex (in abortclasses) that matched the class was\n      printed if the class was defined in a common bundle, but the class\n      itself was printed if it was defined in an agent bundle. With this\n      change, the defined class that caused the abort is always printed.\n    - Remove: Support for email settings from augments_file (Redmine #7682)\n    - Change: set_variable_values_ini uses bundle scoped classes\n    - findfiles() now skips relative paths. (Redmine #7981)\n    - Clients connections using non TLS protocol are rejected\n      by default. . (Jira CFE-2339)\n    - Change: Policy files specified in the 'inputs' section of\n      def.json will no longer be auto-loaded. One has to refer to the\n      which are using the 'inputs' field inside def.json. (Redmine #7961)\n    - Change: Separate binary details from policy update (Redmine #7662)\n    - Add guard for binary upgrade during bootstrap (Redmine #7861)\n    - Change: Modernize pkg module and package_method\n    - Remove: Userdir apache module\n    - filestat(path, 'linktarget') now follows non-absolute links and returns full path of target.\n      This introduces a change in behaviour. Here is an example:\n      $ ls -l /bin/sh\n      lrwxrwxrwx 1 root root 4 Jun  4  2015 /bin/sh -\u003e dash\n      Previously the filestat function would return 'dash', and would also log\n      an error that the file can not be read. Now it will return '/bin/dash'\n      (or the final destination if it happens that /bin/dash is also a\n      symlink).\n      You can still get the previous behaviour by using\n      filestat(path, 'linktarget_shallow'). (Redmine #7404)\n    - Define (bootstrap|failsafe)_mode during update.cf when triggerd from failsafe.cf\n      (Redmine #7861)\n    - Behavior change: The promise string of a processes\n      promise now matches just the command line of each process instead of\n      the line that is output by ps. This was done to reduce fragmentation\n      between platforms, since ps is a very nonstandardized tool.\n      (Jira CFE-2161)\n    - Allowed namespace names made more strict, to disallow\n      namespaces that cannot be reached. (Redmine #7903)\n    - Behavior change: When using readintlist(), readreallist()\n      or readstringlist(), parsing an empty file will no longer result in a\n      failed function call, but instead an empty list. Failure to open the\n      file will still result in a failed function call.\n    - insert_lines is no longer implicitly matching EOF as\n      end of the region if 'select_end' pattern is not matched .\n      (Jira CFE-2263)\n    - EOF is  matched as an end of the region in edit_line\n      promises only if 'select_end_match_eof' parameter is true.\n      (Jira CFE-2263)\n\n    Bug fixes:\n\n    - Upgrade CFEngine dependencies to the following versions:\n      - Curl     7.48.0\n      - libxml2  2.9.4\n      - LMDB     0.9.18\n      - OpenLDAP 2.4.44\n      - OpenSSL  1.0.2h\n      - PCRE     8.38\n      (Jira ENT-2720)\n    - Upgrade dependencies to latest minor versions.\n      For Community / Enterprise:\n      For Enterprise:\n    - Fix bug which sometimes misparses user names in ps output.\n    - Fix: Problem with git not dropping privileges soon enough\n    - Allow def.json up to 5MB instead of 4K.\n    - It is possible to edit the same value in multiple regions\n      of one file. (Redmine #7460)\n    - CFEngine on Windows no longer truncates log messages if the\n      program in question is killed halfway through.\n    - Fixed a bug which caused def.json not being able to define\n      classes based on other hard classes. (Jira CFE-2333)\n    - Change: Tighten Enterprise hub permissions (Jira ENT-2708)\n    - Fix a regression which would sometimes cause 'Permission\n      denied' errors on files inside directories with very restricted\n      permissions. (Redmine #7808)\n    - Fix use-after-free in ArrayMap and HashMap (Redmine #7952)\n    - Package repositories are no more hit every time package promise\n      is evaluated on SUSE.\n    - Fix a bug which sometimes caused package promises to be\n      skipped with 'XX Another cf-agent seems to have done this since I\n      started' messages in the log, most notably in long running cf-agent\n      runs (longer than one minute). (Redmine #7933)\n    - TTY detection should be more reliable. (Redmine #7606)\n    - cf-promises -p cf now produces valid cfengine code (Redmine #7956)\n    - Fix ps options for FreeBSD to check processes only in current host and not in jails\n    - cf-runagent now properly supports multiple -D or -s arguments\n      (Redmine #7191)\n    - Fix: Work around impaired class definition from augments\n      (Jira CFE-2333)\n    - Fix 'No such file or directory' LMDB error on heavily loaded hosts.\n      (Jira CFE-2300)\n    - Check for empty server response in RemoteDirList after decryption\n      (Redmine #7908)\n    - Small performance optimization when cf-execd scans emails before sending.\n    - Fix handling of closed connections during transactions\n      (Redmine #7926)\n    - The core ps parsing engine used for processes promises\n      has been rewritten from scratch, and should be more robust than\n      before. (Jira CFE-2161)\n    - Fix the lexer which could not handle empty newline(s)\n      before a ```@endif```.\n    - groupexists() no longer fails to detect a group name\n      starting with a digit. (Jira CFE-2351)\n    - Fix HP-UX specific bug that caused a lot of log output to disappear.\n    - Fix unresolved variable (Redmine #7931)\n    - Change: Suppress standard services noise on SUSE (Redmine #6968)\n    - Reduce verbosity of yum package module (Redmine #7485)\n    - cf-runagent: Allow connections to localhost instead of failing silently.\n    - Show errors regarding failure to copy extended attributes\n      when doing a local file copy. Errors could happen when copying\n      across two different mount points where the support for extended\n      attributes is different between the mount points.\n    - Fix classes being set because of hash collision in the implementation.\n      (Redmine #7912)\n    - fix build failure on FreeBSD 7.1 (Redmine #7415)\n    - Improve logging when managing setuid/setgid\n    - Reduce verbosity of apt_get package module (Redmine #7485)\n    - packagesmatching() and packageupdatesmatching() should work\n      when new package promise is used. (Jira CFE-2246)\n    - Fix bug which could render host unable to recover from a\n      syntax error, even if failsafe.cf was utilized. This could happen if\n      the file containing the syntax error was specified in the def.json\n      special file. (Redmine #7961)\n    - Prevent crash in cf-execd email code when policy server is not set.\n    - In case of networking error, assume checksum is wrong\n    - Fix two cases where action_policy warn still produces errors\n      (Redmine #7274)\n    - Fix bad option nlwp to vzps on Proxmox / OpenVZ. (Redmine #6961)\n    - @if minimum_version now correctly ignores lines starting with '@'\n      (Redmine #7862)\n    - No longer hang when changing permissions/ownership on fifos\n      (Redmine #7030)\n    - readfile() and read*list() should print an error if they fail to read file.\n      (Redmine #7702)\n    - The isvariable() function call now correctly accepts all\n      array variables when specified inline. Previously it would not accept\n      certain special characters, even though they could be specified\n      indirectly by using a variable to hold it. (Redmine #7088)\n    - Fix file descriptor leak when there are network errors.\n    - Improve robustness of process table parsing on Solaris.\n      (Jira CFE-2161)\n    - Installing packages containing version numbers using yum\n      now works correctly. (Redmine #7825)\n    - Parse def.json vars, classes and inputs from the C\n      code. This fixes a bug where certain entries in this file would be\n      parsed too late to have any effect on the evaluation.\n      (Redmine #7453, #7615)\n    - Change package modules permissions on hub package so that\n      hub can execute package promises. (Redmine #7602)\n    - Fix: CFEngine choking on standard services (Jira CFE-2086)\n    - Fix: cf-upgrade on SUSE\n    - Fix: Stop cfengine choking on systemctl output (Jira CFE-2806)\n    - storage: Properly initialize the list of current mounts\n      (Jira CFE-1803)\n    - Fix bug which caused empty emails to be sent from cf-execd\n      if there was no previous output log and the new log was fully filtered\n      by email filters. (Jira ENT-2739)\n    - Don't send empty emails for logs where everything is filtered.\n      (Jira ENT-2739)\n    - Fix intermittent error message of type:\n      'error: Process table lacks space for last columns: '\n      (Jira CFE-2371)\n    - Be less verbose if a network interface doesn't have a MAC address.\n      (Jira CFE-1995)\n\n3.8.2:\n\n    Fixes:\n\n    - Update library dependencies to latest version.\n      Libraries upgraded:\n      - curl 7.47.0\n      - LMDB 0.9.18\n      - MySQL 5.1.72\n      - OpenLDAP 2.4.44\n      - OpenSSL 1.0.2g\n      - PostgreSQL 9.3.11\n      - Redis 3.0.7\n      - rsync 3.1.2\n      PHP was kept at 5.6.17 because of problems with the 5.6.19 version.\n    - Reduce verbosity of apt_get package module (Redmine #7485)\n    - Reduce verbosity of yum package module (Redmine #7485)\n    - The isvariable() function call now correctly accepts all\n      array variables when specified inline. Previously it would not accept\n      certain special characters, even though they could be specified\n      indirectly by using a variable to hold it. (Redmine #7088)\n    - Don't follow symbolic links when copying extended attributes.\n    - Fix a bug which sometimes caused package promises to be\n      skipped with 'XX Another cf-agent seems to have done this since I\n      started' messages in the log, most notably in long running cf-agent\n      runs (longer than one minute). (Redmine #7933)\n    - Fix bug which could render host unable to recover from a\n      syntax error, even if failsafe.cf was utilized. This could happen if\n      the file containing the syntax error was specified in the def.json\n      special file. (Redmine #7961)\n    - Change: Policy files specified in the 'inputs' section of\n      def.json will no longer be auto-loaded. One has to refer to the\n      $(def.augments_inputs) variable in the policy (the standard\n      masterfiles policies include this by default). This only affects\n      installations which are not based on the standard masterfiles, and\n      which are using the 'inputs' field inside def.json. (Redmine #7961)\n    - Fix file descriptor leak when there are network errors.\n    - Fix cf-serverd error messages with classic protocol clients\n      (Redmine #7818)\n    - Installing packages containing version numbers using yum\n      now works correctly. (Redmine #7825)\n    - Fix ps options for FreeBSD to check processes only in current host and not in jails\n    - fix build failure on FreeBSD 7.1 (Redmine #7415)\n    - Show errors regarding failure to copy extended attributes\n      when doing a local file copy. Errors could happen when copying\n      across two different mount points where the support for extended\n      attributes is different between the mount points.\n    - Fix classes being set because of hash collision in the implementation.\n      (Redmine #7912)\n    - Allow def.json up to 5MB instead of 4K.\n    - Fix a regression which would sometimes cause 'Permission\n      denied' errors on files inside directories with very restricted\n      permissions. (Redmine #7808)\n    - Change: Suppress standard services noise on SUSE (Redmine #6968)\n\n    Changes:\n\n    - Change: classesmatching(): order of classes changed\n\n3.8.1:\n\n    Changes:\n\n    - Upgrade CFEngine dependencies to the following versions:\n      - OpenSSL   1.0.2e\n      - PCRE      8.38\n      - libxml2   2.9.3\n      - OpenLDAP  2.4.43\n      - libcurl   7.46.0\n    - Upgrade LMDB to version 0.9.17. (Redmine #7879)\n\n    Bug fixes:\n\n    - @if minimum_version now correctly ignores lines starting with '@'\n      (Redmine #7862)\n    - Add guard for binary upgrade during bootstrap (Redmine #7861)\n    - Namespaced classes can now be specified on the command line.\n    - Fix bad option nlwp to vzps on Proxmox / OpenVZ. (Redmine #6961)\n    - Fix two cases where action_policy warn still produces errors\n      (Redmine #7274)\n    - Parse def.json vars, classes and inputs from the C\n      code. This fixes a bug where certain entries in this file would be\n      parsed too late to have any effect on the evaluation.\n      (Redmine #7453, #7615)\n    - Fix HP-UX specific bug that caused a lot of log output to disappear.\n    - Check for empty server response in RemoteDirList after decryption\n      (Redmine #7908)\n    - getvalues() will now return a list also for data containers,\n      and will descend recursively into the containers. (Redmine #7116)\n    - Define (bootstrap|failsafe)_mode during update.cf when triggerd from failsafe.cf\n      (Redmine #7861)\n\n3.8.0:\n\n    New features/additions:\n\n    - New feature: Bodies can now inherit attribute values from\n      other bodies by specifying 'inherit_from' with the name of the body to\n      inherit from, plus any arguments it accepts. For example:\n        body classes myclasses\n        {\n            inherit_from =\u003e classes_generic('myname');\n        }\n        (Redmine #4309)\n    - Add url_get() function. (Redmine #6480)\n    - Add @if feature() syntax\n      @if feature work like @if minimum_version but allows distinguishing\n      between features chosen at compile time.\n    - Extend module protocol to create persistent classes.\n      To use it, have the module print a line with '^persistence='\n      before printing any class names. 'persistence=0' goes back to non-\n      persistent classes. (Redmine #7302)\n    - Add: New `results` classes body (Redmine #7418)\n    - Add: Debug reports in cfe_internal_cleanup_agent_reports\n    - Add: Path to svcprop in stdlib\n    - Add: masterfiles-stage script to contrib\n    - Whitespace is now allowed in class expressions for\n      readability, between class names and operators. (Redmine #7152)\n\n    Changes:\n\n    - Change: Clarify bootstrap/failsafe reports\n    - Change: Improve in-line docs for internal log maintenance\n    - Change: Improve efficiency and debug reports (Redmine #7527)\n    - Remove: 3.5 support from masterfiles policy framework\n    - Long promiser strings with multiple lines are now\n      abbreviated in logs. (Redmine #3964)\n    - Change: Reunify Version based policy split\n    - Change: Separate binary details from policy update (Redmine #7662)\n    - Remove /var/cfengine/cf3..runlog. (Redmine #6957)\n    - Change: sys.libdir and sys.local_libdir to non version specific path\n        - sys.libdir now resolves to $(sys.inputdir)/lib\n        - sys.local_libdir now resolves to lib (Redmine #7559)\n    - Moved the following files to /var/cfengine/log/:\n        - /var/cfengine/promise_summary.log\n        - /var/cfengine/cfagent..log\n    - Change: Separate binary details from policy update (Redmine #7662)\n    - Remove: Support for email settings from augments_file (Redmine #7682)\n\n    Bug fixes:\n\n    - It is possible to edit the same value in multiple regions\n      of one file. (Redmine #7460)\n    - Change package modules permissions on hub package so that\n      hub can execute package promises. (Rednime #7602) (Redmine #7602)\n    - Fix exporting CSV reports through HTTPS. (Redmine #7267)\n    - cf-agent, cf-execd, cf-promises, cf-runagent and cf-serverd honor\n      multiple -D, -N and -s arguments (Redmine #7191)\n    - readfile() and read*list() should print an error if they fail to read file.\n      (Redmine #7702)\n    - No longer hang when changing permissions/ownership on fifos\n      (Redmine #7030)\n    - Fix broken HA policy for 3rd disaster-recovery node.\n    - Fix: Policy errors for 3.5 and 3.6\n    - Mustache templates: Fix  key when value is not a\n      primitive. The old behavior, when iterating across a map or array of\n      maps, was to abort if the key was requested with . The new\n      behavior is to always replace  with either the key name or the\n      iteration position in the array. An error is printed if  is used\n      outside of a Mustache iteration section.\n    - Fix build with musl libc. (Redmine #7455)\n    - Fixed a bug which could cause daemons to not to be killed\n      correctly when upgrading or manually running 'service cfengine3 stop'.\n      (Redmine #7193)\n    - Fix daemons not restarting correctly on upgrade on AIX.\n    - Package promise: Fix inability to install certain packages\n      with numbers. (Redmine #7421)\n    - Redmine #6027 Directories should no more be changed randomly\n      into files. (Redmine #6027)\n    - Improve cf-serverd's lock contention because of getpwnam()\n                 call. (Redmine #7643) (Redmine #7643)\n    - action_policy 'warn' now correctly produces warnings instead\n      of various other verbosity levels. (Redmine #7274)\n    - If there is an error saving a mustache template file\n      it is now logged with log-level error (was inform).\n    - The JSON parser now supports unquoted strings as keys.\n    - Reduce malloc() thread contention on heavily loaded\n      cf-serverd, by not exiting early in the logging function, if no message\n      is to be printed. (Redmine #7624) (Redmine #7624)\n    - Fix a bug which caused daemons not to be restarted on\n      upgrade. (Redmine #7528)\n    - Include latest security updates for dependencies.\n    - Fixed bug which would cause bff and depot packages not to\n      run package scripts on removal. (Redmine #7193)\n    - Fix upgrade causing error message under systemd because of open ports.\n    - Fixed several bugs which prevented CFEngine from loading\n      libraries from the correct location. This affected several platforms.\n      (Redmine #6708)\n    - Legacy package promise: Result classes are now defined if\n      the package being promised is already up to date. (Redmine #7399)\n    - failsafe.cf will be created when needed. (Redmine #7634)\n      (Redmine #7634)\n    - If file_select.file_types is set to symlink and there\n      are regular files in the scanned directory, CFEngine no longer\n      produces an unnecessary error message. (Redmine #6996)\n    - Fix 'AIX_PREINSTALL_ALREADY_DONE.txt: cannot create' error\n      message on AIX.\n    - Fix package promise not removing dependent packages. (Redmine #7424)\n    - Fix: Solaris packages no longer contain duplicate library\n      files, but instead symlinks to them. (Redmine #7591)\n    - Fix select_class not setting class when used in common bundle with slist.\n      (Redmine #7482)\n    - Fix '@endif' keyword sometimes being improperly processed\n      by policy parser. (Redmine #7413)\n    - Fix noise from internal policy to upgrade windows agents\n      (Redmine #7456)\n    - cfruncommand now works if it contains spaces, with the TLS protocol.\n      (Redmine #7405)\n    - Fix warning 'Failed to parse csv file entry' with certain very long\n      commands promises. (Redmine #7400)\n    - CFEngine no longer erronously passes -M to useradd on HP-UX. (Redmine #6734)\n    - cf-monitord no longer complains about missing thermal zone files.\n      (Redmine #7238)\n    - systemd is now detected correctly if it is a symlink (Redmine #7297)\n    - TTY detection should be more reliable. (Redmine #7606)\n      (Redmine #7606)\n\nChanges in cfengine-masterfiles:\n\n- Update to 3.21.0 (jsc#SLE-24222, bsc#1197029, CVE-2021-44215)\n\n  - Added inventory for Raspberry Pi and DeviceTree devices (ENT-8628)\n  - Added policy to enforce proper permissions on Mission Portal ldap directory (ENT-9693)\n  - Added check to make sure cf-execd is running after attempting self upgrade on Windows\n  - Added exception for ldap directory perms for settings.ldap.php (ENT-9697)\n    (ENT-9573)\n  - Added date to known paths for linux (CFE-4069)\n  - Added fallback to top-level feeder dump directory (ENT-8936)\n  - Added self upgrade knowledge for Suse 12, 15 and opensuse leap 15\n    (ENT-9209)\n  - Added self upgrade knowledge for debian 11 (ENT-9210)\n  - Added ssh in paths.cf so that policy writers can use $(paths.ssh)\n    (CFE-4037)\n  - Added support for multiple superhubs per feeder (ENT-8936)\n  - Amazon Linux now uses --setopt-exit_on_lock=True in redhat_no_locking_knowledge\n    (ENT-9057)\n  - Avoided error stopping apache when no pid file exists (ENT-9108)\n  - Disabled explicit setting for SSLCompression for Mission Portal Apache.\n    OpenSSL3 does not provide compression capability, when enabled\n    Apache will not start.\n    (ENT-8933)\n  - Fixed deleting multiple hosts with distributed cleanup utility\n    (ENT-8979)\n  - Fixed directory in which windows agents source packages for upgrade\n    (ENT-9010)\n  - Fixed services_autorun_inputs working independently from services_autorun\n    (CFE-4017)\n  - Fixed set_line_based() for case when edit_defaults.empty_before_use is true\n    (ENT-5866)\n  - Made proc inventory configurable via Augments (CFE-4056)\n  - Make device-tree inventory quieter in containers (ENT-9063)\n  - Stopped applying locks to masterfiles-stage (ENT-9625)\n  - Stopped loading several Apache modules on Enterprise Hubs by default:\n    mod_auth_basic, mod_authz_host, mod_authz_owner, mod_dbd,\n    mod_authn_file, mod_authz_dbm (ENT-8607, ENT-8602, ENT-8706,\n    ENT-8609, ENT-9072, ENT-8605)\n  - Updated filename conventions for AIX and Solaris packages (ENT-9095)\n  - Fixed detection of location for httpd.pid (ENT-9603)\n  - Added policy to manage permissions for php/runalerts-stamp (ENT-9703)\n  - Ensured manual edits to httpd.conf are reverted (ENT-9686)\n\n3.20.0:\n\n  - Renamed bundle agent main to bundle agent mpf_main (CFE-3947)\n  - Added prelink to paths.cf\n  - Added Enterprise Hub postgresql.conf to files monitored for diffs by default\n    (ENT-8618)\n  - Added PostgreSQL tunables for Federated Reporting (ENT-8617)\n  - Added lib/templates to packaged assets (ENT-8533)\n  - Added policy to patch apachectl for more robust stopping on Enterprise Hubs\n    (ENT-8823)\n  - Added policy update exclusion for directories named .no-distrib\n    (ENT-8079)\n  - Added support for 'option' option in pkg module (CFE-3568)\n  - Added support for Amazon Linux in standalone self upgrade (ENT-8274)\n  - Added support for downloading windows packages as part of self upgrade\n    (ENT-8283)\n  - Adjusted MPF to handle rxdirs default from true to false (CFE-951)\n  - 755 perms on hub htdocs dir are now enforced (ENT-8212)\n  - Proper owner and perms on docroot are now enforced(ENT-8280)\n  - Prevented def.dir_masterfiles/.no-distrib from being copied\n    (ENT-8079)\n  - Cleaned up policy related to versions prior to 3.12 (CFE-3920)\n  - Removed policy deprecated by sys.os_release (CFE-3933)\n  - Updated bundle names and wording to reflect current tooling\n    (CFE-3921)\n  - Enabled setting environment attribute in body agent control via augments\n    (CFE-3925)\n  - Fixed inclusion of distributed cleanup python files during install\n    (ENT-8393)\n  - Fixed inventory for OS on Rocky Linux (ENT-8292)\n  - Fixed promise status from package upgrade when architecture specified in promise\n    (CFE-3568)\n  - Made body classes u_kept_successful_command_results inherit_from u_results\n    (CFE-3917)\n  - Made cmdb update ignore locks (ENT-8847)\n  - Updating host-specific CMDB data files now happens asynchronously\n    (ENT-7357)\n  - Fixed issue with apt_get package module on Ubuntu 22 (CFE-3976)\n  - Fixed parsing of options attribute and added repo alias for repository option in pkg module\n    (CFE-3568)\n  - Fixed pkg module parsing input when values include equals (=)\n    (CFE-3568)\n  - Warn about missing dependencies for Distributed Cleanup utility\n    (ENT-8832)\n  - Fixed AIX watchdog default threshold for number of cf-execd processes\n    (CFE-3915)\n  - Stopped lowercasing software inventory on Windows (ENT-8424)\n  - Fixed windows unattended self upgrade on Windows 2008 (ENT-8066)\n  - Invalid feeder dump files are now skipped during import (ENT-8229)\n  - Fixed FR clean bundle when off state (ENT-7969)\n  - Fixed psql not found while FR import (ENT-8353)\n  - Now clean_when_off FR bundle is only run when needed (ENT-8294)\n\n3.19.0:\n\n  - Added interpreter attribute to standalone self upgrade package_module bodies\n    (CFE-3703, ENT-5752)\n  - Added almalinux as a know derivative of rhel (ENT-7644)\n  - Added class to prevent hub from seeding binary packages for use in self upgrade\n    (ENT-7544)\n  - Added cleanup of database and status semaphore when federation target_state is off\n    (ENT-7233)\n  - Added custom promise python library\n  - Added distributed_cleanup utility for Federated Reporting (ENT-7215)\n  - Added fallback logic for determining installed software version on Windows\n    (ENT-7501)\n  - Added lsmod to well known paths (CFE-3790)\n  - Added script to cleanup artifacts after cfbs build (CFE-3781)\n  - Added self upgrade support for SUSE (ENT-7446)\n  - Added separate classes for controlling autorun inputs and bundles\n    The class services_autorun continues to enable both automatic inclusion of .cf\n    files in services/autorun and the running of bundles tagged with autorun.\n    This change adds the classes services_autorun_inputs and\n    services_autorun_bundles for independently enabling addition of .cf files in\n    services/autorun and automatic execution of bundles tagged with autorun\n    respectively.  (CFE-3715)\n  - Added support for downloading community packages on hub in preparation for binary upgrades\n  - Added variable for excluding files from Policy Analyzer (ENT-7684)\n  - Adjusted badges for 3.18.0 release (ENT-6713)\n  - Adjusted permissions for Mission Portal public tmp files (ENT-7261)\n  - Autorun bundles now run regardless of locks\n    Previously, when the autorun feature was enabled to automatically run bundles\n    tagged with autorun the bundle actuation was affected by promise locking. The\n    effect of this is that agent runs that happen close together would skip running\n    bundles run within the last minute. Now autorun bundles no longer wait for a\n    lock to expire, they will be actuated each agent execution. Note, promises\n    within those bundles have their own locks which still apply.  (CFE-3795)\n  - Dropped un-necessary local variable\n    The use of this local variable triggers a bug that prevents datastate() from\n    printing. Since the variable is un-necessary, it's been removed and the\n    parameter is used directly.  (CFE-3776)\n  - Enforced permissions for Postgres log (ENT-7961)\n  - Fixed package module augments settings usage for pre 3.15.3 binaries\n    (ENT-7356, ENT-7358)\n  - Fixed path in permissions and ownership promise for application log dir\n    (ENT-7731)\n  - Fixed services_autorun_bundles only case (CFE-3799)\n  - Fixup zypper package module script to work properly with interpreter attribute\n    (ENT-7442)\n  - Gave cfapache group full access to docroot (ENT-8065)\n  - Insured exported reports from Mission Portal are in the correct location\n    (ENT-7465)\n  - Made apache restart more robust (ENT-8045)\n  - Moved httpd.pid to root of httpd workdir (ENT-7966)\n  - Physical Memory (MB) inventory now handles dmidecode MB or GB units\n    (ENT-7714)\n  - Promised permissions for Mission Portal application and Apache log files\n    This change ensures that both Mission Portal and Apache log files have\n    restrictive permissions. Previously this was un-managed.  (ENT-7730)\n  - Reduced scope of report informing of missing systemd service\n    (CFE-290, ENT-7360)\n  - Removed build dir from install/dist targets (ENT-7359)\n  - Removed stale CMDB inventory policy (CFE-3712)\n  - Set apache umask to 0177 (ENT-7948)\n  - State changes of systemd services during agent run are now properly registered\n    (CFE-3753)\n  - Stopped enforcing permissions of modules in inputs\n    This change removes explicit enforcement of permissions for modules in inputs.\n    Instead of explicitly enforcing permissions in inputs, we rely on the default\n    permissions (600). The previous explicit permissions (755) are un-necessary as\n    modules are not executed from within the inputs directory and have resulted in\n    permission flip-flopping in some environments. Permissions on modules in the\n    modules dir (sys.workdir)/modules are still enforced.  (ENT-7733)\n  - Switched from using package_method generic to default package_module\n    for windows software inventory (ENT-2589)\n  - Improved the reliability when detecting a Red Hat system.\n    Now if the ID field in /etc/os-release is set to rhel, the redhat_pure class\n    will be defined.\n    If the variable sys.os_release does not exist, redhat_pure is defined if we have already\n    defined redhat and we do not find classes for well known derivatives\n  - rocky, a class defined on Rocky Linux was added to the list of well known derivatives\n    (ENT-7628)\n  - Added advisory lock for Federated Reporting operations (ENT-7474)\n  - controls/cf_serverd.cf no longer specifies explicit\n    default for bindtointerface and relies on the default\n    binding to both :: and 0.0.0.0 on IPV6-enabled hosts\n    (ENT-7362)\n  - setup-status.json is no longer being repaired over and over on FR feeder hubs\n    (ENT-7967)\n\n3.18.0:\n\n  - Added .ps1 to list of file patterns considered during policy update\n    (ENT-4094)\n  - Added ability to specify additional directories to add autorun policy from\n    (CFE-3524)\n  - Added default cf_version_release of 1 when sys var missing (ENT-6219)\n  - Added description of psql_lock_wait_before_acquisition measurement\n    (ENT-6841)\n  - Added inventory of Setgid files and Setgid files that are root owned\n    (ENT-6793)\n  - Added inventory of users and hosts allowed to use cf-runagent\n    (ENT-6666)\n  - Added measurement of entropy available on linux systems (ENT-6495)\n  - Added missing packages modules scripts in makefile (ENT-6814)\n  - Added new interface for controlling users allowed to initiate cf-agent via cf-runagent\n    (CFE-3544)\n  - Added policy for permissions on cf-execd sockets on Enterprise Hubs\n    (ENT-6777)\n  - Added redirect to remove index.php from Mission Portal's URL\n    (ENT-6464)\n  - Added standalone self upgrade capability for Windows agents\n    (ENT-6219, ENT-6823)\n  - Added tail \u0026 tail_n to standard library (CFE-3558)\n  - Added vars.mpf_admit_cf_runagent_shell to control admission for cf-runagent requests\n    (ENT-6673)\n  - Added verbose logfile for msiexec package module file installs\n    (ENT-6220, ENT-6824)\n  - Changed default behavior of policy update to keep inputs in sync with masterfiles\n    Prior to this change, the default behavior of the MPF was to only ensure that\n    files in masterfiles were up to date with the files in inputs. Files in inputs\n    that did not exist in masterfiles were left undisturbed. To enable sync\n    behavior (a common user expectation) you had to explicitly define\n    'cfengine_internal_purge_policies'. Now, if you wish to return to the previous\n    default behavior, define the class 'cfengine_internal_purge_policies_disabled'.\n    Ticket: (CFE-3662)\n  - Changed msiexec package module install logs to be unique for each msi file\n    (ENT-6824)\n  - Disabled TLSv1 by default for Mission Portal's web server (ENT-6783)\n  - Do not apply redirect from index.php to internal APIs (ENT-6464)\n  - Enabled packages promises using package_module without bundle def\n    (CFE-3504)\n  - Fixed ability to define users authorized for using cf-runagent on policy servers\n    (CFE-3546)\n  - Fixed alpine apk packages module to parse names properly (CFE-3585)\n  - Fixed cfengine_mp_fr_handle_duplicate_hostkeys class usage in policy\n    (ENT-7094)\n  - Fixed docs describing xdev behavior in depth_search bodies (CFE-3541)\n  - Fixed loading of platform specific inventory on AIX (CFE-3614)\n  - Made Enterprise CMDB data update after policy update (ENT-6788)\n  - Prevent setgid files from causing continual repair related to setuid file inventory\n    (ENT-6782)\n  - Removed stale unused copy of u_kept_successful_command body. If you\n    receive an error about undefined body, alter your policy to use\n    kept_successful_command instead (CFE-3617)\n  - Removed unused plugins directory (CFE-3618)\n  - Renamed python symlink to cfengine-selected-python (CFE-3512)\n  - Shortened Inventory OS attribute to be more readable (ENT-6536)\n  - Suppressed inform output from Enterprise Hub database maintenance operations\n    (ENT-6563)\n  - Suppressed output from watchdog on AIX to prevent the mail spool from filling up\n    (CFE-3630)\n  - Added ability to specify a list of bundles to run before autorun (for classification) (ENT-6603)\n  - Update policy now moves obstructions (CFE-2984)\n  - Use VBScript to enumerate installed packages (ENT-4669)\n  - add /usr/bin/yum to paths.cf for aix (CFE-3615)\n  - service status on FreeBSD now uses onestatus (CFE-3515)\n  - Guard again enforcing root ownership for CFEngine files on Windows (ENT-4628)\n3.17.0:\n  - Added .csv to the list of file extensions considered by default during\n        policy update (CFE-3425)\n  - Added ability to extend known paths without modifying vendored policy\n    (CFE-3426)\n  - Added apk package module support for alpinelinux (CFE-3451)\n  - Added bundle edit_line converge_prepend with same behavior as bundle\n    edit_line converge, but inserting at start of content. (CFE-3483)\n  - Added inventory for Timezone and GMT Offset (ENT-6161)\n  - Added inventory for policy servers (ENT-6212)\n  - Added maintenance policy to update health diagnostics failures table on\n        enterprise hubs (ENT-6228)\n  - Added optional handle duplicates step in federated reporting import\n    (ENT-6035)\n  - Added replace_uncommented_substrings (ENT-6117)\n  - Added service states 'active' and 'inactive' for systemd (ENT-6074)\n  - Added watchdog for Windows (ENT-5538)\n  - Adjusted package_module and paths for termux platform (CFE-3288)\n  - Aligned systemd services behavior for service_policy =\u003e 'enable|enabled|disable|disabled'\n    (ENT-6073)\n  - Changed bundle server access_rules to mpf_default_access_rules\n    (CFE-3427)\n  - Cleaned up Mission Portal OS variable (inventory_os.description) on RHEL 5 \u0026 6\n    (ENT-6124)\n  - De-duplicated license headers (ENT-6040)\n  - Fixed converge edit_line bundle not deleting lines containing marker\n    (CFE-3482)\n  - Fixed interpretation of cf-hub --show-license from REPAIRED to KEPT\n    (ENT-6473)\n  - Inventory OS variable (inventory_os.description in policy) is now based on os-release\n  - Made git_stash only stash untracked files when capable (CFE-3383)\n  - Moved systemd service management to own bundle (CFE-3381)\n  - Removed delay in refreshing software installed inventory (ENT-6154)\n  - Removed unnecessary packages promise on SuSE (ENT-5480, ENT-6375)\n  - Replaced @ignore with useful doc strings (CFE-3378)\n\n3.16.0:\n\n  - /var/cfengine/bin/python symlink creation on SLES was fixed\n  - Added 'data' shortcut to cf-serverd, defaults to sys.workdir/data\n  - Added inventory for CFEngine Enterprise License information\n    (ENT-5089, ENT-5279)\n  - Added inventory of NFS servers in use (from /proc/mounts, on linux)\n    (CFE-3259)\n  - Added inventory of license owner on enterprise hubs (ENT-5337)\n  - Added paths support for opensuse (CFE-3283)\n  - Added use of services promise for FR postgresql reconfig in case of\n    systemd (ENT-5420)\n  - Added zypper as default package manager for opensuse (CFE-3284)\n  - Admitted ::1 as a query source on Enterprise hubs (ENT-5531)\n  - Aligned unattended self upgrade package map with current state\n    (ENT-6010)\n  - Always copy modules from masterfiles (CFE-3237)\n  - Changed DocumentRoot of Mission Portal in httpd.conf to\n    `/path/to/cfengine/httpd/htdocs/public` (ENT-5372)\n  - Changed group for state dir files promise to match defaults per OS\n    (CFE-3362)\n  - Changed m_inventory dumping behavior to exclude when values is null\n    (ENT-5562)\n  - Corrected application/logs path to outside of docroot (ENT-5255)\n  - Deleted deprecated __PromiseExecutionsLog from process that cleans\n    log tables (ENT-5170)\n  - Fixed dmi inventory to prefer sysfs to dmidecode for most variables\n    for improved performance and to handle CoreOS hosts that don't\n    have dmidecode.  (CFE-3249)\n  - Fixed permission flipping when policy analyzer is enabled (ENT-5235)\n  - Fixed runalerts processes promise on non-systemd systems (ENT-5432)\n  - Fixed selection of standard_services when used from non-default\n    namespace (ENT-5406)\n  - Fixed system UUID inventory for certain VMWare VMs where dmidecode\n    gives UUID bytes in wrong order.  (CFE-3249)\n  - Fixed typo preventing recommendation bundles from running (CFE-3305)\n  - HA setups no longer have flipping permissions on\n    /opt/cfengine/notification_scripts\n  - Improved resilience of cron watchdog for linux (CFE-3258)\n  - Inventory refresh is no longer part of agent run on the hub\n    (ENT-4864)\n  - Made python symlink fall back to platform-python (CFE-3291)\n  - Made set_variable_values_ini prefer whitespace around = (CFE-3221)\n  - Modified cftransport cleanup to avoid errors (ENT-5555)\n  - Moved 'selinux_enabled' class to config bundle and namespace scope it\n  - Prevented inventory of unresolved variables for diskfree and loadavg\n    (ENT-5190)\n  - Release number was added to MPF tarballs (ENT-5429)\n  - Standard services now considers systemd services in\n    ActiveState=activating active (CFE-3238)\n  - Stopped continual repair of ha_enabled semaphore (ENT-4715)\n  - Stopped disabling disabled systemd unit each run when disabled state\n    requested (CFE-3367)\n  - Stopped trying to edit fields in manage_variable_values_ini\n    (CFE-3372)\n  - Suppressed useless inform output from /bin/true in ec2 inventory\n    (ENT-5233)\n  - Switched from hardcoded path to /bin/true to use paths from stdlib\n    (ENT-5278)\n  - The zypper module is now fully compatible with Python 3 (CFE-3364)\n  - Whitespace is now allowed at the beginning of ini key-values\n    (CFE-3244)\n  - apt_get package module now checks package state (CFE-3233)\n\n3.15.0:\n\n  - Added package_module for snap (CFE-2811)\n  - Fixed pkgsrc in case where multiple Prefix paths are returned for pkg_install (CFE-3152)\n  - Fixed pkgsrc module on Solaris/NetBSD (CFE-3151)\n  - Moved zypper package module errors to the cf-agent output (CFE-3154)\n  - Added new class mpf_enable_cfengine_systemd_component_management to enable\n      component management on systemd hosts. When defined on systemd hosts policy\n      will render systemd unit files in /etc/systemd/system for managed services\n      and that all units are enabled unless explicitly disabled. When this class\n      is not defined on systemd hosts the policy will not actively mange cfengine\n      service units (no change from previous behavior) (CFE-2429)\n  - Fixed detection of service state on FreeBSD (CFE-3167)\n  - Added known paths for true and false on linux\n      (ENT-5060)\n  - Fixed path for restorecon on redhat systems to /sbin/restorecon\n  - Added usermod to known paths for redhat systems\n  - Added policy to manage federated reporting with CFEngine Enterprise\n  - Introduced augments variable `control_hub_query_timeout` to control cf-hub query timeout.\n       (ENT-3153)\n  - Added OOTB inventory for IPv6 addresses (sans ::1 loopback)\n      (ENT-4987)\n  - Added and transitioned to using master_software_updates shortcut in self upgrade policy\n      (ENT-4953)\n  - Added brief descriptions to bodies and bundles in cfe_internal/CFE_cfengine.cf\n      (CFE-3220)\n  - Added support for SUSE 11, 12 in standalone self upgrade (ENT-5045, ENT-5152)\n  - Changed policy triggering cleanup of __lastseenhostlogs to target only\n      3.12.x, 3.13.x and 3.14.x. From 3.15.0 on the table is absent. (ENT-5052)\n  - Fixed agent disabling on systemd systems (CFE-2429, CFE-3416)\n  - Ensured directory for custom action scripts is present (ENT-5070)\n  - Excluded Enterprise federation policy parsing on incompatible versions\n      (CFE-3193)\n  - Extended watchdog for AIX (ENT-4995)\n  - Fixed cleanup of future timestamps from status table\n      (ENT-4331, ENT-4992)\n  - Fixed re-spawning of cf-execd or cf-monitord after remediating duplicate concurrent processes\n      (CFE-3150)\n  - Replaced /var/cfengine with proper $(sys.*) vars (ENT-4800)\n  - Fixed selection of standard_services when used from non-default namespace (ENT-5406)\n\n3.15.0b1:\n\n  - Added continual checking for policy_server state (CFE-3073)\n  - Added monitoring for postgresql lock acquisition times (ENT-4753)\n  - Added support for 'awk' filters in the FR dump-import process (ENT-4839)\n  - Added support for configuring abortclasses and abortbundleclasses via\n    augments (ENT-4823)\n  - Added support for filtering in both dump and import phases of the FR\n    ETL process (ENT-4839)\n  - Added support for ordering FR awk and sed scripts (ENT-4839)\n  - Added support for setting periodic package inventory refresh interval\n    via augments (CFE-2771)\n  - Changed FR policy to honor target_state properly (ENT-4874)\n  - Copy .awk and .sed files from masterfiles to inputs (ENT-4839)\n  - Fixed Python 3 incompatibility in yum package module\n  - Fixed synchronization of important configuration files from active to\n    passive hub (ENT-4944)\n  - Made keys of all types from feeder hubs trusted on a superhub (ENT-4917)\n  - Speeded-up FR import process by merging INSERT INTO statements (ENT-4839)\n  - Suppressed stderr output from lldpctl when using path defined by\n    def.lldpctl_json (CFE-3109)\n  - Added SQL to update feeder update timestamp during import (ENT-4776)\n  - Added ssh_home_t type to cftransport .ssh dir (ENT-4906)\n  - fix use of _stdlib_path_exists_ in FR transport_user policy\n    bundle (ENT-4906)\n  - partitioned __inventory table for federated reporting (ENT-4842)\n  - psql_wrapper needed full path to psql binary (ENT-4912)\n  - yum package_module gets updates available from online repos if local\n    cache fails (CFE-3094)\n\n3.14.0:\n\n  - Fixed isvariable syntax error in update_def.cf (CFE-2953)\n  - Added path support for setfacl, timedatectl and journalctl (CFE-3013)\n  - Added trailing slash to access promises expecting directories\n    (CFE-3024)\n  - Added scripts and templates for Federated Reporting (ENT-4473)\n  - rpm python module is no longer required to check zypper version\n  - Changed cleanup consumer status SQL query (ENT-4365)\n  - Conditioned use of curl for ec2 metadata cache on curl binary being executable\n    (CFE-3049)\n  - Added augments variables to control cf-hub (ENT-4269)\n  - Prevented DB maintenance tasks on a passive High Availability hub (ENT-4706)\n  - Repair outcome for starting cf-monitord or cf-execd is no longer suppressed\n    (CFE-2964)\n  - Restrictive permissions on hub install log are now enforced (ENT-4506)\n  - Ensured that asynchronous query API semaphores are writable (ENT-4551)\n  - Fixed standalone_self_upgrade not triggering because of stale data\n    (ENT-4317)\n  - Fixed maintenance policy for promise log cleanup to respect history_length_days\n    (ENT-4588)\n  - Improved efficiency and error handling of user specified policy update bundle\n  - Log version of Enterprise agent outside of state (ENT-4352)\n  - Added package module for managing windows packages using msiexec (ENT-3719)\n  - Prevented inventorying un-expanded memory values from cf-monitord (ENT-4522)\n  - Prevented performance overhead on hubs that don't enable license utilization logging\n    (ENT-4333)\n  - Collection status records in the future are now purged (ENT-4362)\n  - Reduced cost of knowing when setopt is available in yum (CFE-2993)\n  - runalerts is now restarted if modified (ENT-4273)\n  - Separated kill signals from restart class to avoid warning (CFE-2974)\n  - Separated termination and observation promises for cf-monitord\n    (CFE-2963)\n  - Set default access promises for directories to only share if directory exists\n    (CFE-3060)\n  - Set default value for purge_scheduled_reports_older_than_days\n    (ENT-4404)\n  - Added more accurate and descriptive daemon classes\n  - collect_window in body server control can now be set from augments\n    (ENT-4283)\n  - Guarded vars promises in cfe_internal_enterprise_mission_portal_apache\n    Constrain vars promises in cfe_internal_enterprise_mission_portal_apache\n    to policy_server.enterprise_edition::, otherwise 'cf-promises --show-vars'\n    includes a dump of the entire datastate from the 'data' variable in\n    cfe_internal_enterprise_mission_portal_apache (line over 100K long).\n    (CFE-3011)\n  - redhat_pure is no longer defined on Fedora hosts (CFE-3022)\n\n3.13.0:\n\n  - Add debian 9 to the self upgrade package map (ENT-4255)\n  - Add 'system-uuid' to default dmidecode inventory (CFE-2925)\n  - Add inventory of AWS EC2 linux instances (CFE-2924)\n  - Add ubuntu 18 to package map for self upgrade (ENT-4118)\n  - Allow dmidefs inventory to be overridden via augments (CFE-2927)\n  - Analyze yum return code before parsing its output (CFE-2868)\n  - Fixed issue when promise to edit file that does not exist caused 'promise\n    not kept' condition (ENT-3965)\n  - Avoid trying to read /proc/meminfo when it doesn't exist (CFE-2922)\n  - Avoid use of $(version) for package_version in legacy implementation\n    (ENT-3963)\n  - Cleanup old report data relative to the most recent changetimestamp\n    (ENT-4807)\n  - Clear `__lastseenhostslogs` every 5 minutes. (ENT-3550)\n  - Configure Enterprise hub pull collection schedule via augments\n    (ENT-3834)\n  - Configure agent_expireafter from augments (ENT-4308)\n  - Create desired version tracking data when necessary (ENT-3937)\n  - Cron based watchdog for cf-execd on AIX (ENT-3963)\n  - Detect systemd service enablement for non native services (CFE-2932)\n  - Document how def.acl is used and how to configure it (CFE-2861)\n  - Fix augments control state paths to work on windows (ENT-3839)\n  - Fix package_latest detecting larger version in some cases (CFE-1743)\n  - Fix standalone self upgrade when path contains spaces (ENT-4117)\n  - Fix unattended self upgrade on AIX (ENT-3972)\n  - Fix services starting on windows (ENT-3883)\n  - Improve performance of enterprise license utilization logging\n  - Inventory Memory on HPUX (ENT-4188)\n  - Inventory Physical Memory MB when dmidecode is found (CFE-2896)\n  - Inventory Setuid Files (ENT-4158)\n  - Inventory memory on Windows (ENT-4187)\n  - Make recommendations about postgresql.conf (ENT-3958)\n  - Only consider files that exist for rotation (ENT-3946)\n  - Prevent noise when a service that should be disabled is missing.\n    (CFE-2690)\n  - Prevent standalone self upgrade from triggering un-necessarily\n    (ENT-4092)\n  - Remove Design Center related policies\n    Design center never left beta and has been deprecated. Supporting policies have\n    been removed. If you wish to continue using design center sketches you must\n    incorporate them into inputs and the bundlesequence manually.\n    (ENT-4050)\n  - Remove unicode characters (ENT-3823)\n  - Remove templates for deprecated components (ENT-3781)\n  - Remove un-necessary agent run during self upgrade (ENT-4116)\n  - Slackware package module support (CFE-2827)\n  - Specify scope =\u003e 'namespace' when using persistent classes (CFE-2860)\n  - Store the epoch of packages in cache db with zypper\n  - Sync cf-runalerts override unit template with package (ENT-3923)\n  - Update policy can now skip local copy optimization on policy servers\n    (CFE-2932)\n  - Updated yum package module to take arbitrary options (ENT-4177)\n  - Use default for package arch on aix (ENT-3963)\n  - Use rpmvercmp for version comparison on AIX (ENT-3963)\n  - Users allowed to request execution via cf-runagent can be configured\n    (ENT-4054)\n  - apt_get package module includes held packages when listing updates\n    (CFE-2855)\n\n3.12.0b1:\n\n  - Avoid executing self upgrade policy unnecessarily (ENT-3592)\n  - Add amazon_linux class to yum package module\n  - Introduce ability to set policy update bundle via augments (CFE-2687)\n  - Localize delete tidy in ha update policy (ENT-3659)\n  - Improve context notifying user of missing policy update bundle\n    (ENT-3624)\n  - Configure ignore_missing_inputs and ignore_missing_bundles via augments\n    (CFE-2773)\n  - Change class identifying runagent initiated executions from cfruncommand to cf_runagent_initated\n  - Support enablerepo and disablerepo options in yum package_module\n    (CFE-2806)\n  - Fix cf-runagent during 3.7.x -\u003e 3.10.x migration\n    (CFE-2776, CFE-2781, CFE-2782)\n  - Makes it possible to tune policy master_location via augments in update policy\n    (ENT-3692)\n  - Fix inventory for total memory on AIX (CFE-2797)\n  - Do not manage redis since it's no longer used (ENT-2797)\n  - Server control maxconnections can be configured via augments\n    (CFE-2660)\n  - Allow configuration of allowlegacyconnects from augments (ENT-3375)\n  - Fix ability for zypper package_module to downgrade packages\n  - Splaytime in body executor control can now be configured via augments\n    (CFE-2699)\n  - Add maintenance policy to refresh events table on enterprise hubs\n    (ENT-3537)\n  - Add apache config for new LDAP API (ENT-3265)\n  - update.cf bundlesequence can be configured via augments (CFE-2521)\n  - Update policy inputs can be extended via augments (CFE-2702)\n  - Add oracle linux support to standalone self upgrade\n  - Add bundle to track component variables to restart when necessary\n    (CFE-2326)\n  - Retention of files found in log directories can now be configured via augments\n    (CFE-2539)\n  - Allow multiple sections in insert_ini_section (CFE-2721)\n  - Add lines_present edit_lines bundle\n  - Schedule in body executor control can now be configured via augments\n    (CFE-2508)\n  - Include scheduled report assets in self maintenance (ENT-3558)\n  - Remove unused body action aggregator and body file_select folder\n  - Remove unused body process_count check_process\n  - Prevent yum from locking in package_methods when possible\n    (CFE-2759)\n  - Render variables tagged for inventory from agent host_info_report\n    (CFE-2750)\n  - Make apt_get package module work with repositories containing spaces in the label\n    (ENT-3438)\n  - Allow hubs to collect from themselves over loopback (ENT-3329)\n  - Log file max size and rotation limits can now be configured via augments\n    (CFE-2538)\n  - Change: Do not silence Enterprise hub maintenance\n  - Ensure HA standby hubs have am_policy_hub state marker (ENT-3328)\n  - Add support for 32bit rpms in standalone self upgrade (ENT-3377)\n  - Add enterprise maintenance bundles to host info report (ENT-3537)\n  - Removed unnecessary promises for OOTB package inventory\n  - Add external watchdog support for stuck cf-execd (ENT-3251)\n  - Be less noisy when a promised service is not found (CFE-2690)\n  - Ignore empty options in apt_get module (CFE-2685)\n  - Add postgres.log to enterprise log file rotation (ENT-3191)\n  - Removed unnecessary support for including 3.6 controls\n  - Fix systemctl path detection\n  - Policy Release Id is now inventoried by default (CFE-2097)\n  - Fix to frequent logging of enterprise license utilization (ENT-3390)\n  - Maintain access to exported CSV reports in older versions (ENT-3572)\n  - cf-execd service override template now only kills cf-execd on stop\n    (ENT-3395)\n  - Fix self upgrade for hosts older than 3.7.4 (ENT-3368)\n  - Avoid self upgrade from triggering during bootstrap (ENT-3394)\n  - Add json templates for rendering serial and multiline data (CFE-2713)\n  - Removed unused libraries and controls\n  - Fixed an error in the file_make_mustache_*, incorrect variable name used\n    (CFE-2714)\n\n3.11.0:\n\n  - Rename enable_client_initiated_reporting to client_initiated_reporting_enabled\n  - Directories for ubuntu 16 and centos 7 should exist in master_software_updates\n    (ENT-3136)\n  - Fix: Automatic client upgrades for deb hosts\n  - Add AIX OOTB oslevel inventory (ENT-3117)\n  - Disable package inventory via modules on redhat like systems with unsupported python versions\n    (CFE-2602)\n  - Make stock policy update more resiliant (CFE-2587)\n  - Configure networks allowed to initiate report collection (client initiated reporting) via augments (#910)\n    (CFE-2624)\n  - apt_get package module: Fix bug which prevented updates\n    from being picked up if there was more than one source listed in the\n    'apt upgrade' output, without a comma in between (CFE-2605)\n  - Enable specification of monitoring_include via augments (CFE-2505)\n  - Configure call_collect_interval from augments (enable_client_initiated_reporting) (#905)\n    (CFE-2623)\n  - Add templates shortcut (CFE-2582)\n  - Behaviour change: when used with CFEngine 3.10.0 or greater,\n    bundles set_config_values() and set_line_based() are appending a\n    trailing space when inserting a configuration option with empty value\n    (CFE-2466)\n  - Add default report collection exclusion based on promise handle\n    (ENT-3061)\n  - Fix ability to select INI region with metachars (CFE-2519)\n  - Change: Verify transfered files during policy update\n  - Change select_region INI_section to match end of section or end of file\n    (CFE-2519)\n  - Add class to enable post transfer verrification during policy updates\n  - Add: prunetree bundle to stdlib\n    The prunetree bundle allws you to delete files and directories up to a\n    sepcified depth older than a specified number of days\n  - Do not symlink agents to /usr/local/bin on coreos (ENT-3047)\n  - Add: Ability to set default_repository via augments\n  - Enable settig def.max_client_history_size via augments (CFE-2560)\n  - Change self upgrade now uses standalone policy (ENT-3155)\n  - Fix apt_get package module incorrectly using interactive mode\n  - Add ability to append to bundlesequnece with def.json (CFE-2460)\n  - Enable paths to POSIX tools by default instead of native tools\n  - Remove bundle agent cfe_internal_bins (CFE-2636)\n  - Include previous_state and untracked reports when client clear a buildup of unreported data\n    (ENT-3161)\n  - Fix command to restart apache on config change (ENT-3134)\n  - cf-serverd listens on ipv4 and ipv6 by default (CFE-528)\n  - FixesMake apt_get module compatible with Ubuntu 16.04 (CFE-2445)\n  - Fix rare bug that would sometimes prevent redis-server from launching\n  - Add oslevel to well known paths (ENT-3121)\n  - Add policy to track CFEngine Enterprise license utilization\n    (ENT-3186)\n  - Ensure MP SSL Cert is readable (ENT-3050)\n\n- fix case where Apache and Mission Portal Application log files world were readable (bsc#1197031, CVE-2021-44216)\n- fix case where PostgreSQL log file world were readable (bsc#1197029, CVE-2021-44215)\n\n- Update to 3.10.3 (FATE#323149, bsc#1086475)\n",
      "Title": "Details",
      "Type": "General"
    },
    {
      "Text": "The CVRF data is provided by SUSE under the Creative Commons License 4.0 with Attribution (CC-BY-4.0).",
      "Title": "Terms of Use",
      "Type": "Legal Disclaimer"
    },
    {
      "Text": "SUSE-2023-2126,SUSE-SLE-Module-Adv-Systems-Management-12-2023-2126,SUSE-SLE-SDK-12-SP5-2023-2126",
      "Title": "Patchnames",
      "Type": "Details"
    }
  ],
  "ProductTree": {
    "Relationships": [
      {
        "ProductReference": "cfengine-3.21.0-17.3.1",
        "RelatesToProductReference": "SUSE Linux Enterprise Module for Advanced Systems Management 12",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "cfengine-masterfiles-3.21.0-10.3.1",
        "RelatesToProductReference": "SUSE Linux Enterprise Module for Advanced Systems Management 12",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "libpromises3-3.21.0-17.3.1",
        "RelatesToProductReference": "SUSE Linux Enterprise Module for Advanced Systems Management 12",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "libpromises-devel-3.21.0-17.3.1",
        "RelatesToProductReference": "SUSE Linux Enterprise Software Development Kit 12 SP5",
        "RelationType": "Default Component Of"
      }
    ]
  },
  "References": [
    {
      "URL": "https://www.suse.com/support/update/announcement/2023/suse-su-20232126-1/",
      "Description": "Link for SUSE-SU-2023:2126-1"
    },
    {
      "URL": "https://lists.suse.com/pipermail/sle-updates/2023-May/029262.html",
      "Description": "E-Mail link for SUSE-SU-2023:2126-1"
    },
    {
      "URL": "https://www.suse.com/support/security/rating/",
      "Description": "SUSE Security Ratings"
    },
    {
      "URL": "https://bugzilla.suse.com/1086475",
      "Description": "SUSE Bug 1086475"
    },
    {
      "URL": "https://bugzilla.suse.com/1197029",
      "Description": "SUSE Bug 1197029"
    },
    {
      "URL": "https://bugzilla.suse.com/1197031",
      "Description": "SUSE Bug 1197031"
    },
    {
      "URL": "https://www.suse.com/security/cve/CVE-2021-44215/",
      "Description": "SUSE CVE CVE-2021-44215 page"
    },
    {
      "URL": "https://www.suse.com/security/cve/CVE-2021-44216/",
      "Description": "SUSE CVE CVE-2021-44216 page"
    }
  ],
  "Vulnerabilities": [
    {
      "CVE": "CVE-2021-44215",
      "Description": "Northern.tech CFEngine Enterprise 3.15.4 before 3.15.5 has Insecure Permissions that may allow unauthorized local users to have an unspecified impact.",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "moderate"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2021-44215.html",
          "Description": "CVE-2021-44215"
        },
        {
          "URL": "https://bugzilla.suse.com/1197029",
          "Description": "SUSE Bug 1197029"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": [
            "SUSE Linux Enterprise Module for Advanced Systems Management 12:cfengine-3.21.0-17.3.1",
            "SUSE Linux Enterprise Module for Advanced Systems Management 12:cfengine-masterfiles-3.21.0-10.3.1",
            "SUSE Linux Enterprise Module for Advanced Systems Management 12:libpromises3-3.21.0-17.3.1",
            "SUSE Linux Enterprise Software Development Kit 12 SP5:libpromises-devel-3.21.0-17.3.1"
          ]
        }
      ],
      "CVSSScoreSets": {}
    },
    {
      "CVE": "CVE-2021-44216",
      "Description": "Northern.tech CFEngine Enterprise before 3.15.5 and 3.18.x before 3.18.1 has Insecure Permissions that may allow unauthorized local users to access the Apache and Mission Portal log files.",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "moderate"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2021-44216.html",
          "Description": "CVE-2021-44216"
        },
        {
          "URL": "https://bugzilla.suse.com/1197031",
          "Description": "SUSE Bug 1197031"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": [
            "SUSE Linux Enterprise Module for Advanced Systems Management 12:cfengine-3.21.0-17.3.1",
            "SUSE Linux Enterprise Module for Advanced Systems Management 12:cfengine-masterfiles-3.21.0-10.3.1",
            "SUSE Linux Enterprise Module for Advanced Systems Management 12:libpromises3-3.21.0-17.3.1",
            "SUSE Linux Enterprise Software Development Kit 12 SP5:libpromises-devel-3.21.0-17.3.1"
          ]
        }
      ],
      "CVSSScoreSets": {}
    }
  ]
}