{
  "Identifier": "GHSA-h6gw-r52c-724r",
  "PackageSlug": "pypi/tensorflow",
  "Title": "NULL Pointer Dereference and Access of Uninitialized Pointer in TensorFlow",
  "Description": "### Impact \nThe code for boosted trees in TensorFlow is still missing validation. This allows malicious users to read and write outside of bounds of heap allocated data as well as trigger denial of service (via dereferencing `nullptr`s or via `CHECK`-failures).\n\nThis follows after CVE-2021-41208 where these APIs were still vulnerable to multiple security issues.\n\n**Note**: Given that the boosted trees implementation in TensorFlow is unmaintained, it is recommend to no longer use these APIs.  Instead, please use the downstream [TensorFlow Decision Forests] project which is newer and supports more features. \n  \nThese APIs are now deprecated in TensorFlow 2.8. We will remove TensorFlow's boosted trees APIs in subsequent releases.\n  \n### Patches\nWe have patched the known issues in multiple GitHub commits.\n  \nThe fix will be included in TensorFlow 2.8.0. We will also cherrypick this commit on TensorFlow 2.7.1, TensorFlow 2.6.3, and TensorFlow 2.5.3, as these are also affected and still in supported range.\n\nThis should allow users to use existing boosted trees APIs for a while until they migrate to TensorFlow Decision Forests while guaranteeing that known vulnerabilities are fixed.\n\n### For more information\nPlease consult our security guide for more information regarding the security model and how to contact us with issues and questions.\n\n### Attribution\nThese vulnerabilities have been reported by Yu Tian of Qihoo 360 AIVul Team and Faysal Hossain Shezan from University of Virginia. Some of the issues have been discovered internally after a careful audit of the APIs.",
  "Date": "2022-02-09",
  "Pubdate": "2022-02-09",
  "AffectedRange": "\u003c2.5.3||\u003e=2.6.0,\u003c2.6.3||==2.7.0",
  "FixedVersions": [
    "2.5.3",
    "2.6.3",
    "2.7.1"
  ],
  "AffectedVersions": "All versions before 2.5.3, all versions starting from 2.6.0 before 2.6.3, version 2.7.0",
  "NotImpacted": "All versions starting from 2.5.3 before 2.6.0, all versions starting from 2.6.3 before 2.7.0, all versions after 2.7.0",
  "Solution": "Upgrade to versions 2.5.3, 2.6.3, 2.7.1 or above.",
  "Urls": [
    "https://github.com/tensorflow/tensorflow/security/advisories/GHSA-57wx-m983-2f88",
    "https://github.com/tensorflow/tensorflow/security/advisories/GHSA-h6gw-r52c-724r",
    "https://github.com/advisories/GHSA-h6gw-r52c-724r"
  ],
  "CvssV2": "",
  "CvssV3": "",
  "UUID": "89ec3c3e-0dda-47e9-b9c2-cb57e4fc7298"
}