{
  "Severity": "MODERATE",
  "UpdatedAt": "2025-03-10T18:24:36Z",
  "Package": {
    "Ecosystem": "MAVEN",
    "Name": "io.github.robothy:local-s3-rest"
  },
  "Advisory": {
    "DatabaseId": 283600,
    "Id": "GSA_kwCzR0hTQS1nNndtLTJ2NjQtd3EzNs4ABFPQ",
    "GhsaId": "GHSA-g6wm-2v64-wq36",
    "References": [
      {
        "Url": "https://github.com/Robothy/local-s3/security/advisories/GHSA-g6wm-2v64-wq36"
      },
      {
        "Url": "https://github.com/Robothy/local-s3/commit/d6ed756ceb30c1eb9d4263321ac683d734f8836f"
      },
      {
        "Url": "https://nvd.nist.gov/vuln/detail/CVE-2025-27136"
      },
      {
        "Url": "https://github.com/advisories/GHSA-g6wm-2v64-wq36"
      }
    ],
    "Identifiers": [
      {
        "Type": "GHSA",
        "Value": "GHSA-g6wm-2v64-wq36"
      },
      {
        "Type": "CVE",
        "Value": "CVE-2025-27136"
      }
    ],
    "Description": "## Description\n\nThe LocalS3 service's bucket creation endpoint is vulnerable to XML External Entity (XXE) injection. When processing the CreateBucketConfiguration XML document during bucket creation, the service's XML parser is configured to resolve external entities. This allows an attacker to declare an external entity that references an internal URL, which the server will then attempt to fetch when parsing the XML.\n\nThe vulnerability specifically occurs in the location constraint processing, where the XML parser resolves external entities without proper validation or restrictions. When the external entity is resolved, the server makes an HTTP request to the specified URL and includes the response content in the parsed XML document.\n\nThis vulnerability can be exploited to perform server-side request forgery (SSRF) attacks, allowing an attacker to make requests to internal services or resources that should not be accessible from external networks. The server will include the responses from these internal requests in the resulting bucket configuration, effectively leaking sensitive information.\n\n## Steps to Reproduce\n\n1. Create an XML document that includes an external entity declaration pointing to the internal target:\n```xml\n\u003c?xml version=\"1.0\" encoding=\"UTF-8\"?\u003e\n\u003c!DOCTYPE test [ \u003c!ENTITY xxe SYSTEM \"http://internal-web/flag.txt\"\u003e ]\u003e\n\u003cCreateBucketConfiguration\u003e\n    \u003cLocationConstraint\u003e\u0026xxe;\u003c/LocationConstraint\u003e\n\u003c/CreateBucketConfiguration\u003e\n```\n\n2. Send a PUT request to create a new bucket with this configuration:\n```bash\ncurl -X PUT http://app/test-bucket-2 -H 'Content-Type: application/xml' -d @payload.xml\n```\n\n3. Retrieve the bucket location to see the resolved entity content:\n```bash\ncurl http://app/test-bucket-2/?location\n```\n\nWhen these steps are executed, the server processes the XML, resolves the external entity by making a request to the internal URL, and includes the response in the bucket's location constraint. The attacker can then retrieve this information through the bucket location endpoint.\n\n## Mitigations\n\n- Disable XML external entity resolution in the XML parser configuration. Most XML parsers have options to disable external entity processing.\n- Implement proper input validation for XML documents, rejecting those that contain DOCTYPE declarations or external entity references.\n- Use XML parsers that are configured securely by default and don't process external entities.\n- If external entity processing is required, implement a whitelist of allowed URLs and validate all URLs before making any requests.\n\n## Impact\n\nThe vulnerability allows unauthenticated attackers to make the server perform HTTP requests to internal networks and services, potentially exposing sensitive information or enabling further attacks against internal systems. The attacker only needs to be able to send HTTP requests to the LocalS3 service to exploit this vulnerability.",
    "Origin": "UNSPECIFIED",
    "PublishedAt": "2025-03-10T18:24:35Z",
    "Severity": "MODERATE",
    "Summary": "LocalS3 CreateBucketConfiguration Endpoint XML External Entity (XXE) Injection",
    "UpdatedAt": "2025-03-14T20:29:09Z",
    "WithdrawnAt": "",
    "CVSS": {
      "Score": 0,
      "VectorString": ""
    }
  },
  "Versions": [
    {
      "FirstPatchedVersion": {
        "Identifier": "1.21"
      },
      "VulnerableVersionRange": "\u003c 1.21"
    }
  ]
}