{
  "Severity": "MODERATE",
  "UpdatedAt": "2022-08-10T18:28:39Z",
  "Package": {
    "Ecosystem": "MAVEN",
    "Name": "org.jenkins-ci.plugins:git"
  },
  "Advisory": {
    "DatabaseId": 187214,
    "Id": "GSA_kwCzR0hTQS00NDl3LWM3N2Mtdm1mNs4AAttO",
    "GhsaId": "GHSA-449w-c77c-vmf6",
    "References": [
      {
        "Url": "https://nvd.nist.gov/vuln/detail/CVE-2022-36884"
      },
      {
        "Url": "https://www.jenkins.io/security/advisory/2022-07-27/#SECURITY-284"
      },
      {
        "Url": "http://www.openwall.com/lists/oss-security/2022/07/27/1"
      },
      {
        "Url": "https://github.com/advisories/GHSA-449w-c77c-vmf6"
      }
    ],
    "Identifiers": [
      {
        "Type": "GHSA",
        "Value": "GHSA-449w-c77c-vmf6"
      },
      {
        "Type": "CVE",
        "Value": "CVE-2022-36884"
      }
    ],
    "Description": "Git Plugin provides a webhook endpoint at `/git/notifyCommit` that can be used to notify Jenkins of changes to an SCM repository. For its most basic functionality, this endpoint receives a repository URL, and Jenkins will schedule polling for all jobs configured with the specified repository. In Git Plugin 4.11.3 and earlier, this endpoint can be accessed with GET requests and without authentication. In addition to this basic functionality, the endpoint also accept a `sha1` parameter specifying a commit ID. If this parameter is specified, jobs configured with the specified repo will be triggered immediately, and the build will check out the specified commit. Additionally, the output of the webhook endpoint will provide information about which jobs were triggered or scheduled for polling, including jobs the user has no permission to access. This allows attackers with knowledge of Git repository URLs to trigger builds of jobs using a specified Git repository and to cause them to check out an attacker-specified commit, and to obtain information about the existence of jobs configured with this Git repository. Additionally, this webhook endpoint does not require POST requests, resulting in a cross-site request forgery (CSRF) vulnerability. Git Plugin 4.11.4 requires a `token` parameter which will act as an authentication for the webhook endpoint. While GET requests remain allowed, attackers would need to be able to provide a webhook token. For more information see [the plugin documentation](https://github.com/jenkinsci/git-plugin/#push-notification-from-repository).",
    "Origin": "UNSPECIFIED",
    "PublishedAt": "2022-07-28T00:00:43Z",
    "Severity": "MODERATE",
    "Summary": "Lack of authentication mechanism in Jenkins Git Plugin webhook",
    "UpdatedAt": "2023-07-21T21:32:32Z",
    "WithdrawnAt": "",
    "CVSS": {
      "Score": 5.3,
      "VectorString": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N"
    }
  },
  "Versions": [
    {
      "FirstPatchedVersion": {
        "Identifier": "4.11.4"
      },
      "VulnerableVersionRange": "\u003c= 4.11.3"
    }
  ]
}