{
  "Title": "Security update for nsd",
  "Tracking": {
    "ID": "openSUSE-SU-2020:2222-1",
    "Status": "Final",
    "Version": "1",
    "InitialReleaseDate": "2020-12-10T11:23:12Z",
    "CurrentReleaseDate": "2020-12-10T11:23:12Z",
    "RevisionHistory": [
      {
        "Number": "1",
        "Date": "2020-12-10T11:23:12Z",
        "Description": "current"
      }
    ]
  },
  "Notes": [
    {
      "Text": "Security update for nsd",
      "Title": "Topic",
      "Type": "Summary"
    },
    {
      "Text": "This update for nsd fixes the following issues:\n\nnsd was updated to the new upstream release 4.3.4\n\nFEATURES:\n\n- Merge PR #141: ZONEMD RR type.\n\nBUG FIXES:\n\n- Fix that symlink does not interfere with chown of pidfile\n  (boo#1179191, CVE-2020-28935)\n- Fix #128: Fix that the invalid port number is logged for sendmmsg failed: Invalid argument.\n- Fix #133: fix 0-init of local ( stack ) buffer.\n- Fix #134: IPV4_MINIMAL_RESPONSE_SIZE vs EDNS_MAX_MESSAGE_LEN.\n- Fix to add missing closest encloser NSEC3 for wildcard nodata type DS answer.\n- Fix #138: NSD returns non-EDNS answer when QUESTION is empty.\n- Fix #142: NODATA answers missin SOA in authority section after CNAME chain.\n\nNew upstream release 4.3.3:\n\nFEATURES:\n\n- Follow DNS flag day 2020 advice and set default EDNS message size to 1232.\n- Merged PR #113 with fixes.  Instead of listing an IP-address to\n  listen on, an interface name can be specified in nsd.conf, with\n  ip-address: eth0.  The IP-addresses for that interface are then used.\n\n- New upstream release 4.3.2\n\nFEATURES:\n\n- Fix #96: log-only-syslog: yes sets to only use syslog, fixes\n  that the default configuration and systemd results in duplicate\n  log messages.\n- Fix #107: nsd -v shows configure line, openssl version and libevent\n  version.\n- Fix #103 with #110: min-expire-time option.  To provide a lower\n  bound for expire period.  Expressed in number of seconds or\n  refresh+retry+1.\n\nBUG FIXES:\n\n- Fix to omit the listen-on lines from log at startup, unless verbose.\n- Fix #97: EDNS unknown version: query not in response.\n- Fix #99: Fix copying of socket properties with reuseport enabled.\n- Document default value for tcp-timeout.\n- Merge PR#102 from and0x000: add missing default in documentation for drop-updates.\n- Fix unlink of pidfile warning if not possible due to permissions,\n  nsd can display the message at high verbosity levels.\n- Removed contrib/nsd.service, example is too complicated and not useful.\n- Merge #108 from Nomis: Make the max-retry-time description clearer.\n- Retry when udp send buffer is full to wait until buffer space is available.\n- Remove errno reset behaviour from sendmmsg and recvmmsg replacement functions.\n- Fix unit test for different nsd-control-setup -h exit code.\n- Merge #112 from jaredmauch: log old and new serials when NSD\n  rejects an IXFR due to an old serial number.\n- Fix #106: Adhere better to xfrd bounds.  Refresh and retry times.\n- Fix #105: Clearing hash_tree means just emptying the tree.\n\nNew upstream release 4.3.1\n\nBUG FIXES:\n- Merge PR #91 by gearnode: nsd-control-setup recreate certificates.\n  The '-r' option recreates certificates.  Without it it creates them\n  if they do not exist, and does not modify them otherwise.\n\nNew upstream release 4.3.0\n\nFEATURES:\n\n- Fix to use getrandom() for randomness, if available.\n- Fix #56: Drop sparse TSIG signing support in NSD.\n  Sign every axfr packet with TSIG, according to the latest\n  draft-ietf-dnsop-rfc2845bis-06, Section 5.3.1.\n- Merge pull request #59 from buddyns: add FreeBSD support\n  for conf key ip-transparent.\n- Add feature to pin server processes to specific cpus.\n- Add feature to pin IP addresses to selected server processes.\n- Set process title to identify individual processes.\n- Merge PR#22: minimise-any: prefer polular and not large RRset,\n  from Daisuke Higashi.\n- Add support for SO_BINDTODEVICE on Linux.\n- Add feature to drop queries with opcode UPDATE.\n\nBUG FIXES:\n\n- Fix whitespace in nsd.conf.sample.in, patch from Paul Wouters.\n- use-systemd is ignored in nsd.conf, when NSD is compiled with\n  libsystemd it always signals readiness, if possible.\n- Note that use-systemd is not necessary and ignored in man page.\n- Fix responses for IXFR so that the authority section is not echoed\n  in the response.\n- Fix that the retry wait does not exceed one day for zone transfers.\n\n- Update keyring as per https://nlnetlabs.nl/people/\n\nNew upstream release 4.2.3:\n\n  * confine-to-zone configures NSD to not return out-of-zone\n    additional information.\n  * pidfile '' allows to run NSD without a pidfile\n  * adds support for readiness notification with READY_FD\n  * fix excessive logging of ixfr failures, it stops the log when\n    fallback to axfr is possible. log is enabled at high verbosity.\n  * The nsd.conf includes are sorted ascending, for include statements\n    with a '*' from glob.\n  * Fix log address and failure reason with tls handshake errors,\n    squelches (the same as unbound) some unless high verbosity is used.\n  * Number of different UDP handlers has been reduced to one.\n    recvmmsg and sendmmsg implementations are now used on all platforms.\n  * Socket options are now set in designated functions for easy reuse.\n  * Socket setup has been simplified for easy reuse.\n  * Configuration parser is now aware of the context in which\n    an option was specified.\n  * document that remote-control is a top-level nsd.conf attribute.\n\n- Remove legacy upgrade of nsd users in %post (boo#1157331)\n\nNew upstream release 4.2.2:\n\n  * Fix #20: CVE-2019-13207 Stack-based Buffer Overflow in the\n    dname_concatenate() function.  Reported by Frederic Cambus.\n    It causes the zone parser to crash on a malformed zone file,\n    with assertions enabled, an assertion catches it.\n  * Fix #19: Out-of-bounds read caused by improper validation of\n    array index.  Reported by Frederic Cambus.  The zone parser\n    fails on type SIG because of mismatched definition with RRSIG.\n  * PR #23: Fix typo in nsd.conf man-page.\n  * Fix that NSD warns for wrong length of the hash in SSHFP records.\n  * Fix #25: NSD doesn't refresh zones after extended downtime,\n    it refreshes the old zones.\n  * Set no renegotiation on the SSL context to stop client\n    session renegotiation.\n  * Fix #29: SSHFP check NULL pointer dereference.\n  * Fix #30: SSHFP check failure due to missing domain name.\n  * Fix to timeval_add in minievent for remaining second in microseconds.\n  * PR #31: nsd-control: Add missing stdio header.\n  * PR #32: tsig: Fix compilation without HAVE_SSL.\n  * Cleanup tls context on xfrd exit.\n  * Fix #33: Fix segfault in service of remaining streams on exit.\n  * Fix error message for out of zone data to have more information.\n\nNew upstream release 4.2.1:\n\n  * FEATURES:\n\n    - Added num.tls and num.tls6 stat counters.\n    - PR #12: send-buffer-size, receive-buffer-size,\n      tcp-reject-overflow options for nsd.conf, from Jeroen Koekkoek.\n    - Fix #14, tcp connections have 1/10 to be active and have to work\n      every second, and then they get time to complete during a reload,\n      this is a process that lingers with the old version during a version\n      update.\n\n  * BUG FIXES:\n\n    - Fix #13: Stray dot at the end of some log entries, removes dot\n      after updated serial number in log entry.\n    - Fix TLS cipher selection, the previous was redundant, prefers\n      CHACHA20-POLY1305 over AESGCM and was not as readable as it\n      could be.\n    - Fix #15: crash in SSL library, initialize variables for TCP access\n      when TLS is configured.\n    - Fix tls handshake event callback function mistake, reported\n      by Mykhailo Danylenko.\n    - Fix output of nsd-checkconf -h.\n\nNew upstream release 4.2.0:\n\n  * Implement TCP fast open\n  * Added DNS over TLS\n  * TLS OCSP stapling support with the tls-service-ocsp option\n  * New option hide-identity can be used in nsd.conf to stop NSD\n    from responding with the hostname for probe queries that\n    elicit the chaos class response, this is conform RFC4892\n  * Disable TLS1.0, TLS1.1 and weak ciphers, enable CIPHER_SERVER_PREFERENCE\n\nUpdate to upstream release 4.1.27:\n\n* FEATURES:\n\n    - Deny ANY with only one RR in response, by default.  Patch from\n      Daisuke Higashi.  The deny-any statement in nsd.conf sets ANY\n      queries over UDP to be further moved to TCP as well.\n      Also no additional section processig for type ANY, reducing\n      the response size.\n    - Fix #4215: on-the-fly change of TSIG keys with patch from Igor, adds\n      nsd-control print_tsig, update_tsig, add_tsig, assoc_tsig\n      and del_tsig.  These changes are gone after reload, edit the\n      config file (or a file included from it) to make changes that\n      last after restart.\n\n* BUG FIXES:\n\nUpdate to upstream release 4.1.26:\n\n  * FEATURES:\n\n    - DNSTAP support for NSD, --enable-dnstap and then config in nsd.conf.\n    - Support SO_REUSEPORT_LB in FreeBSD 12 with the reuseport: yes\n      option in nsd.conf.\n    - Added nsd-control changezone.  nsd-control changezone name pattern\n      allows the change of a zone pattern option without downtime for\n      the zone, in one operation.\n\n  * BUG FIXES:\n\n    - Fix #4194: Zone file parser derailed by non-FQDN names in RHS of DNSSEC RRs.\n    - Fix #4202: nsd-control delzone incorrect exit code on error.\n    - Fix to not set GLOB_NOSORT so the nsd.conf include: files are\n      sorted and in a predictable order.\n    - Fix #3433: document that reconfig does not change per-zone stats.\n\nUpdate to upstream release 4.1.25:\n\n  * FEATURES:\n\n    - nsd-control prints neater errors for file failures.\n\n  * BUG FIXES:\n\n    - Fix that nsec3 precompile deletion happens before the RRs of\n      the zone are deleted.\n    - Fix printout of accepted remote control connection for unix sockets.\n    - Fix use_systemd typo/leftover in remote.c.\n    - Fix codingstyle in nsd-checkconf.c in patch from Sharp Liu.\n    - append_trailing_slash has one implementation and is not repeated\n      differently.\n    - Fix coding style in nsd.c\n    - Fix to combine the same error function into one, from Xiaobo Liu.\n    - Fix initialisation in remote.c.\n    - please clang analyzer and fix parse of IPSECKEY with bad gateway.\n    - Fix nsd-checkconf fail on bad zone name.\n    - Annotate exit functions with noreturn.\n    - Remove unused if clause during server service startup.\n    - Fix #4156: Fix systemd service manager state change notification\n      When it is compiled, systemd readiness signalling is enabled.\n      The option in nsd.conf is not used, it is ignored when read.\n\nUpdate to upstream release 4.1.24:\n\n- Features\n\n    * #4102: control interface via local socket\n    * configure --enable-systemd (needs pkg-config and libsystemd) can be \n      used to then use-systemd: yes in nsd.conf and have readiness signalling \n      with systemd.\n    * RFC8162 support, for record type SMIMEA.\n  - Bug Fixes\n    * Patch to fix openwrt for mac os build darwin detection in configure.\n    * Fix that first control-interface determines if TLS is used.\n      Warn when IP address interfaces are used without TLS.\n    * #4106: Fix that stats printed from nsd-control are recast from\n      unsigned long to unsigned (remote.c).\n    * Fix that type CAA (and URI) in the zone file can contain dots\n      when not in quotes.\n    * #4133: Fix that when IXFR contains a zone with broken NSEC3PARAM chain,\n      NSD leniently attempts to find a working NSEC3PARAM.\n\nUpdate to upstream release 4.1.23:\n\n  - Fix NSD time sensitive TSIG compare vulnerability.\n\nUpdate to upstream release 4.1.22:\n\n  - Features:\n    * refuse-any sends truncation (+TC) in reply to ANY queries\n    over UDP, and allows TCP queries like normal.\n    * Use accept4 to speed up answer of TCP queries\n  - Bug fixes:\n    * Fix nsec3 hash of parent and child co-hosted nsec3 enabled zones.\n    * Fix to use same condition for nsec3 hash allocation and free.\n\n- Changes in version 4.1.21:\n\n  - Features:\n    * --enable-memclean cleans up memory for use with memory checkers,\n      eg. valgrind.\n    * refuse-any nsd.conf option that refuses queries of type ANY.\n    * lower memory usage for tcp connections, so tcp-count can be\n      higher.\n  - Bug fixes:\n    * Fix spelling error in xfr-inspect.\n    * Fix buffer size warnings from compiler on filename lengths.\n",
      "Title": "Details",
      "Type": "General"
    },
    {
      "Text": "The CVRF data is provided by SUSE under the Creative Commons License 4.0 with Attribution (CC-BY-4.0).",
      "Title": "Terms of Use",
      "Type": "Legal Disclaimer"
    },
    {
      "Text": "openSUSE-2020-2222",
      "Title": "Patchnames",
      "Type": "Details"
    }
  ],
  "ProductTree": {
    "Relationships": [
      {
        "ProductReference": "nsd-4.3.4-bp152.2.3.1",
        "RelatesToProductReference": "SUSE Package Hub 12",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "nsd-4.3.4-bp152.2.3.1",
        "RelatesToProductReference": "SUSE Package Hub 15 SP1",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "nsd-4.3.4-bp152.2.3.1",
        "RelatesToProductReference": "SUSE Package Hub 15 SP2",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "nsd-4.3.4-bp152.2.3.1",
        "RelatesToProductReference": "openSUSE Leap 15.1",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "nsd-4.3.4-bp152.2.3.1",
        "RelatesToProductReference": "openSUSE Leap 15.2",
        "RelationType": "Default Component Of"
      }
    ]
  },
  "References": [
    {
      "URL": "https://lists.opensuse.org/archives/list/security-announce@lists.opensuse.org/thread/5FIDKYB6WSN55OA36HXF3BL4UYWBXAEV/",
      "Description": "E-Mail link for openSUSE-SU-2020:2222-1"
    },
    {
      "URL": "https://www.suse.com/support/security/rating/",
      "Description": "SUSE Security Ratings"
    },
    {
      "URL": "https://bugzilla.suse.com/1157331",
      "Description": "SUSE Bug 1157331"
    },
    {
      "URL": "https://bugzilla.suse.com/1179191",
      "Description": "SUSE Bug 1179191"
    },
    {
      "URL": "https://www.suse.com/security/cve/CVE-2019-13207/",
      "Description": "SUSE CVE CVE-2019-13207 page"
    },
    {
      "URL": "https://www.suse.com/security/cve/CVE-2020-28935/",
      "Description": "SUSE CVE CVE-2020-28935 page"
    }
  ],
  "Vulnerabilities": [
    {
      "CVE": "CVE-2019-13207",
      "Description": "nsd-checkzone in NLnet Labs NSD 4.2.0 has a Stack-based Buffer Overflow in the dname_concatenate() function in dname.c.",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "moderate"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2019-13207.html",
          "Description": "CVE-2019-13207"
        },
        {
          "URL": "https://bugzilla.suse.com/1182952",
          "Description": "SUSE Bug 1182952"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": [
            "SUSE Package Hub 12:nsd-4.3.4-bp152.2.3.1",
            "SUSE Package Hub 15 SP1:nsd-4.3.4-bp152.2.3.1",
            "SUSE Package Hub 15 SP2:nsd-4.3.4-bp152.2.3.1",
            "openSUSE Leap 15.1:nsd-4.3.4-bp152.2.3.1",
            "openSUSE Leap 15.2:nsd-4.3.4-bp152.2.3.1"
          ]
        }
      ],
      "CVSSScoreSets": {}
    },
    {
      "CVE": "CVE-2020-28935",
      "Description": "NLnet Labs Unbound, up to and including version 1.12.0, and NLnet Labs NSD, up to and including version 4.3.3, contain a local vulnerability that would allow for a local symlink attack. When writing the PID file, Unbound and NSD create the file if it is not there, or open an existing file for writing. In case the file was already present, they would follow symlinks if the file happened to be a symlink instead of a regular file. An additional chown of the file would then take place after it was written, making the user Unbound/NSD is supposed to run as the new owner of the file. If an attacker has local access to the user Unbound/NSD runs as, she could create a symlink in place of the PID file pointing to a file that she would like to erase. If then Unbound/NSD is killed and the PID file is not cleared, upon restarting with root privileges, Unbound/NSD will rewrite any file pointed at by the symlink. This is a local vulnerability that could create a Denial of Service of the system Unbound/NSD is running on. It requires an attacker having access to the limited permission user Unbound/NSD runs as and point through the symlink to a critical file on the system.",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "moderate"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2020-28935.html",
          "Description": "CVE-2020-28935"
        },
        {
          "URL": "https://bugzilla.suse.com/1173619",
          "Description": "SUSE Bug 1173619"
        },
        {
          "URL": "https://bugzilla.suse.com/1179191",
          "Description": "SUSE Bug 1179191"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": [
            "SUSE Package Hub 12:nsd-4.3.4-bp152.2.3.1",
            "SUSE Package Hub 15 SP1:nsd-4.3.4-bp152.2.3.1",
            "SUSE Package Hub 15 SP2:nsd-4.3.4-bp152.2.3.1",
            "openSUSE Leap 15.1:nsd-4.3.4-bp152.2.3.1",
            "openSUSE Leap 15.2:nsd-4.3.4-bp152.2.3.1"
          ]
        }
      ],
      "CVSSScoreSets": {}
    }
  ]
}