{
  "Severity": "LOW",
  "UpdatedAt": "2024-07-15T18:32:23Z",
  "Package": {
    "Ecosystem": "RUST",
    "Name": "risc0-zkvm"
  },
  "Advisory": {
    "DatabaseId": 253550,
    "Id": "GSA_kwCzR0hTQS01eGdqLXBtamotZ3c0Oc4AA95u",
    "GhsaId": "GHSA-5xgj-pmjj-gw49",
    "References": [
      {
        "Url": "https://github.com/risc0/risc0/security/advisories/GHSA-5xgj-pmjj-gw49"
      },
      {
        "Url": "https://eprint.iacr.org/2024/1037"
      },
      {
        "Url": "https://github.com/advisories/GHSA-5xgj-pmjj-gw49"
      }
    ],
    "Identifiers": [
      {
        "Type": "GHSA",
        "Value": "GHSA-5xgj-pmjj-gw49"
      }
    ],
    "Description": "RISC Zero zkVM was designed from its inception to provide three main guarantees:\n1. *Computational integrity*: that a given software program executed correctly.\n2. *Succinctness*: that the proof of execution does not grow in relation to the program being executed.\n3. *Zero Knowledge*: that details of the program execution are not visible within the proof of program execution.\n\nUlrich Habock and Al Kindi have released [new research] that indicates that several STARK implementations -including our RISC Zero zkVM- do not meet the requirements to assert the specific property of zero knowledge provably. \n\nWhile a vast majority of real-world applications that leverage RISC Zero zkVM or similar systems depend primarily on computational integrity and succinctness, a subset of applications critically depend on the privacy guarantees provided by zero-knowledge; and for those use cases, users are cautioned to understand the research and make informed decisions based on the risks outlined in using an impacted system.\n\nAlthough the maintainers are not aware of any attacks that can take advantage of this potential weakness, they are working to proactively address this discovery as quickly as possible. \n\n[new research]: https://eprint.iacr.org/2024/1037",
    "Origin": "UNSPECIFIED",
    "PublishedAt": "2024-07-15T18:32:22Z",
    "Severity": "LOW",
    "Summary": "RISC Zero zkVM notes on zero-knowledge",
    "UpdatedAt": "2024-07-15T18:32:23Z",
    "WithdrawnAt": "",
    "CVSS": {
      "Score": 0,
      "VectorString": ""
    }
  },
  "Versions": [
    {
      "FirstPatchedVersion": {
        "Identifier": ""
      },
      "VulnerableVersionRange": "\u003c= 1.0.2"
    }
  ]
}