{
  "id": "GHSA-7jp5-298q-jg98",
  "modified": "2026-02-28T05:14:36.510296Z",
  "published": "2026-02-25T22:40:15Z",
  "aliases": [
    "CVE-2026-27616"
  ],
  "summary": "Vikunja: Stored XSS via Unsanitized SVG Attachment Upload Leads to Token Exposure",
  "details": "**Details**\nThe application allows users to upload SVG files as task attachments. SVG is an XML-based format that supports JavaScript execution through elements such as \u003cscript\u003e tags or event handlers like onload.\n\nThe application does not sanitize SVG content before storing it. When the uploaded SVG file is accessed via its direct URL, it is rendered inline in the browser under the application's origin. As a result, embedded JavaScript executes in the context of the authenticated user.\n\nBecause the authentication token is stored in localStorage, it is accessible via JavaScript and can be retrieved by a malicious payload.\n\nKey security issues identified:\n\n _No server-side sanitization of SVG content.\nSVG attachments are rendered inline instead of being forced as a download.\nEmbedded JavaScript within SVG files is allowed to execute.\n Authentication tokens stored in localStorage are accessible to client-side scripts._\n\n**PoC**\n\n_**Tested Environment**_\n\n[ ] Application version: 1.1.0\n[ ] Deployment type: Self-hosted\n\n**Steps to Reproduce**\n\n1. Log in to an account.\n2. Go to Projects and Create a new task or open an existing task.\n3. Upload the following SVG file as an attachment:\n\n```\n\u003c?xml version=\"1.0\" encoding=\"UTF-8\" standalone=\"yes\"?\u003e\n\u003csvg\n onload=\"alert(localStorage.getItem('token'))\"\n xmlns=\"http://www.w3.org/2000/svg\"\u003e\n\u003c/svg\u003e\n\n```\n4. After uploading ,save the Task and open the project , copy the direct URL of the attachment.\n5. Open the attachment URL in a new browser tab.\n6. The embedded JavaScript executes immediately and displays the authentication token stored in `localStorage`.\n\nThis confirms that arbitrary JavaScript embedded in an uploaded SVG file executes within the application's context.\n\n**Impact**\n\nThis vulnerability is classified as **Stored Cross-Site Scripting (XSS).**\n\n**Potential impact includes:**\n\nExecution of arbitrary JavaScript in a victim’s browser.\nExposure of authentication tokens.\nPotential account takeover.\nAbility to perform authenticated actions on behalf of the victim.\nPossible privilege escalation if higher-privileged users open the malicious attachment.\nAny authenticated user who accesses a malicious SVG attachment may be affected.\n\n**Recommendations**\n\nThis vulnerability can be mitigated by implementing proper server-side sanitization of SVG uploads and preventing inline execution of uploaded files.\n\nSpecifically:\n\n- Sanitize all uploaded SVG files to remove \u003cscript\u003e elements, event handlers (e.g., onload), and other executable content.\n- Serve attachments with Content-Disposition: attachment to prevent inline rendering.\n- Implement a strict Content Security Policy (CSP) to block script execution within uploaded files.\n- Store authentication tokens in HttpOnly, Secure cookies instead of localStorage to prevent JavaScript access.\n- Applying these controls will prevent stored XSS via SVG uploads and significantly reduce the risk of token exposure and account takeover.\n\n**Attachment**\n[Stored XSS Proof of concept.pdf](https://github.com/user-attachments/files/25414870/Stored.XSS.Proof.of.concept.pdf)\n\nA fix is available at https://github.com/go-vikunja/vikunja/releases/tag/v2.0.0.",
  "affected": [
    {
      "package": {
        "ecosystem": "Go",
        "name": "code.vikunja.io/api",
        "purl": "pkg:golang/code.vikunja.io/api"
      },
      "ranges": [
        {
          "type": "SEMVER",
          "events": [
            {
              "introduced": "0"
            },
            {
              "last_affected": "0.24.6"
            }
          ]
        }
      ],
      "database_specific": {
        "source": "https://github.com/github/advisory-database/blob/main/advisories/github-reviewed/2026/02/GHSA-7jp5-298q-jg98/GHSA-7jp5-298q-jg98.json"
      }
    }
  ],
  "references": [
    {
      "type": "WEB",
      "url": "https://github.com/go-vikunja/vikunja/security/advisories/GHSA-7jp5-298q-jg98"
    },
    {
      "type": "ADVISORY",
      "url": "https://nvd.nist.gov/vuln/detail/CVE-2026-27616"
    },
    {
      "type": "PACKAGE",
      "url": "https://github.com/go-vikunja/vikunja"
    },
    {
      "type": "WEB",
      "url": "https://github.com/go-vikunja/vikunja/releases/tag/v2.0.0"
    },
    {
      "type": "WEB",
      "url": "https://github.com/user-attachments/files/25414870/Stored.XSS.Proof.of.concept.pdf"
    },
    {
      "type": "WEB",
      "url": "https://vikunja.io/changelog/vikunja-v2.0.0-was-released"
    }
  ]
}