{
  "Severity": "MODERATE",
  "UpdatedAt": "2025-12-02T21:07:03Z",
  "Package": {
    "Ecosystem": "GO",
    "Name": "github.com/sylabs/singularity/v4"
  },
  "Advisory": {
    "DatabaseId": 324090,
    "Id": "GSA_kwCzR0hTQS13d3J4LXc3YzktcmY4N84ABPH6",
    "GhsaId": "GHSA-wwrx-w7c9-rf87",
    "References": [
      {
        "Url": "https://github.com/opencontainers/runc/security/advisories/GHSA-cgrx-mc8f-2prm"
      },
      {
        "Url": "https://github.com/sylabs/singularity/security/advisories/GHSA-wwrx-w7c9-rf87"
      },
      {
        "Url": "https://nvd.nist.gov/vuln/detail/CVE-2025-64750"
      },
      {
        "Url": "https://github.com/sylabs/singularity/pull/3850"
      },
      {
        "Url": "https://github.com/sylabs/singularity/commit/27882963879a7af1699fd6511c3f5f1371d80f33"
      },
      {
        "Url": "https://github.com/sylabs/singularity/commit/5af3e790c40593591dfc26d0692e4d4b21c29ba0"
      },
      {
        "Url": "https://github.com/advisories/GHSA-fh74-hm69-rqjw"
      },
      {
        "Url": "https://github.com/advisories/GHSA-wwrx-w7c9-rf87"
      }
    ],
    "Identifiers": [
      {
        "Type": "GHSA",
        "Value": "GHSA-wwrx-w7c9-rf87"
      },
      {
        "Type": "CVE",
        "Value": "CVE-2025-64750"
      }
    ],
    "Description": "### Impact\n\n_**Native Mode (default)**_\n\nSingularity's default native runtime allows users to apply restrictions to container processes using the apparmor or selinux Linux Security Modules (LSMs), via the `--security selinux:\u003clabel\u003e` or `--security apparmor:\u003cprofile\u003e` flags.\n\nLSM labels are written to process or thread `attrs/exec` under `/proc`. If a user relies on LSM restrictions to prevent malicious operations then, under certain circumstances, an attacker can redirect the LSM label write operation so that it is ineffective. This requires:\n\n* The attacker to cause the user to run a malicious container image that redirects the mount of `/proc` to the destination of a shared mount, either known to be configured on the target system, or that will be specified by the user when running the container.\n* Control of the content of the shared mount, for example through another malicious container which also binds it, or as a user with relevant permissions on the host system it is bound from.\n\nNote that Singularity does not attempt to prevent damaging operations, or container escape, from containers that are started as the host root user. When a non-root user starts a container any LSM writes to /proc are performed as that user. For these reasons, the denial-of-service and container escape attacks detailed in [runc CVE-2025-52881](https://github.com/opencontainers/runc/security/advisories/GHSA-cgrx-mc8f-2prm) are not relevant. Processes running in non-root containers are subject to the standard permissions for the non-root account used, and cannot escalate privilege, even when intended container-specific LSM labels are not correctly applied.\n\nIn addition, a bug in the detection of selinux support in Singularity's default setuid flow means that `--security selinux:\u003clabel\u003e` flags may not be applied, even in the absence of an attack  - but in this case a warning message is emitted, indicating that selinux is unavailable. This warning may be may be overlooked, mis-interpreted, or not seen when singularity is run from a script or other tool. Failure to apply requested restrictions should result in a fatal error, rather than a warning message.\n\n_**OCI-Mode**_\n\nSingularity's OCI-mode is unaffected as it does not currently support applying LSM restrictions via the `--security` flag.\n\n### Patches\n\nIneffective write of selinux process labels is addressed via an update to the containers/selinux dependency in https://github.com/sylabs/singularity/pull/3850. This update brings in the upstream fix for CVE-2025-52881 in this dependency.\n\nIneffective write of apparmor process labels is addressed in commit 5af3e79.\n\nFailure to detect apparmor / selinux support, when `--security` flags are provided, is made an error rather than a warning in commit 2788296.\n\n### Workarounds\n\nThere are no known workarounds, other than to define system-wide apparmor / selinux policy for Singularity itself. This would apply to all containers, not just those run with the `--security` flags. Additionally, restrictions that are reasonable to apply to container processes may impact the functionality of Singularity.\n\n### References\n\nRelated vulnerabilities in runc:\n\n* [runc CVE-2025-52881](https://github.com/opencontainers/runc/security/advisories/GHSA-cgrx-mc8f-2prm)\n* [runc CVE-2019-19921](https://github.com/advisories/GHSA-fh74-hm69-rqjw)",
    "Origin": "UNSPECIFIED",
    "PublishedAt": "2025-12-02T21:07:02Z",
    "Severity": "MODERATE",
    "Summary": "Singluarity ineffectively applies selinux / apparmor LSM process labels",
    "UpdatedAt": "2025-12-02T21:07:03Z",
    "WithdrawnAt": "",
    "CVSS": {
      "Score": 4.5,
      "VectorString": "CVSS:3.1/AV:L/AC:H/PR:N/UI:R/S:U/C:L/I:L/A:L"
    }
  },
  "Versions": [
    {
      "FirstPatchedVersion": {
        "Identifier": "4.1.11"
      },
      "VulnerableVersionRange": "\u003c 4.1.11"
    },
    {
      "FirstPatchedVersion": {
        "Identifier": "4.3.5"
      },
      "VulnerableVersionRange": "\u003e= 4.2.0-rc.1, \u003c 4.3.5"
    }
  ]
}