{
  "Severity": "HIGH",
  "UpdatedAt": "2025-11-14T20:50:38Z",
  "Package": {
    "Ecosystem": "NPM",
    "Name": "flowise"
  },
  "Advisory": {
    "DatabaseId": 321774,
    "Id": "GSA_kwCzR0hTQS14N3JwLXFqMmgtZ2hnd84ABOju",
    "GhsaId": "GHSA-x7rp-qj2h-ghgw",
    "References": [
      {
        "Url": "https://github.com/FlowiseAI/Flowise/security/advisories/GHSA-x7rp-qj2h-ghgw"
      },
      {
        "Url": "https://github.com/FlowiseAI/Flowise/pull/5294"
      },
      {
        "Url": "https://github.com/advisories/GHSA-x7rp-qj2h-ghgw"
      }
    ],
    "Identifiers": [
      {
        "Type": "GHSA",
        "Value": "GHSA-x7rp-qj2h-ghgw"
      }
    ],
    "Description": "### Summary\nFailure to Invalidate Existing Sessions After Password Change (Persistent Session / Session Invalidity Failure).\n\n### Details\nAfter a user changes their password, the application does not invalidate other active sessions or session tokens that were established before the change. An attacker who already has an active session (e.g., via a stolen session token, device left logged in, or other access) continues to be authenticated even after the legitimate user rotates credentials, allowing the attacker to retain access despite the user’s password change.\n\n### PoC\n**Repro steps:**\n1. As logged in user on two browsers (ie. Chrome and Firefox, with incognito/private mode) https://cloud.flowiseai.com/account change password, on the Chrome for example\n2. Refresh the site on Firefox (second browser) - notice that still logged in (despite credentials were changed)\n\n**POC:**\nSteps described above (in Repro steps) completed successfully.\n\n### Impact\nPersistent unauthorized access despite credential rotation - undermines the primary purpose of password changes as a remediation step.\nEnables attackers with an active session (remote or physical access to a device) to continue acting as the user (confidentiality and integrity impact).\nIf session tokens are not bound to the credential state, forced password changes won’t terminate attacker sessions.\n\n**Resources**\nOWASP Session Management Cheat Sheet\nCWE-613: Insufficient Session Expiration",
    "Origin": "UNSPECIFIED",
    "PublishedAt": "2025-11-14T20:50:36Z",
    "Severity": "HIGH",
    "Summary": "Flowise Fails to Invalidate Existing Sessions After Password Changes",
    "UpdatedAt": "2025-11-14T20:50:38Z",
    "WithdrawnAt": "",
    "CVSS": {
      "Score": 8.1,
      "VectorString": "CVSS:3.0/AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:N"
    }
  },
  "Versions": [
    {
      "FirstPatchedVersion": {
        "Identifier": "3.0.10"
      },
      "VulnerableVersionRange": "\u003c 3.0.10"
    }
  ]
}