{
  "Title": "Security update for keepass",
  "Tracking": {
    "ID": "openSUSE-SU-2023:0157-1",
    "Status": "Final",
    "Version": "1",
    "InitialReleaseDate": "2023-06-27T18:21:20Z",
    "CurrentReleaseDate": "2023-06-27T18:21:20Z",
    "RevisionHistory": [
      {
        "Number": "1",
        "Date": "2023-06-27T18:21:20Z",
        "Description": "current"
      }
    ]
  },
  "Notes": [
    {
      "Text": "Security update for keepass",
      "Title": "Topic",
      "Type": "Summary"
    },
    {
      "Text": "This update for keepass fixes the following issues:\n\nUpdate to 2.54\n\n  * Security:\n\n    + Improved process memory protection of secure edit controls (CVE-2023-32784, boo#1211397).\n\n  * New Features:\n\n    + Triggers, global URL overrides, password generator profiles and a few more settings are now stored in the enforced configuration file.\n    + Added dialog 'Enforce Options (All Users)' (menu 'Tools' → 'Advanced Tools' → 'Enforce Options'), which facilitates storing certain options in the enforced configuration file.\n    + In report dialogs, passwords (and other sensitive data) are now hidden using asterisks by default (if hiding is activated in the main window); the hiding can be toggled using the new '***' button in the toolbar.\n    + The 'Print' command in most report dialogs now requires the 'Print' application policy flag, and the master key must be entered if the 'Print - No Key Repeat' application policy flag is deactivated.\n    + The 'Export' command in most report dialogs now requires the 'Export' application policy flag, and the master key must be entered.\n    + Single line edit dialogs now support hiding the value using asterisks.\n    + Commands that require elevation now have a shield icon like on Windows.\n    + TrlUtil: added 'Move Selected Unused Text to Dialog Control' command.\n  * Improvements:\n    * The content mode of the configuration elements '/Configuration/Application/TriggerSystem', '/Configuration/Integration/UrlSchemeOverrides' and '/Configuration/PasswordGenerator/UserProfiles' is now 'Replace' by default.\n    * The built-in override for the 'ssh' URI scheme is now deactivated by default (it can be activated in the 'URL Overrides' dialog).\n    * When opening the password generator dialog without a derived profile, the '(Automatically generated passwords for new entries)' profile is now selected by default, if profiles are enabled (otherwise the default profile is used).\n    * The clipboard workarounds are now disabled by default (they are not needed anymore on most systems).\n    * Improved clipboard clearing.\n    * Improved starting of an elevated process.\n\n  * Bugfixes:\n\n    + In report dialogs, the 'Print' and 'Export' commands now always use the actual data (in previous versions, asterisks were printed/exported when the application policy flag 'Unhide Passwords' was turned off).\n\n- Update to 2.53.1\n\n  * When testing a KDF ('Test' button in the database settings dialog), KeePass now spawns a child process that performs the KDF computation (which allows to cancel the test more cleanly in the case of excessive parameters; security is unaffected, because dummy data is used for the test).\n  * Removed the 'Export - No Key Repeat' application policy flag; KeePass now always asks for the current master key when trying to export data.\n  * Minor other improvements.\n\n- Update to 2.53\n\n  * New Features:\n\n    + For each entry listed on the 'History' tab page of the entry dialog, the fields modified with respect to the previous entry are displayed.\n    + Added 'Compare' button on the 'History' tab page of the entry dialog; when two (not necessarily consecutive) history entries are selected, clicking the button shows a detailed comparison (with values, etc.).\n    + When editing an entry, the history entry list of the entry dialog now contains an entry called 'Dialog (unsaved)', which represents all data entered in the current dialog (other tab pages).\n    + When editing an entry, the history entry list of the entry dialog now contains an entry called 'Current (TIME)', which is the entry that is currently stored in the database (without any changes made in the current dialog).\n    + Added 'History' command in the 'Find' main menu; it lists all entry modifications (sorted by time).\n    + Added filter box in most report dialogs (last modified entries, history, large entries, similar password clusters, password quality, history entry comparison, database file search, ...).\n    + Added 'Print' button in most report dialogs.\n    + Added 'Export' button in most report dialogs; supported formats are CSV and HTML.\n    + Added {EDGE} placeholder, which is replaced by the executable path of the new (Chromium-based) Microsoft Edge, if installed.\n    + Added URL override suggestion for Microsoft Edge in private mode in the URL override suggestions drop-down list of the entry dialog.\n    + Added optional built-in global URL overrides for opening HTTP/HTTPS URLs with Microsoft Edge in private mode.\n    + When trying to rearrange entries while automatic sorting is activated, KeePass now asks whether to deactivate automatic sorting.\n    + Added access keys in the tags button drop-down menu of the entry/group dialogs.\n    + Added access keys in the 'View' → 'Sort By' menu.\n    + Added access keys in the entry templates menu.\n    + Added access keys in the 'Perform Auto-Type' menu (which is displayed if the 'Show additional auto-type menu commands' option is turned on).\n    + Added {HMACOTP} and {TIMEOTP} in the 'Perform Auto-Type' menu.\n    + Added keyboard shortcut Ctrl+T for the 'Copy Time-Based OTP' entry data command.\n    + Added keyboard shortcut Ctrl+Shift+T for the 'Show Time-Based OTP' entry data command.\n    + Enhanced Password Depot XML import module to support the new format (added support for the new node names, group icons, recycle bin, tags, favorites, auto-type delay conversion, history, enhanced icon mapping, enhanced date/time parsing, ...).\n    + Added border for headings in HTML exports/printouts.\n    + Added support for running KeePass in FIPS mode.\n\n  * Improvements:\n\n    + History entries listed on the 'History' tab page of the entry dialog are now sorted from newest to oldest.\n    + The icons in the list on the 'History' tab page of the entry dialog now indicate the type of the entry.\n    + History entry controls of the entry dialog are now disabled when creating a new entry.\n    + The history entry 'Restore' button is now disabled when any change has been made in the current dialog.\n    + The 'Password modified' time is now updated immediately when deleting a history entry.\n    + Improved URL override suggestion for Microsoft Edge in the URL override suggestions drop-down list of the entry dialog (changed from 'microsoft-edge:{URL}' to 'cmd://{EDGE} '{URL}'').\n    + Improved optional built-in global URL overrides for opening HTTP/HTTPS URLs with Microsoft Edge (changed from 'microsoft-edge:{BASE}' to 'cmd://{EDGE} '{BASE}'').\n    + Reordered web browser URL overrides alphabetically.\n    + Improved dynamic menu item access key assignment.\n    + Improved item separation in the entry details view.\n    + In most places, groups in a group path are now separated by right arrows instead of hyphens.\n    + Improved last modification time comparison for plugin data dictionaries.\n    + Unified generation of common HTML parts.\n    + The 'Copy Initial Password' command in the 'Tools' menu of the entry dialog now requires the 'Copy' application policy flag.\n    + Various UI text improvements.\n    + Various code optimizations.\n    + Minor other improvements.\n\n  * Bugfixes:\n\n    + The history entry 'Restore' button now always works as expected.\n\n- Update to 2.52\n\n  * New Features:\n\n    + Added 'Copy Initial Password' command in the tools menu of the entry dialog; it copies (to the clipboard) the password that was current when the dialog was opened.\n    + When multiple entries are selected (containing at least one attachment), the number of attachments is now displayed in the 'Attachments' submenu of the entry menu.\n    + Added option 'Alt. item background color' (supporting the states 'Off', 'On, default color' and 'On, custom color'); this combines the previous two options 'Use alternating item background colors' and 'Custom alt. item color'.\n    + Comment placeholders ({C:...}) may now contain balanced braces.\n    + In the auto-type entry selection dialog, values in the 'Sequence - Comments' column are dereferenced now.\n    + The time when the password of an entry was last changed is now displayed in the entry dialog on the 'History' tab page.\n    + Added support for importing 1Password 8.7 1PUX files.\n    + Added support for importing Key Folder 1.22 XML files.\n    + Sticky Password XML import: added support for importing groups and expiry dates.\n    + Steganos Password Manager CSV import: added support for the new encoding of double quotes.\n    + Bitwarden JSON import: time-based one-time password generator settings are converted automatically now.\n    + KeePass now checks the 'KeePass.exe.config' file and shows a warning message when finding a problem.\n    + For development builds: added command for showing GC information.\n    + Plugins can now load the header of a database file more easily.\n    + Plugins can now subscribe to a master key change event.\n    + TrlUtil: added workaround for .NET tab control focus bug.\n\n  * Improvements:\n\n    + Moved the command 'Save Attached File(s) To' into the 'Attachments' submenu of the entry menu and renamed it to 'Save File(s) To'.\n    + The command for saving attached files is now available only if at least one of the selected entries has at least one attachment.\n    + The {APPACTIVATE ...} auto-type command now ignores the options 'Cancel auto-type when the target window changes' and 'Cancel auto-type when the target window title changes'.\n    + {APPACTIVATE ...} auto-type command: if the specified window does not exist or cannot be focused, auto-type is aborted now.\n    + Unified creation of fields with indices.\n    + Improved database modification state and UI updating after imports/synchronizations.\n    + In the master key creation/prompt dialogs, the [OK] button is now disabled when checking the 'Key file/provider' check box and selecting '(None)' in the combo box.\n    + Improved drop-down menu width adjustment for certain combo boxes in the options dialog.\n    + Improved hashing performance of protected binaries, UUIDs, ...\n    + Performance improvements related to empty arrays.\n    + Improved Mono framework version detection.\n    + TrlUtil: improved preview dialog update performance.\n    + Various UI text improvements.\n    + Various code optimizations.\n    + Minor other improvements.\n\n  * Bugfixes:\n\n    * Fixed a bug that caused a minimized main window to be restored to a normal window instead of a maximized window in certain situations.\n    * The 'Help' menu item in the entry dialog and the 'Help' button in the entry string field dialog now open the correct help sections.\n\n- Update to 2.51.1\n\n  * New Features:\n\n    + Most dialogs with fixed size now detect whether they fit onto the current screen, and when a dialog does not fit (e.g. due to a very high DPI factor), its size is reduced and scroll bars are displayed.\n    + Added plural entry command names in the main window (e.g. the command for editing the currently selected entry/entries is now called either 'Edit Entry' or 'Edit Entries', depending on the number of selected entries).\n    + Added tooltip for the main part of the status bar of the main window.\n    + Enhanced color buttons (tooltips, accessible names, ...) in the entry dialog, in the database settings dialog and in the options dialog.\n    + Added 'Interface (2)' tab page in the options dialog, renamed the existing 'Interface' tab page to 'Interface (1)', moved some controls from 'Interface (1)' to 'Interface (2)'.\n    + Enhanced font selection controls (with a checkbox that allows to return to the default, the button shows the currently selected font, tooltip, improved accessibility, ...) in the options dialog.\n    + Added help links 'Dark theme' and 'Main font (size)' in the options dialog.\n    + The options 'Custom alt. item color' and 'Esc keypress in main window' are now disabled if they are enforced (by an enforced configuration file).\n    + Added support for opening URLs with Waterfox in private mode.\n    + Added dialog for editing (HMAC-based and time-based) one-time password generator settings (can be opened using the 'OTP Generator Settings' commands in the entry dialog or in the 'Edit Entry (Quick)' menu of the main window).\n    + Added entry commands 'Copy HMAC-Based OTP', 'Show HMAC-Based OTP', 'Copy Time-Based OTP' and 'Show Time-Based OTP' (in the 'Other Data' menu).\n    + Added entry commands 'Copy Title' and 'Copy Notes' (in the 'Other Data' menu).\n    + When switching to the 'Generate' tab page of the password generator dialog (no database open), the entropy collection dialog is displayed now, if the option 'Show dialog for collecting user input as additional entropy' is turned on.\n    + Added option 'Colorize password characters' in the HTML export/print dialog; the colors are customizable.\n    + Added options 'Custom main font' and 'Custom password font' in the HTML export/print dialog.\n    + Added horizontal entry separator lines in tabular HTML exports/printouts.\n    + In the plugins dialog, the 'Delete old files from cache automatically' option and the 'Clear' button are now disabled if they are enforced (by an enforced configuration file).\n    + Plugins can now change the expiry date of an entry more easily.\n\n  * Improvements:\n\n    + Improved main window initialization performance.\n    + Improved initial emergence of a minimized or maximized main window (less flickering, improved performance, ...).\n    + Improved names/tooltips of the database toolbar buttons in the main window.\n    + Improved handling of bold/italic list fonts.\n    + Improved entry list update performance in certain situations.\n    + Improved dynamic menu deconstruction performance.\n    + Fields starting with 'HmacOtp-' or 'TimeOtp-' are not shown in the entry string copy menu anymore.\n    + Improved tooltips and accessibility of password repetition text boxes.\n    + When a dark theme is active, the error background color of text boxes is darker now.\n    + Improved accessibility of expiry control groups.\n    + The title of the master key creation/change dialog is now adjusted to the context.\n    + Improved 'Compression' tab page of the database settings dialog (extended 'None' option description, improved accessibility, ...).\n    + If no color has been specified, the 'Custom alt. item color' button in the options dialog now shows the default color.\n    + Improved HTML generation for HTML exports/printouts.\n    + Improved default fonts used when printing or exporting to HTML.\n    + In block HTML exports/printouts, field names are not italic anymore (unless the user has selected an italic main font).\n    + In HTML exports/printouts, all field values except passwords are trimmed now.\n    + HTML exports/printouts: improved encoding of white-space characters in passwords.\n    + Improved horizontal entry separator lines in block HTML exports/printouts.\n    + TrlUtil: improved control classification.\n    + Increased Authenticode certificate key length.\n    + Improved entry list update performance when duplicating entries.\n    + Various CHM/help improvements.\n    + Various UI text improvements.\n    + Various code optimizations.\n    + Minor other improvements.\n\n  * Bugfixes:\n\n    + The option 'Use alternating item background colors' is now compatible with automatic sorting again.\n    + The command line parameter '-preselect:' now works as expected when the option 'Clear master key command line parameters after using them once' is turned on.\n    + Font selections in the options dialog are now applied only when closing the dialog with [OK].\n    + Fixed an entry list scrolling bug.\n\n- Update to 2.50\n\n  * New Features:\n\n    + On most Linux systems, AES-KDF is now about 4 times as fast as before, if the 'libgcrypt' library is installed.\n    + On most Linux systems, Argon2d and Argon2id are now about 3 times as fast as before (for default parameters), if the 'libargon2' library is installed.\n    + The option 'Enter master key on secure desktop' is now also supported by master key prompt dialogs shown during imports, confirmations (before exporting, printing, changing the master key, ...) and trigger actions.\n    + The option 'Enter master key on secure desktop' is now also supported by master key creation/change dialogs.\n    + The key file/provider combo boxes in the master key dialogs now have a tooltip that shows the current value, if the value is very long.\n    + Added password generation button in the entry string field dialog.\n    + When double-clicking the title cell of an entry in the main entry list while holding down the Shift key, the title is now copied to the clipboard.\n    + Added support for detecting the latest versions of Chromium on Unix-like systems (for 'Open with ...' commands in the 'URL(s)' menu, for the {GOOGLECHROME} placeholder, ...).\n    + In the 'URL(s)' menu, there now are separate commands for Google Chrome and Chromium, if both are installed.\n    + Enhanced support for detecting Vivaldi, Brave, Pale Moon and Epiphany.\n    + Added support for importing Kaspersky Password Manager 9.0.2 TXT files.\n    + Bitwarden import module: added support for importing subfolders, and collection names are now imported as tags.\n    + In the 'About KeePass' dialog, each item in the components list now has a tooltip that shows the file/folder path of the component, if it is installed.\n    + In the 'About KeePass' dialog, a double-click onto a component now shows the component file/folder with the file manager.\n    + In the 'About KeePass' dialog, the components list now has a context menu that provides the following new commands: 'Show with File Manager', 'Copy Version/Status' and 'Copy Path'.\n  * Improvements:\n    + If the option 'An entry matches if one of its tags is contained in the target window title' is turned on, auto-type now additionally considers tags inherited from groups.\n    + The built-in password generation patterns 'Hex Key - *-Bit' now use upper-case hexadecimal symbols.\n    + Improved Spr variance check of the password generator (custom string references, ...).\n    + All commands in the password generator menu (shown by the password generator buttons in entry/string dialogs) support the option 'Show dialog for collecting user input as additional entropy' now.\n  * Bugfixes:\n    + Column header context menus are not shown for non-report list views anymore.\n    + When copying a URL to the clipboard fails, the main entry list is updated now.\n    + Toggling the password generator option 'Show dialog for collecting user input as additional entropy' now causes a switch to the '(Custom)' profile.\n    + In the TAN wizard dialog, group names containing ampersands are displayed correctly now.\n\n- Add recommends to libargon2-1 and libgrypt20 as Keepass can use\n  those for faster operations.\n",
      "Title": "Details",
      "Type": "General"
    },
    {
      "Text": "The CVRF data is provided by SUSE under the Creative Commons License 4.0 with Attribution (CC-BY-4.0).",
      "Title": "Terms of Use",
      "Type": "Legal Disclaimer"
    },
    {
      "Text": "openSUSE-2023-157",
      "Title": "Patchnames",
      "Type": "Details"
    }
  ],
  "ProductTree": {
    "Relationships": [
      {
        "ProductReference": "keepass-2.54-bp154.2.3.1",
        "RelatesToProductReference": "SUSE Package Hub 15 SP4",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "keepass-2.54-bp154.2.3.1",
        "RelatesToProductReference": "openSUSE Leap 15.4",
        "RelationType": "Default Component Of"
      }
    ]
  },
  "References": [
    {
      "URL": "https://lists.opensuse.org/archives/list/security-announce@lists.opensuse.org/thread/YO3KDTWTM4LYCKXITB6HKBAPXRJFQLJ6/",
      "Description": "E-Mail link for openSUSE-SU-2023:0157-1"
    },
    {
      "URL": "https://www.suse.com/support/security/rating/",
      "Description": "SUSE Security Ratings"
    },
    {
      "URL": "https://bugzilla.suse.com/1211397",
      "Description": "SUSE Bug 1211397"
    },
    {
      "URL": "https://www.suse.com/security/cve/CVE-2023-32784/",
      "Description": "SUSE CVE CVE-2023-32784 page"
    }
  ],
  "Vulnerabilities": [
    {
      "CVE": "CVE-2023-32784",
      "Description": "In KeePass 2.x before 2.54, it is possible to recover the cleartext master password from a memory dump, even when a workspace is locked or no longer running. The memory dump can be a KeePass process dump, swap file (pagefile.sys), hibernation file (hiberfil.sys), or RAM dump of the entire system. The first character cannot be recovered. In 2.54, there is different API usage and/or random string insertion for mitigation.",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "important"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2023-32784.html",
          "Description": "CVE-2023-32784"
        },
        {
          "URL": "https://bugzilla.suse.com/1211397",
          "Description": "SUSE Bug 1211397"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": [
            "SUSE Package Hub 15 SP4:keepass-2.54-bp154.2.3.1",
            "openSUSE Leap 15.4:keepass-2.54-bp154.2.3.1"
          ]
        }
      ],
      "CVSSScoreSets": {}
    }
  ]
}