{
  "Identifier": "GHSA-7wh8-jrq7-p27f",
  "PackageSlug": "packagist/simplesamlphp/simplesamlphp",
  "Title": "SimpleSAMLphp exposes credentials in session storage",
  "Description": "When an authentication request is received via the ECP profile, the username and password obtained this way were saved to the state array, which is used to pass relevant data to different routines that may need it. This is not a problem in itself. However, when the ECP profile is disabled in the Identity Provider, other bindings such as HTTP-POST or HTTP-Redirect will be used, and since redirections are involved, the state array is then persisted to the user’s session, effectively storing it in the session backend.\n\nThe ECP profile, which uses the SOAP and PAOS bindings, does not involve any HTTP redirection for the user, and for that reason the state array containing the credentials is never persisted to the session. The logic for determining when to save the credentials to the state array assumed wrongly, though, that if the authentication request came in on the SOAP binding, that means the ECP profile is used. This may not be true as ECP can be disabled by configuration in the IdP’s hosted SAML metadata, and in that case SimpleSAMLphp would then try to default to a binding different than PAOS, such as HTTP-POST or HTTP-Redirect, effectively consolidating the entire state array to the user’s session as described before.\n\nIn practice, any Identity Provider with the ECP profile disabled but metadata for an entity that supports ECP, would reject incoming ECP requests, but write the credentials obtained in the request to the user’s session, which will be stored in the session store, whichever is used (local file system in case PHP sessions are used, Memcache, Redis, relational databases, etc).",
  "Date": "2024-05-28",
  "Pubdate": "2024-05-28",
  "AffectedRange": "\u003e=1.16.0 \u003c1.16.3",
  "FixedVersions": [
    "1.16.3"
  ],
  "AffectedVersions": "All versions starting from 1.16.0 before 1.16.3",
  "NotImpacted": "All versions before 1.16.0, all versions starting from 1.16.3",
  "Solution": "Upgrade to version 1.16.3 or above.",
  "Urls": [
    "https://github.com/advisories/GHSA-7wh8-jrq7-p27f",
    "https://github.com/simplesamlphp/simplesamlphp/commit/44d1e3052930d93f0f554c25bc7c7602f8136880",
    "https://github.com/FriendsOfPHP/security-advisories/blob/master/simplesamlphp/simplesamlphp/2018-12-20.yaml",
    "https://github.com/simplesamlphp/simplesamlphp",
    "https://simplesamlphp.org/security/201812-01"
  ],
  "CvssV2": "",
  "CvssV3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N",
  "UUID": "b5654a32-d679-4e14-a3a9-22c8f9eba623"
}