{
  "Severity": "MODERATE",
  "UpdatedAt": "2025-03-11T20:31:09Z",
  "Package": {
    "Ecosystem": "COMPOSER",
    "Name": "froxlor/froxlor"
  },
  "Advisory": {
    "DatabaseId": 283935,
    "Id": "GSA_kwCzR0hTQS0yNnhxLW04eHctNjM3M84ABFUf",
    "GhsaId": "GHSA-26xq-m8xw-6373",
    "References": [
      {
        "Url": "https://github.com/froxlor/Froxlor/security/advisories/GHSA-26xq-m8xw-6373"
      },
      {
        "Url": "https://github.com/froxlor/Froxlor/commit/fde43f80600f1035e1e3d2297411b666d805549a"
      },
      {
        "Url": "https://github.com/user-attachments/assets/86947633-3e7c-4e10-86cc-92e577761e8e"
      },
      {
        "Url": "https://nvd.nist.gov/vuln/detail/CVE-2025-48958"
      },
      {
        "Url": "https://github.com/advisories/GHSA-26xq-m8xw-6373"
      }
    ],
    "Identifiers": [
      {
        "Type": "GHSA",
        "Value": "GHSA-26xq-m8xw-6373"
      },
      {
        "Type": "CVE",
        "Value": "CVE-2025-48958"
      }
    ],
    "Description": "### Summary\n_An HTML Injection vulnerability in the customer account portal allows an attacker to inject malicious HTML payloads in the email section. This can lead to phishing attacks, credential theft, and reputational damage by redirecting users to malicious external websites. The vulnerability has a medium severity, as it can be exploited through user input without authentication._\n\n### Observation\n_It is observed that in the portal of the customer account, there is a functionality in the email section to create an email address that accepts user input. By intercepting the request and modifying the \"domain\" field with an HTML injection payload containing an anchor tag, the injected payload is reflected on an error page. When clicked, it redirects users to an external website, confirming the presence of an HTML Injection vulnerability._\n\n### PoC\n1. Navigate to the Email section in the Customer Account Portal and create a new email address.\n\n2. Enter any garbage value in the required field and intercept the request using Burp Suite.\n\n3. Locate the \"domain\" field in the intercepted request and replace its value with the following HTML Injection payload:\n\n\t`\u003ca href=\"\u0026#x68;\u0026#x74;\u0026#x74;\u0026#x70;\u0026#x73;\u0026#x3a;\u0026#x2f;\u0026#x2f;\u0026#x77;\u0026#x77;\u0026#x77;\u0026#x2e;\u0026#x67;\u0026#x6f;\u0026#x6f;\u0026#x67;\u0026#x6c;\u0026#x65;\u0026#x2e;\u0026#x63;\u0026#x6f;\u0026#x6d;\"\u003eCLiCK\u003c/a\u003e`\n\n4. Forward the modified request and observe that the injected payload is reflected on an error page.\n\n5. Click on the displayed \"CLiCK\" link to verify that it redirects to `https://www.google.com`, confirming the presence of HTML [Injection.]([url]([froxlor_HTML-INJECTION.mp4.zip](https://github.com/user-attachments/files/18311429/froxlor_HTML-INJECTION.mp4.zip)))\n\n### Impact\n_An attacker can exploit this HTML Injection vulnerability to manipulate the portal’s content, conduct phishing attacks, deface the application, or trick users into clicking malicious links. This can lead to credential theft, malware distribution, reputational damage, and potential compliance violations.\nThe users of the customer account portal are impacted by this vulnerability. Specifically, any user who interacts with the email section of the portal may be tricked into clicking malicious links, leading to potential phishing attacks, credential theft, and exposure to other malicious activities. The organization hosting the portal could also be impacted by reputational damage and compliance violations._\n\n### Recommendation\n_It is recommended to implement proper input validation and output encoding to prevent HTML Injection. The application should sanitize user input by stripping or escaping HTML tags before rendering it on the page._",
    "Origin": "UNSPECIFIED",
    "PublishedAt": "2025-03-11T20:31:08Z",
    "Severity": "MODERATE",
    "Summary": "Froxlor has an HTML Injection Vulnerability",
    "UpdatedAt": "2025-06-03T17:35:33Z",
    "WithdrawnAt": "",
    "CVSS": {
      "Score": 5.5,
      "VectorString": "CVSS:3.1/AV:N/AC:L/PR:L/UI:R/S:U/C:L/I:L/A:L"
    }
  },
  "Versions": [
    {
      "FirstPatchedVersion": {
        "Identifier": "2.2.6"
      },
      "VulnerableVersionRange": "\u003c= 2.2.5"
    }
  ]
}