{
  "Severity": "MODERATE",
  "UpdatedAt": "2025-09-29T20:40:04Z",
  "Package": {
    "Ecosystem": "GO",
    "Name": "github.com/filecoin-project/go-f3"
  },
  "Advisory": {
    "DatabaseId": 314379,
    "Id": "GSA_kwCzR0hTQS03cHE5LXJmOXAtd2NyZs4ABMwL",
    "GhsaId": "GHSA-7pq9-rf9p-wcrf",
    "References": [
      {
        "Url": "https://github.com/filecoin-project/go-f3/security/advisories/GHSA-7pq9-rf9p-wcrf"
      },
      {
        "Url": "https://nvd.nist.gov/vuln/detail/CVE-2025-59941"
      },
      {
        "Url": "https://github.com/filecoin-project/go-f3/commit/76fff18cf07b21baccf537024bdb2fb41f75f6e2#diff-e1f646cea41790e1642e4e649c9e3c526344736d67222201703e1c29c23e9625"
      },
      {
        "Url": "https://github.com/advisories/GHSA-7pq9-rf9p-wcrf"
      }
    ],
    "Identifiers": [
      {
        "Type": "GHSA",
        "Value": "GHSA-7pq9-rf9p-wcrf"
      },
      {
        "Type": "CVE",
        "Value": "CVE-2025-59941"
      }
    ],
    "Description": "### Description\nA vulnerability exists in go-f3's justification verification caching mechanism where verification results are cached without properly considering the context of the message. An attacker can bypass justification verification by:\n1. First submitting a valid message with a correct justification\n2. Then reusing the same cached justification in contexts where it would normally be invalid\n\nThis occurs because the cached verification does not properly validate the relationship between the justification and the specific message context it's being used with.\n\n### Impact\n- Potential consensus integrity issues through invalid justification acceptance\n- Could affect network liveness if exploited systematically\n- May allow malicious actors to influence consensus decisions with invalid justifications\n- Requires significant power (350+ TiB due to power table rounding) to meaningfully exploit\n- It would also be difficult to exploit in a synchronised fashion, such that \u003e1/3 of the network goes down at one time.  This isn't a one-msg panic, where you can spam it and bring everyone down, because every node will have a different amount of memory andmany SPs also run redundant lotus nodes.  \n\n### Patches\nThe fix was merged and released with go-f3 0.8.9. All node software (Lotus, Forest, Venus) are using a patched version of go-f3 with their updates for the nv27 network upgrade.\n\n### Workarounds\nThe are no immediate workarounds available. Nodes should upgrade to the patched version, which they will have done if participating in nv27 on Filecoin mainnet.\n\n### Credits\nThe bug was reported by @lgprbs via our bug bounty program. Thank you for the contributions.",
    "Origin": "UNSPECIFIED",
    "PublishedAt": "2025-09-29T20:40:02Z",
    "Severity": "MODERATE",
    "Summary": "go-f3 Vulnerable to Cached Justification Verification Bypass",
    "UpdatedAt": "2025-09-30T15:16:04Z",
    "WithdrawnAt": "",
    "CVSS": {
      "Score": 5.9,
      "VectorString": "CVSS:3.1/AV:N/AC:H/PR:L/UI:N/S:U/C:N/I:H/A:L"
    }
  },
  "Versions": [
    {
      "FirstPatchedVersion": {
        "Identifier": "0.8.9"
      },
      "VulnerableVersionRange": "\u003c 0.8.9"
    }
  ]
}