{
  "id": "GHSA-cfpf-hrx2-8rv6",
  "modified": "2025-12-22T18:41:39.691021Z",
  "published": "2025-12-16T22:34:16Z",
  "aliases": [
    "CVE-2025-68156",
    "GO-2025-4245"
  ],
  "related": [
    "CGA-3vq2-7hp9-jqqp",
    "CGA-4fw6-wrq3-g9qf",
    "CGA-84ch-h5m2-mr88",
    "CGA-885c-jh9h-f35h",
    "CGA-96h6-w3q5-f22r",
    "CGA-mr2c-q6qx-g8vm",
    "CGA-p53h-q55r-84pw",
    "CGA-p7xv-647j-5xc9"
  ],
  "summary": "Expr has Denial of Service via Unbounded Recursion in Builtin Functions",
  "details": "Several builtin functions in Expr, including `flatten`, `min`, `max`, `mean`, and `median`, perform\nrecursive traversal over user-provided data structures without enforcing a maximum recursion depth.\n\nIf the evaluation environment contains **deeply nested** or **cyclic** data structures, these functions may recurse\nindefinitely until exceed the Go runtime stack limit. This results in a **stack overflow panic**, causing the host\napplication to crash.\n\nWhile exploitability depends on whether an attacker can influence or inject cyclic or pathologically deep data into the\nevaluation environment, this behavior represents a denial-of-service (DoS) risk and affects overall library robustness.\nInstead of returning a recoverable evaluation error, the process may terminate unexpectedly.\n\n### Impact\n\nIn affected versions, evaluation of expressions that invoke certain builtin functions on untrusted or insufficiently\nvalidated data structures can lead to a **process-level crash** due to stack exhaustion.\n\nThis issue is most relevant in scenarios where:\n\n* Expr is used to evaluate expressions against externally supplied or dynamically constructed environments.\n* Cyclic references (directly or indirectly) can be introduced into arrays, maps, or structs.\n* There are no application-level safeguards preventing deeply nested input data.\n\nIn typical use cases with controlled, acyclic data, the issue may not manifest. However, when present, the resulting\npanic can be used to reliably crash the application, constituting a denial of service.\n\n### Patches\n\nThe issue has been fixed in the v1.17.7 versions of Expr.\n\nThe patch introduces a **maximum recursion depth limit** for affected builtin functions. When this limit is exceeded,\nevaluation aborts gracefully and returns a descriptive error instead of panicking.\n\nAdditionally, the maximum depth can be customized by users via `builtin.MaxDepth`, allowing applications with legitimate\ndeep structures to raise the limit in a controlled manner.\n\nUsers are strongly encouraged to upgrade to the patched release, which includes both the recursion guard and\ncomprehensive test coverage to prevent regressions.\n\n### Workarounds\n\nFor users who cannot immediately upgrade, the following mitigations are recommended:\n\n* Ensure that evaluation environments cannot contain cyclic references.\n* Validate or sanitize externally supplied data structures before passing them to Expr.\n* Wrap expression evaluation with panic recovery to prevent a full process crash (as a last-resort defensive measure).\n\nThese workarounds reduce risk but do not fully eliminate the issue without the patch.",
  "affected": [
    {
      "package": {
        "ecosystem": "Go",
        "name": "github.com/expr-lang/expr",
        "purl": "pkg:golang/github.com/expr-lang/expr"
      },
      "ranges": [
        {
          "type": "SEMVER",
          "events": [
            {
              "introduced": "0"
            },
            {
              "fixed": "1.17.7"
            }
          ]
        }
      ],
      "database_specific": {
        "source": "https://github.com/github/advisory-database/blob/main/advisories/github-reviewed/2025/12/GHSA-cfpf-hrx2-8rv6/GHSA-cfpf-hrx2-8rv6.json"
      }
    }
  ],
  "references": [
    {
      "type": "WEB",
      "url": "https://github.com/expr-lang/expr/security/advisories/GHSA-cfpf-hrx2-8rv6"
    },
    {
      "type": "ADVISORY",
      "url": "https://nvd.nist.gov/vuln/detail/CVE-2025-68156"
    },
    {
      "type": "WEB",
      "url": "https://github.com/expr-lang/expr/pull/870"
    },
    {
      "type": "PACKAGE",
      "url": "https://github.com/expr-lang/expr"
    }
  ]
}