{
  "Identifier": "GHSA-q79m-c546-2g63",
  "PackageSlug": "packagist/cakephp/cakephp",
  "Title": "CakePHP vulnerable to Denial of Service attack through XML payloads",
  "Description": "RequestHandlerComponent had a vulnerability that would allow well crafted requests to create a denial of service attack. RequestHandlerComponent leverages `Xml::build()` which allows reading local files. We recommend that all applications using RequestHandlerComponent upgrade, or disable parsing XML payloads.",
  "Date": "2023-01-20",
  "Pubdate": "2023-01-20",
  "AffectedRange": "\u003e=2.0.0,\u003c2.0.99||\u003e=2.1.0,\u003c2.1.99||\u003e=2.2.0,\u003c2.2.99||\u003e=2.3.0,\u003c2.3.99||\u003e=2.4.0,\u003c2.4.99||\u003e=2.5.0,\u003c2.5.90||\u003e=2.6.0,\u003c2.6.6||\u003e=3.0.0,\u003c3.0.6",
  "FixedVersions": [
    "2.0.99",
    "3.0.6",
    "2.1.99",
    "2.2.99",
    "2.3.99",
    "2.4.99",
    "2.5.90",
    "2.6.6"
  ],
  "AffectedVersions": "All versions starting from 2.0.0 before 2.0.99, all versions starting from 2.1.0 before 2.1.99, all versions starting from 2.2.0 before 2.2.99, all versions starting from 2.3.0 before 2.3.99, all versions starting from 2.4.0 before 2.4.99, all versions starting from 2.5.0 before 2.5.90, all versions starting from 2.6.0 before 2.6.6, all versions starting from 3.0.0 before 3.0.6",
  "NotImpacted": "All versions before 2.0.0, all versions starting from 2.0.99 before 2.1.0, all versions starting from 2.1.99 before 2.2.0, all versions starting from 2.2.99 before 2.3.0, all versions starting from 2.3.99 before 2.4.0, all versions starting from 2.4.99 before 2.5.0, all versions starting from 2.5.90 before 2.6.0, all versions starting from 2.6.6 before 3.0.0, all versions starting from 3.0.6",
  "Solution": "Upgrade to versions 2.0.99, 3.0.6, 2.1.99, 2.2.99, 2.3.99, 2.4.99, 2.5.90, 2.6.6 or above.",
  "Urls": [
    "https://github.com/cakephp/cakephp/commit/c186487151356a8d7c6e2cae05f87b9df0e59fbb",
    "https://bakery.cakephp.org/2015/05/28/cakephp_2_6_6_and_3_0_6_released.html",
    "https://github.com/FriendsOfPHP/security-advisories/blob/master/cakephp/cakephp/2015-05-28.yaml",
    "https://github.com/advisories/GHSA-q79m-c546-2g63"
  ],
  "CvssV2": "",
  "CvssV3": "",
  "UUID": "5fb2deb6-675c-47fe-879d-18fca1e2d4d8"
}