{
  "Severity": "HIGH",
  "UpdatedAt": "2024-12-03T18:44:01Z",
  "Package": {
    "Ecosystem": "PIP",
    "Name": "matrix-synapse"
  },
  "Advisory": {
    "DatabaseId": 270403,
    "Id": "GSA_kwCzR0hTQS12cDZ2LXdoZm0tcnYzZ84ABCBD",
    "GhsaId": "GHSA-vp6v-whfm-rv3g",
    "References": [
      {
        "Url": "https://github.com/element-hq/synapse/security/advisories/GHSA-vp6v-whfm-rv3g"
      },
      {
        "Url": "https://nvd.nist.gov/vuln/detail/CVE-2024-53863"
      },
      {
        "Url": "https://github.com/advisories/GHSA-vp6v-whfm-rv3g"
      }
    ],
    "Identifiers": [
      {
        "Type": "GHSA",
        "Value": "GHSA-vp6v-whfm-rv3g"
      },
      {
        "Type": "CVE",
        "Value": "CVE-2024-53863"
      }
    ],
    "Description": "### Impact\n\nIn Synapse versions before 1.120.1, enabling the `dynamic_thumbnails` option or processing a specially crafted request could trigger the decoding and thumbnail generation of uncommon image formats, potentially invoking external tools like Ghostscript for processing.\n\nThis significantly expands the attack surface in a historically vulnerable area, presenting a risk that far outweighs the benefit, particularly since these formats are rarely used on the open web or within the Matrix ecosystem.\n\nFor a list of image formats, as well as decoding libraries and helper programs used, see [the Pillow documentation](https://pillow.readthedocs.io/en/stable/handbook/image-file-formats.html).\n\n### Patches\n\nSynapse 1.120.1 addresses the issue by restricting thumbnail generation to images in the following widely used formats: PNG, JPEG, GIF, and WebP.\n\n### Workarounds\n\n- Ensure any image codecs and helper programs, such as Ghostscript, are patched against security vulnerabilities.\n- Uninstall unused image decoder libraries and helper programs, such as Ghostscript, from the system environment that Synapse is running in.\n    - Depending on the installation method, there may be some decoder libraries bundled with Pillow and these cannot be easily uninstalled.\n    - The official Docker container image does not include Ghostscript.\n\n### References\n\n- [The Pillow documentation](https://pillow.readthedocs.io/en/stable/handbook/image-file-formats.html) includes a list of supported image formats and which libraries or helper programs are used to decode them.\n\n### For more information\n\nIf you have any questions or comments about this advisory, please email us at [security at element.io](mailto:security@element.io).\n",
    "Origin": "UNSPECIFIED",
    "PublishedAt": "2024-12-03T18:44:00Z",
    "Severity": "HIGH",
    "Summary": "Synapse can be forced to thumbnail unexpected file formats, invoking external, potentially untrustworthy decoders",
    "UpdatedAt": "2024-12-03T18:44:01Z",
    "WithdrawnAt": "",
    "CVSS": {
      "Score": 0,
      "VectorString": ""
    }
  },
  "Versions": [
    {
      "FirstPatchedVersion": {
        "Identifier": "1.120.1"
      },
      "VulnerableVersionRange": "\u003c 1.120.1"
    }
  ]
}