{
  "Title": "ELSA-2015-3098: Unbreakable Enterprise kernel security and bugfix  update (IMPORTANT)",
  "Description": "kernel-uek\n[3.8.13-118]\n- Update ql2400/ql2500 firmware version to 8.02.00 (Dan Duval)  [Orabug: 22159505] \n- update qla2400/ql2500 firmware version to 8.02.00 (Dan Duval)  [Orabug: 22159505]\n\n[3.8.13-117]\n- virtio-net: drop NETIF_F_FRAGLIST (Jason Wang)  [Orabug: 22145600]  {CVE-2015-5156}\n- team: check return value of team_get_port_by_index_rcu() for NULL (Jiri Pirko)  [Orabug: 21944235] \n- team: check return value of team_get_port_by_index_rcu() for NULL (Jiri Pirko)  [Orabug: 21944235]\n\n[3.8.13-116]\n- team: check return value of team_get_port_by_index_rcu() for NULL (Jiri Pirko)  [Orabug: 21944235]\n\n[3.8.13-115]\n- Disable VLAN 0 tagging for none VLAN traffic (Joe Jin)  [Orabug: 20832922] \n- x86/efi: Make efi virtual runtime map passing more robust (Borislav Petkov)  [Orabug: 22020990] \n- IB/rds_rdma: unloading of ofed stack causes page fault panic (Rama Nichanamatlu)  [Orabug: 22039748] \n- xen-blkfront: check for null drvdata in blkback_changed (XenbusStateClosing) (Cathy Avery)  [Orabug: 21924428]\n\n[3.8.13-114]\n- rds: revert commit 4348013 (Rama Nichanamatlu)  [Orabug: 22039425] \n- qlcnic: Fix mailbox completion handling in spurious interrupt (Rajesh Borundia)  \n- xen-netfront: set max_queue default to 8 (Joe Jin)  [Orabug: 21981690] \n- xen-netfront: update num_queues to real created (Joe Jin)  [Orabug: 21981690] \n- lpfc: Update version to 11.0.0.1 for patch set (James Smart)  [Orabug: 21860804] \n- lpfc: Fix default RA_TOV and ED_TOV in the FC/FCoE driver  for all topologies (James Smart)  [Orabug: 21860804] \n- lpfc: The linux driver does not reinitiate discovery after a failed FLOGI (James Smart)  [Orabug: 21860804] \n- lpfc: Fix for discovery failure in PT2PT when FLOGIs ELS  ACC response gets aborted (James Smart)  [Orabug: 21860804] \n- lpfc: Add support for Lancer G6 and 32G FC links (James Smart)  [Orabug: 21860804] \n- fix: lpfc_send_rscn_event sends bigger buffer size (James Smart)  [Orabug: 21860804] \n- lpfc: Fix possible use-after-free and double free (James Smart)  [Orabug: 21860804] \n- lpfc: remove set but not used variables (James Smart)  [Orabug: 21860804] \n- lpfc: Make the function lpfc_sli4_mbox_completions_pending static (James Smart)  [Orabug: 21860804] \n- Fix kmalloc overflow in LPFC driver at large core count (James Smart)  [Orabug: 21860804] \n- lpfc: Destroy lpfc_hba_index IDR on module exit (James Smart)  [Orabug: 21860804] \n- lpfc: in sli3 use configured sg_seg_cnt for sg_tablesize (James Smart)  [Orabug: 21860804] \n- lpfc: Remove unnessary cast (James Smart)  [Orabug: 21860804] \n- lpfc: fix model description (James Smart)  [Orabug: 21860804] \n- lpfc: Fix to drop PLOGIs from fabric node till LOGO proce ssing completes (James Smart)  [Orabug: 21860804] \n- lpfc: Fix scsi task management error message. (James Smart)  [Orabug: 21860804] \n- lpfc: Fix cq_id masking problem. (James Smart)  [Orabug: 21860804] \n- lpfc: Fix scsi prep dma buf error. (James Smart)  [Orabug: 21860804] \n- lpfc: Add support for using block multi-queue (James Smart)  [Orabug: 21860804] \n- lpfc: Devices are not discovered during takeaway/giveback  testing. (James Smart)  [Orabug: 21860804] \n- lpfc: Fix vport deletion failure. (James Smart)  [Orabug: 21860804] \n- lpfc: Check for active portpeerbeacon. (James Smart)  [Orabug: 21860804] \n- RDS: fix race condition when sending a message on unbound socket. (Quentin Casasnovas)  [Orabug: 21882586]  {CVE-2015-6937}\n- RDS: make send_batch_count tunable effective (Santosh Shilimkar)  [Orabug: 21882586] \n- RDS: make use of kfree_rcu() and avoid the call_rcu() chain (Santosh Shilimkar)  [Orabug: 21882586] \n- RDS: verify the underlying transport exists before creating a connection (Sasha Levin)  [Orabug: 21882586] \n- RDS: Disable broken APM feature code (Santosh Shilimkar)  [Orabug: 22045256] \n- RDS: return EMSGSIZE for oversize requests before processing/queueing (Mukesh Kacker)  [Orabug: 21882586] \n- RDS: Make active bonding parameters names consistent (Santosh Shilimkar)  [Orabug: 21882586] \n- IB/mlx4: Use vmalloc for WR buffers when needed (Wengang Wang)  [Orabug: 21835374] \n- mm: move kvfree to mm/util (Wengang Wang)  [Orabug: 21835374] \n- x86/xen: Do not clip xen_e820_map to xen_e820_map_entries when sanitizing map (Malcolm Crossley)  \n- netdev: fix NETIF_F_GSO_UDP_TUNNEL_BIT enum shift in i40e driver import (Todd Vierling)  [Orabug: 21958024]\n\n[3.8.13-113]\n- mlx4_core: Release counters while releasing slave resources (Wengang Wang)  [Orabug: 21116780] \n- IB/ipoib: Disable TSO in connected mode (Yuval Shaia)  [Orabug: 21684386] \n- Revert 'IB/ipoib: Disable TSO in connected mode' (Yuval Shaia)  [Orabug: 21968983] \n- Revert 'IB/ipoib: Disable TSO in connected mode' (Yuval Shaia)  [Orabug: 21968983]\n\n[3.8.13-112]\n- i40e/i40evf: Bump i40e to 1.3.21 and i40evf to 1.3.13 (Catherine Sullivan)  [Orabug: 21539654] \n- i40e/i40evf: add get AQ result command to nvmupdate utility (Shannon Nelson)  [Orabug: 21539654] \n- i40e/i40evf: add exec_aq command to nvmupdate utility (Shannon Nelson)  [Orabug: 21539654] \n- i40e/i40evf: add wait states to NVM state machine (Shannon Nelson)  [Orabug: 21539654] \n- i40e/i40evf: add GetStatus command for nvmupdate (Shannon Nelson)  [Orabug: 21539654] \n- i40e/i40evf: add handling of writeback descriptor (Shannon Nelson)  [Orabug: 21539654] \n- i40e/i40evf: save aq writeback for future inspection (Shannon Nelson)  [Orabug: 21539654] \n- i40e: rename variable to prevent clash of understanding (Shannon Nelson)  [Orabug: 21539654] \n- i40e: Set defport behavior for the Main VSI when in promiscuous mode (Anjali Singhai Jain)  [Orabug: 21539654] \n- i40e/i40evf: Bump i40e to 1.3.9 and i40evf to 1.3.5 (Catherine Sullivan)  [Orabug: 21539654] \n- i40e/i40evf: Cache the CEE TLV status returned from firmware (Neerav Parikh)  [Orabug: 21539654] \n- i40e/i40evf: add VIRTCHNL_VF_OFFLOAD flag (Anjali Singhai Jain)  [Orabug: 21539654] \n- i40e: Remove redundant and unneeded messages (Greg Rose)  [Orabug: 21539654] \n- i40evf: Remove PF specific register definitions from the VF (Anjali Singhai Jain)  [Orabug: 21539654] \n- i40evf: Use the correct defines to match the VF registers (Anjali Singhai Jain)  [Orabug: 21539654] \n- i40e: Fix comment for ethtool diagnostic link test (Greg Rose)  [Orabug: 21539654] \n- i40e/i40evf: Add capability to gather VEB per TC stats (Neerav Parikh)  [Orabug: 21539654] \n- i40e: Fix ethtool offline diagnostic with netqueues (Greg Rose)  [Orabug: 21539654] \n- i40e: Fix legacy interrupt mode in the driver (Anjali Singhai Jain)  [Orabug: 21539654] \n- i40e: Move function calls to i40e_shutdown instead of i40e_suspend (Catherine Sullivan)  [Orabug: 21539654] \n- i40e: add RX to port CRC errors label (Shannon Nelson)  [Orabug: 21539654] \n- i40e: dont degrade __le16 (Mitch Williams)  [Orabug: 21539654] \n- i40e: Add AQ commands for NVM Update for X722 (Shannon Nelson)  [Orabug: 21539654] \n- i40e/i40evf: Add ATR HW eviction support for X722 (Anjali Singhai Jain)  [Orabug: 21539654] \n- i40e: Add IWARP support for X722 (Anjali Singhai Jain)  [Orabug: 21539654] \n- i40e/i40evf: Add TX/RX outer UDP checksum support for X722 (Anjali Singhai Jain)  [Orabug: 21539654] \n- i40e/i40evf: Add support for writeback on ITR feature for X722 (Anjali Singhai Jain)  [Orabug: 21539654] \n- i40e/i40evf: Update register.h file for X722 (Anjali Singhai Jain)  [Orabug: 21539654] \n- i40e/i40evf: Update FW API with X722 support (Anjali Singhai Jain)  [Orabug: 21539654] \n- i40e/i40evf: Add flags for X722 capabilities (Anjali Singhai Jain)  [Orabug: 21539654] \n- i40e/i40evf: Add device ids for X722 (Anjali Singhai Jain)  [Orabug: 21539654] \n- i40e: use BIT and BIT_ULL macros (Jesse Brandeburg)  [Orabug: 21539654] \n- i40e: clean up error status messages (Shannon Nelson)  [Orabug: 21539654] \n- i40e: clean up error status messages (Shannon Nelson)  [Orabug: 21539654] \n- i40e: provide correct API version to older VF drivers (Mitch Williams)  [Orabug: 21539654] \n- i40evf: support virtual channel API version 1.1 (Mitch Williams)  [Orabug: 21539654] \n- i40evf: handle big resets (Mitch Williams)  [Orabug: 21539654] \n- i40e: support virtual channel API 1.1 (Mitch Williams)  [Orabug: 21539654] \n- i40e/i40evf: add macros for virtual channel API version and device capability (Mitch Williams)  [Orabug: 21539654] \n- i40e: add VF capabilities to virtual channel interface (Mitch Williams)  [Orabug: 21539654] \n- i40e: clean up unneeded gotos (Shannon Nelson)  [Orabug: 21539654] \n- i40e/i40evf: Fix and refactor dynamic ITR code (Carolyn Wyborny)  [Orabug: 21539654] \n- i40e: only report generic filters in get_ts_info (Jacob Keller)  [Orabug: 21539654] \n- i40e/i40evf: Bump version to 1.3.6 for i40e and 1.3.2 for i40evf (Catherine Sullivan)  [Orabug: 21539654] \n- i40e: Refine an error message to avoid confusion (Anjali Singhai Jain)  [Orabug: 21539654] \n- i40e/i40evf: Add support for pre-allocated pages for PD (Faisal Latif)  [Orabug: 21539654] \n- i40evf: add MAC address filter in open, not init (Mitch Williams)  [Orabug: 21539654] \n- i40evf: dont delete all the filters (Mitch Williams)  [Orabug: 21539654] \n- i40e: un-disable VF after reset (Mitch Williams)  [Orabug: 21539654] \n- i40e: do a proper reset when disabling a VF (Mitch Williams)  [Orabug: 21539654] \n- i40e: correctly program filters for VFs (Mitch Williams)  [Orabug: 21539654] \n- i40e/i40evf: Update the admin queue command header (Greg Rose)  [Orabug: 21539654] \n- i40e: ignore duplicate port VLAN requests (Mitch Williams)  [Orabug: 21539654] \n- i40evf: Allow for an abundance of vectors (Mitch Williams)  [Orabug: 21539654] \n- i40e/i40evf: Update Flex-10 related device/function capabilities (Pawel Orlowski)  [Orabug: 21539654] \n- i40e/i40evf: Add stats to track FD ATR and SB dynamic enable state (Anjali Singhai Jain)  [Orabug: 21539654] \n- i40evf: dont configure unused RSS queues (Mitch Williams)  [Orabug: 21539654] \n- i40evf: fix panic during MTU change (Mitch Williams)  [Orabug: 21539654] \n- i40e: Bump version to 1.3.4 (Catherine Sullivan)  [Orabug: 21539654] \n- i40e/i40evf: remove time_stamp member (Jesse Brandeburg)  [Orabug: 21539654] \n- i40e/i40evf: force inline transmit functions (Jesse Brandeburg)  [Orabug: 21539654] \n- i40e: Move the FD ATR/SB messages to a higher debug level (Anjali Singhai Jain)  [Orabug: 21539654] \n- i40e: fix unrecognized FCOE EOF case (Vasu Dev)  [Orabug: 21539654] \n- i40e: Remove unnecessary pf members (Anjali Singhai Jain)  [Orabug: 21539654] \n- i40e/i40evf: Add stats to count Tunnel ATR hits (Anjali Singhai Jain)  [Orabug: 21539654] \n- i40e/i40evf: Add ATR support for tunneled TCP/IPv4/IPv6 packets. (Anjali Singhai Jain)  [Orabug: 21539654] \n- i40e: Disable offline diagnostics if VFs are enabled (Greg Rose)  [Orabug: 21539654] \n- i40e: Collect PFC XOFF RX stats even in single TC case (Neerav Parikh)  [Orabug: 21539654] \n- i40e/i40evf: Fix mixed size frags and linearization (Anjali Singhai Jain)  [Orabug: 21539654]\n\n[3.8.13-111]\n- qla2xxx: Update driver version to 8.07.00.26.39.0-k. (Sawan Chandak)  [Orabug: 21946579] \n- qla2xxx: Add pci device id 0x2261. (Sawan Chandak)  [Orabug: 21946579] \n- qla2xxx: Fix missing device login retries. (Arun Easi)  [Orabug: 21946579] \n- qla2xxx: do not clear slot in outstanding cmd array (Himanshu Madhani)  [Orabug: 21946579] \n- qla2xxx: Remove decrement of sp reference count in abort handler. (Chad Dupuis)  [Orabug: 21946579] \n- qla2xxx: Add support to show MPI and PEP FW version for ISP27xx. (Sawan Chandak)  [Orabug: 21946579] \n- qla2xxx: Do not reset ISP for error entry with an out of range handle. (Chad Dupuis)  [Orabug: 21946579] \n- qla2xxx: Do not reset adapter if SRB handle is in range. (Chad Dupuis)  [Orabug: 21946579] \n- qla2xxx: Do not crash system for sp ref count zero (Hiral Patel)  [Orabug: 21946579] \n- qla2xxx: Pause risc before manipulating risc semaphore. (Joe Carnuccio)  [Orabug: 21946579] \n- qla2xxx: Use ssdid to gate semaphore manipulation. (Joe Carnuccio)  [Orabug: 21946579] \n- qla2xxx: Handle AEN8014 incoming port logout. (Joe Carnuccio)  [Orabug: 21946579] \n- qla2xxx: Add serdes register read/write support for ISP25xx. (Joe Carnuccio)  [Orabug: 21946579] \n- qla2xxx: Remove dead code (Bart Van Assche)  [Orabug: 21946579] \n- qla2xxx: Remove a superfluous test (Bart Van Assche)  [Orabug: 21946579] \n- qla2xxx: Avoid that sparse complains about duplicate [noderef] attributes (Bart Van Assche)  [Orabug: 21946579] \n- qla2xxx: Remove __constant_ prefix (Bart Van Assche)  [Orabug: 21946579] \n- qla2xxx: Replace two macros with an inline function (Bart Van Assche)  [Orabug: 21946579] \n- qla2xxx: Remove set-but-not-used variables (Bart Van Assche)  [Orabug: 21946579] \n- qla2xxx: Declare local functions static (Bart Van Assche)  [Orabug: 21946579] \n- bnx2i: rebase 2.11.2.0 (Brian Maly)  [Orabug: 21955132] \n- bnx2fc: update to 2.9.6 (Brian Maly)  [Orabug: 21955132] \n- bnx2x: update to 1.713.01 (Brian Maly)  [Orabug: 21955132] \n- bnx2: update to 2.2.5p (Brian Maly)  [Orabug: 21955132]\n\n[3.8.13-110]\n- xen-netfront: respect user provided max_queues (Wei Liu)  [Orabug: 21976319] \n- net/xen-netfront: only napi_synchronize() if running (Chas Williams)  [Orabug: 21976319] \n- net/xen-netfront: only clean up queues if present (Chas Williams)  [Orabug: 21976319] \n- xen-netfront: Remove the meaningless code (Li, Liang Z)  [Orabug: 21976319] \n- net/xen-netfront: Correct printf format in xennet_get_responses (Julien Grall)  [Orabug: 21976319] \n- xen-netfront: properly destroy queues when removing device (David Vrabel)  [Orabug: 21976319] \n- xen-netfront: Use setup_timer (Vaishali Thakkar)  [Orabug: 21976319] \n- xen-netfront: transmit fully GSO-sized packets (Jonathan Davies)  [Orabug: 21976319] \n- xen-netfront: Use static attribute groups for sysfs entries (Takashi Iwai)  [Orabug: 21976319] \n- xen-netfront: use different locks for Rx and Tx stats (David Vrabel)  [Orabug: 21976319] \n- xen-netfront: refactor making Tx requests (David Vrabel)  [Orabug: 21976319] \n- xen-netfront: refactor skb slot counting (David Vrabel)  [Orabug: 21976319] \n- drivers: net: xen-netfront: remove residual dead code (Vincenzo Maffione)  [Orabug: 21976319] \n- xen-netfront: use napi_complete() correctly to prevent Rx stalling (David Vrabel)  [Orabug: 21976319] \n- xen-netfront: always keep the Rx ring full of requests (David Vrabel)  [Orabug: 21976319] \n- xen-netback: respect user provided max_queues (Wei Liu)  [Orabug: 21976319] \n- xen-netback: require fewer guest Rx slots when not using GSO (David Vrabel)  [Orabug: 21976319] \n- xen/netback: Wake dealloc thread after completing zerocopy work (Ross Lagerwall)  [Orabug: 21976319] \n- xen-netback: Allocate fraglist early to avoid complex rollback (Ross Lagerwall)  [Orabug: 21976319] \n- net/xen-netback: off by one in BUG_ON() condition (Dan Carpenter)  [Orabug: 21976319] \n- xen-netback: remove duplicated function definition (Li, Liang Z)  [Orabug: 21976319] \n- xen-netback: fix a BUG() during initialization (Palik, Imre)  [Orabug: 21976319] \n- net/xen-netback: Dont mix hexa and decimal with 0x in the printf format (Julien Grall)  [Orabug: 21976319] \n- net/xen-netback: Remove unused code in xenvif_rx_action (Julien Grall)  [Orabug: 21976319] \n- xen: netback: read hotplug script once at start of day. (Ian Campbell)  [Orabug: 21976319] \n- xen: netback: fix printf format string warning (Ian Campbell)  [Orabug: 21976319] \n- xen/netback: Properly initialize credit_bytes (Ross Lagerwall)  [Orabug: 21976319] \n- net:xen-netback - Change 1 to true for bool type variable. (Shailendra Verma)  [Orabug: 21976319] \n- xen-netback: notify immediately after pushing Tx response. (David Vrabel)  [Orabug: 21976319] \n- xen-netback: making the bandwidth limiter runtime settable (Palik, Imre)  [Orabug: 21976319] \n- xen-netback: refactor xenvif_handle_frag_list() (David Vrabel)  [Orabug: 21976319] \n- xen-netback: return correct ethtool stats (David Vrabel)  [Orabug: 21976319] \n- xen-netback: release pending index before pushing Tx responses (David Vrabel)  [Orabug: 21976319] \n- xen-netback: fix sparse warning (Lad, Prabhakar)  [Orabug: 21976319] \n- xen-netback: always fully coalesce guest Rx packets (David Vrabel)  [Orabug: 21976319] \n- xen-netback: stop the guest rx thread after a fatal error (David Vrabel)  [Orabug: 21976319] \n- xen-netback: fixing the propagation of the transmit shaper timeout (Palik, Imre)  [Orabug: 21976319] \n- xen-netback: support frontends without feature-rx-notify again (David Vrabel)  [Orabug: 21976319] \n- netback: dont store invalid vif pointer (Jan Beulich)  [Orabug: 21976319] \n- xen-netback: do not report success if backend_create_xenvif() fails (Alexey Khoroshilov)  [Orabug: 21976319] \n- xen-netback: remove unconditional __pskb_pull_tail() in guest Tx path (Malcolm Crossley)  [Orabug: 21976319] \n- xen-netback: reintroduce guest Rx stall detection (David Vrabel)  [Orabug: 21976319] \n- xen-netback: fix unlimited guest Rx internal queue and carrier flapping (David Vrabel)  [Orabug: 21976319] \n- xen-netback: make feature-rx-notify mandatory (David Vrabel)  [Orabug: 21976319] \n- xen-netback: Remove __GFP_COLD (Zoltan Kiss)  [Orabug: 21976319] \n- xen-netback: Disable NAPI after disabling interrupts (Zoltan Kiss)  [Orabug: 21976319] \n- xen-netback: move netif_napi_add before binding interrupt (Wei Liu)  [Orabug: 21976319] \n- xen-netback: remove loop waiting function (Wei Liu)  [Orabug: 21976319] \n- xen-netback: dont stop dealloc kthread too early (Wei Liu)  [Orabug: 21976319] \n- xen-netback: move NAPI add/remove calls (Wei Liu)  [Orabug: 21976319] \n- xen-netback: fix debugfs entry creation (Wei Liu)  [Orabug: 21976319] \n- xen-netback: fix debugfs write length check (Wei Liu)  [Orabug: 21976319] \n- xen-netback: Dont deschedule NAPI when carrier off (Zoltan Kiss)  [Orabug: 21976319] \n- xen-netback: Fix vif-\u003edisable handling (Zoltan Kiss)  [Orabug: 21976319] \n- xen-netback: Turn off the carrier if the guest is not able to receive (Zoltan Kiss)  [Orabug: 21976319] \n- xen-netback: Using a new state bit instead of carrier (Zoltan Kiss)  [Orabug: 21976319] \n- xen-netback: Fix pointer incrementation to avoid incorrect logging (Zoltan Kiss)  [Orabug: 21976319] \n- xen-netback: Fix releasing header slot on error path (Zoltan Kiss)  [Orabug: 21976319] \n- xen-netback: Fix releasing frag_list skbs in error path (Zoltan Kiss)  [Orabug: 21976319] \n- xen-netback: Fix handling frag_list on grant op error path (Zoltan Kiss)  [Orabug: 21976319] \n- xen-netback: Adding debugfs 'io_ring_qX' files (Zoltan Kiss)  [Orabug: 21976319]\n\n[3.8.13-109]\n- mm: check if section present during memory block registering (Yinghai Lu)  [Orabug: 20382859] \n- be2net: post buffers before destroying RXQs in Lancer (Kalesh AP)  \n- be2net: enable IFACE filters only after creating RXQs (Kalesh AP)  \n- be2net: bump up the driver version to 10.6.0.3 (Sathya Perla)  \n- be2net: make SET_LOOPBACK_MODE cmd asynchrounous (Suresh Reddy)  \n- be2net: return error status from be_mcc_notify() (Suresh Reddy)  \n- ipoib/ib: fix merge of Orabug 19468224 fix from uek2 into uek3 resulting in ipoib not functioning. (Rama Nichanamatlu)  [Orabug: 21897912] \n- mlx4: indicate memory resource exhaustion (Ajaykumar Hotchandani)  [Orabug: 21549766] \n- be2iscsi: Bump the driver version (Jitendra Bhivare)  [Orabug: 21903294] \n- be2iscsi: Fix updating the next pointer during WRB posting (Jitendra Bhivare)  [Orabug: 21903294] \n- be2iscsi: add obsolete warning messages (Jitendra Bhivare)  [Orabug: 21903294] \n- be2iscsi: ownership change (Jitendra Bhivare)  [Orabug: 21903294] \n- be2iscsi: update MAINTAINERS list (Jitendra Bhivare)  [Orabug: 21903294] \n- be2iscsi : Logout of FW Boot Session (Jitendra Bhivare)  [Orabug: 21903294] \n- be2iscsi : Fix memory check before unmapping. (Jitendra Bhivare)  [Orabug: 21903294]\n\n[3.8.13-108]\n- prevent spurious PMU NMIs on Haswell systems (Dan Duval)  [Orabug: 21616327] \n- sched/x86: Fix up typo in topology detection (Dave Hansen)  [Orabug: 21662502] \n- mlx4_ib: Memory leak on Dom0 with SRIOV. (Venkat Venkatsubra)  [Orabug: 21675212] \n- mlx4_core: On CQ access violation print syndrome and vendor_error_syndrome (Venkat Venkatsubra)  [Orabug: 21675224] \n- IB/ipoib: Disable TSO in connected mode (Yuval Shaia)  [Orabug: 21684386] \n- xen/blkfront: remove redundant flush_op (Vitaly Kuznetsov)  [Orabug: 21833822] \n- xen/blkfront: improve protection against issuing unsupported REQ_FUA (Vitaly Kuznetsov)  [Orabug: 21833822]\n\n[3.8.13-107]\n- sctp: fix ASCONF list handling (Marcelo Ricardo Leitner)  [Orabug: 21842665]  {CVE-2015-3212}\n- KEYS: ensure we free the assoc array edit if edit is valid (Colin Ian King)  [Orabug: 21842653]  {CVE-2015-1333}\n\n[3.8.13-106]\n- NVMe: Setup max hardware sector count to 512KB (Santosh Shilimkar)  [Orabug: 21818575] \n- Btrfs: optimize the error handling of use_block_rsv() (Ashish Samant)  [Orabug: 21539248] \n- xen-blkfront: introduce blkfront_gather_backend_features() (Bob Liu)  [Orabug: 21825900] \n- iw/rds: fixed big endianness conversion issue for dp-\u003edp_ack_seq (Qing Huang)  [Orabug: 21825863] \n- bonding: change error message to debug message in bond_release (Wengang Wang)  [Orabug: 21825838]\n\n[3.8.13-105]\n- rds: make sure base connection is up on both sides (Ajaykumar Hotchandani)  [Orabug: 21439115] \n- IB/ipoib: Disable TSO in connected mode (Yuval Shaia)  [Orabug: 21439115] \n- ib/rds: fixed big endianness conversion issue for dp-\u003edp_ack_seq (Qing Huang)  [Orabug: 21439115] \n- ib/rds: fixed crashes caused by incoming requests with wrong destination (Qing Huang)  [Orabug: 21439115] \n- RDS: Handle RDMA_CM_EVENT_TIMEWAIT_EXIT (Venkat Venkatsubra)  [Orabug: 21439115] \n- RDS/IP: RDS takes 10 seconds to plumb the second IP back (Mukesh Kacker)  [Orabug: 21439115] \n- RDS/IB: Tune failover-on-reboot scheduling (Mukesh Kacker)  [Orabug: 21439115] \n- RDS: mark netdev UP for intfs added post module load (Mukesh Kacker)  [Orabug: 21439115] \n- rds: fix list corruption and tx hang when netfilter is used (shamir rabinovitch)  [Orabug: 21439115] \n- RDS: move more queing for loopback connections to separate queue (Mukesh Kacker)  [Orabug: 21439115] \n- IPoIB/pkey: delete_child should only delete create_child devices (Mukesh Kacker)  [Orabug: 21439115] \n- IB/ipoib: order:1 failure in ipoib_cm_alloc_rx_skb causes softlockup (Rama Nichanamatlu)  [Orabug: 21439115] \n- rds: fix NULL pointer dereference panic during rds module unload (Rama Nichanamatlu)  [Orabug: 21439115] \n- RDS:active bonding: disable failover across HCAs(failover groups) (Mukesh Kacker)  [Orabug: 21439115] \n- RDS/IB: active bonding - failover down interfaces on reboot. (Guangyu Sun)  [Orabug: 21439115] \n- RFE: remove pkey coupling to device name (Mukesh Kacker)  [Orabug: 21439115] \n- RDS/IB: Remove dangling rcu_read_unlock() and other cleanups (Mukesh Kacker)  [Orabug: 21439115] \n- rds: new extension header: rdma bytes (Shamir Rabinovitch)  [Orabug: 21439115] \n- RDS: Ensure non-zero SL uses correct path before lane 0 connection is dropped (Ajaykumar Hotchandani)  [Orabug: 21439115] \n- iser: handle RDMA_CM_EVENT_TIMEWAIT_EXIT in iser code (Shamir Rabinovitch)  [Orabug: 21439115] \n- RDS: active bonding - failover/failback only to matching pkey (Mukesh Kacker)  [Orabug: 21439115] \n- RDS: active bonding - ports may not failback if all ports go down (Mukesh Kacker)  [Orabug: 21439115] \n- RDS: Use rds_local_wq for loopback connections in rds_conn_connect_if_down() (Chien-Hua Yen)  [Orabug: 21439115] \n- RDS: add workqueue for local loopback connections (Chien-Hua Yen)  [Orabug: 21439115] \n- APM/cma: Kernel panic during IB port failover test (Chien-Hua Yen)  [Orabug: 21439115] \n- RDS: SA query optimization (Bang Nguyen)  [Orabug: 21439115] \n- RDS: Remove cond_resched() in RX tasklet (Bang Nguyen)  [Orabug: 21439115] \n- RDS: Replace queue_work() by cond_resched() in the tasklet to breakup RX stream (Bang Nguyen)  [Orabug: 21439115] \n- RDS: looping to reap cq recv queue in rds_conn_shutdown (Chien-Hua Yen)  [Orabug: 21439115] \n- rds: Fix regression in dynamic active bonding configuration (Bang Nguyen)  [Orabug: 21439115] \n- RDS: Idle QoS connections during remote peer reboot causing application brownout (Chien-Hua Yen)  [Orabug: 21439115] \n- rds: dynamic active bonding configuration (Bang Nguyen)  [Orabug: 21439115] \n- RDS: active bonding needs to set brcast and mask for its primary interface (Chien-Hua Yen)  [Orabug: 21439115] \n- (REAPPLY!) rds: limit the size allocated by rds_message_alloc() (Cong Wang)  [Orabug: 21439115] \n- xen/events: Set irq_info-\u003eevtchn before binding the channel to CPU in __startup_pirq() (Boris Ostrovsky)  [Orabug: 20891536] \n- xen/console: Update console event channel on resume (Boris Ostrovsky)  [Orabug: 20891536] \n- xen/xenbus: Update xenbus event channel on resume (Boris Ostrovsky)  [Orabug: 20891536] \n- xen/events: Clear cpu_evtchn_mask before resuming (Boris Ostrovsky)  [Orabug: 20891536] \n- x86/efi: Quirk out SGI UV (Borislav Petkov)  [Orabug: 21771830] \n- oracleasm: Classify device connectivity issues as global errors (Martin K. Petersen)  [Orabug: 21760144] \n- IB/ipoib: Potential false positive with peer support for ib-crc-as-csum (Yuval Shaia)  [Orabug: 21684866]\n\n[3.8.13-104]\n- idr: fix unexpected ID-removal when idr_remove(unallocated_id) (Lai Jiangshan)  [Orabug: 21684956] \n- idr: remove WARN_ON_ONCE() on negative IDs (Tejun Heo)  [Orabug: 21684956] \n- ipc,shm: fix shm_file deletion races (Greg Thelen)  [Orabug: 21684956] \n- rds_rdma: setup connection before rds_cmsg_send (Wengang Wang)  [Orabug: 21683962] \n- mm/hugetlb: Add locking to region_{add,change,truncate,count} when using shared files with hugepages (Mike Kravetz)  [Orabug: 21683388]\n\n[3.8.13-103]\n- xen-netback: unref frags when handling a from-guest skb with a frag list (David Vrabel)  [Orabug: 21571556]\n\n[3.8.13-102]\n- megaraid_sas : Firmware crash dump feature support (Sumit.Saxena@avagotech.com)  [Orabug: 21660728] \n- NVMe: Use pci_stop_and_remove_bus_device_locked() (Keith Busch)  [Orabug: 21576939] \n- xen/pciback: Dont print scary messages when unsupported by hypervisor. (Konrad Rzeszutek Wilk)  [Orabug: 21660162] \n- config: ol7: enable teaming driver build (Guangyu Sun)  [Orabug: 21517939] \n- config: enable CONFIG_CHELSIO_T4VF option (Guangyu Sun)  [Orabug: 21500967] \n- ext4: fix warning in ext4_da_update_reserve_space() (Jan Kara)  [Orabug: 21621299] \n- ext4: remove unused variable in ext4_free_blocks() (Lukas Czerner)  [Orabug: 21621299] \n- quota: provide interface for readding allocated space into reserved space (Jan Kara)  [Orabug: 21621299]",
  "Platform": [
    "Oracle Linux 6",
    "Oracle Linux 7"
  ],
  "References": [
    {
      "Source": "elsa",
      "URI": "https://linux.oracle.com/errata/ELSA-2015-3098.html",
      "ID": "ELSA-2015-3098"
    },
    {
      "Source": "CVE",
      "URI": "https://linux.oracle.com/cve/CVE-2014-7822.html",
      "ID": "CVE-2014-7822"
    },
    {
      "Source": "CVE",
      "URI": "https://linux.oracle.com/cve/CVE-2015-1805.html",
      "ID": "CVE-2015-1805"
    },
    {
      "Source": "CVE",
      "URI": "https://linux.oracle.com/cve/CVE-2015-6937.html",
      "ID": "CVE-2015-6937"
    }
  ],
  "Criteria": {
    "Operator": "OR",
    "Criterias": [
      {
        "Operator": "AND",
        "Criterias": [
          {
            "Operator": "AND",
            "Criterias": [
              {
                "Operator": "OR",
                "Criterias": [
                  {
                    "Operator": "AND",
                    "Criterias": null,
                    "Criterions": [
                      {
                        "Comment": "dtrace-modules-3.8.13-118.el6uek is earlier than 0:0.4.5-3.el6"
                      },
                      {
                        "Comment": "dtrace-modules-3.8.13-118.el6uek is signed with the Oracle Linux 6 key"
                      }
                    ]
                  },
                  {
                    "Operator": "AND",
                    "Criterias": null,
                    "Criterions": [
                      {
                        "Comment": "kernel-uek is earlier than 0:3.8.13-118.el6uek"
                      },
                      {
                        "Comment": "kernel-uek is signed with the Oracle Linux 6 key"
                      }
                    ]
                  },
                  {
                    "Operator": "AND",
                    "Criterias": null,
                    "Criterions": [
                      {
                        "Comment": "kernel-uek-debug is earlier than 0:3.8.13-118.el6uek"
                      },
                      {
                        "Comment": "kernel-uek-debug is signed with the Oracle Linux 6 key"
                      }
                    ]
                  },
                  {
                    "Operator": "AND",
                    "Criterias": null,
                    "Criterions": [
                      {
                        "Comment": "kernel-uek-debug-devel is earlier than 0:3.8.13-118.el6uek"
                      },
                      {
                        "Comment": "kernel-uek-debug-devel is signed with the Oracle Linux 6 key"
                      }
                    ]
                  },
                  {
                    "Operator": "AND",
                    "Criterias": null,
                    "Criterions": [
                      {
                        "Comment": "kernel-uek-devel is earlier than 0:3.8.13-118.el6uek"
                      },
                      {
                        "Comment": "kernel-uek-devel is signed with the Oracle Linux 6 key"
                      }
                    ]
                  },
                  {
                    "Operator": "AND",
                    "Criterias": null,
                    "Criterions": [
                      {
                        "Comment": "kernel-uek-doc is earlier than 0:3.8.13-118.el6uek"
                      },
                      {
                        "Comment": "kernel-uek-doc is signed with the Oracle Linux 6 key"
                      }
                    ]
                  },
                  {
                    "Operator": "AND",
                    "Criterias": null,
                    "Criterions": [
                      {
                        "Comment": "kernel-uek-firmware is earlier than 0:3.8.13-118.el6uek"
                      },
                      {
                        "Comment": "kernel-uek-firmware is signed with the Oracle Linux 6 key"
                      }
                    ]
                  }
                ],
                "Criterions": null
              }
            ],
            "Criterions": [
              {
                "Comment": "Oracle Linux arch is x86_64"
              }
            ]
          }
        ],
        "Criterions": [
          {
            "Comment": "Oracle Linux 6 is installed"
          }
        ]
      },
      {
        "Operator": "AND",
        "Criterias": [
          {
            "Operator": "AND",
            "Criterias": [
              {
                "Operator": "OR",
                "Criterias": [
                  {
                    "Operator": "AND",
                    "Criterias": null,
                    "Criterions": [
                      {
                        "Comment": "dtrace-modules-3.8.13-118.el7uek is earlier than 0:0.4.5-3.el7"
                      },
                      {
                        "Comment": "dtrace-modules-3.8.13-118.el7uek is signed with the Oracle Linux 7 key"
                      }
                    ]
                  },
                  {
                    "Operator": "AND",
                    "Criterias": null,
                    "Criterions": [
                      {
                        "Comment": "kernel-uek is earlier than 0:3.8.13-118.el7uek"
                      },
                      {
                        "Comment": "kernel-uek is signed with the Oracle Linux 7 key"
                      }
                    ]
                  },
                  {
                    "Operator": "AND",
                    "Criterias": null,
                    "Criterions": [
                      {
                        "Comment": "kernel-uek-debug is earlier than 0:3.8.13-118.el7uek"
                      },
                      {
                        "Comment": "kernel-uek-debug is signed with the Oracle Linux 7 key"
                      }
                    ]
                  },
                  {
                    "Operator": "AND",
                    "Criterias": null,
                    "Criterions": [
                      {
                        "Comment": "kernel-uek-debug-devel is earlier than 0:3.8.13-118.el7uek"
                      },
                      {
                        "Comment": "kernel-uek-debug-devel is signed with the Oracle Linux 7 key"
                      }
                    ]
                  },
                  {
                    "Operator": "AND",
                    "Criterias": null,
                    "Criterions": [
                      {
                        "Comment": "kernel-uek-devel is earlier than 0:3.8.13-118.el7uek"
                      },
                      {
                        "Comment": "kernel-uek-devel is signed with the Oracle Linux 7 key"
                      }
                    ]
                  },
                  {
                    "Operator": "AND",
                    "Criterias": null,
                    "Criterions": [
                      {
                        "Comment": "kernel-uek-doc is earlier than 0:3.8.13-118.el7uek"
                      },
                      {
                        "Comment": "kernel-uek-doc is signed with the Oracle Linux 7 key"
                      }
                    ]
                  },
                  {
                    "Operator": "AND",
                    "Criterias": null,
                    "Criterions": [
                      {
                        "Comment": "kernel-uek-firmware is earlier than 0:3.8.13-118.el7uek"
                      },
                      {
                        "Comment": "kernel-uek-firmware is signed with the Oracle Linux 7 key"
                      }
                    ]
                  }
                ],
                "Criterions": null
              }
            ],
            "Criterions": [
              {
                "Comment": "Oracle Linux arch is x86_64"
              }
            ]
          }
        ],
        "Criterions": [
          {
            "Comment": "Oracle Linux 7 is installed"
          }
        ]
      }
    ],
    "Criterions": null
  },
  "Severity": "IMPORTANT",
  "Cves": [
    {
      "Impact": "",
      "Href": "https://linux.oracle.com/cve/CVE-2014-7822.html",
      "ID": "CVE-2014-7822"
    },
    {
      "Impact": "",
      "Href": "https://linux.oracle.com/cve/CVE-2015-1805.html",
      "ID": "CVE-2015-1805"
    },
    {
      "Impact": "",
      "Href": "https://linux.oracle.com/cve/CVE-2015-6937.html",
      "ID": "CVE-2015-6937"
    }
  ],
  "Issued": {
    "Date": "2015-11-13"
  }
}