{
  "Identifier": "GHSA-wpfr-6297-9v57",
  "PackageSlug": "go/github.com/netlify/gotrue",
  "Title": "User object created with invalid provider data in GoTrue",
  "Description": "### Impact\n_What kind of vulnerability is it? Who is impacted?_\n\nUnder certain circumstances a valid user object would have been created with invalid provider metadata.\n\nThis vulnerability affects everyone running an instance of GoTrue as a service. We advise you to update especially if you are using the provider metadata from the user object to secure other resources.\n\n### Patches\n_Has the problem been patched? What versions should users upgrade to?_\n\nA patch is available with the release of version [1.0.1 on Github](https://github.com/netlify/gotrue/releases/tag/v1.0.1).\n\n### Workarounds\n_Is there a way for users to fix or remediate the vulnerability without upgrading?_\n\nIf you don't rely on the provider metadata in the user object, you might not be affected. We still strongly recommend upgrading.\n\n### References\n_Are there any links users can visit to find out more?_\n\nThis problem was initially found and reported by the team at Supabase: https://github.com/supabase/gotrue/security/advisories/GHSA-5hvv-9cqv-894r. We want to thank them for the cooperation around this report.\n\nIn contrast to their advisory, we decided to set the severity to \"Moderate\" since the provider metadata is not an inherent security feature of this GoTrue codebase or the Netlify ecosystem.\n\n### For more information\nIf you have any questions or comments about this advisory:\n* Email us at [security@netlify.com](mailto:security@netlify.com)\n",
  "Date": "2022-02-11",
  "Pubdate": "2022-02-09",
  "AffectedRange": "\u003c1.0.1",
  "FixedVersions": [
    "1.0.1"
  ],
  "AffectedVersions": "All versions before 1.0.1",
  "NotImpacted": "All versions starting from 1.0.1",
  "Solution": "Upgrade to version 1.0.1 or above.",
  "Urls": [
    "https://github.com/netlify/gotrue/security/advisories/GHSA-wpfr-6297-9v57",
    "https://github.com/netlify/gotrue/pull/313",
    "https://github.com/netlify/gotrue/commit/4d8a3b39fe485a5f83c70617d594be01130c5b83",
    "https://github.com/netlify/gotrue/releases/tag/v1.0.1",
    "https://github.com/advisories/GHSA-wpfr-6297-9v57"
  ],
  "CvssV2": "",
  "CvssV3": "",
  "UUID": "dcca04e3-9aed-4149-a8bb-83ba4505f78e"
}