{
  "Identifier": "GHSA-w476-p2h3-79g9",
  "PackageSlug": "pypi/uv",
  "Title": "uv has differential in tar extraction with PAX headers",
  "Description": "In versions 0.9.4 and earlier of uv, tar archives containing PAX headers with file size overrides were not handled properly. As a result, an attacker could contrive a source distribution (as a tar archive) that would extract differently when installed via uv versus other Python package installers.\n\nThe underlying parsing differential here originates with astral-tokio-tar, which disclosed this vulnerability as CVE-2025-62518.\n\nIn practice, the impact of this vulnerability is **low**: only source distributions can be formatted as tar archives, and source distributions execute arbitrary code at build/installation time by definition. Consequently, a parser differential in tar extraction is strictly less powerful than the capabilities already exposed to an attacker who has the ability to control source distributions.\n\nHowever, this particular source of malleability in source distributions is unintentional and not operating by design, and therefore we consider it a vulnerability despite its overlap in capabilities with intended behavior.",
  "Date": "2025-10-21",
  "Pubdate": "2025-10-21",
  "AffectedRange": "\u003c0.9.5",
  "FixedVersions": [
    "0.9.5"
  ],
  "AffectedVersions": "All versions before 0.9.5",
  "NotImpacted": "All versions starting from 0.9.5",
  "Solution": "Upgrade to version 0.9.5 or above.",
  "Urls": [
    "https://github.com/advisories/GHSA-w476-p2h3-79g9",
    "https://github.com/astral-sh/uv/security/advisories/GHSA-w476-p2h3-79g9",
    "https://github.com/astral-sh/uv/pull/16387",
    "https://github.com/astral-sh/uv/commit/ae450662d1546e9853f67a8c61a506d3a892d963",
    "https://github.com/advisories/GHSA-j5gw-2vrg-8fgx",
    "https://github.com/astral-sh/uv",
    "https://github.com/astral-sh/uv/releases/tag/0.9.5"
  ],
  "CvssV2": "",
  "CvssV3": "",
  "UUID": "5957601b-b98b-4512-b5f9-d09becb50fb3"
}