{
  "id": "GHSA-3rw9-wmc8-8948",
  "modified": "2025-09-08T14:59:38.092197Z",
  "published": "2025-08-28T19:36:04Z",
  "aliases": [
    "GO-2025-3921"
  ],
  "summary": "Coder accepts an APIKey beyond the linked OIDC expiry if there is no refresh token",
  "details": "### Summary\nIf users log in to Coder via OIDC, and the OpenID Identity Provider does not return a refresh token, then Coder may allow their web session to continue beyond the expiration of the token returned by the OpenID Identity Provider.\n\n### Details\nWhen a user logs in via OIDC, Coder stores the OIDC token and refresh token (if any) in its datastore and sets an APIKey in the user's cookies. If there is a refresh token, then when the OIDC token is expired and a request is made with the APIKey, we attempt to refresh the OIDC token. If refresh fails, the Coder API request is also failed and the user needs to log in again.\n\nHowever, if there is no refresh token provided, then affected versions of Coder fail to enforce the expiry of the OIDC token, and allow users to make API requests even if it is expired so long as their APIKey stored in cookies has not expired.\n\nCoder APIKeys have an expiry and lifetime of 24 hours, but Coder is configured to extend the lifetime of the APIKey by up to 24 hours from the time it is used successfully. So, an APIKey that is used at least once every 24 hours will not expire. (This behavior can be disabled by configuration). \n\n### Impact\nThis could allow a user to access the Coder service beyond the lifetime of the token issued by the OpenID provider, potentially indefinitely, even if they are no loner authorized via OIDC.",
  "affected": [
    {
      "package": {
        "ecosystem": "Go",
        "name": "github.com/coder/coder/v2",
        "purl": "pkg:golang/github.com/coder/coder/v2"
      },
      "ranges": [
        {
          "type": "SEMVER",
          "events": [
            {
              "introduced": "0"
            },
            {
              "fixed": "2.23.0"
            }
          ]
        }
      ],
      "database_specific": {
        "source": "https://github.com/github/advisory-database/blob/main/advisories/github-reviewed/2025/08/GHSA-3rw9-wmc8-8948/GHSA-3rw9-wmc8-8948.json"
      }
    }
  ],
  "references": [
    {
      "type": "WEB",
      "url": "https://github.com/coder/coder/security/advisories/GHSA-3rw9-wmc8-8948"
    },
    {
      "type": "WEB",
      "url": "https://github.com/coder/coder/commit/1a4160803589034ce1518e24a78f232c8d08f996"
    },
    {
      "type": "PACKAGE",
      "url": "https://github.com/coder/coder"
    }
  ]
}