{
  "Severity": "MODERATE",
  "UpdatedAt": "2023-08-14T21:14:13Z",
  "Package": {
    "Ecosystem": "NPM",
    "Name": "svelecte"
  },
  "Advisory": {
    "DatabaseId": 218258,
    "Id": "GSA_kwCzR0hTQS03aDQ1LWdyYzUtODl3cc4AA1SS",
    "GhsaId": "GHSA-7h45-grc5-89wq",
    "References": [
      {
        "Url": "https://github.com/mskocik/svelecte/security/advisories/GHSA-7h45-grc5-89wq"
      },
      {
        "Url": "https://nvd.nist.gov/vuln/detail/CVE-2023-38687"
      },
      {
        "Url": "https://github.com/advisories/GHSA-7h45-grc5-89wq"
      }
    ],
    "Identifiers": [
      {
        "Type": "GHSA",
        "Value": "GHSA-7h45-grc5-89wq"
      },
      {
        "Type": "CVE",
        "Value": "CVE-2023-38687"
      }
    ],
    "Description": "### Summary\n\nSvelecte item names are rendered as raw HTML with no escaping. This allows the injection of arbitrary HTML into the Svelecte dropdown. This can be exploited to execute arbitrary JavaScript whenever a Svelecte dropdown is opened.\n\n### Details\n\nItem names given to Svelecte appear to be directly rendered as HTML by the default item renderer. This means that any HTML tags in the name are rendered as HTML elements not as text.\n\nNote that the custom item renderer shown in https://mskocik.github.io/svelecte/#item-rendering is also vulnerable to the same exploit.\n\nTo prevent this all special HTML characters in item names should be escaped (for example using `document.createTextNode()`).\n\n### PoC\n```svelte\n\u003cscript\u003e\n    import Svelecte from 'svelecte';\n    \n    const list = [\n        { id: 1, name: `Item 1` },\n        { id: 2, name: `Item 2\u003cimg style=\"display:none;\" src=1 onerror=\"alert('JavaScript executed!');\"/\u003e` },\n        { id: 3, name: 'Item 3'}\n    ];\n\u003c/script\u003e\n    \n\u003cSvelecte options={list}\u003e\u003c/Svelecte\u003e\n```\n\nThis code snippet demonstrates how the vulnerability can be used to execute arbitrary JavaScript without the user's knowledge when the Svelecte dropdown is opened (note that visually item 2 appears identical to other items).\nIn this case the script is hardcoded, but in practice the real danger is that some applications may use Svelecte with items that are created by users or come from low-trust sources where someone else could add a malicious script to the item name.\n\n### Impact\n\nAny site that uses Svelecte with dynamically created items either from an external source or from user-created content could be vulnerable to an XSS attack (execution of untrusted JavaScript), clickjacking or any other attack that can be performed with arbitrary HTML injection.\nThe actual impact of this vulnerability for a specific application depends on how trustworthy the sources that provide Svelecte items are and the steps that the application has taken to mitigate XSS attacks. XSS attacks using this vulnerability are mostly mitigated by a Content Security Policy that blocks inline JavaScript.\n",
    "Origin": "UNSPECIFIED",
    "PublishedAt": "2023-08-14T21:14:08Z",
    "Severity": "MODERATE",
    "Summary": "Svelecte item names vulnerable to execution of arbitrary JavaScript",
    "UpdatedAt": "2023-11-08T05:06:08Z",
    "WithdrawnAt": "",
    "CVSS": {
      "Score": 5.4,
      "VectorString": "CVSS:3.1/AV:N/AC:L/PR:L/UI:R/S:C/C:L/I:L/A:N"
    }
  },
  "Versions": [
    {
      "FirstPatchedVersion": {
        "Identifier": "3.16.3"
      },
      "VulnerableVersionRange": "\u003c 3.16.3"
    }
  ]
}