{
  "Identifier": "GHSA-962m-m8jw-8wrr",
  "PackageSlug": "pypi/zope",
  "Title": "Duplicate Advisory: Path Traversal in Zope",
  "Description": "## Duplicate Advisory\nThis advisory has been withdrawn because it is a duplicate of GHSA-5pr9-v234-jw36. This link is maintained to preserve external references.\n\n## Original Description\nZope is an open-source web application server. In Zope versions prior to 4.6 and 5.2, users can access untrusted modules indirectly through Python modules that are available for direct use. By default, only users with the Manager role can add or edit Zope Page Templates through the web, but sites that allow untrusted users to add/edit Zope Page Templates through the web are at risk from this vulnerability. The problem has been fixed in Zope 5.2 and 4.6. As a workaround, a site administrator can restrict adding/editing Zope Page Templates through the web using the standard Zope user/role permission mechanisms. Untrusted users should not be assigned the Zope Manager role and adding/editing Zope Page Templates through the web should be restricted to trusted users only.",
  "Date": "2024-11-19",
  "Pubdate": "2021-06-15",
  "AffectedRange": "\u003c4.6||\u003e=5.0,\u003c5.2",
  "FixedVersions": [
    "4.6",
    "5.2"
  ],
  "AffectedVersions": "All versions before 4.6, all versions starting from 5.0 before 5.2",
  "NotImpacted": "All versions starting from 4.6 before 5.0, all versions starting from 5.2",
  "Solution": "Upgrade to versions 4.6, 5.2 or above.",
  "Urls": [
    "https://github.com/advisories/GHSA-962m-m8jw-8wrr",
    "https://github.com/zopefoundation/Zope/security/advisories/GHSA-5pr9-v234-jw36",
    "https://nvd.nist.gov/vuln/detail/CVE-2021-32633",
    "https://github.com/zopefoundation/Zope/commit/1f8456bf1f908ea46012537d52bd7e752a532c91",
    "https://cyllective.com/blog/post/plone-authenticated-rce-cve-2021-32633",
    "https://github.com/zopefoundation/Zope"
  ],
  "CvssV2": "",
  "CvssV3": "CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
  "UUID": "17576b53-5d69-432b-96b9-3de0a36e23a8"
}