{
  "Severity": "LOW",
  "UpdatedAt": "2025-09-05T21:18:49Z",
  "Package": {
    "Ecosystem": "GO",
    "Name": "github.com/runatlantis/atlantis"
  },
  "Advisory": {
    "DatabaseId": 310351,
    "Id": "GSA_kwCzR0hTQS14aDd2LTk2NXItMjNmN84ABLxP",
    "GhsaId": "GHSA-xh7v-965r-23f7",
    "References": [
      {
        "Url": "https://github.com/runatlantis/atlantis/security/advisories/GHSA-xh7v-965r-23f7"
      },
      {
        "Url": "https://nvd.nist.gov/vuln/detail/CVE-2025-58445"
      },
      {
        "Url": "https://github.com/advisories/GHSA-xh7v-965r-23f7"
      }
    ],
    "Identifiers": [
      {
        "Type": "GHSA",
        "Value": "GHSA-xh7v-965r-23f7"
      },
      {
        "Type": "CVE",
        "Value": "CVE-2025-58445"
      }
    ],
    "Description": "### Summary\nAtlantis publicly exposes detailed version information on its `/status` endpoint. This information disclosure could allow attackers to identify and target known vulnerabilities associated with the specific versions, potentially compromising the service's security posture.\n\n### Details\nThe `/status` endpoint in Atlantis returns not only a health check but also detailed version and build information. This disclosure violates the principle of minimizing exposed sensitive metadata and can be leveraged by adversaries to correlate the version information with public vulnerability databases, including CVE listings. Although Atlantis is a public repository maintained by an external team, reducing this exposure can lessen the overall risk of targeted attacks.\n\nFor example, the source code handling the `/status` endpoint exposes version details that allow one to infer software dependencies and system configurations. Best practices, including guidelines from the [OWASP Top 10](https://owasp.org/www-project-top-ten/) and recommendations discussed in NIST SP 800-53, advocate for restricting such potentially exploitable information.\n\n### PoC\n1. Issue a GET request to `http://\u003catlantis-host\u003e/status` using a tool like `curl` or a web browser.\n2. Note that the API response includes detailed version and build information.\n3. Verify that no authentication is required to access the endpoint, leading to public exposure.\n4. Cross-reference the disclosed version with public vulnerability databases (e.g., [NVD](https://nvd.nist.gov)) for likely vulnerabilities.\n\n### Impact\nThe vulnerability falls under the category of information disclosure. Attackers could use the version details to scan public vulnerability repositories and tailor attacks based on known flaws in that particular version. This could potentially escalate into a broader compromise if the underlying software has exploitable vulnerabilities. Therefore, the affected parties include any users or administrators who rely on Atlantis, as well as the maintainers who are responsible for keeping the service secure.\n\n### CVS Severity Assessment\nBased on the current circumstances, this issue is assessed as **CVS Severity: LOW**. However, if the disclosed version is known to contain critical vulnerabilities, the severity rating could be re-evaluated to **Medium**. It is recommended to restrict this information to safeguarded internal channels to mitigate the risk of targeted attacks.",
    "Origin": "UNSPECIFIED",
    "PublishedAt": "2025-09-05T21:18:47Z",
    "Severity": "LOW",
    "Summary": "Atlantis Exposes Service Version Publicly on /status API Endpoint",
    "UpdatedAt": "2025-09-13T03:03:01Z",
    "WithdrawnAt": "",
    "CVSS": {
      "Score": 7.5,
      "VectorString": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N"
    }
  },
  "Versions": [
    {
      "FirstPatchedVersion": {
        "Identifier": ""
      },
      "VulnerableVersionRange": "\u003c= 0.35.1"
    }
  ]
}