{
  "Severity": "MODERATE",
  "UpdatedAt": "2024-01-19T22:12:22Z",
  "Package": {
    "Ecosystem": "GO",
    "Name": "github.com/notaryproject/notation"
  },
  "Advisory": {
    "DatabaseId": 231792,
    "Id": "GSA_kwCzR0hTQS01N3d4LW02MzYtZzNnOM4AA4lw",
    "GhsaId": "GHSA-57wx-m636-g3g8",
    "References": [
      {
        "Url": "https://github.com/notaryproject/specifications/security/advisories/GHSA-57wx-m636-g3g8"
      },
      {
        "Url": "https://nvd.nist.gov/vuln/detail/CVE-2024-23332"
      },
      {
        "Url": "https://github.com/notaryproject/specifications/commit/cdabdd1042de2999c685fa5d422a785ded9c983a"
      },
      {
        "Url": "https://github.com/advisories/GHSA-57wx-m636-g3g8"
      }
    ],
    "Identifiers": [
      {
        "Type": "GHSA",
        "Value": "GHSA-57wx-m636-g3g8"
      },
      {
        "Type": "CVE",
        "Value": "CVE-2024-23332"
      }
    ],
    "Description": "### Impact\nAn external actor with control of a compromised container registry can provide outdated versions of OCI artifacts, such as Images. This could lead artifact consumers with relaxed trust policies (such as `permissive` instead of `strict`) to potentially use artifacts with signatures that are no longer valid, making them susceptible to any exploits those artifacts may contain.\n\n### Mitigation\nIn Notary Project, an artifact publisher can control the validity period of artifact by specifying signature expiry during the signing process. Using shorter signature validity periods along with processes to periodically resign artifacts, allows artifact producers to ensure that their consumers will only receive up-to-date artifacts. Artifact consumers should correspondingly use a `strict` or equivalent trust policy that enforces signature expiry. Together these steps enable use of up-to-date artifacts and safeguard against rollback attack in the event of registry compromise. The Notary Project offers various signature validation options such as `permissive`, `audit` and `skip` to support various scenarios. These scenarios includes 1) situations demanding urgent workload deployment, necessitating the bypassing of expired or revoked signatures; 2) auditing of artifacts lacking signatures without interrupting workload; and 3) skipping of verification for specific images that might have undergone validation through alternative mechanisms.\n\nAdditionally, the Notary Project supports revocation to ensure the signature freshness. Artifact publishers can sign with short-lived certificates and revoke older certificates when necessary. This revocation serves as a signal to inform artifact consumers that the corresponding unexpired artifact is no longer approved by the publisher. This enables the artifact publisher to control the validity of the signature independently of their ability to manage artifacts in a compromised registry.\n\n### Credit\nThe Notary Project extends its gratitude to Justin Cappos (@JustinCappos) for responsibly disclosing the issue.\n\n_**Note:** we have updated [threat model](https://github.com/notaryproject/specifications/blob/main/threatmodels/notation-threatmodel.md) to include considerations for rollback attack.",
    "Origin": "UNSPECIFIED",
    "PublishedAt": "2024-01-19T22:12:22Z",
    "Severity": "MODERATE",
    "Summary": "Go package github.com/notaryproject/notation configured with permissive trust policies potentially susceptible to rollback attack from compromised registry",
    "UpdatedAt": "2024-01-22T20:57:50Z",
    "WithdrawnAt": "",
    "CVSS": {
      "Score": 4,
      "VectorString": "CVSS:3.1/AV:N/AC:H/PR:H/UI:R/S:C/C:N/I:L/A:L"
    }
  },
  "Versions": [
    {
      "FirstPatchedVersion": {
        "Identifier": ""
      },
      "VulnerableVersionRange": "\u003c= 1.0.0"
    }
  ]
}