{
  "Title": "Security update for the Linux Kernel",
  "Tracking": {
    "ID": "SUSE-SU-2018:3961-1",
    "Status": "Final",
    "Version": "1",
    "InitialReleaseDate": "2018-11-30T16:43:13Z",
    "CurrentReleaseDate": "2018-11-30T16:43:13Z",
    "RevisionHistory": [
      {
        "Number": "1",
        "Date": "2018-11-30T16:43:13Z",
        "Description": "current"
      }
    ]
  },
  "Notes": [
    {
      "Text": "Security update for the Linux Kernel",
      "Title": "Topic",
      "Type": "Summary"
    },
    {
      "Text": "\nThe SUSE Linux Enterprise 15 azure kernel was updated to receive various security and bugfixes.\n\n\nThe following security bugs were fixed:\n\n- CVE-2018-9363: Fixed an integer overflow that could have been used for an out of bounds write with no additional execution privileges needed. User interaction is not needed for exploitation (bsc#1105292).\n- CVE-2018-6555: The irda_setsockopt function in net/irda/af_irda.c was fixed in drivers/staging/irda/net/af_irda.c that allowed local users to cause a denial of service (ias_object use-after-free and system crash) or possibly have unspecified other impact via an AF_IRDA socket (bsc#1106511).\n- CVE-2018-6554: Fixed memory leak in the irda_bind function in net/irda/af_irda.c and later in drivers/staging/irda/net/af_irda.c that allowed local users to cause a denial of service (memory consumption) by repeatedly binding an AF_IRDA socket (bsc#1106509).\n- CVE-2018-18710: An information leak was fixed in cdrom_ioctl_select_disc in drivers/cdrom/cdrom.c that could have been used by local attackers to read kernel memory because a cast from unsigned long to int interferes with bounds checking. This is similar to CVE-2018-10940 and CVE-2018-16658 (bsc#1113751).\n- CVE-2018-18445: Fixed faulty computation of numeric bounds in the BPF verifier that now permits out-of-bounds memory accesses because adjust_scalar_min_max_vals in kernel/bpf/verifier.c mishandled 32-bit right shifts (bsc#1112372).\n- CVE-2018-17182: The vmacache_flush_all function in mm/vmacache.c was fixed that was vulnerable to sequence number overflows. An attacker can trigger a use-after-free (and possibly gain privileges) via certain thread creation, map, unmap, invalidation, and dereference operations. (bsc#1108399).\n- CVE-2018-16658: An information leak in cdrom_ioctl_drive_status in drivers/cdrom/cdrom.c was fixed that could have leed to be used by local attackers to read kernel memory because a cast from unsigned long to int interferes with bounds checking. This is similar to CVE-2018-10940 (bsc#1107689).\n- CVE-2018-15572: The spectre_v2_select_mitigation function in arch/x86/kernel/cpu/bugs.c was not always fill RSB upon a context switch, which makes it easier for attackers to conduct userspace-userspace spectreRSB attacks. (bsc#1102517)\n- CVE-2018-14633: A security flaw was fixed in the chap_server_compute_md5() function in the ISCSI target code in a way an authentication request from an ISCSI initiator is processed. An unauthenticated remote attacker can cause a stack buffer overflow and smash up to 17 bytes of the stack. The attack requires the iSCSI target to be enabled on the victim host. Depending on how the target's code was built (i.e. depending on a compiler, compile flags and hardware architecture) an attack may lead to a system crash and thus to a denial-of-service or possibly to a non-authorized access to data exported by an iSCSI target. Due to the nature of the flaw, privilege escalation cannot be fully ruled out, although we believe it is highly unlikely (bsc#1107829).\n- CVE-2018-14617: A NULL pointer dereference and panic in hfsplus_lookup() was fixed when opening a file (that is purportedly a hard link) in an hfs+ filesystem that has malformed catalog data, and is mounted read-only without a metadata directory. (bsc#1102870)\n- CVE-2018-14613: An invalid pointer dereference in io_ctl_map_page() was fixed when mounting and operating a crafted btrfs image, because of a lack of block group item validation in check_leaf_item in fs/btrfs/tree-checker.c. (bsc#1102896)\n- CVE-2018-13095: A denial of service (memory corruption and BUG) was fixed to prevent a corrupted xfs image upon encountering an inode that is in extent format, but has more extents than fit in the inode fork. (bsc#1099999)\n- CVE-2018-13093: A NULL pointer dereference and panic in lookup_slow() on a NULL was fixed to prevent pathwalks on a corrupted xfs image. This occurs because of a lack of proper validation that cached inodes are free during allocation. (bsc#1100001)\n- CVE-2018-12896: An integer overflow in the POSIX timer code was fixed to prevent overrun accounting works. Depending on interval and expiry time values, the overrun can be larger than INT_MAX, but the accounting is int based. This basically makes the accounting values, which are visible to user space via timer_getoverrun(2) and siginfo::si_overrun, random. For example, a local user can cause a denial of service (signed integer overflow) via crafted mmap, futex, timer_create, and timer_settime system calls. (bsc#1099922)\n- CVE-2018-1129: The signature calculation was fixed to by the cephx authentication protocol. An attacker having access to ceph cluster network who is able to alter the message payload was able to bypass signature checks done by cephx protocol. Ceph branches master, mimic, luminous and jewel are believed to be vulnerable. (bsc#1096748)\n- CVE-2018-1128: The cephx authentication protocol was fixed to verify ceph clients correctly and to prevent the vulnerability to replay attack. Any attacker having access to ceph cluster network who is able to sniff packets on network could have used this vulnerability to authenticate with ceph service and perform actions allowed by ceph service. Ceph branches master, mimic, luminous and jewel are believed to be vulnerable (bsc#1096748).\n- CVE-2018-10940: The cdrom_ioctl_media_changed function in drivers/cdrom/cdrom.c was fixed to prevent local attackers to use a incorrect bounds check in the CDROM driver CDROM_MEDIA_CHANGED ioctl to read out kernel memory (bsc#1092903).\n- CVE-2018-10938: A flaw was fixed how the kernel handled network packet sent remotely by an attacker that may forced the kernel to enter an infinite loop in the cipso_v4_optptr() function in net/ipv4/cipso_ipv4.c leading to a denial-of-service. A certain non-default configuration of LSM (Linux Security Module) and NetLabel should be set up on a system before an attacker could leverage this flaw. (bsc#1106016)\n- CVE-2018-10902: The the raw midi kernel driver was fixed to be protected against concurrent access which could have lead to a double realloc (double free) in snd_rawmidi_input_params() and snd_rawmidi_output_status() which are part of snd_rawmidi_ioctl() handler in rawmidi.c file. A malicious local attacker could possibly use this for privilege escalation (bsc#1105322).\n- CVE-2017-18224: fs/ocfs2/aops.c omits use of a semaphore and consequently had a race condition for access to the extent tree during read operations in DIRECT mode, which allows local users to cause a denial of service (BUG) by modifying a certain e_cpos field (bsc#1084831).\n- CVE-2017-16533: The usbhid_parse function in drivers/hid/usbhid/hid-core.c allowed local users to cause a denial of service (out-of-bounds read and system crash) or possibly have unspecified other impact via a crafted USB device (bsc#1066674).\n\n\nThe following security bug was previously fixed by has now an assigned CVE number:\n\n- CVE-2018-18386: drivers/tty/n_tty.c in the Linux kernel allowed local attackers (who are able to access pseudo terminals) to hang/block further usage of any pseudo terminal devices due to an EXTPROC versus ICANON confusion in TIOCINQ (bnc#1094825).\n\n\nThe following non-security bugs were fixed:\n\n- /dev/mem: Add bounce buffer for copy-out (git-fixes).\n- /dev/mem: Avoid overwriting 'err' in read_mem() (git-fixes).\n- 9p/net: Fix zero-copy path in the 9p virtio transport (bsc#1051510).\n- 9p/virtio: fix off-by-one error in sg list bounds check (bsc#1051510).\n- 9p: fix multiple NULL-pointer-dereferences (bsc#1051510).\n- ACPI / APEI: Remove ghes_ioremap_area (bsc#1051510).\n- ACPI / EC: Add another entry for Thinkpad X1 Carbon 6th (bsc#1051510).\n- ACPI / EC: Add parameter to force disable the GPE on suspend (bsc#1051510).\n- ACPI / EC: Use ec_no_wakeup on ThinkPad X1 Yoga 3rd (bsc#1051510).\n- ACPI / EC: Use ec_no_wakeup on Thinkpad X1 Carbon 6th (bsc#1051510).\n- ACPI / EC: Use ec_no_wakeup on more Thinkpad X1 Carbon 6th systems (bsc#1051510).\n- ACPI / PCI: pci_link: Allow the absence of _PRS and change log level (bsc#1104172).\n- ACPI / PM: save NVS memory for ASUS 1025C laptop (bsc#1051510).\n- ACPI / bus: Only call dmi_check_system on X86 (bsc#1105597, bsc#1106178).\n- ACPI / processor: Fix the return value of acpi_processor_ids_walk() (bsc#1051510).\n- ACPI / scan: Initialize status to ACPI_STA_DEFAULT (bsc#1051510).\n- ACPI/IORT: Remove temporary iort_get_id_mapping_index() ACPICA guard (bsc#1103387).\n- ACPI/PCI: pci_link: reduce verbosity when IRQ is enabled (bsc#1104172).\n- ACPICA: Reference Counts: increase max to 0x4000 for large servers (bsc#1108241).\n- ACPICA: iasl: Add SMMUv3 device ID mapping index support (bsc#1103387).\n- ALSA: bebob: fix memory leak for M-Audio FW1814 and ProjectMix I/O at error path (bsc#1051510).\n- ALSA: bebob: use address returned by kmalloc() instead of kernel stack for streaming DMA mapping (bsc#1051510).\n- ALSA: cs46xx: Deliver indirect-PCM transfer error ().\n- ALSA: cs5535audio: Fix invalid endian conversion (bsc#1051510).\n- ALSA: emu10k1: Deliver indirect-PCM transfer error ().\n- ALSA: emu10k1: fix possible info leak to userspace on SNDRV_EMU10K1_IOCTL_INFO (bsc#1051510).\n- ALSA: fireface: fix memory leak in ff400_switch_fetching_mode() (bsc#1051510).\n- ALSA: firewire-digi00x: fix memory leak of private data (bsc#1051510).\n- ALSA: firewire-tascam: fix memory leak of private data (bsc#1051510).\n- ALSA: fireworks: fix memory leak of response buffer at error path (bsc#1051510).\n- ALSA: hda - Add mic quirk for the Lenovo G50-30 (17aa:3905) (bsc#1051510).\n- ALSA: hda - Add quirk for ASUS G751 laptop (bsc#1051510).\n- ALSA: hda - Fix cancel_work_sync() stall from jackpoll work (bsc#1051510).\n- ALSA: hda - Fix headphone pin config for ASUS G751 (bsc#1051510).\n- ALSA: hda - Sleep for 10ms after entering D3 on Conexant codecs (bsc#1051510).\n- ALSA: hda - Turn CX8200 into D3 as well upon reboot (bsc#1051510).\n- ALSA: hda/realtek - Cannot adjust speaker's volume on Dell XPS 27 7760 (bsc#1051510).\n- ALSA: hda/realtek - Fix the problem of the front MIC on the Lenovo M715 (bsc#1051510).\n- ALSA: hda: Add 2 more models to the power_save blacklist (bsc#1051510).\n- ALSA: hda: Add AZX_DCAPS_PM_RUNTIME for AMD Raven Ridge (bsc#1051510).\n- ALSA: hda: Correct Asrock B85M-ITX power_save blacklist entry (bsc#1051510).\n- ALSA: hda: fix unused variable warning (bsc#1051510).\n- ALSA: memalloc: Do not exceed over the requested size (bsc#1051510).\n- ALSA: mips: Deliver indirect-PCM transfer error ().\n- ALSA: msnd: Fix the default sample sizes (bsc#1051510).\n- ALSA: oxfw: fix memory leak for model-dependent data at error path (bsc#1051510).\n- ALSA: oxfw: fix memory leak of discovered stream formats at error path (bsc#1051510).\n- ALSA: oxfw: fix memory leak of private data (bsc#1051510).\n- ALSA: pcm: Fix negative appl_ptr handling in pcm-indirect helpers ().\n- ALSA: pcm: Fix snd_interval_refine first/last with open min/max (bsc#1051510).\n- ALSA: pcm: Simplify forward/rewind codes ().\n- ALSA: pcm: Use a common helper for PCM state check and hwsync ().\n- ALSA: pcm: Workaround for weird PulseAudio behavior on rewind error ().\n- ALSA: rme32: Deliver indirect-PCM transfer error ().\n- ALSA: usb-audio: Fix multiple definitions in AU0828_DEVICE() macro (bsc#1051510).\n- ALSA: usb-audio: update quirk for B W PX to remove microphone (bsc#1051510).\n- ALSA: virmidi: Fix too long output trigger loop (bsc#1051510).\n- ALSA: vx222: Fix invalid endian conversions (bsc#1051510).\n- ALSA: vxpocket: Fix invalid endian conversions (bsc#1051510).\n- ARM: 8780/1: ftrace: Only set kernel memory back to read-only after boot (bsc#1051510).\n- ARM: 8799/1: mm: fix pci_ioremap_io() offset check (bsc#1051510).\n- ARM: DRA7/OMAP5: Enable ACTLR[0] (Enable invalidates of BTB) for secondary cores (bsc#1051510).\n- ARM: bcm2835: Add GET_THROTTLED firmware property (bsc#1108468).\n- ARM: exynos: Clear global variable on init error path (bsc#1051510).\n- ARM: hisi: check of_iomap and fix missing of_node_put (bsc#1051510).\n- ARM: hisi: fix error handling and missing of_node_put (bsc#1051510).\n- ARM: hisi: handle of_iomap and fix missing of_node_put (bsc#1051510).\n- ARM: hwmod: RTC: Do not assume lock/unlock will be called with irq enabled (bsc#1051510).\n- ARM: imx: flag failure of of_iomap (bsc#1051510).\n- ARM: imx_v4_v5_defconfig: Select ULPI support (bsc#1051510).\n- ARM: imx_v6_v7_defconfig: Select ULPI support (bsc#1051510).\n- ARM: mvebu: declare asm symbols as character arrays in pmsu.c (bsc#1051510).\n- ARM: pxa: irq: fix handling of ICMR registers in suspend/resume (bsc#1051510).\n- ASoC: Intel: Skylake: Reset the controller in probe (bsc#1051510).\n- ASoC: Intel: cht_bsw_max98090: remove useless code, align with ChromeOS driver (bsc#1051510).\n- ASoC: Intel: cht_bsw_max98090_ti: Fix jack initialization (bsc#1051510).\n- ASoC: cs4265: fix MMTLR Data switch control (bsc#1051510).\n- ASoC: dapm: Fix potential DAI widget pointer deref when linking DAIs (bsc#1051510).\n- ASoC: intel: skylake: Add missing break in skl_tplg_get_token() (bsc#1051510).\n- ASoC: msm8916-wcd-digital: fix RX2 MIX1 and RX3 MIX1 (bsc#1051510).\n- ASoC: rsnd: adg: care clock-frequency size (bsc#1051510).\n- ASoC: rsnd: do not fallback to PIO mode when -EPROBE_DEFER (bsc#1051510).\n- ASoC: rsnd: fixup not to call clk_get/set under non-atomic (bsc#1051510).\n- ASoC: rsnd: move rsnd_ssi_config_init() execute condition into it (bsc#1051510).\n- ASoC: rsnd: update pointer more accurate (bsc#1051510).\n- ASoC: rt5514: Add the I2S ASRC support (bsc#1051510).\n- ASoC: rt5514: Add the missing register in the readable table (bsc#1051510).\n- ASoC: rt5514: Eliminate the noise in the ASRC case (bsc#1051510).\n- ASoC: rt5514: Fix the issue of the delay volume applied (bsc#1051510).\n- ASoC: rt5514: Fix the issue of the delay volume applied again (bsc#1051510).\n- ASoC: sigmadsp: safeload should not have lower byte limit (bsc#1051510).\n- ASoC: wm8804: Add ACPI support (bsc#1051510).\n- ASoC: wm8994: Fix missing break in switch (bsc#1051510).\n- Apparmor fixes from git-fixes\n- Backport stable-patches for x86 architecture\n- Bluetooth: Add a new Realtek 8723DE ID 0bda:b009 (bsc#1051510).\n- Bluetooth: Use lock_sock_nested in bt_accept_enqueue (bsc#1051510).\n- Bluetooth: avoid killing an already killed socket (bsc#1051510).\n- Bluetooth: btsdio: Do not bind to non-removable BCM43430 (bsc#1103587).\n- Bluetooth: h5: Fix missing dependency on BT_HCIUART_SERDEV (bsc#1051510).\n- Bluetooth: hidp: Fix handling of strncpy for hid-\u003ename information (bsc#1051510).\n- Bluetooth: hidp: buffer overflow in hidp_process_report (bsc#1051510).\n- Btrfs: fix data corruption when deduplicating between different files (bsc#1110647).\n- Btrfs: fix duplicate extents after fsync of file with prealloc extents (bsc#1110644).\n- Btrfs: fix file data corruption after cloning a range and fsync (bsc#1111901).\n- Btrfs: fix fsync after hole punching when using no-holes feature (bsc#1110642).\n- Btrfs: fix loss of prealloc extents past i_size after fsync log replay (bsc#1110643).\n- Btrfs: fix mount failure after fsync due to hard link recreation (bsc#1103543).\n- Btrfs: fix return value on rename exchange failure (bsc#1110645).\n- Btrfs: fix send failure when root has deleted files still open (bsc#1110650).\n- Btrfs: rework outstanding_extents (dependency for bsc#1031392).\n- Btrfs: send, fix invalid access to commit roots due to concurrent snapshotting (bsc#1111904).\n- Btrfs: sync log after logging new name (bsc#1110646).\n- CIFS: check for STATUS_USER_SESSION_DELETED (bsc#1112902).\n- Cleanup out-of-tree subsection\n- Disable DRM patches that broke vbox video driver KMP (bsc#1111076)\n- Do not leak MNT_INTERNAL away from internal mounts (git-fixes).\n- Documentation/l1tf: Fix small spelling typo (bsc#1051510).\n- Documentation: add some docs for errseq_t (bsc#1107008).\n- Documentation: ip-sysctl.txt: document addr_gen_mode (bsc#1051510).\n- Drivers: HV: Send one page worth of kmsg dump over Hyper-V during panic (bsc#1107207).\n- Drivers: hv: vmbus: Add comments on ring buffer signaling (bsc#1107207).\n- Drivers: hv: vmbus: Cleanup synic memory free path (bsc#1107207).\n- Drivers: hv: vmbus: Fix the issue with freeing up hv_ctl_table_hdr (bsc#1107207).\n- Drivers: hv: vmbus: Fix the offer_in_progress in vmbus_process_offer() (bsc#1051510).\n- Drivers: hv: vmbus: Get rid of MSR access from vmbus_drv.c (bsc#1107207).\n- Drivers: hv: vmbus: Implement Direct Mode for stimer0 (bsc#1107207).\n- Drivers: hv: vmbus: Make TLFS #define names architecture neutral (bsc#1107207).\n- Drivers: hv: vmbus: Remove use of slow_virt_to_phys() (bsc#1107207).\n- Drivers: hv: vmbus: Remove x86 MSR refs in arch independent code (bsc#1107207).\n- Drivers: hv: vmbus: Remove x86-isms from arch independent drivers (bsc#1107207).\n- Drivers: hv: vmbus: Removed an unnecessary cast from void * (bsc#1107207).\n- Drivers: hv: vmbus: Reset the channel callback in vmbus_onoffer_rescind() (bsc#1107207).\n- Drivers: hv: vmbus: Use get/put_cpu() in vmbus_connect() (bsc#1107207).\n- Drivers: hv: vmbus: add numa_node to sysfs (bsc#1107207).\n- Drivers: hv: vmbus: do not mark HV_PCIE as perf_device (bsc#1051510).\n- Drivers: hv: vmbus: enable VMBus protocol version 5.0 (bsc#1107207).\n- Drivers: hv: vmbus: respect what we get from hv_get_synint_state() (bsc#1107207).\n- Drivers: hv: vmus: Fix the check for return value from kmsg get dump buffer (bsc#1107207).\n- EDAC, ghes: Add DDR4 and NVDIMM memory types (bsc#1099125).\n- EDAC, i7core: Fix memleaks and use-after-free on probe and remove (bsc#1051510).\n- EDAC, skx: Fix skx_edac build error when ACPI_NFIT=m (bsc#1099125).\n- EDAC, skx_edac: Detect non-volatile DIMMs (bsc#1099125).\n- EDAC, thunderx: Fix memory leak in thunderx_l2c_threaded_isr() (bsc#1114279).\n- EDAC: Add new memory type for non-volatile DIMMs (bsc#1099125).\n- EDAC: Fix memleak in module init error path (bsc#1051510).\n- EDAC: Raise the maximum number of memory controllers (bsc#1113780).\n- Filesystem and FUSE fixes from upstream\n- Fix kexec forbidding kernels signed with keys in the secondary keyring to boot (bsc#1110006).\n- HID: add quirk for another PIXART OEM mouse used by HP (bsc#1051510).\n- HID: add support for Apple Magic Keyboards (bsc#1051510).\n- HID: hid-ntrig: add error handling for sysfs_create_group (bsc#1051510).\n- HID: hid-saitek: Add device ID for RAT 7 Contagion (bsc#1051510).\n- HID: hid-sensor-hub: Force logical minimum to 1 for power and report state (bsc#1051510).\n- HID: i2c-hid: Add no-irq-after-reset quirk for 0911:5288 device ().\n- HID: quirks: fix support for Apple Magic Keyboards (bsc#1051510).\n- HID: sensor-hub: Restore fixup for Lenovo ThinkPad Helix 2 sensor hub report (bsc#1051510).\n- IB/IPoIB: Set ah valid flag in multicast send flow (bsc#1046307 ).\n- IB/core: type promotion bug in rdma_rw_init_one_mr() (bsc#1046306).\n- IB/hfi1: Invalid NUMA node information can cause a divide by zero (bsc#1060463).\n- IB/hfi1: Remove incorrect call to do_interrupt callback (bsc#1060463).\n- IB/hfi1: Set in_use_ctxts bits for user ctxts only (bsc#1060463 ).\n- IB/ipoib: Avoid a race condition between start_xmit and cm_rep_handler (bsc#1046307).\n- IB/ipoib: Fix error return code in ipoib_dev_init() (bsc#1046307 ).\n- IB/mlx4: Test port number before querying type (bsc#1046302 ).\n- IB/mlx4: Use 4K pages for kernel QP's WQE buffer (bsc#1046302 ).\n- IB/mlx5: fix uaccess beyond 'count' in debugfs read/write handlers (bsc#1046305).\n- Input: atakbd - fix Atari CapsLock behaviour (bsc#1051510).\n- Input: atakbd - fix Atari keymap (bsc#1051510).\n- Input: atmel_mxt_ts - only use first T9 instance (bsc#1051510).\n- Input: edt-ft5x06 - fix error handling for factory mode on non-M06 (bsc#1051510).\n- Input: edt-ft5x06 - implement support for the EDT-M12 series (bsc#1051510).\n- Input: edt-ft5x06 - make distinction between m06/m09/generic more clear (bsc#1051510).\n- Input: elantech - enable middle button of touchpad on ThinkPad P72 (bsc#1051510).\n- Input: synaptics-rmi4 - fix axis-swap behavior (bsc#1051510).\n- KABI: hide new member in struct iommu_table from genksyms (bsc#1061840).\n- KABI: move the new handler to end of machdep_calls and hide it from genksyms (bsc#1094244).\n- KABI: powerpc: export __find_linux_pte as __find_linux_pte_or_hugepte (bsc#1061840).\n- KABI: tpm: change relinquish_locality return value back to void (bsc#1082555).\n- KABI: tpm: do keep the cmd_ready and go_idle as pm ops (bsc#1082555).\n- KVM/VMX: Optimize vmx_vcpu_run() and svm_vcpu_run() by marking the RDMSR path as unlikely() (bsc#1110006).\n- KVM/x86: remove WARN_ON() for when vm_munmap() fails (bsc#1106240).\n- KVM: Enforce error in ioctl for compat tasks when !KVM_COMPAT (bsc#1106240).\n- KVM: PPC: Add pt_regs into kvm_vcpu_arch and move vcpu-\u003earch.gpr[] into it (bsc#1061840).\n- KVM: PPC: Avoid marking DMA-mapped pages dirty in real mode (bsc#1061840).\n- KVM: PPC: Book 3S HV: Do ptesync in radix guest exit path (bsc#1061840).\n- KVM: PPC: Book3S HV: Add 'online' register to ONE_REG interface (bsc#1061840).\n- KVM: PPC: Book3S HV: Add of_node_put() in success path (bsc#1061840).\n- KVM: PPC: Book3S HV: Allow HPT and radix on the same core for POWER9 v2.2 (bsc#1061840).\n- KVM: PPC: Book3S HV: Allow creating max number of VCPUs on POWER9 (bsc#1061840).\n- KVM: PPC: Book3S HV: Avoid crash from THP collapse during radix page fault (bsc#1061840).\n- KVM: PPC: Book3S HV: Avoid shifts by negative amounts (bsc#1061840).\n- KVM: PPC: Book3S HV: Check DR not IR to chose real vs virt mode MMIOs (bsc#1061840).\n- KVM: PPC: Book3S HV: Do SLB load/unload with guest LPCR value loaded (bsc#1061840).\n- KVM: PPC: Book3S HV: Do not truncate HPTE index in xlate function (bsc#1061840).\n- KVM: PPC: Book3S HV: Do not use compound_order to determine host mapping size (bsc#1061840).\n- KVM: PPC: Book3S HV: Do not use existing 'prodded' flag for XIVE escalations (bsc#1061840).\n- KVM: PPC: Book3S HV: Enable migration of decrementer register (bsc#1061840).\n- KVM: PPC: Book3S HV: Factor fake-suspend handling out of kvmppc_save/restore_tm (bsc#1061840).\n- KVM: PPC: Book3S HV: Fix VRMA initialization with 2MB or 1GB memory backing (bsc#1061840).\n- KVM: PPC: Book3S HV: Fix conditions for starting vcpu (bsc#1061840).\n- KVM: PPC: Book3S HV: Fix constant size warning (bsc#1061840).\n- KVM: PPC: Book3S HV: Fix duplication of host SLB entries (bsc#1061840).\n- KVM: PPC: Book3S HV: Fix guest r11 corruption with POWER9 TM workarounds (bsc#1061840).\n- KVM: PPC: Book3S HV: Fix handling of large pages in radix page fault handler (bsc#1061840).\n- KVM: PPC: Book3S HV: Fix handling of secondary HPTEG in HPT resizing code (bsc#1061840).\n- KVM: PPC: Book3S HV: Fix inaccurate comment (bsc#1061840).\n- KVM: PPC: Book3S HV: Fix kvmppc_bad_host_intr for real mode interrupts (bsc#1061840).\n- KVM: PPC: Book3S HV: Fix trap number return from __kvmppc_vcore_entry (bsc#1061840).\n- KVM: PPC: Book3S HV: Fix typo in kvmppc_hv_get_dirty_log_radix() (bsc#1061840).\n- KVM: PPC: Book3S HV: Handle 1GB pages in radix page fault handler (bsc#1061840).\n- KVM: PPC: Book3S HV: Improve handling of debug-trigger HMIs on POWER9 (bsc#1061840).\n- KVM: PPC: Book3S HV: Keep XIVE escalation interrupt masked unless ceded (bsc#1061840).\n- KVM: PPC: Book3S HV: Lockless tlbie for HPT hcalls (bsc#1061840).\n- KVM: PPC: Book3S HV: Make HPT resizing work on POWER9 (bsc#1061840).\n- KVM: PPC: Book3S HV: Make radix clear pte when unmapping (bsc#1061840).\n- KVM: PPC: Book3S HV: Make radix use correct tlbie sequence in kvmppc_radix_tlbie_page (bsc#1061840).\n- KVM: PPC: Book3S HV: Make xive_pushed a byte, not a word (bsc#1061840).\n- KVM: PPC: Book3S HV: Pack VCORE IDs to access full VCPU ID space (bsc#1061840).\n- KVM: PPC: Book3S HV: Radix page fault handler optimizations (bsc#1061840).\n- KVM: PPC: Book3S HV: Read kvm-\u003earch.emul_smt_mode under kvm-\u003elock (bsc#1061840).\n- KVM: PPC: Book3S HV: Recursively unmap all page table entries when unmapping (bsc#1061840).\n- KVM: PPC: Book3S HV: Remove useless statement (bsc#1061840).\n- KVM: PPC: Book3S HV: Remove vcpu-\u003earch.dec usage (bsc#1061840).\n- KVM: PPC: Book3S HV: Send kvmppc_bad_interrupt NMIs to Linux handlers (bsc#1061840).\n- KVM: PPC: Book3S HV: Set RWMR on POWER8 so PURR/SPURR count correctly (bsc#1061840).\n- KVM: PPC: Book3S HV: Snapshot timebase offset on guest entry (bsc#1061840).\n- KVM: PPC: Book3S HV: Streamline setting of reference and change bits (bsc#1061840).\n- KVM: PPC: Book3S HV: Use __gfn_to_pfn_memslot() in page fault handler (bsc#1061840).\n- KVM: PPC: Book3S HV: Use a helper to unmap ptes in the radix fault path (bsc#1061840).\n- KVM: PPC: Book3S HV: Use correct pagesize in kvm_unmap_radix() (bsc#1061840, git-fixes).\n- KVM: PPC: Book3S HV: XIVE: Resend re-routed interrupts on CPU priority change (bsc#1061840).\n- KVM: PPC: Book3S HV: radix: Do not clear partition PTE when RC or write bits do not match (bsc#1061840).\n- KVM: PPC: Book3S HV: radix: Refine IO region partition scope attributes (bsc#1061840).\n- KVM: PPC: Book3S PR: Add guest MSR parameter for kvmppc_save_tm()/kvmppc_restore_tm() (bsc#1061840).\n- KVM: PPC: Book3S PR: Move kvmppc_save_tm/kvmppc_restore_tm to separate file (bsc#1061840).\n- KVM: PPC: Book3S: Add MMIO emulation for VMX instructions (bsc#1061840).\n- KVM: PPC: Book3S: Allow backing bigger guest IOMMU pages with smaller physical pages (bsc#1061840).\n- KVM: PPC: Book3S: Check KVM_CREATE_SPAPR_TCE_64 parameters (bsc#1061840).\n- KVM: PPC: Book3S: Eliminate some unnecessary checks (bsc#1061840).\n- KVM: PPC: Book3S: Fix compile error that occurs with some gcc versions (bsc#1061840).\n- KVM: PPC: Book3S: Fix guest DMA when guest partially backed by THP pages (bsc#1077761, git-fixes, bsc#1103948, bsc#1103949).\n- KVM: PPC: Book3S: Fix matching of hardware and emulated TCE tables (bsc#1061840).\n- KVM: PPC: Book3S: Use correct page shift in H_STUFF_TCE (bsc#1061840).\n- KVM: PPC: Fix a mmio_host_swabbed uninitialized usage issue (bsc#1061840).\n- KVM: PPC: Make iommu_table::it_userspace big endian (bsc#1061840).\n- KVM: PPC: Move nip/ctr/lr/xer registers to pt_regs in kvm_vcpu_arch (bsc#1061840).\n- KVM: PPC: Use seq_puts() in kvmppc_exit_timing_show() (bsc#1061840).\n- KVM: SVM: Add MSR-based feature support for serializing LFENCE (bsc#1106240).\n- KVM: VMX: Do not allow reexecute_instruction() when skipping MMIO instr (bsc#1106240).\n- KVM: VMX: Tell the nested hypervisor to skip L1D flush on vmentry (bsc#1106240).\n- KVM: VMX: Work around kABI breakage in 'enum vmx_l1d_flush_state' (bsc#1106369).\n- KVM: VMX: fixes for vmentry_l1d_flush module parameter (bsc#1106369).\n- KVM: VMX: raise internal error for exception during invalid protected mode state (bsc#1110006).\n- KVM: VMX: support MSR_IA32_ARCH_CAPABILITIES as a feature MSR (bsc#1106240).\n- KVM: X86: Fix reserved bits check for MOV to CR3 (bsc#1110006).\n- KVM: X86: Introduce kvm_get_msr_feature() (bsc#1106240).\n- KVM: X86: fix incorrect reference of trace_kvm_pi_irte_update (bsc#1110006).\n- KVM: hyperv: idr_find needs RCU protection (bsc#1107207).\n- KVM: introduce kvm_make_vcpus_request_mask() API (bsc#1107207).\n- KVM: lapic: stop advertising DIRECTED_EOI when in-kernel IOAPIC is in use (bsc#1110006).\n- KVM: nVMX: Do not expose MPX VMX controls when guest MPX disabled (bsc#1106240).\n- KVM: nVMX: Do not flush TLB when vmcs12 uses VPID (bsc#1106240).\n- KVM: nVMX: Do not halt vcpu when L1 is injecting events to L2 (bsc#1110006).\n- KVM: nVMX: Fix injection to L2 when L1 do not intercept external-interrupts (bsc#1106240).\n- KVM: nVMX: Fix races when sending nested PI while dest enters/leaves L2 (bsc#1106240).\n- KVM: nVMX: Re-evaluate L1 pending events when running L2 and L1 got posted-interrupt (bsc#1106240).\n- KVM: s390: add etoken support for guests (bsc#1106948, LTC#171029).\n- KVM: s390: force bp isolation for VSIE (bsc#1103421).\n- KVM: s390: implement CPU model only facilities (bsc#1106948, LTC#171029).\n- KVM: vmx: track host_state.loaded using a loaded_vmcs pointer (bsc#1110006).\n- KVM: vmx: use local variable for current_vmptr when emulating VMPTRST (bsc#1110006).\n- KVM: x86: Add a framework for supporting MSR-based features (bsc#1106240).\n- KVM: x86: Change __kvm_apic_update_irr() to also return if max IRR updated (bsc#1106240).\n- KVM: x86: Default to not allowing emulation retry in kvm_mmu_page_fault (bsc#1106240).\n- KVM: x86: Do not re-{try,execute} after failed emulation in L2 (bsc#1106240).\n- KVM: x86: Do not use kvm_x86_ops-\u003empx_supported() directly (bsc#1106240).\n- KVM: x86: Invert emulation re-execute behavior to make it opt-in (bsc#1106240).\n- KVM: x86: Merge EMULTYPE_RETRY and EMULTYPE_ALLOW_REEXECUTE (bsc#1106240).\n- KVM: x86: SVM: Call x86_spec_ctrl_set_guest/host() with interrupts disabled (git-fixes 1f50ddb4f418).\n- KVM: x86: Update cpuid properly when CR4.OSXAVE or CR4.PKE is changed (bsc#1110006).\n- KVM: x86: VMX: hyper-v: Enlightened MSR-Bitmap support (bsc#1107207).\n- KVM: x86: define SVM/VMX specific kvm_arch_[alloc|free]_vm (bsc#1111506).\n- KVM: x86: ensure all MSRs can always be KVM_GET/SET_MSR'd (bsc#1107207).\n- KVM: x86: fix #UD address of failed Hyper-V hypercalls (bsc#1107207).\n- KVM: x86: fix #UD address of failed Hyper-V hypercalls (bsc#1110006).\n- KVM: x86: fix APIC page invalidation (bsc#1106240).\n- KVM: x86: fix escape of guest dr6 to the host (bsc#1110006).\n- KVM: x86: hyperv: do rep check for each hypercall separately (bsc#1107207).\n- KVM: x86: hyperv: simplistic HVCALL_FLUSH_VIRTUAL_ADDRESS_{LIST,SPACE} implementation (bsc#1107207).\n- KVM: x86: hyperv: simplistic HVCALL_FLUSH_VIRTUAL_ADDRESS_{LIST,SPACE}_EX implementation (bsc#1107207).\n- KVM: x86: hyperv: use defines when parsing hypercall parameters (bsc#1107207).\n- KVM: x86: remove APIC Timer periodic/oneshot spikes (bsc#1110006).\n- Kbuild: fix # escaping in .cmd files for future Make (git-fixes).\n- Limit kernel-source build to architectures for which we build binaries (bsc#1108281).\n- MAINTAINERS: fix location of ina2xx.txt device tree file (bsc#1051510).\n- NET: stmmac: align DMA stuff to largest cache line length (netfilter-stable-18_08_01).\n- NFC: Fix possible memory corruption when handling SHDLC I-Frame commands (bsc#1051510).\n- NFC: nfcmrvl_uart: fix OF child-node lookup (bsc#1051510).\n- NFC: trf7970a: fix check of clock frequencies (bsc#1051510).\n- NFS/filelayout: Fix racy setting of fl-\u003edsaddr in filelayout_check_deviceid() (bsc#1105190).\n- NFS: Avoid quadratic search when freeing delegations (bsc#1084760).\n- NFS: Use an appropriate work queue for direct-write completion (bsc#1082519).\n- NFSv4 client live hangs after live data migration recovery (git-fixes).\n- NFSv4: Fix a sleep in atomic context in nfs4_callback_sequence() (git-fixes).\n- NFSv4: Fix possible 1-byte stack overflow in nfs_idmap_read_and_verify_message (git-fixes).\n- Netperf performance issue due to AppArmor net mediation (bsc#1108520)\n- PCI/ASPM: Fix link_state teardown on device removal (bsc#1051510).\n- PCI/portdrv: Compute MSI/MSI-X IRQ vectors after final allocation (bsc#1109806).\n- PCI/portdrv: Factor out Interrupt Message Number lookup (bsc#1109806).\n- PCI: Add PCI resource type mask #define (bsc#1105355).\n- PCI: Add pci_resize_resource() for resizing BARs (bsc#1105355).\n- PCI: Add resizable BAR infrastructure (bsc#1105355).\n- PCI: Allow release of resources that were never assigned (bsc#1105355).\n- PCI: Cleanup PCI_REBAR_CTRL_BAR_SHIFT handling (bsc#1105355).\n- PCI: Match Root Port's MPS to endpoint's MPSS as necessary (bsc#1109269).\n- PCI: OF: Fix I/O space page leak (git-fixes).\n- PCI: Reprogram bridge prefetch registers on resume (bsc#1051510).\n- PCI: Restore resized BAR state on resume (bsc#1105355).\n- PCI: Skip MPS logic for Virtual Functions (VFs) (bsc#1051510).\n- PCI: aardvark: Fix I/O space page leak (git-fixes).\n- PCI: aardvark: Size bridges before resources allocation (bsc#1109806).\n- PCI: designware: Fix I/O space page leak (bsc#1109806).\n- PCI: dwc: Fix scheduling while atomic issues (git-fixes).\n- PCI: faraday: Add missing of_node_put() (bsc#1109806).\n- PCI: faraday: Fix I/O space page leak (bsc#1109806).\n- PCI: hotplug: Do not leak pci_slot on registration failure (bsc#1051510).\n- PCI: hv: Convert remove_lock to refcount (bsc#1107207).\n- PCI: hv: Do not wait forever on a device that has disappeared (bsc#1107207).\n- PCI: hv: Do not wait forever on a device that has disappeared (bsc#1109806).\n- PCI: hv: Fix return value check in hv_pci_assign_slots() (bsc#1107207).\n- PCI: hv: Make sure the bus domain is really unique (git-fixes).\n- PCI: hv: Remove unused reason for refcount handler (bsc#1107207).\n- PCI: hv: Replace GFP_ATOMIC with GFP_KERNEL in new_pcichild_device() (bsc#1107207).\n- PCI: hv: Use effective affinity mask (bsc#1107207).\n- PCI: hv: Use list_for_each_entry() (bsc#1107207).\n- PCI: hv: support reporting serial number as slot information (bsc#1107207).\n- PCI: mvebu: Fix I/O space end address calculation (bsc#1051510).\n- PCI: pciehp: Fix unprotected list iteration in IRQ handler (bsc#1051510).\n- PCI: pciehp: Fix use-after-free on unplug (bsc#1051510).\n- PCI: versatile: Fix I/O space page leak (bsc#1109806).\n- PCI: xgene: Fix I/O space page leak (bsc#1109806).\n- PCI: xilinx-nwl: Add missing of_node_put() (bsc#1109806).\n- PCI: xilinx: Add missing of_node_put() (bsc#1109806).\n- PM / Domains: Fix error path during attach in genpd (bsc#1051510).\n- PM / Domains: Fix genpd to deal with drivers returning 1 from -\u003eprepare() (bsc#1051510).\n- PM / clk: signedness bug in of_pm_clk_add_clks() (bsc#1051510).\n- PM / core: Clear the direct_complete flag on errors (bsc#1051510).\n- PM / runtime: Drop usage count for suppliers at device link removal (bsc#1100132).\n- PM / sleep: wakeup: Fix build error caused by missing SRCU support (bsc#1051510).\n- PM: cpuidle: Fix cpuidle_poll_state_init() prototype (bsc#1110006).\n- RAID10 BUG_ON in raise_barrier when force is true and conf-\u003ebarrier is 0 (git-fixes).\n- RDMA/bnxt_re: Fix a bunch of off by one bugs in qplib_fp.c (bsc#1050244).\n- RDMA/bnxt_re: Fix a couple off by one bugs (bsc#1050244 ).\n- RDMA/bnxt_re: Fix system crash during RDMA resource initialization (bsc#1086283).\n- RDMA/i40w: Hold read semaphore while looking after VMA (bsc#1058659).\n- RDMA/uverbs: Expand primary and alt AV port checks (bsc#1046306 ).\n- Squashfs: Compute expected length from inode size rather than block length (bsc#1051510).\n- Tools: hv: Fix a bug in the key delete code (bsc#1107207).\n- USB: Add quirk to support DJI CineSSD (bsc#1051510).\n- USB: add quirk for WORLDE Controller KS49 or Prodipe MIDI 49C USB controller (bsc#1051510).\n- USB: cdc-wdm: do not enable interrupts in USB-giveback (bsc#1051510).\n- USB: fix error handling in usb_driver_claim_interface() (bsc#1051510).\n- USB: handle NULL config in usb_find_alt_setting() (bsc#1051510).\n- USB: net2280: Fix erroneous synchronization change (bsc#1051510).\n- USB: option: add support for DW5821e (bsc#1051510).\n- USB: remove LPM management from usb_driver_claim_interface() (bsc#1051510).\n- USB: serial: cypress_m8: fix interrupt-out transfer length (bsc#1051510).\n- USB: serial: io_ti: fix array underflow in completion handler (bsc#1051510).\n- USB: serial: kobil_sct: fix modem-status error handling (bsc#1051510).\n- USB: serial: pl2303: add a new device id for ATEN (bsc#1051510).\n- USB: serial: sierra: fix potential deadlock at close (bsc#1051510).\n- USB: serial: simple: add Motorola Tetra MTP6550 id (bsc#1051510).\n- USB: serial: ti_usb_3410_5052: fix array underflow in completion handler (bsc#1051510).\n- USB: yurex: Check for truncation in yurex_read() (bsc#1051510).\n- USB: yurex: Fix buffer over-read in yurex_write() (bsc#1051510).\n- Update config files, make CRYPTO_CRCT10DIF_PCLMUL built-in (bsc#1105603).\n- VFS: do not test owner for NFS in set_posix_acl() (bsc#1103405).\n- Workaround for mysterious NVMe breakage with i915 CFL (bsc#1111040).\n- Workaround kABI breakage by __must_check drop of strscpy() (bsc#1051510).\n- X86/Hyper-V: Add flush HvFlushGuestPhysicalAddressSpace hypercall support (bsc#1107207).\n- X86/Hyper-V: Add hyperv_nested_flush_guest_mapping ftrace support (bsc#1107207).\n- X86/Hyper-V: Consolidate code for converting cpumask to vpset (bsc#1107207).\n- X86/Hyper-V: Consolidate the allocation of the hypercall input page (bsc#1107207).\n- X86/Hyper-V: Enable IPI enlightenments (bsc#1107207).\n- X86/Hyper-V: Enhanced IPI enlightenment (bsc#1107207).\n- X86/Hyper-V: Enlighten APIC access (bsc#1107207).\n- acpi, nfit: Add function to look up nvdimm device and provide SMBIOS handle (bsc#1099125).\n- affs_lookup(): close a race with affs_remove_link() (bsc#1105355).\n- ahci: Add Intel Ice Lake LP PCI ID (bsc#1051510).\n- aio: fix io_destroy(2) vs. lookup_ioctx() race (git-fixes).\n- apparmor: Check buffer bounds when mapping permissions mask (git-fixes).\n- apparmor: Fix failure to audit context info in build_change_hat (bsc#1051510).\n- apparmor: Fix regression in profile conflict logic (bsc#1106427)\n- apparmor: Fully initialize aa_perms struct when answering userspace query (bsc#1051510).\n- apparmor: ensure that undecidable profile attachments fail (bsc#1106427).\n- apparmor: fix an error code in __aa_create_ns() (bsc#1106427).\n- apparmor: fix mediation of prlimit (bsc#1051510).\n- apparmor: fix memory leak when deduping profile load (bsc#1051510).\n- apparmor: fix ptrace read check (bsc#1051510).\n- apparmor: remove no-op permission check in policy_unpack (bsc#1106427).\n- arm/asm/tlb.h: Fix build error implicit func declaration (bsc#1105467 Reduce IPIs and atomic ops with improved lazy TLB).\n- arm64/acpi: Create arch specific cpu to acpi id helper (bsc#1106903).\n- arm64/kasan: do not allocate extra shadow memory (bsc#1106897).\n- arm64/mm/kasan: do not use vmemmap_populate() to initialize shadow (bsc#1106898).\n- arm64: Enforce BBM for huge IO/VMAP mappings (bsc#1106890).\n- arm64: Ignore hardware dirty bit updates in ptep_set_wrprotect() (bsc#1108010).\n- arm64: Make sure permission updates happen for pmd/pud (bsc#1106891).\n- arm64: dma-mapping: clear buffers allocated with FORCE_CONTIGUOUS flag (bsc#1106902).\n- arm64: enable thunderx gpio driver\n- arm64: export memblock_reserve()d regions via /proc/iomem (bsc#1106892).\n- arm64: fix unwind_frame() for filtered out fn for function graph tracing (bsc#1106900).\n- arm64: fix vmemmap BUILD_BUG_ON() triggering on !vmemmap setups (bsc#1106896).\n- arm64: fpsimd: Avoid FPSIMD context leakage for the init task (bsc#1106894).\n- arm64: kasan: avoid pfn_to_nid() before page array is initialized (bsc#1106899).\n- arm64: mm: Ensure writes to swapper are ordered wrt subsequent cache maintenance (bsc#1106906).\n- arm64: mm: check for upper PAGE_SHIFT bits in pfn_valid() (bsc#1106893).\n- arm64: move patches to sorted section\n- arm64: numa: rework ACPI NUMA initialization (bsc#1106905).\n- arm64: vgic-v2: Fix proxying of cpuif access (bsc#1106901).\n- asix: Check for supported Wake-on-LAN modes (bsc#1051510).\n- ata: Fix ZBC_OUT all bit handling (bsc#1051510).\n- ata: Fix ZBC_OUT command block check (bsc#1051510).\n- ata: libahci: Allow reconfigure of DEVSLP register (bsc#1051510).\n- ata: libahci: Correct setting of DEVSLP register (bsc#1051510).\n- ath10k: disable bundle mgmt tx completion event support (bsc#1051510).\n- ath10k: fix kernel panic issue during pci probe (bsc#1051510).\n- ath10k: fix scan crash due to incorrect length calculation (bsc#1051510).\n- ath10k: fix use-after-free in ath10k_wmi_cmd_send_nowait (bsc#1051510).\n- ath10k: prevent active scans on potential unusable channels (bsc#1051510).\n- ath10k: protect ath10k_htt_rx_ring_free with rx_ring.lock (bsc#1051510).\n- ath10k: update the phymode along with bandwidth change request (bsc#1051510).\n- ath9k: add MSI support ().\n- ath9k: report tx status on EOSP (bsc#1051510).\n- ath9k_hw: fix channel maximum power level test (bsc#1051510).\n- atm: Preserve value of skb-\u003etruesize when accounting to vcc (networking-stable-18_07_19).\n- atm: horizon: Fix irq release error (bsc#1105355).\n- atm: zatm: Fix potential Spectre v1 (networking-stable-18_07_19).\n- atm: zatm: fix memcmp casting (bsc#1105355).\n- audit: Fix extended comparison of GID/EGID (bsc#1051510).\n- audit: allow not equal op for audit by executable (bsc#1051510).\n- audit: fix use-after-free in audit_add_watch (bsc#1051510).\n- autofs: fix autofs_sbi() does not check super block type (git-fixes).\n- autofs: fix slab out of bounds read in getname_kernel() (git-fixes).\n- autofs: mount point create should honour passed in mode (git-fixes).\n- ax88179_178a: Check for supported Wake-on-LAN modes (bsc#1051510).\n- b43/leds: Ensure NUL-termination of LED name string (bsc#1051510).\n- b43legacy/leds: Ensure NUL-termination of LED name string (bsc#1051510).\n- badblocks: fix wrong return value in badblocks_set if badblocks are disabled (git-fixes).\n- batman-adv: Avoid probe ELP information leak (bsc#1051510).\n- batman-adv: Fix multicast TT issues with bogus ROAM flags (bsc#1051510).\n- batman-adv: Fix segfault when writing to sysfs elp_interval (bsc#1051510).\n- batman-adv: Fix segfault when writing to throughput_override (bsc#1051510).\n- batman-adv: Prevent duplicated gateway_node entry (bsc#1051510).\n- batman-adv: Prevent duplicated global TT entry (bsc#1051510).\n- batman-adv: Prevent duplicated nc_node entry (bsc#1051510).\n- batman-adv: Prevent duplicated softif_vlan entry (bsc#1051510).\n- batman-adv: Prevent duplicated tvlv handler (bsc#1051510).\n- batman-adv: fix backbone_gw refcount on queue_work() failure (bsc#1051510).\n- batman-adv: fix hardif_neigh refcount on queue_work() failure (bsc#1051510).\n- bcache: avoid unncessary cache prefetch bch_btree_node_get().\n- bcache: calculate the number of incremental GC nodes according to the total of btree nodes.\n- bcache: display rate debug parameters to 0 when writeback is not running.\n- bcache: do not check return value of debugfs_create_dir().\n- bcache: finish incremental GC.\n- bcache: fix I/O significant decline while backend devices registering.\n- bcache: fix error setting writeback_rate through sysfs interface.\n- bcache: free heap cache_set-\u003eflush_btree in bch_journal_free.\n- bcache: make the pr_err statement used for ENOENT only in sysfs_attatch section.\n- bcache: release dc-\u003ewriteback_lock properly in bch_writeback_thread().\n- bcache: set max writeback rate when I/O request is idle.\n- bcache: simplify the calculation of the total amount of flash dirty data.\n- bdi: Fix another oops in wb_workfn() (bsc#1112746).\n- bdi: Preserve kabi when adding cgwb_release_mutex (bsc#1112746).\n- be2net: Fix memory leak in be_cmd_get_profile_config() (bsc#1086288).\n- be2net: remove unused old AIC info (bsc#1086288).\n- be2net: remove unused old custom busy-poll fields (bsc#1086288 ).\n- binfmt_elf: Respect error return from `regset-\u003eactive' (bsc#1051510).\n- blk-mq: I/O and timer unplugs are inverted in blktrace (bsc#1112713).\n- blk-mq: avoid to synchronize rcu inside blk_cleanup_queue() (bsc#1077989).\n- blkdev: __blkdev_direct_IO_simple: fix leak in error case (bsc#1083663).\n- blkdev_report_zones_ioctl(): Use vmalloc() to allocate large buffers (bsc#1111819).\n- block, bfq: fix wrong init of saved start time for weight raising (bsc#1112708).\n- block, bfq: return nbytes and not zero from struct cftype .write() method (bsc#1106238).\n- block, dax: remove dead code in blkdev_writepages() (bsc#1104888).\n- block: Invalidate cache on discard v2 (bsc#1109992).\n- block: bfq: swap puts in bfqg_and_blkg_put (bsc#1112712).\n- block: bio_iov_iter_get_pages: fix size of last iovec (bsc#1083663).\n- block: bio_iov_iter_get_pages: pin more pages for multi-segment IOs (bsc#1083663).\n- block: bvec_nr_vecs() returns value for wrong slab (bsc#1111834).\n- block: do not print a message when the device went away (bsc#1098459).\n- block: do not warn for flush on read-only device (bsc#1107756).\n- block: fix warning when I/O elevator is changed as request_queue is being removed (bsc#1109979).\n- block: pass inclusive 'lend' parameter to truncate_inode_pages_range (bsc#1109992).\n- block: properly protect the 'queue' kobj in blk_unregister_queue (bsc#1109979).\n- bnx2x: Fix invalid memory access in rss hash config path (bsc#1050319).\n- bnx2x: Fix receiving tx-timeout in error or recovery state (bsc#1050319).\n- bnxt_en: Clean up unused functions (bsc#1086282).\n- bnxt_en: Do not adjust max_cp_rings by the ones used by RDMA (bsc#1086282).\n- bnxt_en: Fix VF mac address regression (bsc#1086282 ).\n- bnxt_re: Fix couple of memory leaks that could lead to IOMMU call traces (bsc#1050244).\n- bonding: avoid lockdep confusion in bond_get_stats() (netfilter-stable-18_08_04).\n- bpf, s390: fix potential memleak when later bpf_jit_prog fails (bsc#1083647).\n- bpf/verifier: disallow pointer subtraction (bsc#1083647).\n- bpf: fix references to free_bpf_prog_info() in comments (bsc#1083647).\n- bpf: fix uninitialized variable in bpf tools (bsc#1083647).\n- bpf: hash map: decrement counter on error (bsc#1083647).\n- bpf: make cavium thunder compatible w/ bpf_xdp_adjust_tail (bsc#1110096).\n- bpf: powerpc64: pad function address loads with NOPs (bsc#1083647).\n- bpf: use GFP_ATOMIC instead of GFP_KERNEL in bpf_parse_prog() (bsc#1083647).\n- brcmfmac: stop watchdog before detach and free everything (bsc#1051510).\n- brcmsmac: fix wrap around in conversion from constant to s16 (bsc#1051510).\n- btrfs: Add checker for EXTENT_CSUM (bsc#1102882, bsc#1102896, bsc#1102879, bsc#1102877, bsc#1102875,).\n- btrfs: Add sanity check for EXTENT_DATA when reading out leaf (bsc#1102882, bsc#1102896, bsc#1102879, bsc#1102877, bsc#1102875,).\n- btrfs: Check if item pointer overlaps with the item itself (bsc#1102882, bsc#1102896, bsc#1102879, bsc#1102877, bsc#1102875,).\n- btrfs: Check that each block group has corresponding chunk at mount time (bsc#1102882, bsc#1102896, bsc#1102879, bsc#1102877, bsc#1102875,).\n- btrfs: Enhance btrfs_trim_fs function to handle error better (Dependency for bsc#1113667).\n- btrfs: Ensure btrfs_trim_fs can trim the whole filesystem (bsc#1113667).\n- btrfs: Fix use-after-free when cleaning up fs_devs with a single stale device (bsc#1097105).\n- btrfs: Fix wrong btrfs_delalloc_release_extents parameter (bsc#1031392).\n- btrfs: Handle error from btrfs_uuid_tree_rem call in _btrfs_ioctl_set_received_subvol (bsc#1097105).\n- btrfs: Introduce mount time chunk dev extent mapping check (bsc#1102882, bsc#1102896, bsc#1102879, bsc#1102877, bsc#1102875,).\n- btrfs: Manually implement device_total_bytes getter/setter (bsc#1043912).\n- btrfs: Move leaf and node validation checker to tree-checker.c (bsc#1102882, bsc#1102896, bsc#1102879, bsc#1102877, bsc#1102875,).\n- btrfs: Remove unused parameters from various functions (bsc#1110649).\n- btrfs: Round down values which are written for total_bytes_size (bsc#1043912).\n- btrfs: Verify that every chunk has corresponding block group at mount time (bsc#1102882, bsc#1102896, bsc#1102879, bsc#1102877, bsc#1102875,).\n- btrfs: add a comp_refs() helper (dependency for bsc#1031392).\n- btrfs: add tracepoints for outstanding extents mods (dependency for bsc#1031392).\n- btrfs: check-integrity: Fix NULL pointer dereference for degraded mount (bsc#1107947).\n- btrfs: cleanup extent locking sequence (dependency for bsc#1031392).\n- btrfs: delayed-inode: Remove wrong qgroup meta reservation calls (bsc#1031392).\n- btrfs: delayed-inode: Use new qgroup meta rsv for delayed inode and item (bsc#1031392).\n- btrfs: fix error handling in btrfs_dev_replace_start (bsc#1107535).\n- btrfs: fix missing error return in btrfs_drop_snapshot (Git-fixes bsc#1109919).\n- btrfs: handle errors while updating refcounts in update_ref_for_cow (Git-fixes bsc#1109915).\n- btrfs: log csums for all modified extents (bsc#1110639).\n- btrfs: make the delalloc block rsv per inode (dependency for bsc#1031392).\n- btrfs: qgroup: Add quick exit for non-fs extents (dependency for bsc#1031392).\n- btrfs: qgroup: Cleanup btrfs_qgroup_prepare_account_extents function (dependency for bsc#1031392).\n- btrfs: qgroup: Cleanup the remaining old reservation counters (bsc#1031392).\n- btrfs: qgroup: Commit transaction in advance to reduce early EDQUOT (bsc#1031392).\n- btrfs: qgroup: Do not use root-\u003eqgroup_meta_rsv for qgroup (bsc#1031392).\n- btrfs: qgroup: Fix qgroup reserved space underflow by only freeing reserved ranges (dependency for bsc#1031392).\n- btrfs: qgroup: Fix qgroup reserved space underflow caused by buffered write and quotas being enabled (dependency for bsc#1031392).\n- btrfs: qgroup: Fix wrong qgroup reservation update for relationship modification (bsc#1031392).\n- btrfs: qgroup: Introduce extent changeset for qgroup reserve functions (dependency for bsc#1031392).\n- btrfs: qgroup: Introduce function to convert META_PREALLOC into META_PERTRANS (bsc#1031392).\n- btrfs: qgroup: Introduce helpers to update and access new qgroup rsv (bsc#1031392).\n- btrfs: qgroup: Make qgroup_reserve and its callers to use separate reservation type (bsc#1031392).\n- btrfs: qgroup: Return actually freed bytes for qgroup release or free data (dependency for bsc#1031392).\n- btrfs: qgroup: Skeleton to support separate qgroup reservation type (bsc#1031392).\n- btrfs: qgroup: Split meta rsv type into meta_prealloc and meta_pertrans (bsc#1031392).\n- btrfs: qgroup: Update trace events for metadata reservation (bsc#1031392).\n- btrfs: qgroup: Update trace events to use new separate rsv types (bsc#1031392).\n- btrfs: qgroup: Use independent and accurate per inode qgroup rsv (bsc#1031392).\n- btrfs: qgroup: Use root::qgroup_meta_rsv_* to record qgroup meta reserved space (bsc#1031392).\n- btrfs: qgroup: Use separate meta reservation type for delalloc (bsc#1031392).\n- btrfs: remove type argument from comp_tree_refs (dependency for bsc#1031392).\n- btrfs: round down size diff when shrinking/growing device (bsc#1097105).\n- btrfs: scrub: Do not use inode page cache in scrub_handle_errored_block() (follow up for bsc#1108096).\n- btrfs: scrub: Do not use inode pages for device replace (follow up for bsc#1108096).\n- btrfs: switch args for comp_*_refs (dependency for bsc#1031392).\n- btrfs: tests/qgroup: Fix wrong tree backref level (bsc#1107928).\n- btrfs: tree-checker: Add checker for dir item (bsc#1102882, bsc#1102896, bsc#1102879, bsc#1102877, bsc#1102875,).\n- btrfs: tree-checker: Detect invalid and empty essential trees (bsc#1102882, bsc#1102896, bsc#1102879, bsc#1102877, bsc#1102875,).\n- btrfs: tree-checker: Enhance btrfs_check_node output (bsc#1102882, bsc#1102896, bsc#1102879, bsc#1102877, bsc#1102875,).\n- btrfs: tree-checker: Enhance output for btrfs_check_leaf (bsc#1102882, bsc#1102896, bsc#1102879, bsc#1102877, bsc#1102875,).\n- btrfs: tree-checker: Enhance output for check_csum_item (bsc#1102882, bsc#1102896, bsc#1102879, bsc#1102877, bsc#1102875,).\n- btrfs: tree-checker: Enhance output for check_extent_data_item (bsc#1102882, bsc#1102896, bsc#1102879, bsc#1102877, bsc#1102875,).\n- btrfs: tree-checker: Fix false panic for sanity test (bsc#1102882, bsc#1102896, bsc#1102879, bsc#1102877, bsc#1102875,).\n- btrfs: tree-checker: Replace root parameter with fs_info (bsc#1102882, bsc#1102896, bsc#1102879, bsc#1102877, bsc#1102875,).\n- btrfs: tree-checker: Verify block_group_item (bsc#1102882, bsc#1102896, bsc#1102879, bsc#1102877, bsc#1102875,).\n- btrfs: tree-checker: use %zu format string for size_t (bsc#1102882, bsc#1102896, bsc#1102879, bsc#1102877, bsc#1102875,).\n- btrfs: tree-checker: use %zu format string for size_t (bsc#1102882, bsc#1102896, bsc#1102879, bsc#1102877, bsc#1102875,).\n- cdc-acm: fix race between reset and control messaging (bsc#1051510).\n- cdrom: Fix info leak/OOB read in cdrom_ioctl_drive_status (bsc#1051510).\n- ceph: avoid a use-after-free in ceph_destroy_options() (bsc#1111983).\n- ceph: fix incorrect use of strncpy (bsc#1107319).\n- ceph: return errors from posix_acl_equiv_mode() correctly (bsc#1107320).\n- cfg80211: fix a type issue in ieee80211_chandef_to_operating_class() (bsc#1051510).\n- cfg80211: nl80211_update_ft_ies() to validate NL80211_ATTR_IE (bsc#1051510).\n- cfg80211: reg: Init wiphy_idx in regulatory_hint_core() (bsc#1051510).\n- cgroup: avoid copying strings longer than the buffers (bsc#1051510).\n- cifs: Fix stack out-of-bounds in smb{2,3}_create_lease_buf() (bsc#1051510).\n- cifs: Fix use after free of a mid_q_entry (bsc#1112903).\n- cifs: check kmalloc before use (bsc#1051510).\n- cifs: fix memory leak in SMB2_open() (bsc#1112894).\n- cifs: integer overflow in in SMB2_ioctl() (bsc#1051510).\n- cifs: store the leaseKey in the fid on SMB2_open (bsc#1051510).\n- clk: clk-fixed-factor: Clear OF_POPULATED flag in case of failure (bsc#1051510).\n- clk: core: Potentially free connection id (bsc#1051510).\n- clk: imx6ul: fix missing of_node_put() (bsc#1051510).\n- clk: meson: gxbb: remove HHI_GEN_CLK_CTNL duplicate definition (bsc#1051510).\n- clk: mvebu: armada-38x: add support for 1866MHz variants (bsc#1105355).\n- clk: mvebu: armada-38x: add support for missing clocks (bsc#1105355).\n- clk: rockchip: Add pclk_rkpwm_pmu to PMU critical clocks in rk3399 (bsc#1051510).\n- clk: rockchip: fix clk_i2sout parent selection bits on rk3399 (bsc#1051510).\n- clk: tegra: bpmp: Do not crash when a clock fails to register (bsc#1051510).\n- clk: x86: Stop marking clocks as CLK_IS_CRITICAL (bsc#1051510).\n- clk: x86: add 'ether_clk' alias for Bay Trail / Cherry Trail (bsc#1051510).\n- clocksource/drivers/ti-32k: Add CLOCK_SOURCE_SUSPEND_NONSTOP flag for non-am43 SoCs (bsc#1051510).\n- clocksource/drivers/timer-atmel-pit: Properly handle error cases (bsc#1051510).\n- cls_matchall: fix tcf_unbind_filter missing (networking-stable-18_08_21).\n- coda: fix 'kernel memory exposure attempt' in fsync (bsc#1051510).\n- coresight: Handle errors in finding input/output ports (bsc#1051510).\n- coresight: tpiu: Fix disabling timeouts (bsc#1051510).\n- cpu/hotplug: Fix SMT supported evaluation (bsc#1110006).\n- cpufreq / CPPC: Set platform specific transition_delay_us (bsc#1101480).\n- cpufreq, intel_pstate: Allow unspecified FADT profile to probe PPC (bsc#1108841).\n- cpufreq: CPPC: Do not set transition_latency (bsc#1101480).\n- cpufreq: CPPC: Use transition_delay_us depending transition_latency (bsc#1101480).\n- cpufreq: remove setting of policy-\u003ecpu in policy-\u003ecpus during init (bsc#1101480).\n- crypto: ablkcipher - fix crash flushing dcache in error path (bsc#1051510).\n- crypto: blkcipher - fix crash flushing dcache in error path (bsc#1051510).\n- crypto: caam - fix implicit casts in endianness helpers (bsc#1051510).\n- crypto: caam/jr - fix ablkcipher_edesc pointer arithmetic (bsc#1051510).\n- crypto: caam/jr - fix descriptor DMA unmapping (bsc#1051510).\n- crypto: caam/qi - fix error path in xts setkey (bsc#1051510).\n- crypto: cavium/nitrox - fix for command corruption in queue full case with backlog submissions (bsc#1051510).\n- crypto: ccp - Check for NULL PSP pointer at module unload (bsc#1051510).\n- crypto: ccp - Fix command completion detection race (bsc#1051510).\n- crypto: ccp - add timeout support in the SEV command (bsc#1106838).\n- crypto: chelsio - Fix memory corruption in DMA Mapped buffers (bsc#1051510).\n- crypto: clarify licensing of OpenSSL asm code ().\n- crypto: lrw - Fix out-of bounds access on counter overflow (bsc#1051510).\n- crypto: mxs-dcp - Fix wait logic on chan threads (bsc#1051510).\n- crypto: qat - Fix KASAN stack-out-of-bounds bug in adf_probe() (bsc#1051510).\n- crypto: sharah - Unregister correct algorithms for SAHARA 3 (bsc#1051510).\n- crypto: skcipher - Fix -Wstringop-truncation warnings (bsc#1051510).\n- crypto: skcipher - fix aligning block size in skcipher_copy_iv() (bsc#1051510).\n- crypto: skcipher - fix crash flushing dcache in error path (bsc#1051510).\n- crypto: tcrypt - fix ghash-generic speed test (bsc#1051510).\n- crypto: vmac - require a block cipher with 128-bit block size (bsc#1051510).\n- crypto: vmac - separate tfm and request context (bsc#1051510).\n- crypto: vmx - Fix sleep-in-atomic bugs (bsc#1051510).\n- crypto: vmx - Use skcipher for ctr fallback to SLE12-SP4 (bsc#1106464).\n- crypto: x86/sha256-mb - fix digest copy in sha256_mb_mgr_get_comp_job_avx2() (bsc#1051510).\n- cxgb4: Fix the condition to check if the card is T5 (bsc#1097585 bsc#1097586 bsc#1097587 bsc#1097588 bsc#1097583 bsc#1097584).\n- cxgb4: fix abort_req_rss6 struct (bsc#1046540).\n- cxgb4: when disabling dcb set txq dcb priority to 0 (bsc#1046540 ).\n- cxl: Configure PSL to not use APC virtual machines (bsc#1055014, git-fixes).\n- cxl: Fix wrong comparison in cxl_adapter_context_get() (bsc#1055014, git-fixes).\n- dax: Fix deadlock in dax_lock_mapping_entry() (bsc#1109951).\n- dax: Introduce a -\u003ecopy_to_iter dax operation (bsc#1098782).\n- dax: Make extension of dax_operations transparent (bsc#1098782).\n- dax: Report bytes remaining in dax_iomap_actor() (bsc#1098782).\n- dax: remove VM_MIXEDMAP for fsdax and device dax (bsc#1106007).\n- dax: remove default copy_from_iter fallback (bsc#1098782). \n- dax: require 'struct page' by default for filesystem dax (bsc#1104888).\n- dax: store pfns in the radix (bsc#1104888).\n- dccp: fix undefined behavior with 'cwnd' shift in ccid2_cwnd_restart() (netfilter-stable-18_08_17).\n- debugobjects: Make stack check warning more informative (bsc#1051510).\n- declance: Fix continuation with the adapter identification message (bsc#1051510).\n- device-dax: Add missing address_space_operations (bsc#1107783).\n- device-dax: Enable page_mapping() (bsc#1107783).\n- device-dax: Set page-\u003eindex (bsc#1107783).\n- devicectree: bindings: fix location of leds common file (bsc#1051510).\n- dma-buf: remove redundant initialization of sg_table (bsc#1051510).\n- dmaengine: hsu: Support dmaengine_terminate_sync() (bsc#1051510).\n- dmaengine: idma64: Support dmaengine_terminate_sync() (bsc#1051510).\n- dmaengine: mv_xor_v2: kill the tasklets upon exit (bsc#1051510).\n- dmaengine: pl330: fix irq race with terminate_all (bsc#1051510).\n- do d_instantiate/unlock_new_inode combinations safely (git-fixes).\n- doc/README.SUSE: Remove mentions of cloneconfig (bsc#1103636).\n- driver core: add __printf verification to __ata_ehi_pushv_desc (bsc#1051510).\n- drivers/base: stop new probing during shutdown (bsc#1051510).\n- drivers/tty: add error handling for pcmcia_loop_config (bsc#1051510).\n- drm/amd/pp/Polaris12: Fix a chunk of registers missed to program (bsc#1051510).\n- drm/amdgpu/powerplay: fix missing break in switch statements (bsc#1113722)\n- drm/amdgpu: Enable/disable gfx PG feature in rlc safe mode (bsc#1051510).\n- drm/amdgpu: Fix RLC safe mode test in gfx_v9_0_enter_rlc_safe_mode (bsc#1051510).\n- drm/amdgpu: Fix SDMA HQD destroy error on gfx_v7 (bsc#1051510).\n- drm/amdgpu: Fix vce work queue was not cancelled when suspend (bsc#1106110)\n- drm/amdgpu: Pulling old prepare and submit for flip back (bsc#1051510).\n- drm/amdgpu: Update power state at the end of smu hw_init (bsc#1051510).\n- drm/amdgpu: add another ATPX quirk for TOPAZ (bsc#1051510).\n- drm/amdgpu: add new polaris pci id (bsc#1051510).\n- drm/amdgpu: fix error handling in amdgpu_cs_user_fence_chunk (bsc#1106110)\n- drm/amdgpu: fix swapped emit_ib_size in vce3 (bsc#1051510).\n- drm/amdgpu: revert 'fix deadlock of reservation between cs and gpu reset v2' (bsc#1051510).\n- drm/amdgpu: update tmr mc address (bsc#1100132).\n- drm/amdgpu:add new firmware id for VCN (bsc#1051510).\n- drm/amdgpu:add tmr mc address into amdgpu_firmware_info (bsc#1051510).\n- drm/amdkfd: Fix error codes in kfd_get_process (bsc#1051510).\n- drm/arm/malidp: Preserve LAYER_FORMAT contents when setting format (bsc#1051510).\n- drm/armada: fix colorkey mode property (bsc#1051510).\n- drm/armada: fix irq handling (bsc#1051510).\n- drm/bridge/sii8620: Fix display of packed pixel modes (bsc#1051510).\n- drm/bridge/sii8620: fix display of packed pixel modes in MHL2 (bsc#1051510).\n- drm/bridge/sii8620: fix loops in EDID fetch logic (bsc#1051510).\n- drm/bridge: adv7511: Reset registers on hotplug (bsc#1051510).\n- drm/edid: Add 6 bpc quirk for SDC panel in Lenovo B50-80 (bsc#1051510).\n- drm/edid: VSDB yCBCr420 Deep Color mode bit definitions (bsc#1051510).\n- drm/exynos: decon5433: Fix WINCONx reset value (bsc#1051510).\n- drm/exynos: decon5433: Fix per-plane global alpha for XRGB modes (bsc#1051510).\n- drm/exynos: gsc: Fix support for NV16/61, YUV420/YVU420 and YUV422 modes (bsc#1051510).\n- drm/fb-helper: Fix typo on kerneldoc (bsc#1051510).\n- drm/hisilicon: hibmc: Do not carry error code in HiBMC framebuffer (bsc#1113722)\n- drm/hisilicon: hibmc: Do not overwrite fb helper surface depth (bsc#1113722)\n- drm/i915/aml: Introducing Amber Lake platform ().\n- drm/i915/audio: Fix audio enumeration issue on BXT ().\n- drm/i915/audio: Hook up component bindings even if displays are (bsc#1113722)\n- drm/i915/cfl: Add a new CFL PCI ID ().\n- drm/i915/dp: Link train Fallback on eDP only if fallback link BW can fit panel's native mode (bsc#1051510).\n- drm/i915/gen9+: Fix initial readout for Y tiled framebuffers (bsc#1113722)\n- drm/i915/glk: Add Quirk for GLK NUC HDMI port issues (bsc#1051510).\n- drm/i915/gvt: Fix the incorrect length of child_device_config issue (bsc#1051510).\n- drm/i915/gvt: Off by one in intel_vgpu_write_fence() (bsc#1051510).\n- drm/i915/gvt: clear ggtt entries when destroy vgpu (bsc#1051510).\n- drm/i915/gvt: request srcu_read_lock before checking if one gfn is valid (bsc#1051510).\n- drm/i915/kvmgt: Fix potential Spectre v1 (bsc#1051510).\n- drm/i915/lpe: Mark LPE audio runtime pm as 'no callbacks' (bsc#1051510).\n- drm/i915/overlay: Allocate physical registers from stolen (bsc#1051510).\n- drm/i915/whl: Introducing Whiskey Lake platform ().\n- drm/i915: Handle incomplete Z_FINISH for compressed error states (bsc#1100132)\n- drm/i915: Increase LSPCON timeout (bsc#1051510).\n- drm/i915: Nuke the LVDS lid notifier (bsc#1051510).\n- drm/i915: Only show debug for state changes when banning (bsc#1051510).\n- drm/i915: Restore user forcewake domains across suspend (bsc#1100132).\n- drm/i915: Restore vblank interrupts earlier (bsc#1051510).\n- drm/i915: Unmask user interrupts writes into HWSP on snb/ivb/vlv/hsw (bsc#1051510).\n- drm/i915: set DP Main Stream Attribute for color range on DDI platforms (bsc#1051510).\n- drm/imx: imx-ldb: check if channel is enabled before printing warning (bsc#1051510).\n- drm/imx: imx-ldb: disable LDB on driver bind (bsc#1051510).\n- drm/mediatek: fix OF sibling-node lookup (bsc#1106110)\n- drm/modes: Introduce drm_mode_match() ().\n- drm/msm: fix OF child-node lookup (bsc#1106110)\n- drm/nouveau/TBDdevinit: do not fail when PMU/PRE_OS is missing from VBIOS (bsc#1051510).\n- drm/nouveau/debugfs: Wake up GPU before doing any reclocking (bsc#1051510).\n- drm/nouveau/disp: fix DP disable race (bsc#1051510).\n- drm/nouveau/drm/nouveau: Do not forget to cancel hpd_work on suspend/unload (bsc#1051510).\n- drm/nouveau/drm/nouveau: Fix bogus drm_kms_helper_poll_enable() placement (bsc#1051510).\n- drm/nouveau/drm/nouveau: Prevent handling ACPI HPD events too early (bsc#1051510).\n- drm/nouveau/drm/nouveau: Use pm_runtime_get_noresume() in connector_detect() (bsc#1051510).\n- drm/nouveau: Do not disable polling in fallback mode (bsc#1103356).\n- drm/nouveau: Fix deadlocks in nouveau_connector_detect() (bsc#1051510).\n- drm/nouveau: Fix runtime PM leak in drm_open() (bsc#1051510).\n- drm/nouveau: tegra: Detach from ARM DMA/IOMMU mapping (bsc#1051510).\n- drm/panel: type promotion bug in s6e8aa0_read_mtp_id() (bsc#1051510).\n- drm/rockchip: lvds: add missing of_node_put (bsc#1051510).\n- drm/sti: do not remove the drm_bridge that was never added (bsc#1100132)\n- drm/sun4i: Fix an ulong overflow in the dotclock driver (bsc#1106110)\n- drm/sun4i: Fix releasing node when enumerating enpoints (bsc#1051510).\n- drm/tegra: Check for malformed offsets and sizes in the 'submit' IOCTL (bsc#1106170).\n- drm/tegra: Fix comparison operator for buffer size (bsc#1100132).\n- drm/vc4: Fix the 'no scaling' case on multi-planar YUV formats (bsc#1051510).\n- drm/virtio: fix bounds check in virtio_gpu_cmd_get_capset() (bsc#1113722)\n- drm: Add DRM client cap for aspect-ratio ().\n- drm: Add and handle new aspect ratios in DRM layer ().\n- drm: Add aspect ratio parsing in DRM layer ().\n- drm: Expose modes with aspect ratio, only if requested ().\n- drm: Handle aspect ratio info in legacy modeset path ().\n- drm: mali-dp: Call drm_crtc_vblank_reset on device init (bsc#1051510).\n- drm: mali-dp: Enable Global SE interrupts mask for DP500 (bsc#1051510).\n- drm: udl: Destroy framebuffer only if it was initialized (bsc#1051510).\n- dwc2: gadget: Fix ISOC IN DDMA PID bitfield value calculation (bsc#1051510).\n- e1000: check on netif_running() before calling e1000_up() (bsc#1051510).\n- e1000: ensure to free old tx/rx rings in set_ringparam() (bsc#1051510).\n- eeprom: at24: change nvmem stride to 1 (bsc#1051510).\n- eeprom: at24: check at24_read/write arguments (bsc#1051510).\n- eeprom: at24: correctly set the size for at24mac402 (bsc#1051510).\n- efi: Avoid potential crashes, fix the 'struct efi_pci_io_protocol_32' definition for mixed mode (bsc#1110006).\n- enable CONFIG_SCSI_MQ_DEFAULT (bsc#1107207)\n- enable MLX5 in azure (bsc#1108260)\n- enic: do not call enic_change_mtu in enic_probe (bsc#1051510).\n- enic: handle mtu change for vf properly (bsc#1051510).\n- enic: initialize enic-\u003erfs_h.lock in enic_probe (bsc#1051510).\n- errseq: Add to documentation tree (bsc#1107008).\n- errseq: Always report a writeback error once (bsc#1107008).\n- ethtool: Remove trailing semicolon for static inline (bsc#1051510).\n- ethtool: fix a privilege escalation bug (bsc#1076830).\n- evm: Do not deadlock if a crypto algorithm is unavailable (bsc#1051510).\n- ext2, dax: introduce ext2_dax_aops (bsc#1104888).\n- ext2, dax: set ext2_dax_aops for dax files (bsc#1112554).\n- ext2: auto disable dax instead of failing mount (bsc#1104888).\n- ext4, dax: add ext4_bmap to ext4_dax_aops (bsc#1104888).\n- ext4, dax: introduce ext4_dax_aops (bsc#1104888).\n- ext4, dax: set ext4_dax_aops for dax files (bsc#1104888).\n- ext4: auto disable dax instead of failing mount (bsc#1104888).\n- ext4: avoid arithemetic overflow that can trigger a BUG (bsc#1112736).\n- ext4: avoid divide by zero fault when deleting corrupted inline directories (bsc#1112735).\n- ext4: check for NUL characters in extended attribute's name (bsc#1112732).\n- ext4: check to make sure the rename(2)'s destination is not freed (bsc#1112734).\n- ext4: do not mark mmp buffer head dirty (bsc#1112743).\n- ext4: fix online resize's handling of a too-small final block group (bsc#1112739).\n- ext4: fix online resizing for bigalloc file systems with a 1k block size (bsc#1112740).\n- ext4: fix spectre gadget in ext4_mb_regular_allocator() (bsc#1112733).\n- ext4: recalucate superblock checksum after updating free blocks/inodes (bsc#1112738).\n- ext4: reset error code in ext4_find_entry in fallback (bsc#1112731).\n- ext4: show test_dummy_encryption mount option in /proc/mounts (bsc#1112741).\n- ext4: sysfs: print ext4_super_block fields as little-endian (bsc#1106229).\n- extcon: Release locking when sending the notification of connector state (bsc#1051510).\n- f2fs: remove unneeded memory footprint accounting (bsc#1106233).\n- f2fs: remove unneeded memory footprint accounting (bsc#1106297).\n- f2fs: validate before set/clear free nat bitmap (bsc#1106231).\n- f2fs: validate before set/clear free nat bitmap (bsc#1106297).\n- fat: fix memory allocation failure handling of match_strdup() (bsc#1051510).\n- fb: fix lost console when the user unplugs a USB adapter (bsc#1051510).\n- fbdev/omapfb: fix omapfb_memory_read infoleak (bsc#1051510).\n- fbdev/via: fix defined but not used warning (bsc#1051510).\n- fbdev: Distinguish between interlaced and progressive modes (bsc#1051510).\n- fbdev: omapfb: off by one in omapfb_register_client() (bsc#1051510).\n- filesystem-dax: Introduce dax_lock_mapping_entry() (bsc#1107783).\n- filesystem-dax: Set page-\u003eindex (bsc#1107783).\n- firmware, DMI: Add function to look up a handle and return DIMM size (bsc#1099125).\n- firmware: raspberrypi: Register hwmon driver (bsc#1108468).\n- fix __legitimize_mnt()/mntput() race (bsc#1106297).\n- fix a page leak in vhost_scsi_iov_to_sgl() error recovery (bsc#1051510).\n- fix mntput/mntput race (bsc#1106297).\n- floppy: Do not copy a kernel pointer to user memory in FDGETPRM ioctl (bsc#1051510).\n- fs, dax: prepare for dax-specific address_space_operations (bsc#1104888).\n- fs, dax: use page-\u003emapping to warn if truncate collides with a busy page (bsc#1104888).\n- fs/9p/xattr.c: catch the error of p9_client_clunk when setting xattr failed (bsc#1051510).\n- fs/dcache.c: fix kmemcheck splat at take_dentry_name_snapshot() (git-fixes).\n- fs/proc/proc_sysctl.c: fix potential page fault while unregistering sysctl table (bsc#1106297).\n- fs/quota: Fix spectre gadget in do_quotactl (bsc#1112745).\n- fs: dcache: Avoid livelock between d_alloc_parallel and __d_add (git-fixes).\n- fs: dcache: Use READ_ONCE when accessing i_dir_seq (git-fixes).\n- fuse: Add missed unlock_page() to fuse_readpages_fill() (bsc#1106291).\n- fuse: Do not access pipe-\u003ebuffers without pipe_lock() (bsc#1051510).\n- fuse: Fix oops at process_init_reply() (bsc#1106291).\n- fuse: fix double request_end() (bsc#1106291).\n- fuse: fix initial parallel dirops (bsc#1106291).\n- fuse: fix unlocked access to processing queue (bsc#1106291).\n- fuse: umount should wait for all requests (bsc#1106291).\n- gen_stats: Fix netlink stats dumping in the presence of padding (netfilter-stable-18_07_23).\n- genirq: Add handle_fasteoi_{level,edge}_irq flow handlers (bsc#1105378).\n- genirq: Export more irq_chip_*_parent() functions (bsc#1105378).\n- getname_kernel() needs to make sure that -\u003ename != -\u003einame in long case (git-fixes).\n- getxattr: use correct xattr length (bsc#1106235).\n- getxattr: use correct xattr length (bsc#1106297).\n- gpio: Add gpio driver support for ThunderX and OCTEON-TX (bsc#1105378).\n- gpio: Fix crash due to registration race (bsc#1051510).\n- gpio: Fix wrong rounding in gpio-menz127 (bsc#1051510).\n- gpio: adp5588: Fix sleep-in-atomic-context bug (bsc#1051510).\n- gpio: mb86s70: Revert 'Return error if requesting an already assigned gpio' (bsc#1051510).\n- gpio: ml-ioh: Fix buffer underwrite on probe error path (bsc#1051510).\n- gpio: pxa: Fix potential NULL dereference (bsc#1051510).\n- gpio: tegra: Move driver registration to subsys_init level (bsc#1051510).\n- gpio: thunderx: fix error return code in thunderx_gpio_probe() (bsc#1105378).\n- gpio: thunderx: remove unused .map() hook from irq_domain_ops (bsc#1105378).\n- gpiolib-acpi: Register GpioInt ACPI event handlers from a late_initcall (bsc#1051510).\n- gpiolib-acpi: make sure we trigger edge events at least once on boot (bsc#1051510).\n- gpiolib: Free the last requested descriptor (bsc#1051510).\n- gpiolib: Mark gpio_suffixes array with __maybe_unused (bsc#1051510).\n- gpiolib: acpi: Switch to cansleep version of GPIO library call (bsc#1051510).\n- gpu: host1x: Check whether size of unpin isn't 0 (bsc#1051510).\n- gpu: ipu-v3: csi: pass back mbus_code_to_bus_cfg error codes (bsc#1051510).\n- gpu: ipu-v3: default to id 0 on missing OF alias (bsc#1051510).\n- hfs: prevent crash on exit from failed search (bsc#1051510).\n- hfsplus: do not return 0 when fill_super() failed (bsc#1051510).\n- hfsplus: stop workqueue when fill_super() failed (bsc#1051510).\n- hotplug/cpu: Add operation queuing function ().\n- hotplug/cpu: Conditionally acquire/release DRC index ().\n- hotplug/cpu: Provide CPU readd operation ().\n- hv: Synthetic typo correction (bsc#1107207).\n- hv: add SPDX license id to Kconfig (bsc#1107207).\n- hv: add SPDX license to trace (bsc#1107207).\n- hv: avoid crash in vmbus sysfs files (bsc#1108377).\n- hv_balloon: trace post_status (bsc#1107207).\n- hv_netvsc: Add NetVSP v6 and v6.1 into version negotiation (bsc#1107207).\n- hv_netvsc: Add handlers for ethtool get/set msg level (bsc#1107207).\n- hv_netvsc: Add per-cpu ethtool stats for netvsc (bsc#1107207).\n- hv_netvsc: Add range checking for rx packet offset and length (bsc#1107207).\n- hv_netvsc: Clean up extra parameter from rndis_filter_receive_data() (bsc#1107207).\n- hv_netvsc: Fix a deadlock by getting rtnl lock earlier in netvsc_probe() (bsc#1107207).\n- hv_netvsc: Fix the return status in RX path (bsc#1107207).\n- hv_netvsc: Fix the variable sizes in ipsecv2 and rsc offload (bsc#1107207).\n- hv_netvsc: Pass net_device parameter to revoke and teardown functions (bsc#1107207).\n- hv_netvsc: add trace points (bsc#1107207).\n- hv_netvsc: fix bogus ifalias on network device (bsc#1107207).\n- hv_netvsc: fix network namespace issues with VF support (bsc#1107207).\n- hv_netvsc: fix schedule in RCU context ().\n- hv_netvsc: fix schedule in RCU context (bsc#1107207).\n- hv_netvsc: fix vf serial matching with pci slot info (bsc#1107207).\n- hv_netvsc: ignore devices that are not PCI (bsc#1107207).\n- hv_netvsc: move VF to same namespace as netvsc device (bsc#1107207).\n- hv_netvsc: pair VF based on serial number (bsc#1107207).\n- hv_netvsc: pass netvsc_device to rndis halt (bsc#1107207).\n- hv_netvsc: propogate Hyper-V friendly name into interface alias (bsc#1107207).\n- hv_netvsc: select needed ucs2_string routine (bsc#1107207).\n- hv_netvsc: simplify receive side calling arguments (bsc#1107207).\n- hv_netvsc: typo in NDIS RSS parameters structure (bsc#1107207).\n- hv_vmbus: Correct the stale comments regarding cpu affinity (bsc#1107207).\n- hwmon: (adt7475) Make adt7475_read_word() return errors (bsc#1051510).\n- hwmon: (ina2xx) fix sysfs shunt resistor read access (bsc#1051510).\n- hwmon: (nct6775) Set weight source to zero correctly (bsc#1051510).\n- hwmon: Add support for RPi voltage sensor (bsc#1108468).\n- hwmon: rpi: add module alias to raspberrypi-hwmon (bsc#1108468).\n- hwrng: core - document the quality field (bsc#1051510).\n- hyper-v: use GFP_KERNEL for hv_context.hv_numa_map (bsc#1107207).\n- hypfs_kill_super(): deal with failed allocations (bsc#1051510).\n- i2c: core: ACPI: Properly set status byte to 0 for multi-byte writes (bsc#1051510).\n- i2c: davinci: Avoid zero value of CLKH (bsc#1051510).\n- i2c: i2c-scmi: fix for i2c_smbus_write_block_data (bsc#1051510).\n- i2c: i801: Add missing documentation entries for Braswell and Kaby Lake (bsc#1051510).\n- i2c: i801: Add support for Intel Cedar Fork (bsc#1051510).\n- i2c: i801: Add support for Intel Ice Lake (bsc#1051510).\n- i2c: i801: Allow ACPI AML access I/O ports not reserved for SMBus (bsc#1051510).\n- i2c: i801: Consolidate chipset names in documentation and Kconfig (bsc#1051510).\n- i2c: i801: fix DNV's SMBCTRL register offset (bsc#1051510).\n- i2c: imx: Fix race condition in dma read (bsc#1051510).\n- i2c: rcar: cleanup DMA for all kinds of failure (bsc#1051510).\n- i2c: uniphier-f: issue STOP only for last message or I2C_M_STOP (bsc#1051510).\n- i2c: uniphier: issue STOP only for last message or I2C_M_STOP (bsc#1051510).\n- i2c: xiic: Make the start and the byte count write atomic (bsc#1051510).\n- i2c: xlp9xx: Fix case where SSIF read transaction completes early (bsc#1105907).\n- i2c: xlp9xx: Fix issue seen when updating receive length (bsc#1105907).\n- i2c: xlp9xx: Make sure the transfer size is not more than I2C_SMBUS_BLOCK_SIZE (bsc#1105907).\n- i40e: fix condition of WARN_ONCE for stat strings (bsc#1107522).\n- ib_srpt: Fix a use-after-free in srpt_close_ch() (bsc#1046306 ).\n- ibmvnic: Include missing return code checks in reset function (bsc#1107966).\n- ieee802154: ca8210: fix uninitialised data read (bsc#1051510).\n- ieee802154: fix gcc-4.9 warnings (bsc#1051510).\n- ieee802154: mrf24j40: fix incorrect mask in mrf24j40_stop (bsc#1051510).\n- iio: 104-quad-8: Fix off-by-one error in register selection (bsc#1051510).\n- iio: ad9523: Fix displayed phase (bsc#1051510).\n- iio: ad9523: Fix return value for ad952x_store() (bsc#1051510).\n- iio: adc: at91: fix acking DRDY irq on simple conversions (bsc#1051510).\n- iio: adc: at91: fix wrong channel number in triggered buffer mode (bsc#1051510).\n- iio: adc: imx25-gcq: Fix leak of device_node in mx25_gcq_setup_cfgs() (bsc#1051510).\n- iio: adc: ina2xx: avoid kthread_stop() with stale task_struct (bsc#1051510).\n- iio: adc: sun4i-gpadc: select REGMAP_IRQ (bsc#1051510).\n- iio: sca3000: Fix an error handling path in 'sca3000_probe()' (bsc#1051510).\n- iio: sca3000: Fix missing return in switch (bsc#1051510).\n- ima: based on policy verify firmware signatures (pre-allocated buffer) (bsc#1051510).\n- include/rdma/opa_addr.h: Fix an endianness issue (bsc#1046306 ).\n- input: rohm_bu21023: switch to i2c_lock_bus(..., I2C_LOCK_SEGMENT) (bsc#1051510).\n- intel_th: Fix device removal logic (bsc#1051510).\n- intel_th: pci: Add Ice Lake PCH support (bsc#1051510).\n- iommu/amd: Add support for IOMMU XT mode ().\n- iommu/amd: Add support for higher 64-bit IOMMU Control Register ().\n- iommu/amd: Clear memory encryption mask from physical address (bsc#1106105).\n- iommu/amd: Finish TLB flush in amd_iommu_unmap() (bsc#1106105).\n- iommu/amd: Return devid as alias for ACPI HID devices (bsc#1106105).\n- iommu/amd: make sure TLB to be flushed before IOVA freed (bsc#1106105).\n- iommu/arm-smmu-v3: Do not free page table ops twice (bsc#1106237).\n- iommu/arm-smmu: Error out only if not enough context interrupts (bsc#1106237).\n- iommu/vt-d: Add definitions for PFSID (bsc#1106237).\n- iommu/vt-d: Fix a potential memory leak (bsc#1106105).\n- iommu/vt-d: Fix dev iotlb pfsid use (bsc#1106237).\n- iommu/vt-d: Fix scatterlist offset handling (bsc#1106237).\n- iommu/vt-d: Ratelimit each dmar fault printing (bsc#1106105).\n- ioremap: Update pgtable free interfaces with addr (bsc#1110006).\n- ip: hash fragments consistently (netfilter-stable-18_07_27).\n- ip: in cmsg IP(V6)_ORIGDSTADDR call pskb_may_pull (netfilter-stable-18_07_27).\n- ipc/shm: fix shmat() nil address after round-down when remapping (bsc#1090078).\n- ipmi/powernv: Fix error return code in ipmi_powernv_probe() (git-fixes).\n- ipmi: Fix some counter issues (bsc#1105907).\n- ipmi: Move BT capabilities detection to the detect call (bsc#1106779).\n- ipmi: Remove ACPI SPMI probing from the SSIF (I2C) driver (bsc#1105907).\n- ipmi:bt: Set the timeout before doing a capabilities check (bsc#1051510).\n- ipmi:ssif: Add support for multi-part transmit messages \u003e 2 parts (bsc#1103308).\n- ipv4: Return EINVAL when ping_group_range sysctl does not map to user ns (netfilter-stable-18_07_23).\n- ipv4: fix use-after-free in ip_cmsg_recv_dstaddr() (git-fixes).\n- ipv4: remove BUG_ON() from fib_compute_spec_dst (netfilter-stable-18_08_01).\n- ipv6: fix useless rol32 call on hash (netfilter-stable-18_07_23).\n- ipv6: ila: select CONFIG_DST_CACHE (netfilter-stable-18_07_23).\n- ipv6: make DAD fail with enhanced DAD when nonce length differs (netfilter-stable-18_07_23).\n- ipv6: sr: fix passing wrong flags to crypto_alloc_shash() (networking-stable-18_07_19).\n- ipvlan: fix IFLA_MTU ignored on NEWLINK (networking-stable-18_07_19).\n- irq/core: Fix boot crash when the irqaffinity= boot parameter is passed on CPUMASK_OFFSTACK=y kernels(v1) (bsc#1051510).\n- irqchip/bcm7038-l1: Hide cpu offline callback when building for !SMP (bsc#1051510).\n- irqdomain: Add irq_domain_{push,pop}_irq() functions (bsc#1105378).\n- irqdomain: Check for NULL function pointer in irq_domain_free_irqs_hierarchy() (bsc#1105378).\n- irqdomain: Factor out code to add and remove items to and from the revmap (bsc#1105378).\n- irqdomain: Prevent potential NULL pointer dereference in irq_domain_push_irq() (bsc#1105378).\n- irqdomain: Update the comments of fwnode field of irq_domain structure (bsc#1051510).\n- isdn: Disable IIOCDBGVAR (bsc#1051510).\n- iw_cxgb4: remove duplicate memcpy() in c4iw_create_listen() (bsc#1046543).\n- iwlwifi: dbg: do not crash if the firmware crashes in the middle of a debug dump (bsc#1051510).\n- iwlwifi: mvm: Allow TKIP for AP mode (bsc#1051510).\n- iwlwifi: mvm: check for n_profiles validity in EWRD ACPI (bsc#1051510).\n- iwlwifi: mvm: clear HW_RESTART_REQUESTED when stopping the interface (bsc#1051510).\n- iwlwifi: mvm: open BA session only when sta is authorized (bsc#1051510).\n- iwlwifi: mvm: send BCAST management frames to the right station (bsc#1051510).\n- iwlwifi: pcie gen2: check iwl_pcie_gen2_set_tb() return value (bsc#1051510).\n- iwlwifi: pcie: do not access periphery registers when not available (bsc#1051510).\n- iwlwifi: pcie: gen2: build A-MSDU only for GSO (bsc#1051510).\n- ixgbe: Refactor queue disable logic to take completion time into account (bsc#1101557).\n- ixgbe: Reorder Tx/Rx shutdown to reduce time needed to stop device (bsc#1101557).\n- jbd2: fix use after free in jbd2_log_do_checkpoint() (bsc#1113257).\n- kABI: Hide get_msr_feature() in kvm_x86_ops (bsc#1106240).\n- kABI: protect eswitch.h include (kabi).\n- kABI: protect struct nf_conn (kabi).\n- kABI: protect struct vsock_sock (kabi).\n- kABI: reexport tcp_send_ack (kabi).\n- kABI: reexport vsock_pending_work (kabi).\n- kabi fix for check_disk_size_change() (bsc#1098459).\n- kabi protect enum mem_type (bsc#1099125).\n- kabi protect hnae_ae_ops (bsc#1107924).\n- kabi protect struct kvm_sync_regs (bsc#1106948).\n- kabi/severities: Whitelist libceph, rbd, and ceph (bsc#1096748).\n- kabi/severities: add qeth inter-module symbols to ignore list.\n- kabi/severities: ignore __xive_vm_h_* KVM internal symbols.\n- kabi/severities: ignore ppc64 realmode helpers. KVM fixes remove exports of realmode_pfn_to_page iommu_tce_xchg_rm mm_iommu_lookup_rm mm_iommu_ua_to_hpa_rm. Some are no longer used and others are no longer exported because the code was consolideted in one place. These helpers are to be called in realmode and linking to them from non-KVM modules is a bug. Hence removing them does not break KABI.\n- kabi: move s390 mm_context_t lock to mm_struct and ignore the change (bsc#1103421).\n- kabi: x86/speculation/l1tf: Increase l1tf memory limit for Nehalem+ (bsc#1105536).\n- kernfs: update comment about kernfs_path() return value (bsc#1051510).\n- kprobes/x86: Disable preemption in ftrace-based jprobes (bsc#1110006).\n- kprobes/x86: Fix %p uses in error messages (bsc#1110006).\n- kprobes/x86: Prohibit probing on exception masking instructions (bsc#1110006).\n- kprobes/x86: Release insn_slot in failure path (bsc#1110006).\n- ksm: fix unlocked iteration over vmas in cmp_and_merge_page() (VM Functionality bsc#1111806).\n- kvm, mm: account shadow page tables to kmemcg (bsc#1110006).\n- kvm/x86: kABI fix for vm_alloc/vm_free changes (bsc#1111506).\n- kvm: Make VM ioctl do valloc for some archs (bsc#1111506).\n- kvm: arm64: Convert kvm_set_s2pte_readonly() from inline asm to cmpxchg() (bsc#1108010).\n- kvm: nVMX: Fix fault vector for VMX operation at CPL \u003e 0 (bsc#1106105).\n- kvm: nVMX: Use nested_run_pending rather than from_vmentry (bsc#1106240).\n- kvm: x86: Set highest physical address bits in non-present/reserved SPTEs (bsc#1106240).\n- kvm: x86: factor out kvm.arch.hyperv (de)init (bsc#1107207).\n- kvm: x86: fix KVM_XEN_HVM_CONFIG ioctl (bsc#1110006).\n- kvm: x86: hyperv: delete dead code in kvm_hv_hypercall() (bsc#1107207).\n- kvm: x86: hyperv: guest-\u003ehost event signaling via eventfd (bsc#1107207).\n- kvm: x86: vmx: fix vpid leak (bsc#1106240).\n- kvmclock: fix TSC calibration for nested guests (bsc#1110006).\n- l2tp: use sk_dst_check() to avoid race on sk-\u003esk_dst_cache (netfilter-stable-18_08_17).\n- lan78xx: Check for supported Wake-on-LAN modes (bsc#1051510).\n- lan78xx: Lan7801 Support for Fixed PHY (bsc#1085262).\n- lan78xx: Set ASD in MAC_CR when EEE is enabled (bsc#1085262).\n- lan78xx: remove redundant initialization of pointer 'phydev' (bsc#1085262).\n- leds: max8997: use mode when calling max8997_led_set_mode (bsc#1051510).\n- lib/bug.c: exclude non-BUG/WARN exceptions from report_bug() (bsc#1110006).\n- lib/iov_iter: Fix pipe handling in _copy_to_iter_mcsafe() (bsc#1098782).\n- lib/rhashtable: consider param-\u003emin_size when setting initial table size (bsc#1051510).\n- lib/test_hexdump.c: fix failure on big endian cpu (bsc#1051510).\n- lib/ubsan.c: s/missaligned/misaligned/ (bsc#1051510).\n- lib/ubsan: add type mismatch handler for new GCC/Clang (bsc#1051510).\n- lib/vsprintf: Remove atomic-unsafe support for %pCr (bsc#1051510).\n- libahci: Fix possible Spectre-v1 pmp indexing in ahci_led_store() (bsc#1051510).\n- libata: Fix command retry decision (bsc#1051510).\n- libata: Fix compile warning with ATA_DEBUG enabled (bsc#1051510).\n- libbpf: Makefile set specified permission mode (bsc#1083647).\n- libceph: check authorizer reply/challenge length before reading (bsc#1096748).\n- libceph: factor out __ceph_x_decrypt() (bsc#1096748).\n- libceph: factor out __prepare_write_connect() (bsc#1096748).\n- libceph: factor out encrypt_authorizer() (bsc#1096748).\n- libceph: store ceph_auth_handshake pointer in ceph_connection (bsc#1096748).\n- libceph: weaken sizeof check in ceph_x_verify_authorizer_reply() (bsc#1096748).\n- libertas: call into generic suspend code before turning off power (bsc#1051510).\n- libertas: fix suspend and resume for SDIO connected cards (bsc#1051510).\n- libnvdimm, btt: fix uninitialized err_lock (bsc#1103961).\n- libnvdimm, dimm: Maximize label transfer size (bsc#1111921, bsc#1113408, bsc#1113972).\n- libnvdimm, label: Fix sparse warning (bsc#1111921, bsc#1113408, bsc#1113972).\n- libnvdimm, label: change nvdimm_num_label_slots per UEFI 2.7 (bsc#1111921, bsc#1113408, bsc#1113972).\n- libnvdimm, nfit: enable support for volatile ranges (bsc#1103961).\n- libnvdimm, nfit: move the check on nd_reserved2 to the endpoint (bsc#1103961).\n- libnvdimm, pmem: Fix memcpy_mcsafe() return code handling in nsio_rw_bytes() (bsc#1098782).\n- libnvdimm, pmem: Restore page attributes when clearing errors (bsc#1107783).\n- libnvdimm: Use max contiguous area for namespace size (git-fixes).\n- libnvdimm: fix ars_status output length calculation (bsc#1104890).\n- libnvdimm: rename nd_sector_size_{show,store} to nd_size_select_{show,store} (bsc#1103961).\n- liquidio: fix hang when re-binding VF host drv after running DPDK VF driver (bsc#1067126).\n- liquidio: fix kernel panic in VF driver (bsc#1067126).\n- livepatch: Remove reliable stacktrace check in klp_try_switch_task() (bsc#1071995).\n- livepatch: Validate module/old func name length (bsc#1071995).\n- livepatch: create and include UAPI headers ().\n- llc: use refcount_inc_not_zero() for llc_sap_find() (netfilter-stable-18_08_17).\n- lockd: fix 'list_add double add' caused by legacy signal interface (git-fixes).\n- loop: add recursion validation to LOOP_CHANGE_FD (bsc#1112711).\n- loop: do not call into filesystem while holding lo_ctl_mutex (bsc#1112710).\n- loop: fix LOOP_GET_STATUS lock imbalance (bsc#1113284).\n- mac80211: Fix station bandwidth setting after channel switch (bsc#1051510).\n- mac80211: Run TXQ teardown code before de-registering interfaces (bsc#1051510).\n- mac80211: add stations tied to AP_VLANs during hw reconfig (bsc#1051510).\n- mac80211: always account for A-MSDU header changes (bsc#1051510).\n- mac80211: avoid kernel panic when building AMSDU from non-linear SKB (bsc#1051510).\n- mac80211: correct use of IEEE80211_VHT_CAP_RXSTBC_X (bsc#1051510).\n- mac80211: do not Tx a deauth frame if the AP forbade Tx (bsc#1051510).\n- mac80211: do not convert to A-MSDU if frag/subframe limited (bsc#1051510).\n- mac80211: fix a race between restart and CSA flows (bsc#1051510).\n- mac80211: fix an off-by-one issue in A-MSDU max_subframe computation (bsc#1051510).\n- mac80211: fix pending queue hang due to TX_DROP (bsc#1051510).\n- mac80211: fix setting IEEE80211_KEY_FLAG_RX_MGMT for AP mode keys (bsc#1051510).\n- mac80211: mesh: fix HWMP sequence numbering to follow standard (bsc#1051510).\n- mac80211: minstrel: fix using short preamble CCK rates on HT clients (bsc#1051510).\n- mac80211: restrict delayed tailroom needed decrement (bsc#1051510).\n- mac80211: shorten the IBSS debug messages (bsc#1051510).\n- mac80211_hwsim: correct use of IEEE80211_VHT_CAP_RXSTBC_X (bsc#1051510).\n- mac80211_hwsim: require at least one channel (bsc#1051510).\n- mach64: detect the dot clock divider correctly on sparc (bsc#1051510).\n- macros.kernel-source: pass -b properly in kernel module package (bsc#1107870).\n- mailbox: xgene-slimpro: Fix potential NULL pointer dereference (bsc#1051510).\n- make sure that __dentry_kill() always invalidates d_seq, unhashed or not (git-fixes).\n- md-cluster: clear another node's suspend_area after the copy is finished (bsc#1106333).\n- md-cluster: do not send msg if array is closing (bsc#1106333).\n- md-cluster: release RESYNC lock after the last resync message (bsc#1106688).\n- md-cluster: show array's status more accurate (bsc#1106333).\n- md/raid10: fix that replacement cannot complete recovery after reassemble (git-fixes).\n- md/raid1: add error handling of read error from FailFast device (git-fixes).\n- md/raid5-cache: disable reshape completely (git-fixes).\n- md/raid5: fix data corruption of replacements after originals dropped (git-fixes).\n- md: fix NULL dereference of mddev-\u003epers in remove_and_add_spares() (git-fixes).\n- media: Revert '[media] tvp5150: fix pad format frame height' (bsc#1051510).\n- media: af9035: prevent buffer overflow on write (bsc#1051510).\n- media: cx231xx: fix potential sign-extension overflow on large shift (bsc#1051510).\n- media: davinci: vpif_display: Mix memory leak on probe error path (bsc#1051510).\n- media: dvb: fix compat ioctl translation (bsc#1051510).\n- media: em28xx: fix input name for Terratec AV 350 (bsc#1051510).\n- media: em28xx: use a default format if TRY_FMT fails (bsc#1051510).\n- media: exynos4-is: Prevent NULL pointer dereference in __isp_video_try_fmt() (bsc#1051510).\n- media: fsl-viu: fix error handling in viu_of_probe() (bsc#1051510).\n- media: helene: fix xtal frequency setting at power on (bsc#1051510).\n- media: mem2mem: Remove excessive try_run call (bsc#1051510).\n- media: omap3isp: zero-initialize the isp cam_xclk{a,b} initial data (bsc#1051510).\n- media: pci: cx23885: handle adding to list failure (bsc#1051510).\n- media: rtl28xxu: be sure that it won't go past the array size (bsc#1051510).\n- media: s3c-camif: ignore -ENOIOCTLCMD from v4l2_subdev_call for s_power (bsc#1051510).\n- media: s5p-mfc: Fix buffer look up in s5p_mfc_handle_frame_{new, copy_time} functions (bsc#1051510).\n- media: soc_camera: ov772x: correct setting of banding filter (bsc#1051510).\n- media: tm6000: add error handling for dvb_register_adapter (bsc#1051510).\n- media: tvp5150: avoid going past array on v4l2_querymenu() (bsc#1051510).\n- media: tvp5150: fix switch exit in set control handler (bsc#1051510).\n- media: tvp5150: fix width alignment during set_selection() (bsc#1051510).\n- media: tw686x: Fix oops on buffer alloc failure (bsc#1051510).\n- media: uvcvideo: Fix uvc_alloc_entity() allocation alignment (bsc#1051510).\n- media: v4l2-mem2mem: Fix missing v4l2_m2m_try_run call (bsc#1051510).\n- media: v4l2-tpg: fix kernel oops when enabling HFLIP and OSD (bsc#1051510).\n- media: videobuf-dma-sg: Fix dma_{sync,unmap}_sg() calls (bsc#1051510).\n- media: videobuf2-core: check for q-\u003eerror in vb2_core_qbuf() (bsc#1051510).\n- media: vsp1: Fix YCbCr planar formats pitch calculation (bsc#1051510).\n- mei: bus: type promotion bug in mei_nfc_if_version() (bsc#1051510).\n- mei: do not update offset in write (bsc#1051510).\n- mei: ignore not found client in the enumeration (bsc#1051510).\n- mei: me: enable asynchronous probing ().\n- memcg, thp: do not invoke oom killer on thp charges (bsc#1089663).\n- memory: tegra: Apply interrupts mask per SoC (bsc#1051510).\n- memory: tegra: Do not handle spurious interrupts (bsc#1051510).\n- merge hyperv part of f5caf621\n- mfd: 88pm860x-i2c: switch to i2c_lock_bus(..., I2C_LOCK_SEGMENT) (bsc#1051510).\n- mfd: arizona: Correct calling of runtime_put_sync (bsc#1051510).\n- mfd: arizona: Do not use regmap_read_poll_timeout (bsc#1051510).\n- mfd: intel-lpss: Add Ice Lake PCI IDs (bsc#1051510).\n- mfd: lpc_ich: Do not touch SPI-NOR write protection bit on Apollo Lake (bsc#1051510).\n- mfd: sm501: Set coherent_dma_mask when creating subdevices (bsc#1051510).\n- mfd: ti_am335x_tscadc: Fix struct clk memory leak (bsc#1051510).\n- mlxsw: core_acl_flex_actions: Return error for conflicting actions (netfilter-stable-18_08_17).\n- mm, dax: introduce pfn_t_special() (bsc#1104888).\n- mm, madvise_inject_error: Disable MADV_SOFT_OFFLINE for ZONE_DEVICE pages (bsc#1107783).\n- mm, madvise_inject_error: Let memory_failure() optionally take a page reference (bsc#1107783).\n- mm, memory_failure: Collect mapping size in collect_procs() (bsc#1107783).\n- mm, memory_failure: Teach memory_failure() about dev_pagemap pages (bsc#1107783).\n- mm, numa: Migrate pages to local nodes quicker early in the lifetime of a task (bsc#1101669 optimise numa balancing for fast migrate).\n- mm, numa: Remove rate-limiting of automatic numa balancing migration (bsc#1101669 optimise numa balancing for fast migrate).\n- mm, numa: Remove rate-limiting of automatic numa balancing migration kabi (bsc#1101669 optimise numa balancing for fast migrate).\n- mm, page_alloc: double zone's batchsize (bsc#971975 VM performance -- page allocator).\n- mm/huge_memory.c: fix data loss when splitting a file pmd (bsc#1107074).\n- mm/hugetlb: filter out hugetlb pages if HUGEPAGE migration is not supported (bsc#1106697).\n- mm/migrate: Use spin_trylock() while resetting rate limit ().\n- mm/vmalloc: add interfaces to free unmapped page table (bsc#1110006).\n- mm/vmscan: wake up flushers for legacy cgroups too (bsc#1107061).\n- mm: /proc/pid/pagemap: hide swap entries from unprivileged users (Git-fixes bsc#1109907).\n- mm: Preserve _PAGE_DEVMAP across mprotect() calls (bsc#1111028).\n- mm: fix BUG_ON() in vmf_insert_pfn_pud() from VM_MIXEDMAP removal (bsc#1111841).\n- mm: fix devmem_is_allowed() for sub-page System RAM intersections (bsc#1106800).\n- mm: memcg: fix use after free in mem_cgroup_iter() (bsc#1107065).\n- mmc: block: avoid multiblock reads for the last sector in SPI mode (bsc#1051510).\n- mmc: omap_hsmmc: fix wakeirq handling on removal (bsc#1051510).\n- mmc: sdhci-of-esdhc: set proper dma mask for ls104x chips (bsc#1051510).\n- mmc: sdhci: do not try to use 3.3V signaling if not supported (bsc#1051510).\n- mmc: tegra: prevent HS200 on Tegra 3 (bsc#1051510).\n- modpost: ignore livepatch unresolved relocations ().\n- module: exclude SHN_UNDEF symbols from kallsyms api (bsc#1071995).\n- move a hyperv related patch to correct place in series.conf\n- move changes without Git-commit out of sorted section\n- mwifiex: handle race during mwifiex_usb_disconnect (bsc#1051510).\n- net/9p/client.c: version pointer uninitialized (bsc#1051510).\n- net/9p/trans_fd.c: fix race by holding the lock (bsc#1051510).\n- net/9p/trans_fd.c: fix race-condition by flushing workqueue before the kfree() (bsc#1051510).\n- net/9p: Switch to wait_event_killable() (bsc#1051510).\n- net/9p: fix error path of p9_virtio_probe (bsc#1051510).\n- net/ipv4: Set oif in fib_compute_spec_dst (netfilter-stable-18_07_23).\n- net/mlx5: E-Switch, Avoid setup attempt if not being e-switch manager (networking-stable-18_07_19).\n- net/mlx5e: Avoid dealing with vport representors if not being e-switch manager (networking-stable-18_07_19).\n- net/packet: fix use-after-free (networking-stable-18_07_19).\n- net: add support for Cavium PTP coprocessor (bsc#1110096).\n- net: bcmgenet: Fix sparse warnings in bcmgenet_put_tx_csum() (bsc#1051510).\n- net: bcmgenet: Fix unmapping of fragments in bcmgenet_xmit() (bsc#1051510).\n- net: bcmgenet: correct bad merge (bsc#1051510).\n- net: bcmgenet: enable loopback during UniMAC sw_reset (bsc#1051510).\n- net: bcmgenet: prevent duplicate calls of bcmgenet_dma_teardown (bsc#1051510).\n- net: cavium: fix NULL pointer dereference in cavium_ptp_put (bsc#1110096).\n- net: cavium: use module_pci_driver to simplify the code (bsc#1110096).\n- net: dccp: avoid crash in ccid3_hc_rx_send_feedback() (networking-stable-18_07_19).\n- net: dccp: switch rx_tstamp_last_feedback to monotonic clock (networking-stable-18_07_19).\n- net: diag: Do not double-free TCP_NEW_SYN_RECV sockets in tcp_abort (netfilter-stable-18_07_23).\n- net: dsa: Do not suspend/resume closed slave_dev (netfilter-stable-18_08_04).\n- net: ena: Eliminate duplicate barriers on weakly-ordered archs (bsc#1108093).\n- net: ena: Fix use of uninitialized DMA address bits field (netfilter-stable-18_08_01).\n- net: ena: fix device destruction to gracefully free resources (bsc#1108093).\n- net: ena: fix driver when PAGE_SIZE == 64kB (bsc#1108093).\n- net: ena: fix incorrect usage of memory barriers (bsc#1108093).\n- net: ena: fix missing calls to READ_ONCE (bsc#1108093).\n- net: ena: fix missing lock during device destruction (bsc#1108093).\n- net: ena: fix potential double ena_destroy_device() (bsc#1108093).\n- net: ena: fix surprise unplug NULL dereference kernel crash (bsc#1108093).\n- net: ethernet: mvneta: Fix napi structure mixup on armada 3700 (networking-stable-18_08_21).\n- net: fix amd-xgbe flow-control issue (netfilter-stable-18_08_01).\n- net: fix use-after-free in GRO with ESP (networking-stable-18_07_19).\n- net: hns3: Fix MSIX allocation issue for VF (bsc#1104353 ).\n- net: hns3: Fix comments for hclge_get_ring_chain_from_mbx (bsc#1104353).\n- net: hns3: Fix desc num set to default when setting channel (bsc#1104353).\n- net: hns3: Fix for command format parsing error in hclge_is_all_function_id_zero (bsc#1104353).\n- net: hns3: Fix for information of phydev lost problem when down/up (bsc#1104353).\n- net: hns3: Fix for l4 checksum offload bug (bsc#1104353 ).\n- net: hns3: Fix for mac pause not disable in pfc mode (bsc#1104353).\n- net: hns3: Fix for mailbox message truncated problem (bsc#1104353).\n- net: hns3: Fix for phy link issue when using marvell phy driver (bsc#1104353).\n- net: hns3: Fix for reset_level default assignment probelm (bsc#1104353).\n- net: hns3: Fix for using wrong mask and shift in hclge_get_ring_chain_from_mbx (bsc#1104353).\n- net: hns3: Fix for waterline not setting correctly (bsc#1104353).\n- net: hns3: Fix get_vector ops in hclgevf_main module (bsc#1104353).\n- net: hns3: Fix return value error in hns3_reset_notify_down_enet (bsc#1104353).\n- net: hns3: Fix warning bug when doing lp selftest (bsc#1104353 ).\n- net: hns3: Prevent sending command during global or core reset (bsc#1104353).\n- net: hns3: Standardize the handle of return value (bsc#1104353 ).\n- net: hns3: add unlikely for error check (bsc#1104353 ).\n- net: hns3: fix page_offset overflow when CONFIG_ARM64_64K_PAGES (bsc#1104353).\n- net: hns3: fix return value error while hclge_cmd_csq_clean failed (bsc#1104353).\n- net: hns3: modify hnae_ to hnae3_ (bsc#1104353).\n- net: hns3: remove some redundant assignments (bsc#1104353 ).\n- net: hns3: remove unnecessary ring configuration operation while resetting (bsc#1104353).\n- net: hns3: simplify hclge_cmd_csq_clean (bsc#1104353 ).\n- net: hns: add netif_carrier_off before change speed and duplex (bsc#1107924).\n- net: hns: add the code for cleaning pkt in chip (bsc#1107924).\n- net: mdio-mux: bcm-iproc: fix wrong getter and setter pair (netfilter-stable-18_08_01).\n- net: mvneta: fix mvneta_config_rss on armada 3700 (networking-stable-18_08_21).\n- net: mvneta: fix the Rx desc DMA address in the Rx path (networking-stable-18_07_19).\n- net: phy: consider PHY_IGNORE_INTERRUPT in phy_start_aneg_priv (netfilter-stable-18_07_27).\n- net: phy: fix flag masking in __set_phy_supported (netfilter-stable-18_07_23).\n- net: rtnl_configure_link: fix dev flags changes arg to __dev_notify_flags (git-fixes).\n- net: skb_segment() should not return NULL (netfilter-stable-18_07_27).\n- net: stmmac: Fix WoL for PCI-based setups (netfilter-stable-18_08_04).\n- net: stmmac: mark PM functions as __maybe_unused (git-fixes).\n- net: sungem: fix rx checksum support (networking-stable-18_07_19).\n- net: systemport: Fix CRC forwarding check for SYSTEMPORT Lite (netfilter-stable-18_07_23).\n- net: thunder: change q_len's type to handle max ring size (bsc#1110096).\n- net: thunderx: Set max queue count taking XDP_TX into account (bsc#1110096).\n- net: thunderx: add MAC address filter tracking for LMAC (bsc#1110096).\n- net: thunderx: add XCAST messages handlers for PF (bsc#1110096).\n- net: thunderx: add multicast filter management support (bsc#1110096).\n- net: thunderx: add ndo_set_rx_mode callback implementation for VF (bsc#1110096).\n- net: thunderx: add new messages for handle ndo_set_rx_mode callback (bsc#1110096).\n- net: thunderx: add timestamping support (bsc#1110096).\n- net: thunderx: add workqueue control structures for handle ndo_set_rx_mode request (bsc#1110096).\n- net: thunderx: check for failed allocation lmac-\u003edmacs (bsc#1110096).\n- net: thunderx: fix double free error (bsc#1110096).\n- net: thunderx: move filter register related macro into proper place (bsc#1110096).\n- net: thunderx: prevent concurrent data re-writing by nicvf_set_rx_mode (bsc#1110096).\n- net: thunderx: remove a couple of redundant assignments (bsc#1110096).\n- net: thunderx: rework mac addresses list to u64 array (bsc#1110096).\n- net_sched: Fix missing res info when create new tc_index filter (netfilter-stable-18_08_17).\n- net_sched: blackhole: tell upper qdisc about dropped packets (networking-stable-18_07_19).\n- netfilter: do not set F_IFACE on ipv6 fib lookups (netfilter-stable-18_06_25).\n- netfilter: ip6t_rpfilter: provide input interface for route lookup (netfilter-stable-18_06_25).\n- netfilter: ip6t_rpfilter: set F_IFACE for linklocal addresses (git-fixes).\n- netfilter: nat: Revert 'netfilter: nat: convert nat bysrc hash to rhashtable' (netfilter-stable-17_11_16).\n- netfilter: nf_tables: add missing netlink attrs to policies (netfilter-stable-18_06_27).\n- netfilter: nf_tables: do not assume chain stats are set when jumplabel is set (netfilter-stable-18_06_27).\n- netfilter: nf_tables: fix memory leak on error exit return (netfilter-stable-18_06_27).\n- netfilter: nf_tables: nft_compat: fix refcount leak on xt module (netfilter-stable-18_06_27).\n- netfilter: nf_tables: use WARN_ON_ONCE instead of BUG_ON in nft_do_chain() (netfilter-stable-18_06_25).\n- netfilter: nft_compat: fix handling of large matchinfo size (netfilter-stable-18_06_27).\n- netfilter: nft_compat: prepare for indirect info storage (netfilter-stable-18_06_27).\n- netfilter: nft_meta: fix wrong value dereference in nft_meta_set_eval (netfilter-stable-18_06_27).\n- netlink: Do not shift on 64 for ngroups (git-fixes).\n- netlink: Do not shift with UB on nlk-\u003engroups (netfilter-stable-18_08_01).\n- netlink: Do not subscribe to non-existent groups (netfilter-stable-18_08_01).\n- netlink: Fix spectre v1 gadget in netlink_create() (netfilter-stable-18_08_04).\n- nfs/filelayout: fix oops when freeing filelayout segment (bsc#1105190).\n- nfs/pnfs: fix nfs_direct_req ref leak when i/o falls back to the mds (git-fixes).\n- nfs41: do not return ENOMEM on LAYOUTUNAVAILABLE (git-fixes).\n- nfsd: remove blocked locks on client teardown (git-fixes).\n- nl80211: Add a missing break in parse_station_flags (bsc#1051510).\n- nl80211: check nla_parse_nested() return values (bsc#1051510).\n- nvdimm: Clarify comment in sizeof_namespace_index (bsc#1111921, bsc#1113408, bsc#1113972).\n- nvdimm: Remove empty if statement (bsc#1111921, bsc#1113408, bsc#1113972).\n- nvdimm: Sanity check labeloff (bsc#1111921, bsc#1113408, bsc#1113972).\n- nvdimm: Split label init out from the logic for getting config data (bsc#1111921, bsc#1113408, bsc#1113972).\n- nvdimm: Use namespace index data to reduce number of label reads needed (bsc#1111921, bsc#1113408, bsc#1113972).\n- nvme: call nvme_complete_rq when nvmf_check_ready fails for mpath I/O (bsc#1107685).\n- nvme: register ns_id attributes as default sysfs groups (bsc#1105247).\n- nvme_fc: add 'nvme_discovery' sysfs attribute to fc transport device (bsc#1044189).\n- objtool, kprobes/x86: Sync the latest asm/insn.h header with tools/objtool/arch/x86/include/asm/insn.h (bsc#1110006).\n- of: add helper to lookup compatible child node (bsc#1106110)\n- orangefs: fix deadlock; do not write i_size in read_iter (bsc#1051510).\n- orangefs: initialize op on loop restart in orangefs_devreq_read (bsc#1051510).\n- orangefs: use list_for_each_entry_safe in purge_waiting_ops (bsc#1051510).\n- orangefs_kill_sb(): deal with allocation failures (bsc#1051510).\n- ovl: Sync upper dirty data when syncing overlayfs (git-fixes).\n- ovl: fix format of setxattr debug (git-fixes).\n- parport: sunbpp: fix error return code (bsc#1051510).\n- partitions/aix: append null character to print data from disk (bsc#1051510).\n- partitions/aix: fix usage of uninitialized lv_info and lvname structures (bsc#1051510).\n- perf/x86/amd/ibs: Do not access non-started event (bsc#1110006).\n- perf/x86/cstate: Fix possible Spectre-v1 indexing for pkg_msr (bsc#1110006).\n- perf/x86/intel/lbr: Fix incomplete LBR call stack (bsc#1110006).\n- perf/x86/intel/uncore: Correct fixed counter index check for NHM (bsc#1110006).\n- perf/x86/intel/uncore: Correct fixed counter index check in generic code (bsc#1110006).\n- perf/x86/intel/uncore: Fix Skylake UPI event format (bsc#1110006).\n- perf/x86/intel: Do not accidentally clear high bits in bdw_limit_period() (bsc#1110006).\n- perf/x86/intel: Fix event update for auto-reload (bsc#1110006).\n- perf/x86/intel: Fix large period handling on Broadwell CPUs (bsc#1110006).\n- perf/x86/intel: Fix linear IP of PEBS real_ip on Haswell and later CPUs (bsc#1110006).\n- perf/x86/intel: Properly save/restore the PMU state in the NMI handler (bsc#1110006).\n- perf/x86/msr: Fix possible Spectre-v1 indexing in the MSR driver (bsc#1110006).\n- perf/x86: Fix possible Spectre-v1 indexing for hw_perf_event cache_* (bsc#1110006).\n- perf/x86: Fix possible Spectre-v1 indexing for x86_pmu::event_map() (bsc#1110006).\n- pinctrl/amd: only handle irq if it is pending and unmasked (bsc#1051510).\n- pinctrl: cannonlake: Fix HOSTSW_OWN register offset of H variant (bsc#1051510).\n- pipe: actually allow root to exceed the pipe buffer limits (bsc#1106297).\n- pipe: match pipe_max_size data type with procfs (git-fixes).\n- platform/x86: alienware-wmi: Correct a memory leak (bsc#1051510).\n- platform/x86: asus-nb-wmi: Add keymap entry for lid flip action on UX360 (bsc#1051510).\n- platform/x86: thinkpad_acpi: Proper model/release matching (bsc#1051510).\n- platform/x86: toshiba_acpi: Fix defined but not used build warnings (bsc#1051510).\n- pmem: Switch to copy_to_iter_mcsafe() (bsc#1098782).\n- pnfs/blocklayout: off by one in bl_map_stripe() (git-fixes).\n- power: gemini-poweroff: Avoid more spurious poweroffs (bsc#1051510).\n- power: generic-adc-battery: check for duplicate properties copied from iio channels (bsc#1051510).\n- power: generic-adc-battery: fix out-of-bounds write when copying channel properties (bsc#1051510).\n- power: remove possible deadlock when unregistering power_supply (bsc#1051510).\n- power: supply: axp288_charger: Fix initial constant_charge_current value (bsc#1051510).\n- power: supply: max77693_charger: fix unintentional fall-through (bsc#1051510).\n- power: vexpress: fix corruption in notifier registration (bsc#1051510).\n- powernv/pseries: consolidate code for mce early handling (bsc#1094244).\n- powerpc/64s: Default l1d_size to 64K in RFI fallback flush (bsc#1068032, git-fixes).\n- powerpc/64s: Fix DT CPU features Power9 DD2.1 logic (bsc#1055117).\n- powerpc/64s: Fix compiler store ordering to SLB shadow area (bsc#1094244).\n- powerpc/64s: move machine check SLB flushing to mm/slb.c (bsc#1094244).\n- powerpc/fadump: cleanup crash memory ranges support (bsc#1103269).\n- powerpc/fadump: re-register firmware-assisted dump if already registered (bsc#1108170, bsc#1108823).\n- powerpc/firmware: Add definitions for new drc-info firmware feature (bsc#1109158).\n- powerpc/kprobes: Fix call trace due to incorrect preempt count (bsc#1065729).\n- powerpc/kvm/booke: Fix altivec related build break (bsc#1061840).\n- powerpc/kvm: Switch kvm pmd allocator to custom allocator (bsc#1061840).\n- powerpc/lib: Fix the feature fixup tests to actually work (bsc#1065729).\n- powerpc/mce: Fix SLB rebolting during MCE recovery path (bsc#1094244).\n- powerpc/mm/hugetlb: initialize the pagetable cache correctly for hugetlb (bsc#1091800).\n- powerpc/mm: Rename find_linux_pte_or_hugepte() (bsc#1061840).\n- powerpc/numa: Skip onlining a offline node in kdump path (bsc#1109784).\n- powerpc/numa: Use associativity if VPHN hcall is successful (bsc#1110363).\n- powerpc/perf: Fix IMC allocation routine (bsc#1054914).\n- powerpc/perf: Fix memory allocation for core-imc based on num_possible_cpus() (bsc#1054914).\n- powerpc/perf: Remove sched_task function defined for thread-imc (bsc#1054914).\n- powerpc/pkeys: Fix reading of ibm, processor-storage-keys property (bsc#1109244).\n- powerpc/powernv/ioda2: Reduce upper limit for DMA window size (bsc#1055120).\n- powerpc/powernv/ioda: Allocate indirect TCE levels on demand (bsc#1061840).\n- powerpc/powernv/ioda: Finish removing explicit max window size check (bsc#1061840).\n- powerpc/powernv/ioda: Remove explicit max window size check (bsc#1061840).\n- powerpc/powernv/npu: Do a PID GPU TLB flush when invalidating a large address range (bsc#1055120).\n- powerpc/powernv: Add indirect levels to it_userspace (bsc#1061840).\n- powerpc/powernv: Move TCE manupulation code to its own file (bsc#1061840).\n- powerpc/powernv: Rework TCE level allocation (bsc#1061840).\n- powerpc/pseries/mm: Introducing FW_FEATURE_BLOCK_REMOVE (bsc#1109158).\n- powerpc/pseries/mm: call H_BLOCK_REMOVE (bsc#1109158).\n- powerpc/pseries/mm: factorize PTE slot computation (bsc#1109158).\n- powerpc/pseries: Avoid using the size greater than RTAS_ERROR_LOG_MAX (bsc#1094244).\n- powerpc/pseries: Defer the logging of rtas error to irq work queue (bsc#1094244).\n- powerpc/pseries: Define MCE error event section (bsc#1094244).\n- powerpc/pseries: Disable CPU hotplug across migrations (bsc#1065729).\n- powerpc/pseries: Display machine check error details (bsc#1094244).\n- powerpc/pseries: Dump the SLB contents on SLB MCE errors (bsc#1094244).\n- powerpc/pseries: Fix 'OF: ERROR: Bad of_node_put() on /cpus' during DLPAR (bsc#1113295).\n- powerpc/pseries: Fix CONFIG_NUMA=n build (bsc#1067906, git-fixes).\n- powerpc/pseries: Fix build break for SPLPAR=n and CPU hotplug (bsc#1079524, git-fixes).\n- powerpc/pseries: Fix duplicate firmware feature for DRC_INFO (bsc#1109158).\n- powerpc/pseries: Fix endianness while restoring of r3 in MCE handler (bsc#1094244).\n- powerpc/pseries: Flush SLB contents on SLB MCE errors (bsc#1094244).\n- powerpc/pseries: Remove prrn_work workqueue (bsc#1102495, bsc#1109337).\n- powerpc/pseries: Remove unneeded uses of dlpar work queue (bsc#1102495, bsc#1109337).\n- powerpc/pseries: fix EEH recovery of some IOV devices (bsc#1078720, git-fixes).\n- powerpc/rtas: Fix a potential race between CPU-Offline Migration (bsc#1111870).\n- powerpc/tm: Avoid possible userspace r1 corruption on reclaim (bsc#1109333).\n- powerpc/tm: Fix userspace r13 corruption (bsc#1109333).\n- powerpc/topology: Get topology for shared processors at boot (bsc#1104683).\n- powerpc/xive: Fix trying to 'push' an already active pool VP (bsc#1085030, git-fixes).\n- powerpc/xive: Move definition of ESB bits (bsc#1061840).\n- powerpc/xmon: Add ISA v3.0 SPRs to SPR dump (bsc#1061840).\n- powerpc64s: Show ori31 availability in spectre_v1 sysfs file not v2 (bsc#1068032, bsc#1080157, git-fixes).\n- powerpc: Avoid code patching freed init sections (bsc#1107735).\n- powerpc: Fix size calculation using resource_size() (bsc#1012382).\n- powerpc: KABI add aux_ptr to hole in paca_struct to extend it with additional members (bsc#1094244).\n- powerpc: KABI: move mce_data_buf into paca_aux (bsc#1094244).\n- powerpc: make feature-fixup tests fortify-safe (bsc#1065729).\n- powerpc: pseries: remove dlpar_attach_node dependency on full path (bsc#1113295).\n- ppp: Destroy the mutex when cleanup (bsc#1051510).\n- ppp: fix __percpu annotation (bsc#1051510).\n- printk/tracing: Do not trace printk_nmi_enter() (bsc#1112208).\n- printk: drop in_nmi check from printk_safe_flush_on_panic() (bsc#1112170).\n- proc: restrict kernel stack dumps to root (git-fixes). blacklist.conf:\n- pstore: Fix incorrect persistent ram buffer mapping (bsc#1051510).\n- ptp: fix missing break in switch (bsc#1105355).\n- ptr_ring: fail early if queue occupies more than KMALLOC_MAX_SIZE (bsc#1105355).\n- ptr_ring: fix up after recent ptr_ring changes (bsc#1105355).\n- ptr_ring: prevent integer overflow when calculating size (bsc#1105355).\n- ptrace,x86: Make user_64bit_mode() available to 32-bit builds (bsc#1110006).\n- pwm: tiehrpwm: Fix disabling of output of PWMs (bsc#1051510).\n- qed: Add missing device config for RoCE EDPM in UFP mode (bsc#1109217).\n- qed: Avoid sending mailbox commands when MFW is not responsive (bsc#1050536).\n- qed: Do not add VLAN 0 tag to untagged frames in multi-function mode (bsc#1050536).\n- qed: Fix populating the invalid stag value in multi function mode (bsc#1050536).\n- qed: Fix shmem structure inconsistency between driver and the mfw (bsc#1110561).\n- qed: Prevent a possible deadlock during driver load and unload (bsc#1050536).\n- qed: Wait for MCP halt and resume commands to take place (bsc#1050536).\n- qed: Wait for ready indication before rereading the shmem (bsc#1050536).\n- qlcnic: fix Tx descriptor corruption on 82xx devices (bsc#1050540).\n- qlge: Fix netdev features configuration (bsc#1098822).\n- qmi_wwan: Added support for Gemalto's Cinterion ALASxx WWAN interface (bsc#1051510).\n- qmi_wwan: set DTR for modems in forced USB2 mode (bsc#1051510).\n- qrtr: add MODULE_ALIAS macro to smd (bsc#1051510).\n- r8152: Check for supported Wake-on-LAN Modes (bsc#1051510).\n- r8169: Clear RTL_FLAG_TASK_*_PENDING when clearing RTL_FLAG_TASK_ENABLED (bsc#1051510).\n- r8169: add support for NCube 8168 network card (bsc#1051510).\n- race of lockd inetaddr notifiers vs nlmsvc_rqst change (git-fixes).\n- random: add new ioctl RNDRESEEDCRNG (bsc#1051510).\n- random: fix possible sleeping allocation from irq context (bsc#1051510).\n- random: mix rdrand with entropy sent in from userspace (bsc#1051510).\n- random: rate limit unseeded randomness warnings (git-fixes).\n- random: set up the NUMA crng instances after the CRNG is fully initialized (bsc#1051510).\n- rculist: Improve documentation for list_for_each_entry_from_rcu() (bsc#1084760).\n- rculist: add list_for_each_entry_from_rcu() (bsc#1084760).\n- readahead: stricter check for bdi io_pages (VM Functionality, git fixes).\n- regulator: fix crash caused by null driver data (bsc#1051510).\n- reiserfs: add check to detect corrupted directory entry (bsc#1109818).\n- reiserfs: do not panic on bad directory entries (bsc#1109818).\n- reiserfs: fix broken xattr handling (heap corruption, bad retval) (bsc#1106236).\n- rename a hv patch to reduce conflicts in -AZURE\n- rename/renumber hv patches to simplify upcoming upstream merges Good Bye automerge. Hello Conflicts.\n- rename/renumber hv patches to simplify upcoming upstream merges No code changes.\n- reorder a qedi patch to allow further work in this branch\n- resort series.conf\n- resource: Include resource end in walk_*() interfaces (bsc#1114279).\n- rhashtable: add schedule points (bsc#1051510).\n- rndis_wlan: potential buffer overflow in rndis_wlan_auth_indication() (bsc#1051510).\n- root dentries need RCU-delayed freeing (bsc#1106297).\n- rpc_pipefs: fix double-dput() (bsc#1051510).\n- rpm/kernel-binary.spec.in: fix call of split-modules split-modules is called with some parameters depending on config options. But since we do not use backslash consistelny, the call to split-modules might be evaluated so that also the following cat command is appended. Avoid this behaviour by using backslashes everywhere and add %nil to the end. This perhaps never happens, but stay on the safe side.\n- rpm/mkspec: build dtbs for architectures marked -!needs_updating\n- rpm/mkspec: fix ppc64 kernel-source build.\n- rpmsg: Correct support for MODULE_DEVICE_TABLE() (git-fixes).\n- rsi: Fix 'invalid vdd' warning in mmc (bsc#1051510).\n- rtc: bq4802: add error handling for devm_ioremap (bsc#1051510).\n- rtnetlink: add rtnl_link_state check in rtnl_configure_link (netfilter-stable-18_07_27).\n- rxrpc: Fix user call ID check in rxrpc_service_prealloc_one (netfilter-stable-18_08_04).\n- s390/crypto: Fix return code checking in cbc_paes_crypt() (bsc#1108323, LTC#171709).\n- s390/entry.S: use assembler alternatives (bsc#1103421).\n- s390/lib: use expoline for all bcr instructions (git-fixes, bsc#1103421).\n- s390/mm: fix local TLB flushing vs. detach of an mm address space (bsc#1103421).\n- s390/mm: fix race on mm-\u003econtext.flush_mm (bsc#1103421).\n- s390/pci: fix out of bounds access during irq setup (bsc#1108323, LTC#171068).\n- s390/qdio: reset old sbal_state flags (LTC#171525, bsc#1106948).\n- s390/qeth: consistently re-enable device features (bsc#1104482, LTC#170340).\n- s390/qeth: do not clobber buffer on async TX completion (bsc#1104482, LTC#170340).\n- s390/qeth: rely on kernel for feature recovery (bsc#1104482, LTC#170340).\n- s390/qeth: use vzalloc for QUERY OAT buffer (LTC#171527, bsc#1106948).\n- s390/runtime instrumentation: simplify task exit handling (bsc#1103421).\n- s390: Prevent hotplug rwsem recursion (bsc#1105731).\n- s390: always save and restore all registers on context switch (bsc#1103421).\n- s390: detect etoken facility (bsc#1103421).\n- s390: fix br_r1_trampoline for machines without exrl (git-fixes, bsc#1103421).\n- s390: fix compat system call table (bsc#1103421).\n- s390: fix handling of -1 in set{,fs}id16 syscalls (bsc#1103421).\n- s390: use expoline thunks for all branches generated by the BPF JIT (bsc#1103421).\n- samples/bpf: adjust rlimit RLIMIT_MEMLOCK for xdp1 (bsc#1083647).\n- sched/fair: Fix bandwidth timer clock drift condition (Git-fixes).\n- sched/fair: Fix vruntime_normalized() for remote non-migration wakeup (git-fixes).\n- sched/isolcpus: Fix 'isolcpus=' boot parameter handling when !CONFIG_CPUMASK_OFFSTACK (bsc#1107207).\n- sched/numa: Avoid task migration for small NUMA improvement (bsc#1101669 optimise numa balancing for fast migrate).\n- sched/numa: Do not move imbalanced load purely on the basis of an idle CPU (bsc#1101669 optimise numa balancing for fast migrate).\n- sched/numa: Evaluate move once per node (bsc#1101669 optimise numa balancing for fast migrate).\n- sched/numa: Limit the conditions where scan period is reset ().\n- sched/numa: Pass destination CPU as a parameter to migrate_task_rq (bsc#1101669 optimise numa balancing for fast migrate).\n- sched/numa: Pass destination CPU as a parameter to migrate_task_rq kabi (bsc#1101669 optimise numa balancing for fast migrate).\n- sched/numa: Remove numa_has_capacity() (bsc#1101669 optimise numa balancing for fast migrate).\n- sched/numa: Remove unused task_capacity from 'struct numa_stats' (bsc#1101669 optimise numa balancing for fast migrate).\n- sched/numa: Reset scan rate whenever task moves across nodes (bsc#1101669 optimise numa balancing for fast migrate).\n- sched/numa: Stop comparing tasks for NUMA placement after selecting an idle core (bsc#1101669 optimise numa balancing for fast migrate).\n- sched/numa: Stop multiple tasks from moving to the CPU at the same time (bsc#1101669 optimise numa balancing for fast migrate).\n- sched/numa: Stop multiple tasks from moving to the CPU at the same time kabi (bsc#1101669 optimise numa balancing for fast migrate).\n- sched/numa: remove unused code from update_numa_stats() (bsc#1101669 optimise numa balancing for fast migrate).\n- sched/numa: remove unused nr_running field (bsc#1101669 optimise numa balancing for fast migrate).\n- scripts/git_sort/git_sort.py: Add fixes branch from mkp/scsi.git.\n- scripts/git_sort/git_sort.py: add libnvdimm-for-next branch\n- scripts/git_sort/git_sort.py: add mkp 4.20/scsi-queue\n- scripts: modpost: check memory allocation results (bsc#1051510).\n- scsi: core: Allow state transitions from OFFLINE to BLOCKED (bsc#1112246).\n- scsi: cxlflash: Abstract hardware dependent assignments ().\n- scsi: cxlflash: Acquire semaphore before invoking ioctl services ().\n- scsi: cxlflash: Adapter context init can return error ().\n- scsi: cxlflash: Adapter context support for OCXL ().\n- scsi: cxlflash: Add argument identifier names ().\n- scsi: cxlflash: Add include guards to backend.h ().\n- scsi: cxlflash: Avoid clobbering context control register value ().\n- scsi: cxlflash: Enable OCXL operations ().\n- scsi: cxlflash: Explicitly cache number of interrupts per context ().\n- scsi: cxlflash: Handle spurious interrupts ().\n- scsi: cxlflash: Hardware AFU for OCXL ().\n- scsi: cxlflash: Introduce OCXL backend ().\n- scsi: cxlflash: Introduce OCXL context state machine ().\n- scsi: cxlflash: Introduce object handle fop ().\n- scsi: cxlflash: Isolate external module dependencies ().\n- scsi: cxlflash: Limit the debug logs in the IO path ().\n- scsi: cxlflash: MMIO map the AFU ().\n- scsi: cxlflash: Preserve number of interrupts for master contexts ().\n- scsi: cxlflash: Read host AFU configuration ().\n- scsi: cxlflash: Read host function configuration ().\n- scsi: cxlflash: Register for translation errors ().\n- scsi: cxlflash: Remove commmands from pending list on timeout ().\n- scsi: cxlflash: Remove embedded CXL work structures ().\n- scsi: cxlflash: Setup AFU PASID ().\n- scsi: cxlflash: Setup AFU acTag range ().\n- scsi: cxlflash: Setup LISNs for master contexts ().\n- scsi: cxlflash: Setup LISNs for user contexts ().\n- scsi: cxlflash: Setup OCXL transaction layer ().\n- scsi: cxlflash: Setup function OCXL link ().\n- scsi: cxlflash: Setup function acTag range ().\n- scsi: cxlflash: Staging to support future accelerators ().\n- scsi: cxlflash: Support AFU interrupt management ().\n- scsi: cxlflash: Support AFU interrupt mapping and registration ().\n- scsi: cxlflash: Support AFU reset ().\n- scsi: cxlflash: Support AFU state toggling ().\n- scsi: cxlflash: Support adapter context discovery ().\n- scsi: cxlflash: Support adapter context mmap and release ().\n- scsi: cxlflash: Support adapter context polling ().\n- scsi: cxlflash: Support adapter context reading ().\n- scsi: cxlflash: Support adapter file descriptors for OCXL ().\n- scsi: cxlflash: Support file descriptor mapping ().\n- scsi: cxlflash: Support image reload policy modification ().\n- scsi: cxlflash: Support process element lifecycle ().\n- scsi: cxlflash: Support process specific mappings ().\n- scsi: cxlflash: Support reading adapter VPD data ().\n- scsi: cxlflash: Support starting an adapter context ().\n- scsi: cxlflash: Support starting user contexts ().\n- scsi: cxlflash: Synchronize reset and remove ops ().\n- scsi: cxlflash: Use IDR to manage adapter contexts ().\n- scsi: cxlflash: Use local mutex for AFU serialization ().\n- scsi: cxlflash: Yield to active send threads ().\n- scsi: fcoe: hold disc_mutex when traversing rport lists (bsc#1077989).\n- scsi: hisi_sas: Add SATA FIS check for v3 hw ().\n- scsi: hisi_sas: Add a flag to filter PHY events during reset ().\n- scsi: hisi_sas: Add missing PHY spinlock init ().\n- scsi: hisi_sas: Adjust task reject period during host reset ().\n- scsi: hisi_sas: Drop hisi_sas_slot_abort() ().\n- scsi: hisi_sas: Fix the conflict between dev gone and host reset ().\n- scsi: hisi_sas: Fix the failure of recovering PHY from STP link timeout ().\n- scsi: hisi_sas: Implement handlers of PCIe FLR for v3 hw ().\n- scsi: hisi_sas: Only process broadcast change in phy_bcast_v3_hw() ().\n- scsi: hisi_sas: Pre-allocate slot DMA buffers ().\n- scsi: hisi_sas: Release all remaining resources in clear nexus ha ().\n- scsi: hisi_sas: Tidy hisi_sas_task_prep() ().\n- scsi: hisi_sas: Use dmam_alloc_coherent() ().\n- scsi: hisi_sas: add memory barrier in task delivery function ().\n- scsi: hisi_sas: relocate some common code for v3 hw ().\n- scsi: hisi_sas: tidy channel interrupt handler for v3 hw ().\n- scsi: hisi_sas: tidy host controller reset function a bit ().\n- scsi: hpsa: limit transfer length to 1MB, not 512kB (bsc#1102346).\n- scsi: ipr: Eliminate duplicate barriers ().\n- scsi: ipr: System hung while dlpar adding primary ipr adapter back (bsc#1109336).\n- scsi: ipr: Use dma_pool_zalloc() ().\n- scsi: ipr: fix incorrect indentation of assignment statement ().\n- scsi: libfc: Add lockdep annotations (bsc#1077989).\n- scsi: libfc: check fc_frame_payload_get() return value for null (bsc#1104731).\n- scsi: libfc: fixup 'sleeping function called from invalid context' (bsc#1077989).\n- scsi: libfc: fixup lockdep annotations (bsc#1077989).\n- scsi: libfc: hold disc_mutex in fc_disc_stop_rports() (bsc#1077989).\n- scsi: libfc: retry PRLI if we cannot analyse the payload (bsc#1104731).\n- scsi: lpfc: Correct MDS diag and nvmet configuration (bsc#1106636).\n- scsi: mpt3sas: Fix calltrace observed while running IO reset (bsc#1077989).\n- scsi: netvsc: Use the vmbus function to calculate ring buffer percentage (bsc#1107207).\n- scsi: qedi: Add the CRC size within iSCSI NVM image (bsc#1110538).\n- scsi: qedi: Initialize the stats mutex lock (bsc#1110538).\n- scsi: qla2xxx: Add appropriate debug info for invalid RX_ID (bsc#1108870).\n- scsi: qla2xxx: Add logic to detect ABTS hang and response completion (bsc#1108870).\n- scsi: qla2xxx: Add longer window for chip reset (bsc#1086327,).\n- scsi: qla2xxx: Add mode control for each physical port (bsc#1108870).\n- scsi: qla2xxx: Add support for ZIO6 interrupt threshold (bsc#1108870).\n- scsi: qla2xxx: Allow FC-NVMe underrun to be handled by transport (bsc#1108870).\n- scsi: qla2xxx: Check for Register disconnect (bsc#1108870).\n- scsi: qla2xxx: Cleanup for N2N code (bsc#1086327,).\n- scsi: qla2xxx: Decrement login retry count for only plogi (bsc#1108870).\n- scsi: qla2xxx: Defer chip reset until target mode is enabled (bsc#1108870).\n- scsi: qla2xxx: Fix ISP recovery on unload (bsc#1086327,).\n- scsi: qla2xxx: Fix Management Server NPort handle reservation logic (bsc#1086327,).\n- scsi: qla2xxx: Fix N2N link re-connect (bsc#1086327,).\n- scsi: qla2xxx: Fix NVMe Target discovery (bsc#1108870).\n- scsi: qla2xxx: Fix NVMe session hang on unload (bsc#1108870).\n- scsi: qla2xxx: Fix Remote port registration (bsc#1108870).\n- scsi: qla2xxx: Fix deadlock between ATIO and HW lock (bsc#1108870).\n- scsi: qla2xxx: Fix double increment of switch scan retry count (bsc#1108870).\n- scsi: qla2xxx: Fix driver hang when FC-NVMe LUNs are configured (bsc#1108870).\n- scsi: qla2xxx: Fix dropped srb resource (bsc#1108870).\n- scsi: qla2xxx: Fix duplicate switch database entries (bsc#1108870).\n- scsi: qla2xxx: Fix duplicate switch's Nport ID entries (bsc#1108870).\n- scsi: qla2xxx: Fix early srb free on abort (bsc#1108870).\n- scsi: qla2xxx: Fix for double free of SRB structure (bsc#1108870).\n- scsi: qla2xxx: Fix iIDMA error (bsc#1108870).\n- scsi: qla2xxx: Fix incorrect port speed being set for FC adapters (bsc#1108870).\n- scsi: qla2xxx: Fix issue reported by static checker for qla2x00_els_dcmd2_sp_done() (bsc#1086327,).\n- scsi: qla2xxx: Fix login retry count (bsc#1086327,).\n- scsi: qla2xxx: Fix memory leak for allocating abort IOCB (bsc#1111830).\n- scsi: qla2xxx: Fix out of order Termination and ABTS response (bsc#1108870).\n- scsi: qla2xxx: Fix port speed display on chip reset (bsc#1108870).\n- scsi: qla2xxx: Fix premature command free (bsc#1108870).\n- scsi: qla2xxx: Fix process response queue for ISP26XX and above (bsc#1108870).\n- scsi: qla2xxx: Fix race between switch cmd completion and timeout (bsc#1086327,).\n- scsi: qla2xxx: Fix race condition for resource cleanup (bsc#1108870).\n- scsi: qla2xxx: Fix re-using LoopID when handle is in use (bsc#1108870).\n- scsi: qla2xxx: Fix recursive mailbox timeout (bsc#1108870).\n- scsi: qla2xxx: Fix redundant fc_rport registration (bsc#1086327,).\n- scsi: qla2xxx: Fix session state stuck in Get Port DB (bsc#1086327,).\n- scsi: qla2xxx: Fix stalled relogin (bsc#1086327,).\n- scsi: qla2xxx: Fix stuck session in PLOGI state (bsc#1108870).\n- scsi: qla2xxx: Fix unintended Logout (bsc#1086327,).\n- scsi: qla2xxx: Flush mailbox commands on chip reset (bsc#1086327,).\n- scsi: qla2xxx: Force fw cleanup on ADISC error (bsc#1108870).\n- scsi: qla2xxx: Increase abort timeout value (bsc#1108870).\n- scsi: qla2xxx: Migrate NVME N2N handling into state machine (bsc#1086327,).\n- scsi: qla2xxx: Move ABTS code behind qpair (bsc#1108870).\n- scsi: qla2xxx: Move log messages before issuing command to firmware (bsc#1108870).\n- scsi: qla2xxx: Move rport registration out of internal work_list (bsc#1108870).\n- scsi: qla2xxx: Move {get|rel}_sp to base_qpair struct (bsc#1108870).\n- scsi: qla2xxx: Prevent sysfs access when chip is down (bsc#1086327,).\n- scsi: qla2xxx: Reduce holding sess_lock to prevent CPU lock-up (bsc#1108870).\n- scsi: qla2xxx: Reject bsg request if chip is down (bsc#1108870).\n- scsi: qla2xxx: Remove ASYNC GIDPN switch command (bsc#1108870).\n- scsi: qla2xxx: Remove all rports if fabric scan retry fails (bsc#1108870).\n- scsi: qla2xxx: Remove redundant check for fcport deletion (bsc#1108870).\n- scsi: qla2xxx: Remove stale ADISC_DONE event (bsc#1108870).\n- scsi: qla2xxx: Remove stale debug trace message from tcm_qla2xxx (bsc#1108870).\n- scsi: qla2xxx: Return switch command on a timeout (bsc#1108870).\n- scsi: qla2xxx: Save frame payload size from ICB (bsc#1086327,).\n- scsi: qla2xxx: Serialize mailbox request (bsc#1108870).\n- scsi: qla2xxx: Silent erroneous message (bsc#1086327,).\n- scsi: qla2xxx: Spinlock recursion in qla_target (bsc#1086327,).\n- scsi: qla2xxx: Terminate Plogi/PRLI if WWN is 0 (bsc#1108870).\n- scsi: qla2xxx: Turn off IOCB timeout timer on IOCB completion (bsc#1108870).\n- scsi: qla2xxx: Update driver to version 10.00.00.09-k (bsc#1108870).\n- scsi: qla2xxx: Update driver version to 10.00.00.08-k (bsc#1086327,).\n- scsi: qla2xxx: Update driver version to 10.00.00.10-k (bsc#1108870).\n- scsi: qla2xxx: Update driver version to 10.00.00.11-k (bsc#1108870).\n- scsi: qla2xxx: Update rscn_rcvd field to more meaningful scan_needed (bsc#1108870).\n- scsi: qla2xxx: Use correct qpair for ABTS/CMD (bsc#1108870).\n- scsi: qla2xxx: do not allow negative thresholds (bsc#1108870).\n- scsi: qla2xxx: shutdown chip if reset fail (bsc#1108870).\n- scsi: storsvc: do not set a bounce limit (bsc#1107207).\n- scsi: storvsc: Avoid allocating memory for temp cpumasks (bsc#1107207).\n- scsi: storvsc: Select channel based on available percentage of ring buffer to write (bsc#1107207).\n- scsi: storvsc: Set up correct queue depth values for IDE devices (bsc#1107207).\n- scsi: target: prefer dbroot of /etc/target over /var/target (bsc#1111928).\n- scsi: vmbus: Add function to report available ring buffer to write in total ring size percentage (bsc#1107207).\n- scsi_debug: call resp_XXX function after setting host_scribble (bsc#1069138).\n- scsi_debug: reset injection flags for every_nth \u003e 0 (bsc#1069138).\n- security: check for kstrdup() failure in lsm_append() (bsc#1051510).\n- selftests/bpf/test_maps: exit child process without error in ENOMEM case (bsc#1083647).\n- selftests/bpf: fix a typo in map in map test (bsc#1083647).\n- selftests/x86: Add tests for User-Mode Instruction Prevention (bsc#1110006).\n- selftests/x86: Add tests for the STR and SLDT instructions (bsc#1110006).\n- serial: 8250: Do not service RX FIFO if interrupts are disabled (bsc#1051510).\n- serial: 8250: Fix clearing FIFOs in RS485 mode again (bsc#1051510).\n- serial: 8250_dw: Add ACPI support for uart on Broadcom SoC (bsc#1051510).\n- serial: 8250_dw: always set baud rate in dw8250_set_termios (bsc#1051510).\n- serial: 8250_exar: Read INT0 from slave device, too (bsc#1051510).\n- serial: core: mark port as initialized after successful IRQ change (bsc#1051510).\n- serial: cpm_uart: return immediately from console poll (bsc#1051510).\n- serial: enable spi in sc16is7xx driver References: bsc#1105672\n- serial: imx: restore handshaking irq for imx1 (bsc#1051510).\n- serial: make sc16is7xx driver supported References: bsc#1105672\n- serial: pxa: Fix an error handling path in 'serial_pxa_probe()' (bsc#1051510).\n- serial: sh-sci: Stop RX FIFO timer during port shutdown (bsc#1051510).\n- serial: xuartps: fix typo in cdns_uart_startup (bsc#1051510).\n- series.conf: moved some Xen patches to the sorted region xen/blkfront: correct purging of persistent grants (bsc#1112514).\n- signal: Properly deliver SIGSEGV from x86 uprobes (bsc#1110006).\n- slab: __GFP_ZERO is incompatible with a constructor (bsc#1107060).\n- smb2: fix missing files in root share directory listing (bsc#1112907).\n- smb3: fill in statfs fsid and correct namelen (bsc#1112905).\n- smb3: fix reset of bytes read and written stats (bsc#1112906).\n- smb3: on reconnect set PreviousSessionId field (bsc#1112899).\n- smsc75xx: Check for Wake-on-LAN modes (bsc#1051510).\n- smsc95xx: Check for Wake-on-LAN modes (bsc#1051510).\n- soc/tegra: pmc: Fix child-node lookup (bsc#1051510).\n- soc: fsl: qe: Fix copy/paste bug in ucc_get_tdm_sync_shift() (bsc#1051510).\n- soc: mediatek: pwrap: fix cipher init setting error (bsc#1051510).\n- sock_diag: fix use-after-free read in __sk_free (bsc#1051510).\n- soreuseport: initialise timewait reuseport field (bsc#1051510).\n- sound: do not call skl_init_chip() to reset intel skl soc (bsc#1051510).\n- sound: enable interrupt after dma buffer initialization (bsc#1051510).\n- spi-nor: intel-spi: Fix number of protected range registers for BYT/LPT ().\n- spi/bcm63xx-hsspi: keep pll clk enabled (bsc#1051510).\n- spi: bcm-qspi: switch back to reading flash using smaller chunks (bsc#1051510).\n- spi: cadence: Change usleep_range() to udelay(), for atomic context (bsc#1051510).\n- spi: davinci: fix a NULL pointer dereference (bsc#1051510).\n- spi: pxa2xx: Add support for Intel Ice Lake (bsc#1051510).\n- spi: rspi: Fix interrupted DMA transfers (bsc#1051510).\n- spi: rspi: Fix invalid SPI use during system suspend (bsc#1051510).\n- spi: sh-msiof: Fix handling of write value for SISTR register (bsc#1051510).\n- spi: sh-msiof: Fix invalid SPI use during system suspend (bsc#1051510).\n- spi: sh-msiof: fix deferred probing (bsc#1051510).\n- spi: tegra20-slink: explicitly enable/disable clock (bsc#1051510).\n- squashfs metadata 2: electric boogaloo (bsc#1051510).\n- squashfs: be more careful about metadata corruption (bsc#1051510).\n- squashfs: more metadata hardening (bsc#1051510).\n- squashfs: more metadata hardening (bsc#1051510).\n- sr9800: Check for supported Wake-on-LAN modes (bsc#1051510).\n- sr: get/drop reference to device in revalidate and check_events (bsc#1109979).\n- staging: bcm2835-audio: Check if workqueue allocation failed ().\n- staging: bcm2835-audio: Deliver indirect-PCM transfer error ().\n- staging: bcm2835-audio: Disconnect and free vchi_instance on module_exit() ().\n- staging: bcm2835-audio: Do not leak workqueue if open fails ().\n- staging: bcm2835-audio: constify snd_pcm_ops structures ().\n- staging: bcm2835-audio: make snd_pcm_hardware const ().\n- staging: bcm2835-camera: fix timeout handling in wait_for_completion_timeout (bsc#1051510).\n- staging: bcm2835-camera: handle wait_for_completion_timeout return properly (bsc#1051510).\n- staging: comedi: ni_mio_common: fix subdevice flags for PFI subdevice (bsc#1051510).\n- staging: comedi: ni_mio_common: protect register write overflow (bsc#1051510).\n- staging: lustre: Use 'kvfree()' for memory allocated by 'kvzalloc()' (bsc#1051510).\n- staging: lustre: disable preempt while sampling processor id (bsc#1051510).\n- staging: lustre: fix bug in osc_enter_cache_try (bsc#1051510).\n- staging: lustre: ldlm: free resource when ldlm_lock_create() fails (bsc#1051510).\n- staging: lustre: libcfs: Prevent harmless read underflow (bsc#1051510).\n- staging: lustre: libcfs: fix test for libcfs_ioctl_hdr minimum size (bsc#1051510).\n- staging: lustre: llite: correct removexattr detection (bsc#1051510).\n- staging: lustre: llite: initialize xattr-\u003exe_namelen (bsc#1051510).\n- staging: lustre: lmv: correctly iput lmo_root (bsc#1051510).\n- staging: lustre: lov: use correct env in lov_io_data_version_end() (bsc#1051510).\n- staging: lustre: o2iblnd: Fix FastReg map/unmap for MLX5 (bsc#1051510).\n- staging: lustre: o2iblnd: Fix crash in kiblnd_handle_early_rxs() (bsc#1051510).\n- staging: lustre: o2iblnd: fix race at kiblnd_connect_peer (bsc#1051510).\n- staging: lustre: obd_mount: use correct niduuid suffix (bsc#1051510).\n- staging: lustre: obdclass: return -EFAULT if copy_from_user() fails (bsc#1051510).\n- staging: lustre: ptlrpc: kfree used instead of kvfree (bsc#1051510).\n- staging: lustre: remove invariant in cl_io_read_ahead() (bsc#1051510).\n- staging: lustre: statahead: remove incorrect test on agl_list_empty() (bsc#1051510).\n- staging: rts5208: fix missing error check on call to rtsx_write_register (bsc#1051510).\n- staging: vc04_services: Fix platform_no_drv_owner.cocci warnings ().\n- staging: vc04_services: bcm2835-audio Format multiline comment ().\n- staging: vc04_services: bcm2835-audio: Add blank line after declaration ().\n- staging: vc04_services: bcm2835-audio: Change to unsigned int * ().\n- staging: vc04_services: bcm2835-audio: add SPDX identifiers ().\n- staging: vc04_services: bcm2835-audio: remove redundant license text ().\n- staging: vc04_services: please do not use multiple blank lines ().\n- stm: Potential read overflow in stm_char_policy_set_ioctl() (bsc#1051510).\n- stmmac: fix DMA channel hang in half-duplex mode (networking-stable-18_07_19).\n- string: drop __must_check from strscpy() and restore strscpy() usages in cgroup (bsc#1051510).\n- strparser: Remove early eaten to fix full tcp receive buffer stall (networking-stable-18_07_19).\n- sunxi-rsb: Include OF based modalias in device uevent (bsc#1051510).\n- switchtec: Fix Spectre v1 vulnerability (bsc#1051510).\n- sys: do not hold uts_sem while accessing userspace memory (bsc#1106995).\n- sysfs: Do not return POSIX ACL xattrs via listxattr (git-fixes).\n- target: log Data-Out timeouts as errors (bsc#1095805).\n- target: log NOP ping timeouts as errors (bsc#1095805).\n- target: split out helper for cxn timeout error stashing (bsc#1095805).\n- target: stash sess_err_stats on Data-Out timeout (bsc#1095805).\n- target: use ISCSI_IQN_LEN in iscsi_target_stat (bsc#1095805).\n- target_core_rbd: break up free_device callback (bsc#1105524).\n- target_core_rbd: use RCU in free_device (bsc#1105524).\n- team: Forbid enslaving team device to itself (bsc#1051510).\n- thermal: of-thermal: disable passive polling when thermal zone is disabled (bsc#1051510).\n- thermal: thermal_hwmon: Convert to hwmon_device_register_with_info() (bsc#1103363).\n- thermal_hwmon: Pass the originating device down to hwmon_device_register_with_info (bsc#1103363).\n- thermal_hwmon: Sanitize attribute name passed to hwmon (bsc#1103363).\n- ti: ethernet: cpdma: Use correct format for genpool_* (bsc#1051510).\n- tools build: fix # escaping in .cmd files for future Make (git-fixes).\n- tools/hv: Fix IP reporting by KVP daemon with SRIOV (bsc#1107207).\n- tools/power turbostat: Read extended processor family from CPUID (bsc#1051510).\n- tools/power turbostat: fix -S on UP systems (bsc#1051510).\n- tools/vm/page-types.c: fix 'defined but not used' warning (bsc#1051510).\n- tools/vm/slabinfo.c: fix sign-compare warning (bsc#1051510).\n- tools: hv: fcopy: set 'error' in case an unknown operation was requested (bsc#1107207).\n- tools: hv: fix compiler warnings about major/target_fname (bsc#1107207).\n- tools: hv: include string.h in hv_fcopy_daemon (bsc#1107207).\n- tools: hv: update lsvmbus to be compatible with python3 (bsc#1107207).\n- tools: usb: ffs-test: Fix build on big endian systems (bsc#1051510).\n- tpm: Introduce flag TPM_TRANSMIT_RAW (bsc#1082555).\n- tpm: cmd_ready command can be issued only after granting locality (bsc#1082555).\n- tpm: fix race condition in tpm_common_write() (bsc#1082555).\n- tpm: fix use after free in tpm2_load_context() (bsc#1082555).\n- tpm: separate cmd_ready/go_idle from runtime_pm (bsc#1082555).\n- tpm: tpm_crb: relinquish locality on error path (bsc#1082555).\n- tpm: vtpm_proxy: Implement request_locality function (bsc#1082555).\n- tracepoint: Do not warn on ENOMEM (bsc#1051510).\n- tracing/x86/xen: Remove zero data size trace events trace_xen_mmu_flush_tlb{_all} (bsc#1110006).\n- tracing: Add barrier to trace_printk() buffer nesting modification (bsc#1112219).\n- tsl2550: fix lux1_input error in low light (bsc#1051510).\n- tty/ldsem: Add lockdep asserts for ldisc_sem (bsc#1105428).\n- tty/ldsem: Convert to regular lockdep annotations (bsc#1105428).\n- tty/ldsem: Decrement wait_readers on timeouted down_read() (bsc#1105428).\n- tty/ldsem: Wake up readers after timed out down_write() (bsc#1105428).\n- tty: Do not block on IO when ldisc change is pending (bsc#1105428).\n- tty: Drop tty-\u003ecount on tty_reopen() failure (bsc#1051510).\n- tty: Hold tty_ldisc_lock() during tty_reopen() (bsc#1105428).\n- tty: Simplify tty-\u003ecount math in tty_reopen() (bsc#1105428).\n- tty: fix data race between tty_init_dev and flush of buf (bsc#1105428).\n- tty: fix termios input-speed encoding (bsc#1051510).\n- tty: fix termios input-speed encoding when using BOTHER (bsc#1051510).\n- tty: rocket: Fix possible buffer overwrite on register_PCI (bsc#1051510).\n- tty: serial: 8250: Revert NXP SC16C2552 workaround (bsc#1051510).\n- tty: serial: exar: Relocate sleep wake-up handling (bsc#1051510).\n- tty: serial: lpuart: avoid leaking struct tty_struct (bsc#1051510).\n- tty: vt_ioctl: fix potential Spectre v1 (bsc#1051510).\n- uart: fix race between uart_put_char() and uart_shutdown() (bsc#1051510).\n- ubifs: Check data node size before truncate (bsc#1051510).\n- ubifs: Check for name being NULL while mounting (bsc#1051510).\n- ubifs: Fix directory size calculation for symlinks (bsc#1106230).\n- ubifs: Fix memory leak in lprobs self-check (bsc#1051510).\n- ubifs: Fix synced_i_size calculation for xattr inodes (bsc#1051510).\n- ubifs: xattr: Do not operate on deleted inodes (bsc#1051510).\n- udl-kms: avoid division (bsc#1051510).\n- udl-kms: change down_interruptible to down (bsc#1051510).\n- udl-kms: fix crash due to uninitialized memory (bsc#1051510).\n- udl-kms: handle allocation failure (bsc#1051510).\n- udlfb: set optimal write delay (bsc#1051510).\n- udp: Unbreak modules that rely on external __skb_recv_udp() availability (bsc#1109151).\n- uio, lib: Fix CONFIG_ARCH_HAS_UACCESS_MCSAFE compilation (bsc#1098782).\n- uio: potential double frees if __uio_register_device() fails (bsc#1051510).\n- uio_hv_generic: fix subchannel ring mmap (bsc#1107207).\n- uio_hv_generic: make ring buffer attribute for primary channel (bsc#1107207).\n- uio_hv_generic: set size of ring buffer attribute (bsc#1107207).\n- uio_hv_generic: support sub-channels (bsc#1107207).\n- uio_hv_generic: use correct channel in isr (bsc#1107207).\n- uprobes/x86: Prohibit probing on MOV SS instruction (bsc#1110006).\n- uprobes/x86: Remove incorrect WARN_ON() in uprobe_init_insn() (bsc#1051510).\n- uprobes: Use synchronize_rcu() not synchronize_sched() (bsc#1051510).\n- usb/phy: fix PPC64 build errors in phy-fsl-usb.c (bsc#1051510).\n- usb: Avoid use-after-free by flushing endpoints early in usb_set_interface() (bsc#1051510).\n- usb: Do not die twice if PCI xhci host is not responding in resume (bsc#1051510).\n- usb: cdc_acm: Do not leak URB buffers (bsc#1051510).\n- usb: chipidea: Prevent unbalanced IRQ disable (bsc#1051510).\n- usb: dwc2: Turn on uframe_sched on 'amlogic' platforms (bsc#1102881).\n- usb: dwc2: Turn on uframe_sched on 'bcm' platforms (bsc#1102881).\n- usb: dwc2: Turn on uframe_sched on 'his' platforms (bsc#1102881).\n- usb: dwc2: Turn on uframe_sched on 'stm32f4x9_fsotg' platforms (bsc#1102881).\n- usb: dwc2: fix isoc split in transfer with no data (bsc#1051510).\n- usb: dwc2: gadget: Fix issue in dwc2_gadget_start_isoc() (bsc#1051510).\n- usb: dwc3: change stream event enable bit back to 13 (bsc#1051510).\n- usb: dwc3: pci: add support for Intel IceLake (bsc#1051510).\n- usb: gadget: composite: fix delayed_status race condition when set_interface (bsc#1051510).\n- usb: gadget: dwc2: fix memory leak in gadget_init() (bsc#1051510).\n- usb: gadget: fotg210-udc: Fix memory leak of fotg210-\u003eep[i] (bsc#1051510).\n- usb: gadget: fsl_udc_core: check allocation return value and cleanup on failure (bsc#1051510).\n- usb: gadget: fsl_udc_core: fixup struct_udc_setup documentation (bsc#1051510).\n- usb: gadget: r8a66597: Fix a possible sleep-in-atomic-context bugs in r8a66597_queue() (bsc#1051510).\n- usb: gadget: r8a66597: Fix two possible sleep-in-atomic-context bugs in init_controller() (bsc#1051510).\n- usb: gadget: udc: renesas_usb3: fix maxpacket size of ep0 (bsc#1051510).\n- usb: host: u132-hcd: Fix a sleep-in-atomic-context bug in u132_get_frame() (bsc#1051510).\n- usb: misc: uss720: Fix two sleep-in-atomic-context bugs (bsc#1051510).\n- usb: musb: dsps: do not disable CPPI41 irq in driver teardown (bsc#1051510).\n- usb: uas: add support for more quirk flags (bsc#1051510).\n- usb: wusbcore: security: cast sizeof to int for comparison (bsc#1051510).\n- usb: xhci-mtk: resume USB3 roothub first (bsc#1051510).\n- usb: xhci: increase CRS timeout value (bsc#1051510).\n- usbip: tools: fix atoi() on non-null terminated string (bsc#1051510).\n- use the new async probing feature for the hyperv drivers (bsc#1107207).\n- userfaultfd: hugetlbfs: fix userfaultfd_huge_must_wait() pte access (bsc#1109739).\n- userns: move user access out of the mutex (bsc#1051510).\n- uwb: hwa-rc: fix memory leak at probe (bsc#1051510).\n- vfio/pci: Virtualize Maximum Payload Size (bsc#1051510).\n- vfio/pci: Virtualize Maximum Read Request Size (bsc#1051510).\n- vfio/type1: Fix task tracking for QEMU vCPU hotplug (bsc#1051510).\n- vfs/proc/kcore, x86/mm/kcore: Fix SMAP fault when dumping vsyscall user page (bsc#1110006).\n- vfs: fix freeze protection in mnt_want_write_file() for overlayfs (git-fixes).\n- vhost: correctly check the iova range when waking virtqueue (bsc#1051510).\n- vhost: do not try to access device IOTLB when not initialized (bsc#1051510).\n- vhost: reset metadata cache when initializing new IOTLB (netfilter-stable-18_08_17).\n- vhost: use mutex_lock_nested() in vhost_dev_lock_vqs() (bsc#1051510).\n- vhost_net: validate sock before trying to put its fd (networking-stable-18_07_19).\n- video: fbdev: pxafb: clear allocated memory for video modes (bsc#1051510).\n- video: goldfishfb: fix memory leak on driver remove (bsc#1051510).\n- virtio: pci-legacy: Validate queue pfn (bsc#1051510).\n- vmbus: do not return values for uninitalized channels (bsc#1051510).\n- vmbus: do not return values for uninitalized channels (bsc#1107207).\n- vmci: type promotion bug in qp_host_get_user_memory() (bsc#1105355).\n- vmw_balloon: VMCI_DOORBELL_SET does not check status (bsc#1051510).\n- vmw_balloon: do not use 2MB without batching (bsc#1051510).\n- vmw_balloon: fix VMCI use when balloon built into kernel (bsc#1051510).\n- vmw_balloon: fix inflation of 64-bit GFNs (bsc#1051510).\n- vmw_balloon: remove inflation rate limiting (bsc#1051510).\n- vsock: split dwork to avoid reinitializations (netfilter-stable-18_08_17).\n- vti4: Do not count header length twice on tunnel setup (bsc#1051510).\n- vti6: fix PMTU caching and reporting on xmit (bsc#1051510).\n- vti6: remove !skb-\u003eignore_df check from vti6_xmit() (bsc#1051510).\n- vxlan: add new fdb alloc and create helpers (netfilter-stable-18_07_27).\n- vxlan: fix default fdb entry netlink notify ordering during netdev create (netfilter-stable-18_07_27).\n- vxlan: make netlink notify in vxlan_fdb_destroy optional (netfilter-stable-18_07_27).\n- wan/fsl_ucc_hdlc: use IS_ERR_VALUE() to check return value of qe_muram_alloc (bsc#1051510).\n- watchdog: Mark watchdog touch functions as notrace (git-fixes).\n- wlcore: Add missing PM call for wlcore_cmd_wait_for_event_or_timeout() (bsc#1051510).\n- wlcore: Set rx_status boottime_ns field on rx (bsc#1051510).\n- x86-64/realmode: Add instruction suffix (bsc#1110006).\n- x86/CPU/AMD: Derive CPU topology from CPUID function 0xB when available ().\n- x86/CPU/AMD: Have smp_num_siblings and cpu_llc_id always be present (bsc#1110006).\n- x86/CPU: Add a microcode loader callback (bsc#1110006).\n- x86/CPU: Check CPU feature bits after microcode upgrade (bsc#1110006).\n- x86/CPU: Modify detect_extended_topology() to return result ().\n- x86/EISA: Do not probe EISA bus for Xen PV guests (bsc#1110006).\n- x86/Hyper-V/hv_apic: Build the Hyper-V APIC conditionally (bsc#1107207).\n- x86/Hyper-V/hv_apic: Include asm/apic.h (bsc#1107207).\n- x86/KVM/VMX: Do not set l1tf_flush_l1d from vmx_handle_external_intr() (bsc#1110006).\n- x86/KVM/VMX: Do not set l1tf_flush_l1d to true from vmx_l1d_flush() (bsc#1110006).\n- x86/KVM/VMX: Move the l1tf_flush_l1d test to vmx_l1d_flush() (bsc#1110006).\n- x86/KVM/VMX: Replace 'vmx_l1d_flush_always' with 'vmx_l1d_flush_cond' (bsc#1110006).\n- x86/Kconfig: Limit NR_CPUS on 32-bit to a sane amount (bsc#1110006).\n- x86/LDT: Avoid warning in 32-bit builds with older gcc (bsc#1110006).\n- x86/MCE/AMD: Define a function to get SMCA bank type (bsc#1110006).\n- x86/MCE: Fix stack out-of-bounds write in mce-inject.c: Flags_read() (bsc#1110006).\n- x86/MCE: Remove min interval polling limitation (bsc#1110006).\n- x86/MCE: Report only DRAM ECC as memory errors on AMD systems (bsc#1110006).\n- x86/MCE: Serialize sysfs changes (bsc#1110006).\n- x86/PCI: Make broadcom_postcore_init() check acpi_disabled (bsc#1110006).\n- x86/acpi: Prevent X2APIC id 0xffffffff from being accounted (bsc#1110006).\n- x86/alternatives: Fixup alternative_call_2 (bsc#1110006).\n- x86/apic/vector: Fix off by one in error path (bsc#1110006).\n- x86/apic: Fix restoring boot IRQ mode in reboot and kexec/kdump (bsc#1110006).\n- x86/apic: Set up through-local-APIC mode on the boot CPU if 'noapic' specified (bsc#1110006).\n- x86/apic: Split disable_IO_APIC() into two functions to fix CONFIG_KEXEC_JUMP=y (bsc#1110006).\n- x86/apic: Split out restore_boot_irq_mode() from disable_IO_APIC() (bsc#1110006).\n- x86/asm/memcpy_mcsafe: Add labels for __memcpy_mcsafe() write fault handling (bsc#1098782).\n- x86/asm/memcpy_mcsafe: Add write-protection-fault handling (bsc#1098782).\n- x86/asm/memcpy_mcsafe: Define copy_to_iter_mcsafe() (bsc#1098782).\n- x86/asm/memcpy_mcsafe: Fix copy_to_user_mcsafe() exception handling (bsc#1098782).\n- x86/asm/memcpy_mcsafe: Provide original memcpy_mcsafe_unrolled (bsc#1098782).\n- x86/asm/memcpy_mcsafe: Remove loop unrolling (bsc#1098782).\n- x86/asm/memcpy_mcsafe: Return bytes remaining (bsc#1098782).\n- x86/asm: Add _ASM_ARG* constants for argument registers to asm/asm.h (bsc#1110006).\n- x86/asm: Allow again using asm.h when building for the 'bpf' clang target (bsc#1110006).\n- x86/asm: Do not use the confusing '.ifeq' directive (bsc#1110006).\n- x86/boot/64: Verify alignment of the LOAD segment (bsc#1110006).\n- x86/boot/KASLR: Work around firmware bugs by excluding EFI_BOOT_SERVICES_* and EFI_LOADER_* from KASLR's choice (bsc#1112878).\n- x86/boot/compressed/64: Print error if 5-level paging is not supported (bsc#1110006).\n- x86/boot: Fix if_changed build flip/flop bug (bsc#1110006).\n- x86/boot: Fix kexec booting failure in the SEV bit detection code (bsc#1110301).\n- x86/boot: Move EISA setup to a separate file (bsc#1110006).\n- x86/boot: Relocate definition of the initial state of CR0 (bsc#1110006).\n- x86/build/64: Force the linker to use 2MB page size (bsc#1109603).\n- x86/build: Beautify build log of syscall headers (bsc#1110006).\n- x86/cpu/AMD: Apply the Erratum 688 fix when the BIOS does not (bsc#1110006).\n- x86/cpu/intel: Add missing TLB cpuid values (bsc#1110006).\n- x86/cpufeature: Add User-Mode Instruction Prevention definitions (bsc#1110006).\n- x86/cpufeatures: Add Intel PCONFIG cpufeature (bsc#1110006).\n- x86/cpufeatures: Add Intel Total Memory Encryption cpufeature (bsc#1110006).\n- x86/debug: Handle warnings before the notifier chain, to fix KGDB crash (bsc#1110006).\n- x86/decoder: Add new TEST instruction pattern (bsc#1110006).\n- x86/dumpstack: Save first regs set for the executive summary (bsc#1110006).\n- x86/dumpstack: Unify show_regs() (bsc#1110006).\n- x86/efi: Fix efi_call_phys_epilog() with CONFIG_X86_5LEVEL=y (bsc#1110006).\n- x86/eisa: Add missing include (bsc#1110006).\n- x86/entry/64: Add two more instruction suffixes (bsc#1110006).\n- x86/entry/64: Remove %ebx handling from error_entry/exit (bsc#1102715).\n- x86/entry/64: Use 'xorl' for faster register clearing (bsc#1110006).\n- x86/entry/64: Wipe KASAN stack shadow before rewind_stack_do_exit() (bsc#1110006).\n- x86/entry: Reduce the code footprint of the 'idtentry' macro (bsc#1110006).\n- x86/entry: Use SYSCALL_DEFINE() macros for sys_modify_ldt() (bsc#1110006).\n- x86/espfix/64: Fix espfix double-fault handling on 5-level systems (bsc#1110006).\n- x86/events/intel/ds: Fix bts_interrupt_threshold alignment (git-fixes c1961a4631da).\n- x86/fpu/debug: Remove unused 'x86_fpu_state' and 'x86_fpu_deactivate_state' tracepoints (bsc#1110006).\n- x86/fpu: Make XSAVE check the base CPUID features before enabling (bsc#1110006).\n- x86/fpu: Parse clearcpuid= as early XSAVE argument (bsc#1110006).\n- x86/fpu: Remove second definition of fpu in __fpu__restore_sig() (bsc#1110006).\n- x86/fpu: Remove the explicit clearing of XSAVE dependent features (bsc#1110006).\n- x86/headers/UAPI: Use __u64 instead of u64 in uapi/asm/hyperv.h (bsc#1107207).\n- x86/hyper-V: Allocate the IDT entry early in boot (bsc#1107207).\n- x86/hyper-v: Check cpumask_to_vpset() return value in hyperv_flush_tlb_others_ex() (bsc#1107207).\n- x86/hyper-v: Check for VP_INVAL in hyperv_flush_tlb_others() (bsc#1107207).\n- x86/hyper-v: Fix the circular dependency in IPI enlightenment (bsc#1107207).\n- x86/hyper-v: Fix wrong merge conflict resolution (bsc#1107207).\n- x86/hyper-v: Implement hv_do_fast_hypercall16 (bsc#1107207).\n- x86/hyper-v: Trace PV IPI send (bsc#1107207).\n- x86/hyper-v: Use 'fast' hypercall for HVCALL_SEND_IPI (bsc#1107207).\n- x86/hyper-v: Use cheaper HVCALL_FLUSH_VIRTUAL_ADDRESS_{LIST,SPACE} hypercalls when possible (bsc#1107207).\n- x86/hyper-v: Use cheaper HVCALL_SEND_IPI hypercall when possible (bsc#1107207).\n- x86/hyper-v: allocate and use Virtual Processor Assist Pages (bsc#1107207).\n- x86/hyper-v: define struct hv_enlightened_vmcs and clean field bits (bsc#1107207).\n- x86/hyper-v: detect nested features (bsc#1107207).\n- x86/hyper-v: move definitions from TLFS to hyperv-tlfs.h (bsc#1107207).\n- x86/hyper-v: move hyperv.h out of uapi (bsc#1107207).\n- x86/hyper-v: move struct hv_flush_pcpu{,ex} definitions to common header (bsc#1107207).\n- x86/hyper-v: rename ipi_arg_{ex,non_ex} structures (bsc#1107207).\n- x86/hyperv: Add a function to read both TSC and TSC page value simulateneously (bsc#1107207).\n- x86/hyperv: Add interrupt handler annotations (bsc#1107207).\n- x86/hyperv: Check for required priviliges in hyperv_init() (bsc#1107207).\n- x86/hyperv: Check for required priviliges in hyperv_init() (bsc#1110006).\n- x86/hyperv: Redirect reenlightment notifications on CPU offlining (bsc#1107207).\n- x86/hyperv: Reenlightenment notifications support (bsc#1107207).\n- x86/idt: Load idt early in start_secondary (bsc#1110006).\n- x86/init: fix build with CONFIG_SWAP=n (bsc#1106121).\n- x86/intel_rdt: Enable CMT and MBM on new Skylake stepping (bsc#1110006).\n- x86/intel_rdt: Fix incorrect returned value when creating rdgroup sub-directory in resctrl file system (bsc#1110006).\n- x86/intel_rdt: Fix potential deadlock during resctrl mount (bsc#1110006).\n- x86/intel_rdt: Fix potential deadlock during resctrl unmount (bsc#1110006).\n- x86/irq: Count Hyper-V reenlightenment interrupts (bsc#1107207).\n- x86/irq: Remove an old outdated comment about context tracking races (bsc#1110006).\n- x86/irq: implement irq_data_get_effective_affinity_mask() for v4.12 (bsc#1109772).\n- x86/kasan/64: Teach KASAN about the cpu_entry_area (kasan).\n- x86/kasan: Panic if there is not enough memory to boot (bsc#1110006).\n- x86/kexec: Avoid double free_page() upon do_kexec_load() failure (bsc#1110006).\n- x86/kexec: Correct KEXEC_BACKUP_SRC_END off-by-one error (bsc#1114279).\n- x86/kexec: Make kexec (mostly) work in 5-level paging mode (bsc#1110006).\n- x86/kprobes: Fix kernel crash when probing .entry_trampoline code (bsc#1110006).\n- x86/kvm/hyper-v: add reenlightenment MSRs support (bsc#1107207).\n- x86/kvm/hyper-v: inject #GP only when invalid SINTx vector is unmasked (bsc#1107207).\n- x86/kvm/hyper-v: remove stale entries from vec_bitmap/auto_eoi_bitmap on vector change (bsc#1107207).\n- x86/kvm/vmx: Remove duplicate l1d flush definitions (bsc#1110006).\n- x86/kvm: fix LAPIC timer drift when guest uses periodic mode (bsc#1106240).\n- x86/kvm: rename HV_X64_MSR_APIC_ASSIST_PAGE to HV_X64_MSR_VP_ASSIST_PAGE (bsc#1107207).\n- x86/mce/AMD: Get address from already initialized block (bsc#1110006).\n- x86/mce: Add notifier_block forward declaration (bsc#1110006).\n- x86/mce: Check for alternate indication of machine check recovery on Skylake (bsc#1110006).\n- x86/mce: Do not overwrite MCi_STATUS in mce_no_way_out() (bsc#1110006).\n- x86/mce: Fix incorrect 'Machine check from unknown source' message (bsc#1110006).\n- x86/mce: Fix set_mce_nospec() to avoid #GP fault (bsc#1107783).\n- x86/mce: Improve error message when kernel cannot recover (bsc#1110006).\n- x86/mce: Improve error message when kernel cannot recover (bsc#1110301).\n- x86/mcelog: Get rid of RCU remnants (git-fixes 5de97c9f6d85).\n- x86/memory_failure: Introduce {set, clear}_mce_nospec() (bsc#1107783).\n- x86/microcode/intel: Check microcode revision before updating sibling threads (bsc#1110006).\n- x86/microcode/intel: Fix memleak in save_microcode_patch() (bsc#1110006).\n- x86/microcode/intel: Look into the patch cache first (bsc#1110006).\n- x86/microcode/intel: Save microcode patch unconditionally (bsc#1110006).\n- x86/microcode/intel: Writeback and invalidate caches before updating microcode (bsc#1110006).\n- x86/microcode: Allow late microcode loading with SMT disabled (bsc#1110006).\n- x86/microcode: Attempt late loading only when new microcode is present (bsc#1110006).\n- x86/microcode: Do not exit early from __reload_late() (bsc#1110006).\n- x86/microcode: Do not upload microcode if CPUs are offline (bsc#1110006).\n- x86/microcode: Fix CPU synchronization routine (bsc#1110006).\n- x86/microcode: Get rid of struct apply_microcode_ctx (bsc#1110006).\n- x86/microcode: Make sure boot_cpu_data.microcode is up-to-date (bsc#1110006).\n- x86/microcode: Make the late update update_lock a raw lock for RT (bsc#1110006).\n- x86/microcode: Propagate return value from updating functions (bsc#1110006).\n- x86/microcode: Request microcode on the BSP (bsc#1110006).\n- x86/microcode: Synchronize late microcode loading (bsc#1110006).\n- x86/microcode: Update the new microcode revision unconditionally (bsc#1110006).\n- x86/mm/32: Initialize the CR4 shadow before __flush_tlb_all() (bsc#1110006).\n- x86/mm/64: Rename the register_page_bootmem_memmap() 'size' parameter to 'nr_pages' (bsc#1110006).\n- x86/mm/kasan: Do not use vmemmap_populate() to initialize shadow (kasan).\n- x86/mm/kmmio: Fix mmiotrace for page unaligned addresses (bsc#1110006).\n- x86/mm/kmmio: Make the tracer robust against L1TF (bsc#1110006).\n- x86/mm/memory_hotplug: determine block size based on the end of boot memory (bsc#1108243).\n- x86/mm/pat: Make set_memory_np() L1TF safe (bsc#1110006).\n- x86/mm/pat: Prepare {reserve, free}_memtype() for 'decoy' addresses (bsc#1107783).\n- x86/mm/pti: Add an overflow check to pti_clone_pmds() (bsc#1110006).\n- x86/mm/pti: Fix PTI comment in entry_SYSCALL_64() (bsc#1110006).\n- x86/mm/tlb: Always use lazy TLB mode (bsc#1105467 Reduce IPIs and atomic ops with improved lazy TLB).\n- x86/mm/tlb: Leave lazy TLB mode at page table free time (bsc#1105467 Reduce IPIs and atomic ops with improved lazy TLB).\n- x86/mm/tlb: Make lazy TLB mode lazier (bsc#1105467 Reduce IPIs and atomic ops with improved lazy TLB).\n- x86/mm/tlb: Only send page table free TLB flush to lazy TLB CPUs (bsc#1105467 Reduce IPIs and atomic ops with improved lazy TLB).\n- x86/mm/tlb: Restructure switch_mm_irqs_off() (bsc#1105467 Reduce IPIs and atomic ops with improved lazy TLB).\n- x86/mm/tlb: Skip atomic operations for 'init_mm' in switch_mm_irqs_off() (bsc#1105467 Reduce IPIs and atomic ops with improved lazy TLB).\n- x86/mm: Add TLB purge to free pmd/pte page interfaces (bsc#1110006).\n- x86/mm: Define _PAGE_TABLE using _KERNPG_TABLE (bsc#1110006).\n- x86/mm: Disable ioremap free page handling on x86-PAE (bsc#1110006).\n- x86/mm: Do not forbid _PAGE_RW before init for __ro_after_init (bsc#1110006).\n- x86/mm: Drop TS_COMPAT on 64-bit exec() syscall (bsc#1110006).\n- x86/mm: Expand static page table for fixmap space (bsc#1110006).\n- x86/mm: Fix ELF_ET_DYN_BASE for 5-level paging (bsc#1110006).\n- x86/mm: Fix bogus warning during EFI bootup, use boot_cpu_has() instead of this_cpu_has() in build_cr3_noflush() (bsc#1110006).\n- x86/mm: Relocate page fault error codes to traps.h (bsc#1110006).\n- x86/mm: Remove in_nmi() warning from vmalloc_fault() (bsc#1110006).\n- x86/mm: implement free pmd/pte page interfaces (bsc#1110006).\n- x86/mpx: Do not allow MPX if we have mappings above 47-bit (bsc#1110006).\n- x86/nmi: Fix NMI uaccess race against CR3 switching (bsc#1110006).\n- x86/numa_emulation: Fix emulated-to-physical node mapping (bsc#1110006).\n- x86/oprofile: Fix bogus GCC-8 warning in nmi_setup() (bsc#1110006).\n- x86/pae: use 64 bit atomic xchg function in native_ptep_get_and_clear (bsc#1110006).\n- x86/paravirt: Fix some warning messages (bsc#1065600).\n- x86/paravirt: Fix spectre-v2 mitigations for paravirt guests (bsc#1065600).\n- x86/paravirt: Remove 'noreplace-paravirt' cmdline option (bsc#1110006).\n- x86/percpu: Fix this_cpu_read() (bsc#1110006).\n- x86/pgtable: Do not set huge PUD/PMD on non-leaf entries (bsc#1110006).\n- x86/pkeys: Do not special case protection key 0 (bsc#1110006).\n- x86/pkeys: Override pkey when moving away from PROT_EXEC (bsc#1110006).\n- x86/platform/UV: Add adjustable set memory block size function (bsc#1108243).\n- x86/platform/UV: Add kernel parameter to set memory block size (bsc#1108243).\n- x86/platform/UV: Mark memblock related init code and data correctly (bsc#1108243).\n- x86/platform/UV: Use new set memory block size function (bsc#1108243).\n- x86/power: Fix swsusp_arch_resume prototype (bsc#1110006).\n- x86/process: Do not mix user/kernel regs in 64bit __show_regs() (bsc#1110006).\n- x86/process: Re-export start_thread() (bsc#1110006).\n- x86/pti: Check the return value of pti_user_pagetable_walk_p4d() (bsc#1110006).\n- x86/pti: Check the return value of pti_user_pagetable_walk_pmd() (bsc#1110006).\n- x86/retpoline/checksum32: Convert assembler indirect jumps (bsc#1110006).\n- x86/retpoline/irq32: Convert assembler indirect jumps (bsc#1110006).\n- x86/smp: fix non-SMP broken build due to redefinition of apic_id_is_primary_thread (bsc#1110006).\n- x86/smpboot: Do not use mwait_play_dead() on AMD systems (bsc#1110006).\n- x86/spectre: Add missing family 6 check to microcode check (git-fixes a5b296636453).\n- x86/spectre: Fix spelling mistake: 'vunerable'-\u003e 'vulnerable' (bsc#1110006).\n- x86/speculation, objtool: Annotate indirect calls/jumps for objtool on 32-bit kernels (bsc#1110006).\n- x86/speculation/l1tf: Exempt zeroed PTEs from inversion (bsc#1110006).\n- x86/speculation/l1tf: Extend 64bit swap file size limit (bsc#1110006).\n- x86/speculation/l1tf: Fix off-by-one error when warning that system has too much RAM (bsc#1105536).\n- x86/speculation/l1tf: Fix overflow in l1tf_pfn_limit() on 32bit (bsc#1105536).\n- x86/speculation/l1tf: Fix up pte-\u003epfn conversion for PAE (bsc#1110006).\n- x86/speculation/l1tf: Increase l1tf memory limit for Nehalem+ (bsc#1105536).\n- x86/speculation/l1tf: Invert all not present mappings (bsc#1110006).\n- x86/speculation/l1tf: Make pmd/pud_mknotpresent() invert (bsc#1110006).\n- x86/speculation/l1tf: Protect PAE swap entries against L1TF (bsc#1110006).\n- x86/speculation/l1tf: Suggest what to do on systems with too much RAM (bsc#1105536).\n- x86/speculation: Simplify sysfs report of VMX L1TF vulnerability (bsc#1110006).\n- x86/speculation: Use ARCH_CAPABILITIES to skip L1D flush on vmentry (bsc#1106369).\n- x86/time: Correct the attribute on jiffies' definition (bsc#1110006).\n- x86/topology: Update the 'cpu cores' field in /proc/cpuinfo correctly across CPU hotplug operations (bsc#1110006).\n- x86/tsc: Add missing header to tsc_msr.c (bsc#1110006).\n- x86/tsc: Allow TSC calibration without PIT (bsc#1110006).\n- x86/tsc: Prevent 32bit truncation in calc_hpet_ref() (bsc#1110006).\n- x86/vdso: Fix asm constraints on vDSO syscall fallbacks (bsc#1110006).\n- x86/vdso: Fix lsl operand order (bsc#1110006).\n- x86/vdso: Fix lsl operand order (bsc#1110301).\n- x86/vdso: Fix vDSO syscall fallback asm constraint regression (bsc#1110006).\n- x86/xen/efi: Initialize only the EFI struct members used by Xen (bsc#1107945).\n- x86/xen: Add call of speculative_store_bypass_ht_init() to PV paths (bsc#1065600).\n- x86/xen: Delay get_cpu_cap until stack canary is established (bsc#1110006).\n- x86/xen: Drop 5-level paging support code from the XEN_PV code (bsc#1110006).\n- x86/xen: Reset VCPU0 info pointer after shared_info remap (bsc#1110006).\n- x86/xen: do not write ptes directly in 32-bit PV guests (bsc#1110006).\n- x86: Add check for APIC access address for vmentry of L2 guests (bsc#1110006).\n- x86: Call fixup_exception() before notify_die() in math_error() (bsc#1110006).\n- x86: Delay skip of emulated hypercall instruction (bsc#1107207).\n- x86: Delay skip of emulated hypercall instruction (bsc#1110006).\n- x86: PM: Make APM idle driver initialize polling state (bsc#1110006).\n- x86: i8259: Add missing include file (bsc#1110006).\n- x86: irq_remapping: Move irq remapping mode enum ().\n- x86: kvm: avoid unused variable warning (bsc#1110006).\n- x86: msr-index.h: Correct SNB_C1/C3_AUTO_UNDEMOTE defines (bsc#1110006).\n- x86: msr-index.h: Correct SNB_C1/C3_AUTO_UNDEMOTE defines (bsc#1110301).\n- xen-netfront: fix bug concerning replacement of MAX_SKB_FRAGS with XEN_NETIF_NR_SLOTS_MIN (bsc#1104824).\n- xen-netfront: fix queue name setting (bsc#1065600).\n- xen-netfront: fix warn message as irq device name has '/' (bsc#1065600).\n- xen-swiotlb: fix the check condition for xen_swiotlb_free_coherent (bsc#1065600).\n- xen/PVH: Set up GS segment for stack canary (bsc#1110006).\n- xen/blkback: do not keep persistent grants too long (bsc#1085042).\n- xen/blkback: move persistent grants flags to bool (bsc#1085042).\n- xen/blkback: remove unused pers_gnts_lock from struct (bsc#1085042).\n- xen/blkfront: cleanup stale persistent grants (bsc#1085042).\n- xen/blkfront: reorder tests in xlblk_init() (bsc#1085042).\n- xen/gntdev: avoid out of bounds access in case of partial gntdev_mmap() (bsc#1065600).\n- xen/x86/vpmu: Zero struct pt_regs before calling into sample handling code (bsc#1110006).\n- xen: Fix {set,clear}_foreign_p2m_mapping on autotranslating guests (bsc#1110006).\n- xen: Remove unnecessary BUG_ON from __unbind_from_irq() (bsc#1065600).\n- xen: avoid crash in disable_hotplug_cpu (bsc#1106594).\n- xen: issue warning message when out of grant maptrack entries (bsc#1105795).\n- xen: xenbus_dev_frontend: Fix XS_TRANSACTION_END handling (bsc#1065600).\n- xen: xenbus_dev_frontend: Really return response string (bsc#1065600).\n- xenbus: track caller request id (bsc#1065600).\n- xfrm: use complete IPv6 addresses for hash (bsc#1109330).\n- xfs, dax: introduce xfs_dax_aops (bsc#1104888).\n- xfs: Fix per-inode DAX flag inheritance (Git-fixes bsc#1109511).\n- xfs: Remove dead code from inode recover function (bsc#1105396).\n- xfs: add a new xfs_iext_lookup_extent_before helper (bsc#1095344).\n- xfs: add a xfs_bmap_fork_to_state helper (bsc#1095344).\n- xfs: add a xfs_iext_update_extent helper (bsc#1095344).\n- xfs: add asserts for the mmap lock in xfs_{insert,collapse}_file_space (bsc#1095344).\n- xfs: add comments documenting the rebalance algorithm (bsc#1095344).\n- xfs: add some comments to xfs_iext_insert/xfs_iext_insert_node (bsc#1095344).\n- xfs: allow unaligned extent records in xfs_bmbt_disk_set_all (bsc#1095344).\n- xfs: do not create overlapping extents in xfs_bmap_add_extent_delay_real (bsc#1095344).\n- xfs: do not fail when converting shortform attr to long form during ATTR_REPLACE (bsc#1105025).\n- xfs: do not rely on extent indices in xfs_bmap_collapse_extents (bsc#1095344).\n- xfs: do not rely on extent indices in xfs_bmap_insert_extents (bsc#1095344).\n- xfs: do not set XFS_BTCUR_BPRV_WASDEL in xfs_bunmapi (bsc#1095344).\n- xfs: fix memory leak in xfs_iext_free_last_leaf (bsc#1095344).\n- xfs: fix number of records handling in xfs_iext_split_leaf (bsc#1095344).\n- xfs: fix type usage (bsc#1095344).\n- xfs: handle zero entries case in xfs_iext_rebalance_leaf (bsc#1095344).\n- xfs: inline xfs_shift_file_space into callers (bsc#1095344).\n- xfs: introduce the xfs_iext_cursor abstraction (bsc#1095344).\n- xfs: iterate backwards in xfs_reflink_cancel_cow_blocks (bsc#1095344).\n- xfs: iterate over extents in xfs_bmap_extents_to_btree (bsc#1095344).\n- xfs: iterate over extents in xfs_iextents_copy (bsc#1095344).\n- xfs: make better use of the 'state' variable in xfs_bmap_del_extent_real (bsc#1095344).\n- xfs: merge xfs_bmap_read_extents into xfs_iread_extents (bsc#1095344).\n- xfs: move pre/post-bmap tracing into xfs_iext_update_extent (bsc#1095344).\n- xfs: move some code around inside xfs_bmap_shift_extents (bsc#1095344).\n- xfs: move some more code into xfs_bmap_del_extent_real (bsc#1095344).\n- xfs: move xfs_bmbt_irec and xfs_exntst_t to xfs_types.h (bsc#1095344).\n- xfs: move xfs_iext_insert tracepoint to report useful information (bsc#1095344).\n- xfs: pass a struct xfs_bmbt_irec to xfs_bmbt_lookup_eq (bsc#1095344).\n- xfs: pass a struct xfs_bmbt_irec to xfs_bmbt_update (bsc#1095344).\n- xfs: pass an on-disk extent to xfs_bmbt_validate_extent (bsc#1095344).\n- xfs: pass struct xfs_bmbt_irec to xfs_bmbt_validate_extent (bsc#1095344).\n- xfs: preserve i_rdev when recycling a reclaimable inode (bsc#1095344).\n- xfs: refactor delalloc accounting in xfs_bmap_add_extent_delay_real (bsc#1095344).\n- xfs: refactor dir2 leaf readahead shadow buffer cleverness (bsc#1095344).\n- xfs: refactor xfs_bmap_add_extent_delay_real (bsc#1095344).\n- xfs: refactor xfs_bmap_add_extent_hole_delay (bsc#1095344).\n- xfs: refactor xfs_bmap_add_extent_hole_real (bsc#1095344).\n- xfs: refactor xfs_bmap_add_extent_unwritten_real (bsc#1095344).\n- xfs: refactor xfs_del_extent_real (bsc#1095344).\n- xfs: remove XFS_BMAP_MAX_SHIFT_EXTENTS (bsc#1095344).\n- xfs: remove XFS_BMAP_TRACE_EXLIST (bsc#1095344).\n- xfs: remove a duplicate assignment in xfs_bmap_add_extent_delay_real (bsc#1095344).\n- xfs: remove a superflous assignment in xfs_iext_remove_node (bsc#1095344).\n- xfs: remove all xfs_bmbt_set_* helpers except for xfs_bmbt_set_all (bsc#1095344).\n- xfs: remove if_rdev (bsc#1095344).\n- xfs: remove post-bmap tracing in xfs_bmap_local_to_extents (bsc#1095344).\n- xfs: remove support for inlining data/extents into the inode fork (bsc#1095344).\n- xfs: remove the never fully implemented UUID fork format (bsc#1095344).\n- xfs: remove the nr_extents argument to xfs_iext_insert (bsc#1095344).\n- xfs: remove the nr_extents argument to xfs_iext_remove (bsc#1095344).\n- xfs: remove xfs_bmbt_get_state (bsc#1095344).\n- xfs: remove xfs_bmse_shift_one (bsc#1095344).\n- xfs: rename bno to end in __xfs_bunmapi (bsc#1095344).\n- xfs: repair malformed inode items during log recovery (bsc#1105396).\n- xfs: replace xfs_bmbt_lookup_ge with xfs_bmbt_lookup_first (bsc#1095344).\n- xfs: replace xfs_qm_get_rtblks with a direct call to xfs_bmap_count_leaves (bsc#1095344).\n- xfs: rewrite getbmap using the xfs_iext_* helpers (bsc#1095344).\n- xfs: rewrite xfs_bmap_count_leaves using xfs_iext_get_extent (bsc#1095344).\n- xfs: rewrite xfs_bmap_first_unused to make better use of xfs_iext_get_extent (bsc#1095344).\n- xfs: simplify the xfs_getbmap interface (bsc#1095344).\n- xfs: simplify xfs_reflink_convert_cow (bsc#1095344).\n- xfs: split xfs_bmap_shift_extents (bsc#1095344).\n- xfs: switch xfs_bmap_local_to_extents to use xfs_iext_insert (bsc#1095344).\n- xfs: treat idx as a cursor in xfs_bmap_add_extent_delay_real (bsc#1095344).\n- xfs: treat idx as a cursor in xfs_bmap_add_extent_hole_delay (bsc#1095344).\n- xfs: treat idx as a cursor in xfs_bmap_add_extent_hole_real (bsc#1095344).\n- xfs: treat idx as a cursor in xfs_bmap_add_extent_unwritten_real (bsc#1095344).\n- xfs: treat idx as a cursor in xfs_bmap_collapse_extents (bsc#1095344).\n- xfs: treat idx as a cursor in xfs_bmap_del_extent_* (bsc#1095344).\n- xfs: trivial indentation fixup for xfs_iext_remove_node (bsc#1095344).\n- xfs: update got in xfs_bmap_shift_update_extent (bsc#1095344).\n- xfs: use a b+tree for the in-core extent list (bsc#1095344).\n- xfs: use correct state defines in xfs_bmap_del_extent_{cow,delay} (bsc#1095344).\n- xfs: use the state defines in xfs_bmap_del_extent_real (bsc#1095344).\n- xfs: use xfs_bmap_del_extent_delay for the data fork as well (bsc#1095344).\n- xfs: use xfs_iext_*_extent helpers in xfs_bmap_shift_extents (bsc#1095344).\n- xfs: use xfs_iext_*_extent helpers in xfs_bmap_split_extent_at (bsc#1095344).\n- xfs: use xfs_iext_get_extent in xfs_bmap_first_unused (bsc#1095344).\n- xfs: use xfs_iext_get_extent instead of open coding it (bsc#1095344).\n- xhci: Add missing CAS workaround for Intel Sunrise Point xHCI (bsc#1051510).\n- xhci: Do not print a warning when setting link state for disabled ports (bsc#1051510).\n- xhci: Fix use after free for URB cancellation on a reallocated endpoint (bsc#1051510).\n- zram: fix null dereference of handle (bsc#1105355).\n",
      "Title": "Details",
      "Type": "General"
    },
    {
      "Text": "The CVRF data is provided by SUSE under the Creative Commons License 4.0 with Attribution (CC-BY-4.0).",
      "Title": "Terms of Use",
      "Type": "Legal Disclaimer"
    },
    {
      "Text": "SUSE-SLE-Module-Public-Cloud-15-2018-2819",
      "Title": "Patchnames",
      "Type": "Details"
    }
  ],
  "ProductTree": {
    "Relationships": [
      {
        "ProductReference": "kernel-azure-4.12.14-5.16.1",
        "RelatesToProductReference": "SUSE Linux Enterprise Module for Public Cloud 15",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "kernel-azure-base-4.12.14-5.16.1",
        "RelatesToProductReference": "SUSE Linux Enterprise Module for Public Cloud 15",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "kernel-azure-devel-4.12.14-5.16.1",
        "RelatesToProductReference": "SUSE Linux Enterprise Module for Public Cloud 15",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "kernel-devel-azure-4.12.14-5.16.1",
        "RelatesToProductReference": "SUSE Linux Enterprise Module for Public Cloud 15",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "kernel-source-azure-4.12.14-5.16.1",
        "RelatesToProductReference": "SUSE Linux Enterprise Module for Public Cloud 15",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "kernel-syms-azure-4.12.14-5.16.1",
        "RelatesToProductReference": "SUSE Linux Enterprise Module for Public Cloud 15",
        "RelationType": "Default Component Of"
      }
    ]
  },
  "References": [
    {
      "URL": "https://www.suse.com/support/update/announcement/2018/suse-su-20183961-1/",
      "Description": "Link for SUSE-SU-2018:3961-1"
    },
    {
      "URL": "https://lists.suse.com/pipermail/sle-security-updates/2018-November/004905.html",
      "Description": "E-Mail link for SUSE-SU-2018:3961-1"
    },
    {
      "URL": "https://www.suse.com/support/security/rating/",
      "Description": "SUSE Security Ratings"
    },
    {
      "URL": "https://bugzilla.suse.com/1012382",
      "Description": "SUSE Bug 1012382"
    },
    {
      "URL": "https://bugzilla.suse.com/1031392",
      "Description": "SUSE Bug 1031392"
    },
    {
      "URL": "https://bugzilla.suse.com/1043912",
      "Description": "SUSE Bug 1043912"
    },
    {
      "URL": "https://bugzilla.suse.com/1044189",
      "Description": "SUSE Bug 1044189"
    },
    {
      "URL": "https://bugzilla.suse.com/1046302",
      "Description": "SUSE Bug 1046302"
    },
    {
      "URL": "https://bugzilla.suse.com/1046305",
      "Description": "SUSE Bug 1046305"
    },
    {
      "URL": "https://bugzilla.suse.com/1046306",
      "Description": "SUSE Bug 1046306"
    },
    {
      "URL": "https://bugzilla.suse.com/1046307",
      "Description": "SUSE Bug 1046307"
    },
    {
      "URL": "https://bugzilla.suse.com/1046540",
      "Description": "SUSE Bug 1046540"
    },
    {
      "URL": "https://bugzilla.suse.com/1046543",
      "Description": "SUSE Bug 1046543"
    },
    {
      "URL": "https://bugzilla.suse.com/1050244",
      "Description": "SUSE Bug 1050244"
    },
    {
      "URL": "https://bugzilla.suse.com/1050319",
      "Description": "SUSE Bug 1050319"
    },
    {
      "URL": "https://bugzilla.suse.com/1050536",
      "Description": "SUSE Bug 1050536"
    },
    {
      "URL": "https://bugzilla.suse.com/1050540",
      "Description": "SUSE Bug 1050540"
    },
    {
      "URL": "https://bugzilla.suse.com/1051510",
      "Description": "SUSE Bug 1051510"
    },
    {
      "URL": "https://bugzilla.suse.com/1054914",
      "Description": "SUSE Bug 1054914"
    },
    {
      "URL": "https://bugzilla.suse.com/1055014",
      "Description": "SUSE Bug 1055014"
    },
    {
      "URL": "https://bugzilla.suse.com/1055117",
      "Description": "SUSE Bug 1055117"
    },
    {
      "URL": "https://bugzilla.suse.com/1055120",
      "Description": "SUSE Bug 1055120"
    },
    {
      "URL": "https://bugzilla.suse.com/1058659",
      "Description": "SUSE Bug 1058659"
    },
    {
      "URL": "https://bugzilla.suse.com/1060463",
      "Description": "SUSE Bug 1060463"
    },
    {
      "URL": "https://bugzilla.suse.com/1061840",
      "Description": "SUSE Bug 1061840"
    },
    {
      "URL": "https://bugzilla.suse.com/1065600",
      "Description": "SUSE Bug 1065600"
    },
    {
      "URL": "https://bugzilla.suse.com/1065729",
      "Description": "SUSE Bug 1065729"
    },
    {
      "URL": "https://bugzilla.suse.com/1066674",
      "Description": "SUSE Bug 1066674"
    },
    {
      "URL": "https://bugzilla.suse.com/1067126",
      "Description": "SUSE Bug 1067126"
    },
    {
      "URL": "https://bugzilla.suse.com/1067906",
      "Description": "SUSE Bug 1067906"
    },
    {
      "URL": "https://bugzilla.suse.com/1068032",
      "Description": "SUSE Bug 1068032"
    },
    {
      "URL": "https://bugzilla.suse.com/1069138",
      "Description": "SUSE Bug 1069138"
    },
    {
      "URL": "https://bugzilla.suse.com/1071995",
      "Description": "SUSE Bug 1071995"
    },
    {
      "URL": "https://bugzilla.suse.com/1076830",
      "Description": "SUSE Bug 1076830"
    },
    {
      "URL": "https://bugzilla.suse.com/1077761",
      "Description": "SUSE Bug 1077761"
    },
    {
      "URL": "https://bugzilla.suse.com/1077989",
      "Description": "SUSE Bug 1077989"
    },
    {
      "URL": "https://bugzilla.suse.com/1078720",
      "Description": "SUSE Bug 1078720"
    },
    {
      "URL": "https://bugzilla.suse.com/1079524",
      "Description": "SUSE Bug 1079524"
    },
    {
      "URL": "https://bugzilla.suse.com/1080157",
      "Description": "SUSE Bug 1080157"
    },
    {
      "URL": "https://bugzilla.suse.com/1082519",
      "Description": "SUSE Bug 1082519"
    },
    {
      "URL": "https://bugzilla.suse.com/1082555",
      "Description": "SUSE Bug 1082555"
    },
    {
      "URL": "https://bugzilla.suse.com/1083647",
      "Description": "SUSE Bug 1083647"
    },
    {
      "URL": "https://bugzilla.suse.com/1083663",
      "Description": "SUSE Bug 1083663"
    },
    {
      "URL": "https://bugzilla.suse.com/1084760",
      "Description": "SUSE Bug 1084760"
    },
    {
      "URL": "https://bugzilla.suse.com/1084831",
      "Description": "SUSE Bug 1084831"
    },
    {
      "URL": "https://bugzilla.suse.com/1085030",
      "Description": "SUSE Bug 1085030"
    },
    {
      "URL": "https://bugzilla.suse.com/1085042",
      "Description": "SUSE Bug 1085042"
    },
    {
      "URL": "https://bugzilla.suse.com/1085262",
      "Description": "SUSE Bug 1085262"
    },
    {
      "URL": "https://bugzilla.suse.com/1086282",
      "Description": "SUSE Bug 1086282"
    },
    {
      "URL": "https://bugzilla.suse.com/1086283",
      "Description": "SUSE Bug 1086283"
    },
    {
      "URL": "https://bugzilla.suse.com/1086288",
      "Description": "SUSE Bug 1086288"
    },
    {
      "URL": "https://bugzilla.suse.com/1086327",
      "Description": "SUSE Bug 1086327"
    },
    {
      "URL": "https://bugzilla.suse.com/1089663",
      "Description": "SUSE Bug 1089663"
    },
    {
      "URL": "https://bugzilla.suse.com/1090078",
      "Description": "SUSE Bug 1090078"
    },
    {
      "URL": "https://bugzilla.suse.com/1091800",
      "Description": "SUSE Bug 1091800"
    },
    {
      "URL": "https://bugzilla.suse.com/1092903",
      "Description": "SUSE Bug 1092903"
    },
    {
      "URL": "https://bugzilla.suse.com/1094244",
      "Description": "SUSE Bug 1094244"
    },
    {
      "URL": "https://bugzilla.suse.com/1094825",
      "Description": "SUSE Bug 1094825"
    },
    {
      "URL": "https://bugzilla.suse.com/1095344",
      "Description": "SUSE Bug 1095344"
    },
    {
      "URL": "https://bugzilla.suse.com/1095805",
      "Description": "SUSE Bug 1095805"
    },
    {
      "URL": "https://bugzilla.suse.com/1096748",
      "Description": "SUSE Bug 1096748"
    },
    {
      "URL": "https://bugzilla.suse.com/1097105",
      "Description": "SUSE Bug 1097105"
    },
    {
      "URL": "https://bugzilla.suse.com/1097583",
      "Description": "SUSE Bug 1097583"
    },
    {
      "URL": "https://bugzilla.suse.com/1097584",
      "Description": "SUSE Bug 1097584"
    },
    {
      "URL": "https://bugzilla.suse.com/1097585",
      "Description": "SUSE Bug 1097585"
    },
    {
      "URL": "https://bugzilla.suse.com/1097586",
      "Description": "SUSE Bug 1097586"
    },
    {
      "URL": "https://bugzilla.suse.com/1097587",
      "Description": "SUSE Bug 1097587"
    },
    {
      "URL": "https://bugzilla.suse.com/1097588",
      "Description": "SUSE Bug 1097588"
    },
    {
      "URL": "https://bugzilla.suse.com/1098459",
      "Description": "SUSE Bug 1098459"
    },
    {
      "URL": "https://bugzilla.suse.com/1098782",
      "Description": "SUSE Bug 1098782"
    },
    {
      "URL": "https://bugzilla.suse.com/1098822",
      "Description": "SUSE Bug 1098822"
    },
    {
      "URL": "https://bugzilla.suse.com/1099125",
      "Description": "SUSE Bug 1099125"
    },
    {
      "URL": "https://bugzilla.suse.com/1099922",
      "Description": "SUSE Bug 1099922"
    },
    {
      "URL": "https://bugzilla.suse.com/1099999",
      "Description": "SUSE Bug 1099999"
    },
    {
      "URL": "https://bugzilla.suse.com/1100001",
      "Description": "SUSE Bug 1100001"
    },
    {
      "URL": "https://bugzilla.suse.com/1100132",
      "Description": "SUSE Bug 1100132"
    },
    {
      "URL": "https://bugzilla.suse.com/1101480",
      "Description": "SUSE Bug 1101480"
    },
    {
      "URL": "https://bugzilla.suse.com/1101557",
      "Description": "SUSE Bug 1101557"
    },
    {
      "URL": "https://bugzilla.suse.com/1101669",
      "Description": "SUSE Bug 1101669"
    },
    {
      "URL": "https://bugzilla.suse.com/1102346",
      "Description": "SUSE Bug 1102346"
    },
    {
      "URL": "https://bugzilla.suse.com/1102495",
      "Description": "SUSE Bug 1102495"
    },
    {
      "URL": "https://bugzilla.suse.com/1102517",
      "Description": "SUSE Bug 1102517"
    },
    {
      "URL": "https://bugzilla.suse.com/1102715",
      "Description": "SUSE Bug 1102715"
    },
    {
      "URL": "https://bugzilla.suse.com/1102870",
      "Description": "SUSE Bug 1102870"
    },
    {
      "URL": "https://bugzilla.suse.com/1102875",
      "Description": "SUSE Bug 1102875"
    },
    {
      "URL": "https://bugzilla.suse.com/1102877",
      "Description": "SUSE Bug 1102877"
    },
    {
      "URL": "https://bugzilla.suse.com/1102879",
      "Description": "SUSE Bug 1102879"
    },
    {
      "URL": "https://bugzilla.suse.com/1102881",
      "Description": "SUSE Bug 1102881"
    },
    {
      "URL": "https://bugzilla.suse.com/1102882",
      "Description": "SUSE Bug 1102882"
    },
    {
      "URL": "https://bugzilla.suse.com/1102896",
      "Description": "SUSE Bug 1102896"
    },
    {
      "URL": "https://bugzilla.suse.com/1103269",
      "Description": "SUSE Bug 1103269"
    },
    {
      "URL": "https://bugzilla.suse.com/1103308",
      "Description": "SUSE Bug 1103308"
    },
    {
      "URL": "https://bugzilla.suse.com/1103356",
      "Description": "SUSE Bug 1103356"
    },
    {
      "URL": "https://bugzilla.suse.com/1103363",
      "Description": "SUSE Bug 1103363"
    },
    {
      "URL": "https://bugzilla.suse.com/1103387",
      "Description": "SUSE Bug 1103387"
    },
    {
      "URL": "https://bugzilla.suse.com/1103405",
      "Description": "SUSE Bug 1103405"
    },
    {
      "URL": "https://bugzilla.suse.com/1103421",
      "Description": "SUSE Bug 1103421"
    },
    {
      "URL": "https://bugzilla.suse.com/1103543",
      "Description": "SUSE Bug 1103543"
    },
    {
      "URL": "https://bugzilla.suse.com/1103587",
      "Description": "SUSE Bug 1103587"
    },
    {
      "URL": "https://bugzilla.suse.com/1103636",
      "Description": "SUSE Bug 1103636"
    },
    {
      "URL": "https://bugzilla.suse.com/1103948",
      "Description": "SUSE Bug 1103948"
    },
    {
      "URL": "https://bugzilla.suse.com/1103949",
      "Description": "SUSE Bug 1103949"
    },
    {
      "URL": "https://bugzilla.suse.com/1103961",
      "Description": "SUSE Bug 1103961"
    },
    {
      "URL": "https://bugzilla.suse.com/1104172",
      "Description": "SUSE Bug 1104172"
    },
    {
      "URL": "https://bugzilla.suse.com/1104353",
      "Description": "SUSE Bug 1104353"
    },
    {
      "URL": "https://bugzilla.suse.com/1104482",
      "Description": "SUSE Bug 1104482"
    },
    {
      "URL": "https://bugzilla.suse.com/1104683",
      "Description": "SUSE Bug 1104683"
    },
    {
      "URL": "https://bugzilla.suse.com/1104731",
      "Description": "SUSE Bug 1104731"
    },
    {
      "URL": "https://bugzilla.suse.com/1104824",
      "Description": "SUSE Bug 1104824"
    },
    {
      "URL": "https://bugzilla.suse.com/1104888",
      "Description": "SUSE Bug 1104888"
    },
    {
      "URL": "https://bugzilla.suse.com/1104890",
      "Description": "SUSE Bug 1104890"
    },
    {
      "URL": "https://bugzilla.suse.com/1105025",
      "Description": "SUSE Bug 1105025"
    },
    {
      "URL": "https://bugzilla.suse.com/1105190",
      "Description": "SUSE Bug 1105190"
    },
    {
      "URL": "https://bugzilla.suse.com/1105247",
      "Description": "SUSE Bug 1105247"
    },
    {
      "URL": "https://bugzilla.suse.com/1105292",
      "Description": "SUSE Bug 1105292"
    },
    {
      "URL": "https://bugzilla.suse.com/1105322",
      "Description": "SUSE Bug 1105322"
    },
    {
      "URL": "https://bugzilla.suse.com/1105355",
      "Description": "SUSE Bug 1105355"
    },
    {
      "URL": "https://bugzilla.suse.com/1105378",
      "Description": "SUSE Bug 1105378"
    },
    {
      "URL": "https://bugzilla.suse.com/1105396",
      "Description": "SUSE Bug 1105396"
    },
    {
      "URL": "https://bugzilla.suse.com/1105428",
      "Description": "SUSE Bug 1105428"
    },
    {
      "URL": "https://bugzilla.suse.com/1105467",
      "Description": "SUSE Bug 1105467"
    },
    {
      "URL": "https://bugzilla.suse.com/1105524",
      "Description": "SUSE Bug 1105524"
    },
    {
      "URL": "https://bugzilla.suse.com/1105536",
      "Description": "SUSE Bug 1105536"
    },
    {
      "URL": "https://bugzilla.suse.com/1105597",
      "Description": "SUSE Bug 1105597"
    },
    {
      "URL": "https://bugzilla.suse.com/1105603",
      "Description": "SUSE Bug 1105603"
    },
    {
      "URL": "https://bugzilla.suse.com/1105672",
      "Description": "SUSE Bug 1105672"
    },
    {
      "URL": "https://bugzilla.suse.com/1105731",
      "Description": "SUSE Bug 1105731"
    },
    {
      "URL": "https://bugzilla.suse.com/1105795",
      "Description": "SUSE Bug 1105795"
    },
    {
      "URL": "https://bugzilla.suse.com/1105907",
      "Description": "SUSE Bug 1105907"
    },
    {
      "URL": "https://bugzilla.suse.com/1106007",
      "Description": "SUSE Bug 1106007"
    },
    {
      "URL": "https://bugzilla.suse.com/1106016",
      "Description": "SUSE Bug 1106016"
    },
    {
      "URL": "https://bugzilla.suse.com/1106105",
      "Description": "SUSE Bug 1106105"
    },
    {
      "URL": "https://bugzilla.suse.com/1106110",
      "Description": "SUSE Bug 1106110"
    },
    {
      "URL": "https://bugzilla.suse.com/1106121",
      "Description": "SUSE Bug 1106121"
    },
    {
      "URL": "https://bugzilla.suse.com/1106170",
      "Description": "SUSE Bug 1106170"
    },
    {
      "URL": "https://bugzilla.suse.com/1106178",
      "Description": "SUSE Bug 1106178"
    },
    {
      "URL": "https://bugzilla.suse.com/1106229",
      "Description": "SUSE Bug 1106229"
    },
    {
      "URL": "https://bugzilla.suse.com/1106230",
      "Description": "SUSE Bug 1106230"
    },
    {
      "URL": "https://bugzilla.suse.com/1106231",
      "Description": "SUSE Bug 1106231"
    },
    {
      "URL": "https://bugzilla.suse.com/1106233",
      "Description": "SUSE Bug 1106233"
    },
    {
      "URL": "https://bugzilla.suse.com/1106235",
      "Description": "SUSE Bug 1106235"
    },
    {
      "URL": "https://bugzilla.suse.com/1106236",
      "Description": "SUSE Bug 1106236"
    },
    {
      "URL": "https://bugzilla.suse.com/1106237",
      "Description": "SUSE Bug 1106237"
    },
    {
      "URL": "https://bugzilla.suse.com/1106238",
      "Description": "SUSE Bug 1106238"
    },
    {
      "URL": "https://bugzilla.suse.com/1106240",
      "Description": "SUSE Bug 1106240"
    },
    {
      "URL": "https://bugzilla.suse.com/1106291",
      "Description": "SUSE Bug 1106291"
    },
    {
      "URL": "https://bugzilla.suse.com/1106297",
      "Description": "SUSE Bug 1106297"
    },
    {
      "URL": "https://bugzilla.suse.com/1106333",
      "Description": "SUSE Bug 1106333"
    },
    {
      "URL": "https://bugzilla.suse.com/1106369",
      "Description": "SUSE Bug 1106369"
    },
    {
      "URL": "https://bugzilla.suse.com/1106427",
      "Description": "SUSE Bug 1106427"
    },
    {
      "URL": "https://bugzilla.suse.com/1106464",
      "Description": "SUSE Bug 1106464"
    },
    {
      "URL": "https://bugzilla.suse.com/1106509",
      "Description": "SUSE Bug 1106509"
    },
    {
      "URL": "https://bugzilla.suse.com/1106511",
      "Description": "SUSE Bug 1106511"
    },
    {
      "URL": "https://bugzilla.suse.com/1106594",
      "Description": "SUSE Bug 1106594"
    },
    {
      "URL": "https://bugzilla.suse.com/1106636",
      "Description": "SUSE Bug 1106636"
    },
    {
      "URL": "https://bugzilla.suse.com/1106688",
      "Description": "SUSE Bug 1106688"
    },
    {
      "URL": "https://bugzilla.suse.com/1106697",
      "Description": "SUSE Bug 1106697"
    },
    {
      "URL": "https://bugzilla.suse.com/1106779",
      "Description": "SUSE Bug 1106779"
    },
    {
      "URL": "https://bugzilla.suse.com/1106800",
      "Description": "SUSE Bug 1106800"
    },
    {
      "URL": "https://bugzilla.suse.com/1106838",
      "Description": "SUSE Bug 1106838"
    },
    {
      "URL": "https://bugzilla.suse.com/1106890",
      "Description": "SUSE Bug 1106890"
    },
    {
      "URL": "https://bugzilla.suse.com/1106891",
      "Description": "SUSE Bug 1106891"
    },
    {
      "URL": "https://bugzilla.suse.com/1106892",
      "Description": "SUSE Bug 1106892"
    },
    {
      "URL": "https://bugzilla.suse.com/1106893",
      "Description": "SUSE Bug 1106893"
    },
    {
      "URL": "https://bugzilla.suse.com/1106894",
      "Description": "SUSE Bug 1106894"
    },
    {
      "URL": "https://bugzilla.suse.com/1106896",
      "Description": "SUSE Bug 1106896"
    },
    {
      "URL": "https://bugzilla.suse.com/1106897",
      "Description": "SUSE Bug 1106897"
    },
    {
      "URL": "https://bugzilla.suse.com/1106898",
      "Description": "SUSE Bug 1106898"
    },
    {
      "URL": "https://bugzilla.suse.com/1106899",
      "Description": "SUSE Bug 1106899"
    },
    {
      "URL": "https://bugzilla.suse.com/1106900",
      "Description": "SUSE Bug 1106900"
    },
    {
      "URL": "https://bugzilla.suse.com/1106901",
      "Description": "SUSE Bug 1106901"
    },
    {
      "URL": "https://bugzilla.suse.com/1106902",
      "Description": "SUSE Bug 1106902"
    },
    {
      "URL": "https://bugzilla.suse.com/1106903",
      "Description": "SUSE Bug 1106903"
    },
    {
      "URL": "https://bugzilla.suse.com/1106905",
      "Description": "SUSE Bug 1106905"
    },
    {
      "URL": "https://bugzilla.suse.com/1106906",
      "Description": "SUSE Bug 1106906"
    },
    {
      "URL": "https://bugzilla.suse.com/1106948",
      "Description": "SUSE Bug 1106948"
    },
    {
      "URL": "https://bugzilla.suse.com/1106995",
      "Description": "SUSE Bug 1106995"
    },
    {
      "URL": "https://bugzilla.suse.com/1107008",
      "Description": "SUSE Bug 1107008"
    },
    {
      "URL": "https://bugzilla.suse.com/1107060",
      "Description": "SUSE Bug 1107060"
    },
    {
      "URL": "https://bugzilla.suse.com/1107061",
      "Description": "SUSE Bug 1107061"
    },
    {
      "URL": "https://bugzilla.suse.com/1107065",
      "Description": "SUSE Bug 1107065"
    },
    {
      "URL": "https://bugzilla.suse.com/1107074",
      "Description": "SUSE Bug 1107074"
    },
    {
      "URL": "https://bugzilla.suse.com/1107207",
      "Description": "SUSE Bug 1107207"
    },
    {
      "URL": "https://bugzilla.suse.com/1107319",
      "Description": "SUSE Bug 1107319"
    },
    {
      "URL": "https://bugzilla.suse.com/1107320",
      "Description": "SUSE Bug 1107320"
    },
    {
      "URL": "https://bugzilla.suse.com/1107522",
      "Description": "SUSE Bug 1107522"
    },
    {
      "URL": "https://bugzilla.suse.com/1107535",
      "Description": "SUSE Bug 1107535"
    },
    {
      "URL": "https://bugzilla.suse.com/1107685",
      "Description": "SUSE Bug 1107685"
    },
    {
      "URL": "https://bugzilla.suse.com/1107689",
      "Description": "SUSE Bug 1107689"
    },
    {
      "URL": "https://bugzilla.suse.com/1107735",
      "Description": "SUSE Bug 1107735"
    },
    {
      "URL": "https://bugzilla.suse.com/1107756",
      "Description": "SUSE Bug 1107756"
    },
    {
      "URL": "https://bugzilla.suse.com/1107783",
      "Description": "SUSE Bug 1107783"
    },
    {
      "URL": "https://bugzilla.suse.com/1107829",
      "Description": "SUSE Bug 1107829"
    },
    {
      "URL": "https://bugzilla.suse.com/1107870",
      "Description": "SUSE Bug 1107870"
    },
    {
      "URL": "https://bugzilla.suse.com/1107924",
      "Description": "SUSE Bug 1107924"
    },
    {
      "URL": "https://bugzilla.suse.com/1107928",
      "Description": "SUSE Bug 1107928"
    },
    {
      "URL": "https://bugzilla.suse.com/1107945",
      "Description": "SUSE Bug 1107945"
    },
    {
      "URL": "https://bugzilla.suse.com/1107947",
      "Description": "SUSE Bug 1107947"
    },
    {
      "URL": "https://bugzilla.suse.com/1107966",
      "Description": "SUSE Bug 1107966"
    },
    {
      "URL": "https://bugzilla.suse.com/1108010",
      "Description": "SUSE Bug 1108010"
    },
    {
      "URL": "https://bugzilla.suse.com/1108093",
      "Description": "SUSE Bug 1108093"
    },
    {
      "URL": "https://bugzilla.suse.com/1108096",
      "Description": "SUSE Bug 1108096"
    },
    {
      "URL": "https://bugzilla.suse.com/1108170",
      "Description": "SUSE Bug 1108170"
    },
    {
      "URL": "https://bugzilla.suse.com/1108241",
      "Description": "SUSE Bug 1108241"
    },
    {
      "URL": "https://bugzilla.suse.com/1108243",
      "Description": "SUSE Bug 1108243"
    },
    {
      "URL": "https://bugzilla.suse.com/1108260",
      "Description": "SUSE Bug 1108260"
    },
    {
      "URL": "https://bugzilla.suse.com/1108281",
      "Description": "SUSE Bug 1108281"
    },
    {
      "URL": "https://bugzilla.suse.com/1108323",
      "Description": "SUSE Bug 1108323"
    },
    {
      "URL": "https://bugzilla.suse.com/1108377",
      "Description": "SUSE Bug 1108377"
    },
    {
      "URL": "https://bugzilla.suse.com/1108399",
      "Description": "SUSE Bug 1108399"
    },
    {
      "URL": "https://bugzilla.suse.com/1108468",
      "Description": "SUSE Bug 1108468"
    },
    {
      "URL": "https://bugzilla.suse.com/1108520",
      "Description": "SUSE Bug 1108520"
    },
    {
      "URL": "https://bugzilla.suse.com/1108823",
      "Description": "SUSE Bug 1108823"
    },
    {
      "URL": "https://bugzilla.suse.com/1108841",
      "Description": "SUSE Bug 1108841"
    },
    {
      "URL": "https://bugzilla.suse.com/1108870",
      "Description": "SUSE Bug 1108870"
    },
    {
      "URL": "https://bugzilla.suse.com/1109151",
      "Description": "SUSE Bug 1109151"
    },
    {
      "URL": "https://bugzilla.suse.com/1109158",
      "Description": "SUSE Bug 1109158"
    },
    {
      "URL": "https://bugzilla.suse.com/1109217",
      "Description": "SUSE Bug 1109217"
    },
    {
      "URL": "https://bugzilla.suse.com/1109244",
      "Description": "SUSE Bug 1109244"
    },
    {
      "URL": "https://bugzilla.suse.com/1109269",
      "Description": "SUSE Bug 1109269"
    },
    {
      "URL": "https://bugzilla.suse.com/1109330",
      "Description": "SUSE Bug 1109330"
    },
    {
      "URL": "https://bugzilla.suse.com/1109333",
      "Description": "SUSE Bug 1109333"
    },
    {
      "URL": "https://bugzilla.suse.com/1109336",
      "Description": "SUSE Bug 1109336"
    },
    {
      "URL": "https://bugzilla.suse.com/1109337",
      "Description": "SUSE Bug 1109337"
    },
    {
      "URL": "https://bugzilla.suse.com/1109511",
      "Description": "SUSE Bug 1109511"
    },
    {
      "URL": "https://bugzilla.suse.com/1109603",
      "Description": "SUSE Bug 1109603"
    },
    {
      "URL": "https://bugzilla.suse.com/1109739",
      "Description": "SUSE Bug 1109739"
    },
    {
      "URL": "https://bugzilla.suse.com/1109772",
      "Description": "SUSE Bug 1109772"
    },
    {
      "URL": "https://bugzilla.suse.com/1109784",
      "Description": "SUSE Bug 1109784"
    },
    {
      "URL": "https://bugzilla.suse.com/1109806",
      "Description": "SUSE Bug 1109806"
    },
    {
      "URL": "https://bugzilla.suse.com/1109818",
      "Description": "SUSE Bug 1109818"
    },
    {
      "URL": "https://bugzilla.suse.com/1109907",
      "Description": "SUSE Bug 1109907"
    },
    {
      "URL": "https://bugzilla.suse.com/1109915",
      "Description": "SUSE Bug 1109915"
    },
    {
      "URL": "https://bugzilla.suse.com/1109919",
      "Description": "SUSE Bug 1109919"
    },
    {
      "URL": "https://bugzilla.suse.com/1109951",
      "Description": "SUSE Bug 1109951"
    },
    {
      "URL": "https://bugzilla.suse.com/1109979",
      "Description": "SUSE Bug 1109979"
    },
    {
      "URL": "https://bugzilla.suse.com/1109992",
      "Description": "SUSE Bug 1109992"
    },
    {
      "URL": "https://bugzilla.suse.com/1110006",
      "Description": "SUSE Bug 1110006"
    },
    {
      "URL": "https://bugzilla.suse.com/1110096",
      "Description": "SUSE Bug 1110096"
    },
    {
      "URL": "https://bugzilla.suse.com/1110301",
      "Description": "SUSE Bug 1110301"
    },
    {
      "URL": "https://bugzilla.suse.com/1110363",
      "Description": "SUSE Bug 1110363"
    },
    {
      "URL": "https://bugzilla.suse.com/1110538",
      "Description": "SUSE Bug 1110538"
    },
    {
      "URL": "https://bugzilla.suse.com/1110561",
      "Description": "SUSE Bug 1110561"
    },
    {
      "URL": "https://bugzilla.suse.com/1110639",
      "Description": "SUSE Bug 1110639"
    },
    {
      "URL": "https://bugzilla.suse.com/1110642",
      "Description": "SUSE Bug 1110642"
    },
    {
      "URL": "https://bugzilla.suse.com/1110643",
      "Description": "SUSE Bug 1110643"
    },
    {
      "URL": "https://bugzilla.suse.com/1110644",
      "Description": "SUSE Bug 1110644"
    },
    {
      "URL": "https://bugzilla.suse.com/1110645",
      "Description": "SUSE Bug 1110645"
    },
    {
      "URL": "https://bugzilla.suse.com/1110646",
      "Description": "SUSE Bug 1110646"
    },
    {
      "URL": "https://bugzilla.suse.com/1110647",
      "Description": "SUSE Bug 1110647"
    },
    {
      "URL": "https://bugzilla.suse.com/1110649",
      "Description": "SUSE Bug 1110649"
    },
    {
      "URL": "https://bugzilla.suse.com/1110650",
      "Description": "SUSE Bug 1110650"
    },
    {
      "URL": "https://bugzilla.suse.com/1111028",
      "Description": "SUSE Bug 1111028"
    },
    {
      "URL": "https://bugzilla.suse.com/1111040",
      "Description": "SUSE Bug 1111040"
    },
    {
      "URL": "https://bugzilla.suse.com/1111076",
      "Description": "SUSE Bug 1111076"
    },
    {
      "URL": "https://bugzilla.suse.com/1111506",
      "Description": "SUSE Bug 1111506"
    },
    {
      "URL": "https://bugzilla.suse.com/1111806",
      "Description": "SUSE Bug 1111806"
    },
    {
      "URL": "https://bugzilla.suse.com/1111819",
      "Description": "SUSE Bug 1111819"
    },
    {
      "URL": "https://bugzilla.suse.com/1111830",
      "Description": "SUSE Bug 1111830"
    },
    {
      "URL": "https://bugzilla.suse.com/1111834",
      "Description": "SUSE Bug 1111834"
    },
    {
      "URL": "https://bugzilla.suse.com/1111841",
      "Description": "SUSE Bug 1111841"
    },
    {
      "URL": "https://bugzilla.suse.com/1111870",
      "Description": "SUSE Bug 1111870"
    },
    {
      "URL": "https://bugzilla.suse.com/1111901",
      "Description": "SUSE Bug 1111901"
    },
    {
      "URL": "https://bugzilla.suse.com/1111904",
      "Description": "SUSE Bug 1111904"
    },
    {
      "URL": "https://bugzilla.suse.com/1111921",
      "Description": "SUSE Bug 1111921"
    },
    {
      "URL": "https://bugzilla.suse.com/1111928",
      "Description": "SUSE Bug 1111928"
    },
    {
      "URL": "https://bugzilla.suse.com/1111983",
      "Description": "SUSE Bug 1111983"
    },
    {
      "URL": "https://bugzilla.suse.com/1112170",
      "Description": "SUSE Bug 1112170"
    },
    {
      "URL": "https://bugzilla.suse.com/1112208",
      "Description": "SUSE Bug 1112208"
    },
    {
      "URL": "https://bugzilla.suse.com/1112219",
      "Description": "SUSE Bug 1112219"
    },
    {
      "URL": "https://bugzilla.suse.com/1112246",
      "Description": "SUSE Bug 1112246"
    },
    {
      "URL": "https://bugzilla.suse.com/1112372",
      "Description": "SUSE Bug 1112372"
    },
    {
      "URL": "https://bugzilla.suse.com/1112514",
      "Description": "SUSE Bug 1112514"
    },
    {
      "URL": "https://bugzilla.suse.com/1112554",
      "Description": "SUSE Bug 1112554"
    },
    {
      "URL": "https://bugzilla.suse.com/1112708",
      "Description": "SUSE Bug 1112708"
    },
    {
      "URL": "https://bugzilla.suse.com/1112710",
      "Description": "SUSE Bug 1112710"
    },
    {
      "URL": "https://bugzilla.suse.com/1112711",
      "Description": "SUSE Bug 1112711"
    },
    {
      "URL": "https://bugzilla.suse.com/1112712",
      "Description": "SUSE Bug 1112712"
    },
    {
      "URL": "https://bugzilla.suse.com/1112713",
      "Description": "SUSE Bug 1112713"
    },
    {
      "URL": "https://bugzilla.suse.com/1112731",
      "Description": "SUSE Bug 1112731"
    },
    {
      "URL": "https://bugzilla.suse.com/1112732",
      "Description": "SUSE Bug 1112732"
    },
    {
      "URL": "https://bugzilla.suse.com/1112733",
      "Description": "SUSE Bug 1112733"
    },
    {
      "URL": "https://bugzilla.suse.com/1112734",
      "Description": "SUSE Bug 1112734"
    },
    {
      "URL": "https://bugzilla.suse.com/1112735",
      "Description": "SUSE Bug 1112735"
    },
    {
      "URL": "https://bugzilla.suse.com/1112736",
      "Description": "SUSE Bug 1112736"
    },
    {
      "URL": "https://bugzilla.suse.com/1112738",
      "Description": "SUSE Bug 1112738"
    },
    {
      "URL": "https://bugzilla.suse.com/1112739",
      "Description": "SUSE Bug 1112739"
    },
    {
      "URL": "https://bugzilla.suse.com/1112740",
      "Description": "SUSE Bug 1112740"
    },
    {
      "URL": "https://bugzilla.suse.com/1112741",
      "Description": "SUSE Bug 1112741"
    },
    {
      "URL": "https://bugzilla.suse.com/1112743",
      "Description": "SUSE Bug 1112743"
    },
    {
      "URL": "https://bugzilla.suse.com/1112745",
      "Description": "SUSE Bug 1112745"
    },
    {
      "URL": "https://bugzilla.suse.com/1112746",
      "Description": "SUSE Bug 1112746"
    },
    {
      "URL": "https://bugzilla.suse.com/1112878",
      "Description": "SUSE Bug 1112878"
    },
    {
      "URL": "https://bugzilla.suse.com/1112894",
      "Description": "SUSE Bug 1112894"
    },
    {
      "URL": "https://bugzilla.suse.com/1112899",
      "Description": "SUSE Bug 1112899"
    },
    {
      "URL": "https://bugzilla.suse.com/1112902",
      "Description": "SUSE Bug 1112902"
    },
    {
      "URL": "https://bugzilla.suse.com/1112903",
      "Description": "SUSE Bug 1112903"
    },
    {
      "URL": "https://bugzilla.suse.com/1112905",
      "Description": "SUSE Bug 1112905"
    },
    {
      "URL": "https://bugzilla.suse.com/1112906",
      "Description": "SUSE Bug 1112906"
    },
    {
      "URL": "https://bugzilla.suse.com/1112907",
      "Description": "SUSE Bug 1112907"
    },
    {
      "URL": "https://bugzilla.suse.com/1113257",
      "Description": "SUSE Bug 1113257"
    },
    {
      "URL": "https://bugzilla.suse.com/1113284",
      "Description": "SUSE Bug 1113284"
    },
    {
      "URL": "https://bugzilla.suse.com/1113295",
      "Description": "SUSE Bug 1113295"
    },
    {
      "URL": "https://bugzilla.suse.com/1113408",
      "Description": "SUSE Bug 1113408"
    },
    {
      "URL": "https://bugzilla.suse.com/1113667",
      "Description": "SUSE Bug 1113667"
    },
    {
      "URL": "https://bugzilla.suse.com/1113722",
      "Description": "SUSE Bug 1113722"
    },
    {
      "URL": "https://bugzilla.suse.com/1113751",
      "Description": "SUSE Bug 1113751"
    },
    {
      "URL": "https://bugzilla.suse.com/1113780",
      "Description": "SUSE Bug 1113780"
    },
    {
      "URL": "https://bugzilla.suse.com/1113972",
      "Description": "SUSE Bug 1113972"
    },
    {
      "URL": "https://bugzilla.suse.com/1114279",
      "Description": "SUSE Bug 1114279"
    },
    {
      "URL": "https://bugzilla.suse.com/971975",
      "Description": "SUSE Bug 971975"
    },
    {
      "URL": "https://www.suse.com/security/cve/CVE-2017-16533/",
      "Description": "SUSE CVE CVE-2017-16533 page"
    },
    {
      "URL": "https://www.suse.com/security/cve/CVE-2017-18224/",
      "Description": "SUSE CVE CVE-2017-18224 page"
    },
    {
      "URL": "https://www.suse.com/security/cve/CVE-2018-10902/",
      "Description": "SUSE CVE CVE-2018-10902 page"
    },
    {
      "URL": "https://www.suse.com/security/cve/CVE-2018-10938/",
      "Description": "SUSE CVE CVE-2018-10938 page"
    },
    {
      "URL": "https://www.suse.com/security/cve/CVE-2018-10940/",
      "Description": "SUSE CVE CVE-2018-10940 page"
    },
    {
      "URL": "https://www.suse.com/security/cve/CVE-2018-1128/",
      "Description": "SUSE CVE CVE-2018-1128 page"
    },
    {
      "URL": "https://www.suse.com/security/cve/CVE-2018-1129/",
      "Description": "SUSE CVE CVE-2018-1129 page"
    },
    {
      "URL": "https://www.suse.com/security/cve/CVE-2018-12896/",
      "Description": "SUSE CVE CVE-2018-12896 page"
    },
    {
      "URL": "https://www.suse.com/security/cve/CVE-2018-13093/",
      "Description": "SUSE CVE CVE-2018-13093 page"
    },
    {
      "URL": "https://www.suse.com/security/cve/CVE-2018-13095/",
      "Description": "SUSE CVE CVE-2018-13095 page"
    },
    {
      "URL": "https://www.suse.com/security/cve/CVE-2018-14613/",
      "Description": "SUSE CVE CVE-2018-14613 page"
    },
    {
      "URL": "https://www.suse.com/security/cve/CVE-2018-14617/",
      "Description": "SUSE CVE CVE-2018-14617 page"
    },
    {
      "URL": "https://www.suse.com/security/cve/CVE-2018-14633/",
      "Description": "SUSE CVE CVE-2018-14633 page"
    },
    {
      "URL": "https://www.suse.com/security/cve/CVE-2018-15572/",
      "Description": "SUSE CVE CVE-2018-15572 page"
    },
    {
      "URL": "https://www.suse.com/security/cve/CVE-2018-16658/",
      "Description": "SUSE CVE CVE-2018-16658 page"
    },
    {
      "URL": "https://www.suse.com/security/cve/CVE-2018-17182/",
      "Description": "SUSE CVE CVE-2018-17182 page"
    },
    {
      "URL": "https://www.suse.com/security/cve/CVE-2018-18386/",
      "Description": "SUSE CVE CVE-2018-18386 page"
    },
    {
      "URL": "https://www.suse.com/security/cve/CVE-2018-18445/",
      "Description": "SUSE CVE CVE-2018-18445 page"
    },
    {
      "URL": "https://www.suse.com/security/cve/CVE-2018-18710/",
      "Description": "SUSE CVE CVE-2018-18710 page"
    },
    {
      "URL": "https://www.suse.com/security/cve/CVE-2018-6554/",
      "Description": "SUSE CVE CVE-2018-6554 page"
    },
    {
      "URL": "https://www.suse.com/security/cve/CVE-2018-6555/",
      "Description": "SUSE CVE CVE-2018-6555 page"
    },
    {
      "URL": "https://www.suse.com/security/cve/CVE-2018-9363/",
      "Description": "SUSE CVE CVE-2018-9363 page"
    }
  ],
  "Vulnerabilities": [
    {
      "CVE": "CVE-2017-16533",
      "Description": "The usbhid_parse function in drivers/hid/usbhid/hid-core.c in the Linux kernel before 4.13.8 allows local users to cause a denial of service (out-of-bounds read and system crash) or possibly have unspecified other impact via a crafted USB device.",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "moderate"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2017-16533.html",
          "Description": "CVE-2017-16533"
        },
        {
          "URL": "https://bugzilla.suse.com/1066674",
          "Description": "SUSE Bug 1066674"
        },
        {
          "URL": "https://bugzilla.suse.com/1087082",
          "Description": "SUSE Bug 1087082"
        },
        {
          "URL": "https://bugzilla.suse.com/1146519",
          "Description": "SUSE Bug 1146519"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": [
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-azure-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-azure-base-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-azure-devel-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-devel-azure-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-source-azure-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-syms-azure-4.12.14-5.16.1"
          ]
        }
      ],
      "CVSSScoreSets": {
        "BaseScore": "4.7",
        "Vector": "AV:L/AC:M/Au:N/C:N/I:N/A:C"
      }
    },
    {
      "CVE": "CVE-2017-18224",
      "Description": "In the Linux kernel before 4.15, fs/ocfs2/aops.c omits use of a semaphore and consequently has a race condition for access to the extent tree during read operations in DIRECT mode, which allows local users to cause a denial of service (BUG) by modifying a certain e_cpos field.",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "moderate"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2017-18224.html",
          "Description": "CVE-2017-18224"
        },
        {
          "URL": "https://bugzilla.suse.com/1084831",
          "Description": "SUSE Bug 1084831"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": [
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-azure-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-azure-base-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-azure-devel-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-devel-azure-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-source-azure-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-syms-azure-4.12.14-5.16.1"
          ]
        }
      ],
      "CVSSScoreSets": {}
    },
    {
      "CVE": "CVE-2018-10902",
      "Description": "It was found that the raw midi kernel driver does not protect against concurrent access which leads to a double realloc (double free) in snd_rawmidi_input_params() and snd_rawmidi_output_status() which are part of snd_rawmidi_ioctl() handler in rawmidi.c file. A malicious local attacker could possibly use this for privilege escalation.",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "moderate"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2018-10902.html",
          "Description": "CVE-2018-10902"
        },
        {
          "URL": "https://bugzilla.suse.com/1105322",
          "Description": "SUSE Bug 1105322"
        },
        {
          "URL": "https://bugzilla.suse.com/1105323",
          "Description": "SUSE Bug 1105323"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": [
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-azure-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-azure-base-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-azure-devel-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-devel-azure-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-source-azure-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-syms-azure-4.12.14-5.16.1"
          ]
        }
      ],
      "CVSSScoreSets": {}
    },
    {
      "CVE": "CVE-2018-10938",
      "Description": "A flaw was found in the Linux kernel present since v4.0-rc1 and through v4.13-rc4. A crafted network packet sent remotely by an attacker may force the kernel to enter an infinite loop in the cipso_v4_optptr() function in net/ipv4/cipso_ipv4.c leading to a denial-of-service. A certain non-default configuration of LSM (Linux Security Module) and NetLabel should be set up on a system before an attacker could leverage this flaw.",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "important"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2018-10938.html",
          "Description": "CVE-2018-10938"
        },
        {
          "URL": "https://bugzilla.suse.com/1106016",
          "Description": "SUSE Bug 1106016"
        },
        {
          "URL": "https://bugzilla.suse.com/1106191",
          "Description": "SUSE Bug 1106191"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": [
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-azure-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-azure-base-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-azure-devel-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-devel-azure-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-source-azure-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-syms-azure-4.12.14-5.16.1"
          ]
        }
      ],
      "CVSSScoreSets": {}
    },
    {
      "CVE": "CVE-2018-10940",
      "Description": "The cdrom_ioctl_media_changed function in drivers/cdrom/cdrom.c in the Linux kernel before 4.16.6 allows local attackers to use a incorrect bounds check in the CDROM driver CDROM_MEDIA_CHANGED ioctl to read out kernel memory.",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "moderate"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2018-10940.html",
          "Description": "CVE-2018-10940"
        },
        {
          "URL": "https://bugzilla.suse.com/1087082",
          "Description": "SUSE Bug 1087082"
        },
        {
          "URL": "https://bugzilla.suse.com/1092903",
          "Description": "SUSE Bug 1092903"
        },
        {
          "URL": "https://bugzilla.suse.com/1107689",
          "Description": "SUSE Bug 1107689"
        },
        {
          "URL": "https://bugzilla.suse.com/1113751",
          "Description": "SUSE Bug 1113751"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": [
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-azure-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-azure-base-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-azure-devel-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-devel-azure-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-source-azure-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-syms-azure-4.12.14-5.16.1"
          ]
        }
      ],
      "CVSSScoreSets": {}
    },
    {
      "CVE": "CVE-2018-1128",
      "Description": "It was found that cephx authentication protocol did not verify ceph clients correctly and was vulnerable to replay attack. Any attacker having access to ceph cluster network who is able to sniff packets on network can use this vulnerability to authenticate with ceph service and perform actions allowed by ceph service. Ceph branches master, mimic, luminous and jewel are believed to be vulnerable.",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "important"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2018-1128.html",
          "Description": "CVE-2018-1128"
        },
        {
          "URL": "https://bugzilla.suse.com/1096748",
          "Description": "SUSE Bug 1096748"
        },
        {
          "URL": "https://bugzilla.suse.com/1114710",
          "Description": "SUSE Bug 1114710"
        },
        {
          "URL": "https://bugzilla.suse.com/1177843",
          "Description": "SUSE Bug 1177843"
        },
        {
          "URL": "https://bugzilla.suse.com/1177859",
          "Description": "SUSE Bug 1177859"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": [
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-azure-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-azure-base-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-azure-devel-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-devel-azure-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-source-azure-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-syms-azure-4.12.14-5.16.1"
          ]
        }
      ],
      "CVSSScoreSets": {}
    },
    {
      "CVE": "CVE-2018-1129",
      "Description": "A flaw was found in the way signature calculation was handled by cephx authentication protocol. An attacker having access to ceph cluster network who is able to alter the message payload was able to bypass signature checks done by cephx protocol. Ceph branches master, mimic, luminous and jewel are believed to be vulnerable.",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "important"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2018-1129.html",
          "Description": "CVE-2018-1129"
        },
        {
          "URL": "https://bugzilla.suse.com/1096748",
          "Description": "SUSE Bug 1096748"
        },
        {
          "URL": "https://bugzilla.suse.com/1114710",
          "Description": "SUSE Bug 1114710"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": [
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-azure-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-azure-base-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-azure-devel-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-devel-azure-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-source-azure-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-syms-azure-4.12.14-5.16.1"
          ]
        }
      ],
      "CVSSScoreSets": {}
    },
    {
      "CVE": "CVE-2018-12896",
      "Description": "An issue was discovered in the Linux kernel through 4.17.3. An Integer Overflow in kernel/time/posix-timers.c in the POSIX timer code is caused by the way the overrun accounting works. Depending on interval and expiry time values, the overrun can be larger than INT_MAX, but the accounting is int based. This basically makes the accounting values, which are visible to user space via timer_getoverrun(2) and siginfo::si_overrun, random. For example, a local user can cause a denial of service (signed integer overflow) via crafted mmap, futex, timer_create, and timer_settime system calls.",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "low"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2018-12896.html",
          "Description": "CVE-2018-12896"
        },
        {
          "URL": "https://bugzilla.suse.com/1099922",
          "Description": "SUSE Bug 1099922"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": [
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-azure-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-azure-base-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-azure-devel-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-devel-azure-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-source-azure-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-syms-azure-4.12.14-5.16.1"
          ]
        }
      ],
      "CVSSScoreSets": {}
    },
    {
      "CVE": "CVE-2018-13093",
      "Description": "An issue was discovered in fs/xfs/xfs_icache.c in the Linux kernel through 4.17.3. There is a NULL pointer dereference and panic in lookup_slow() on a NULL inode-\u003ei_ops pointer when doing pathwalks on a corrupted xfs image. This occurs because of a lack of proper validation that cached inodes are free during allocation.",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "moderate"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2018-13093.html",
          "Description": "CVE-2018-13093"
        },
        {
          "URL": "https://bugzilla.suse.com/1100001",
          "Description": "SUSE Bug 1100001"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": [
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-azure-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-azure-base-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-azure-devel-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-devel-azure-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-source-azure-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-syms-azure-4.12.14-5.16.1"
          ]
        }
      ],
      "CVSSScoreSets": {}
    },
    {
      "CVE": "CVE-2018-13095",
      "Description": "An issue was discovered in fs/xfs/libxfs/xfs_inode_buf.c in the Linux kernel through 4.17.3. A denial of service (memory corruption and BUG) can occur for a corrupted xfs image upon encountering an inode that is in extent format, but has more extents than fit in the inode fork.",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "moderate"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2018-13095.html",
          "Description": "CVE-2018-13095"
        },
        {
          "URL": "https://bugzilla.suse.com/1099999",
          "Description": "SUSE Bug 1099999"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": [
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-azure-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-azure-base-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-azure-devel-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-devel-azure-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-source-azure-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-syms-azure-4.12.14-5.16.1"
          ]
        }
      ],
      "CVSSScoreSets": {}
    },
    {
      "CVE": "CVE-2018-14613",
      "Description": "An issue was discovered in the Linux kernel through 4.17.10. There is an invalid pointer dereference in io_ctl_map_page() when mounting and operating a crafted btrfs image, because of a lack of block group item validation in check_leaf_item in fs/btrfs/tree-checker.c.",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "moderate"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2018-14613.html",
          "Description": "CVE-2018-14613"
        },
        {
          "URL": "https://bugzilla.suse.com/1102896",
          "Description": "SUSE Bug 1102896"
        },
        {
          "URL": "https://bugzilla.suse.com/1103800",
          "Description": "SUSE Bug 1103800"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": [
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-azure-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-azure-base-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-azure-devel-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-devel-azure-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-source-azure-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-syms-azure-4.12.14-5.16.1"
          ]
        }
      ],
      "CVSSScoreSets": {}
    },
    {
      "CVE": "CVE-2018-14617",
      "Description": "An issue was discovered in the Linux kernel through 4.17.10. There is a NULL pointer dereference and panic in hfsplus_lookup() in fs/hfsplus/dir.c when opening a file (that is purportedly a hard link) in an hfs+ filesystem that has malformed catalog data, and is mounted read-only without a metadata directory.",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "moderate"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2018-14617.html",
          "Description": "CVE-2018-14617"
        },
        {
          "URL": "https://bugzilla.suse.com/1102870",
          "Description": "SUSE Bug 1102870"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": [
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-azure-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-azure-base-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-azure-devel-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-devel-azure-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-source-azure-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-syms-azure-4.12.14-5.16.1"
          ]
        }
      ],
      "CVSSScoreSets": {}
    },
    {
      "CVE": "CVE-2018-14633",
      "Description": "A security flaw was found in the chap_server_compute_md5() function in the ISCSI target code in the Linux kernel in a way an authentication request from an ISCSI initiator is processed. An unauthenticated remote attacker can cause a stack buffer overflow and smash up to 17 bytes of the stack. The attack requires the iSCSI target to be enabled on the victim host. Depending on how the target's code was built (i.e. depending on a compiler, compile flags and hardware architecture) an attack may lead to a system crash and thus to a denial-of-service or possibly to a non-authorized access to data exported by an iSCSI target. Due to the nature of the flaw, privilege escalation cannot be fully ruled out, although we believe it is highly unlikely. Kernel versions 4.18.x, 4.14.x and 3.10.x are believed to be vulnerable.",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "important"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2018-14633.html",
          "Description": "CVE-2018-14633"
        },
        {
          "URL": "https://bugzilla.suse.com/1107829",
          "Description": "SUSE Bug 1107829"
        },
        {
          "URL": "https://bugzilla.suse.com/1107832",
          "Description": "SUSE Bug 1107832"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": [
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-azure-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-azure-base-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-azure-devel-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-devel-azure-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-source-azure-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-syms-azure-4.12.14-5.16.1"
          ]
        }
      ],
      "CVSSScoreSets": {}
    },
    {
      "CVE": "CVE-2018-15572",
      "Description": "The spectre_v2_select_mitigation function in arch/x86/kernel/cpu/bugs.c in the Linux kernel before 4.18.1 does not always fill RSB upon a context switch, which makes it easier for attackers to conduct userspace-userspace spectreRSB attacks.",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "important"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2018-15572.html",
          "Description": "CVE-2018-15572"
        },
        {
          "URL": "https://bugzilla.suse.com/1102517",
          "Description": "SUSE Bug 1102517"
        },
        {
          "URL": "https://bugzilla.suse.com/1105296",
          "Description": "SUSE Bug 1105296"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": [
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-azure-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-azure-base-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-azure-devel-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-devel-azure-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-source-azure-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-syms-azure-4.12.14-5.16.1"
          ]
        }
      ],
      "CVSSScoreSets": {}
    },
    {
      "CVE": "CVE-2018-16658",
      "Description": "An issue was discovered in the Linux kernel before 4.18.6. An information leak in cdrom_ioctl_drive_status in drivers/cdrom/cdrom.c could be used by local attackers to read kernel memory because a cast from unsigned long to int interferes with bounds checking. This is similar to CVE-2018-10940.",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "low"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2018-16658.html",
          "Description": "CVE-2018-16658"
        },
        {
          "URL": "https://bugzilla.suse.com/1092903",
          "Description": "SUSE Bug 1092903"
        },
        {
          "URL": "https://bugzilla.suse.com/1107689",
          "Description": "SUSE Bug 1107689"
        },
        {
          "URL": "https://bugzilla.suse.com/1113751",
          "Description": "SUSE Bug 1113751"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": [
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-azure-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-azure-base-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-azure-devel-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-devel-azure-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-source-azure-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-syms-azure-4.12.14-5.16.1"
          ]
        }
      ],
      "CVSSScoreSets": {}
    },
    {
      "CVE": "CVE-2018-17182",
      "Description": "An issue was discovered in the Linux kernel through 4.18.8. The vmacache_flush_all function in mm/vmacache.c mishandles sequence number overflows. An attacker can trigger a use-after-free (and possibly gain privileges) via certain thread creation, map, unmap, invalidation, and dereference operations.",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "moderate"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2018-17182.html",
          "Description": "CVE-2018-17182"
        },
        {
          "URL": "https://bugzilla.suse.com/1108399",
          "Description": "SUSE Bug 1108399"
        },
        {
          "URL": "https://bugzilla.suse.com/1110233",
          "Description": "SUSE Bug 1110233"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": [
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-azure-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-azure-base-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-azure-devel-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-devel-azure-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-source-azure-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-syms-azure-4.12.14-5.16.1"
          ]
        }
      ],
      "CVSSScoreSets": {}
    },
    {
      "CVE": "CVE-2018-18386",
      "Description": "drivers/tty/n_tty.c in the Linux kernel before 4.14.11 allows local attackers (who are able to access pseudo terminals) to hang/block further usage of any pseudo terminal devices due to an EXTPROC versus ICANON confusion in TIOCINQ.",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "moderate"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2018-18386.html",
          "Description": "CVE-2018-18386"
        },
        {
          "URL": "https://bugzilla.suse.com/1094825",
          "Description": "SUSE Bug 1094825"
        },
        {
          "URL": "https://bugzilla.suse.com/1112039",
          "Description": "SUSE Bug 1112039"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": [
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-azure-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-azure-base-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-azure-devel-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-devel-azure-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-source-azure-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-syms-azure-4.12.14-5.16.1"
          ]
        }
      ],
      "CVSSScoreSets": {}
    },
    {
      "CVE": "CVE-2018-18445",
      "Description": "In the Linux kernel 4.14.x, 4.15.x, 4.16.x, 4.17.x, and 4.18.x before 4.18.13, faulty computation of numeric bounds in the BPF verifier permits out-of-bounds memory accesses because adjust_scalar_min_max_vals in kernel/bpf/verifier.c mishandles 32-bit right shifts.",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "low"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2018-18445.html",
          "Description": "CVE-2018-18445"
        },
        {
          "URL": "https://bugzilla.suse.com/1112372",
          "Description": "SUSE Bug 1112372"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": [
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-azure-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-azure-base-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-azure-devel-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-devel-azure-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-source-azure-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-syms-azure-4.12.14-5.16.1"
          ]
        }
      ],
      "CVSSScoreSets": {}
    },
    {
      "CVE": "CVE-2018-18710",
      "Description": "An issue was discovered in the Linux kernel through 4.19. An information leak in cdrom_ioctl_select_disc in drivers/cdrom/cdrom.c could be used by local attackers to read kernel memory because a cast from unsigned long to int interferes with bounds checking. This is similar to CVE-2018-10940 and CVE-2018-16658.",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "moderate"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2018-18710.html",
          "Description": "CVE-2018-18710"
        },
        {
          "URL": "https://bugzilla.suse.com/1113751",
          "Description": "SUSE Bug 1113751"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": [
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-azure-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-azure-base-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-azure-devel-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-devel-azure-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-source-azure-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-syms-azure-4.12.14-5.16.1"
          ]
        }
      ],
      "CVSSScoreSets": {}
    },
    {
      "CVE": "CVE-2018-6554",
      "Description": "Memory leak in the irda_bind function in net/irda/af_irda.c and later in drivers/staging/irda/net/af_irda.c in the Linux kernel before 4.17 allows local users to cause a denial of service (memory consumption) by repeatedly binding an AF_IRDA socket.",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "low"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2018-6554.html",
          "Description": "CVE-2018-6554"
        },
        {
          "URL": "https://bugzilla.suse.com/1106509",
          "Description": "SUSE Bug 1106509"
        },
        {
          "URL": "https://bugzilla.suse.com/1106511",
          "Description": "SUSE Bug 1106511"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": [
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-azure-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-azure-base-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-azure-devel-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-devel-azure-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-source-azure-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-syms-azure-4.12.14-5.16.1"
          ]
        }
      ],
      "CVSSScoreSets": {}
    },
    {
      "CVE": "CVE-2018-6555",
      "Description": "The irda_setsockopt function in net/irda/af_irda.c and later in drivers/staging/irda/net/af_irda.c in the Linux kernel before 4.17 allows local users to cause a denial of service (ias_object use-after-free and system crash) or possibly have unspecified other impact via an AF_IRDA socket.",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "moderate"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2018-6555.html",
          "Description": "CVE-2018-6555"
        },
        {
          "URL": "https://bugzilla.suse.com/1106509",
          "Description": "SUSE Bug 1106509"
        },
        {
          "URL": "https://bugzilla.suse.com/1106511",
          "Description": "SUSE Bug 1106511"
        },
        {
          "URL": "https://bugzilla.suse.com/1115893",
          "Description": "SUSE Bug 1115893"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": [
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-azure-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-azure-base-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-azure-devel-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-devel-azure-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-source-azure-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-syms-azure-4.12.14-5.16.1"
          ]
        }
      ],
      "CVSSScoreSets": {}
    },
    {
      "CVE": "CVE-2018-9363",
      "Description": "In the hidp_process_report in bluetooth, there is an integer overflow. This could lead to an out of bounds write with no additional execution privileges needed. User interaction is not needed for exploitation. Product: Android Versions: Android kernel Android ID: A-65853588 References: Upstream kernel.",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "important"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2018-9363.html",
          "Description": "CVE-2018-9363"
        },
        {
          "URL": "https://bugzilla.suse.com/1087082",
          "Description": "SUSE Bug 1087082"
        },
        {
          "URL": "https://bugzilla.suse.com/1105292",
          "Description": "SUSE Bug 1105292"
        },
        {
          "URL": "https://bugzilla.suse.com/1105293",
          "Description": "SUSE Bug 1105293"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": [
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-azure-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-azure-base-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-azure-devel-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-devel-azure-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-source-azure-4.12.14-5.16.1",
            "SUSE Linux Enterprise Module for Public Cloud 15:kernel-syms-azure-4.12.14-5.16.1"
          ]
        }
      ],
      "CVSSScoreSets": {}
    }
  ]
}