{
  "Title": "Security Beta update for SUSE Manager Client Tools and Salt",
  "Tracking": {
    "ID": "SUSE-SU-2020:1715-1",
    "Status": "Final",
    "Version": "1",
    "InitialReleaseDate": "2020-06-23T12:41:34Z",
    "CurrentReleaseDate": "2020-06-23T12:41:34Z",
    "RevisionHistory": [
      {
        "Number": "1",
        "Date": "2020-06-23T12:41:34Z",
        "Description": "current"
      }
    ]
  },
  "Notes": [
    {
      "Text": "Security Beta update for SUSE Manager Client Tools and Salt",
      "Title": "Topic",
      "Type": "Summary"
    },
    {
      "Text": "\nThis update fixes the following issues:\n\ndracut-saltboot:\n\n- Print a list of available disk devices (bsc#1170824)\n- Install wipefs to initrd\n- Force install crypt modules\n- Add missing terminal naming modifiers as exported veriables\n\ngolang-github-prometheus-prometheus:\n\n- Update change log and spec file\n  + Modified spec file: default to golang 1.14 to avoid 'have choice' build issues in OBS. \n  + Rebase and update patches for version 2.18.0\n  + Changed:  \n    * 0002-Default-settings.patch Changed\n- Update to 2.18.0 \n  + Features \n    * Tracing: Added experimental Jaeger support #7148\n  + Changes\n    * Federation: Only use local TSDB for federation (ignore remote read). #7096\n    * Rules: `rule_evaluations_total` and `rule_evaluation_failures_total` have a `rule_group` label now. #7094\n  + Enhancements\n    * TSDB: Significantly reduce WAL size kept around after a block cut. #7098\n    * Discovery: Add `architecture` meta label for EC2. #7000\n  + Bug fixes\n    * UI: Fixed wrong MinTime reported by /status. #7182\n    * React UI: Fixed multiselect legend on OSX. #6880\n    * Remote Write: Fixed blocked resharding edge case. #7122\n    * Remote Write: Fixed remote write not updating on relabel configs change. #7073\n- Changes from 2.17.2\n  + Bug fixes\n    * Federation: Register federation metrics #7081\n    * PromQL: Fix panic in parser error handling #7132\n    * Rules: Fix reloads hanging when deleting a rule group that is being evaluated #7138\n    * TSDB: Fix a memory leak when prometheus starts with an empty TSDB WAL #7135\n    * TSDB: Make isolation more robust to panics in web handlers #7129 #7136\n- Changes from 2.17.1\n  + Bug fixes\n    * TSDB: Fix query performance regression that increased memory and CPU usage #7051\n- Changes from 2.17.0\n  + Features \n    * TSDB: Support isolation #6841\n    * This release implements isolation in TSDB. API queries and recording rules are\n      guaranteed to only see full scrapes and full recording rules. This comes with a\n      certain overhead in resource usage. Depending on the situation, there might be\n      some increase in memory usage, CPU usage, or query latency.\n  + Enhancements\n    * PromQL: Allow more keywords as metric names #6933\n    * React UI: Add normalization of localhost URLs in targets page #6794\n    * Remote read: Read from remote storage concurrently #6770\n    * Rules: Mark deleted rule series as stale after a reload #6745\n    * Scrape: Log scrape append failures as debug rather than warn #6852\n    * TSDB: Improve query performance for queries that partially hit the head #6676\n    * Consul SD: Expose service health as meta label #5313\n    * EC2 SD: Expose EC2 instance lifecycle as meta label #6914\n    * Kubernetes SD: Expose service type as meta label for K8s service role #6684\n    * Kubernetes SD: Expose label_selector and field_selector #6807\n    * Openstack SD: Expose hypervisor id as meta label #6962\n  + Bug fixes\n    * PromQL: Do not escape HTML-like chars in query log #6834 #6795\n    * React UI: Fix data table matrix values #6896\n    * React UI: Fix new targets page not loading when using non-ASCII characters #6892\n    * Remote read: Fix duplication of metrics read from remote storage with external labels #6967 #7018\n    * Remote write: Register WAL watcher and live reader metrics for all remotes, not just the first one #6998\n    * Scrape: Prevent removal of metric names upon relabeling #6891\n    * Scrape: Fix 'superfluous response.WriteHeader call' errors when scrape fails under some circonstances #6986\n    * Scrape: Fix crash when reloads are separated by two scrape intervals #7011\n- Changes from 2.16.0\n  + Features \n    * React UI: Support local timezone on /graph #6692\n    * PromQL: add absent_over_time query function #6490\n    * Adding optional logging of queries to their own file #6520\n  + Enhancements\n    * React UI: Add support for rules page and 'Xs ago' duration displays #6503\n    * React UI: alerts page, replace filtering togglers tabs with checkboxes #6543\n    * TSDB: Export metric for WAL write errors #6647\n    * TSDB: Improve query performance for queries that only touch the most recent 2h of data. #6651\n    * PromQL: Refactoring in parser errors to improve error messages #6634\n    * PromQL: Support trailing commas in grouping opts #6480\n    * Scrape: Reduce memory usage on reloads by reusing scrape cache #6670\n    * Scrape: Add metrics to track bytes and entries in the metadata cache #6675\n    * promtool: Add support for line-column numbers for invalid rules output #6533\n    * Avoid restarting rule groups when it is unnecessary #6450\n  + Bug fixes\n    * React UI: Send cookies on fetch() on older browsers #6553\n    * React UI: adopt grafana flot fix for stacked graphs #6603\n    * React UI: broken graph page browser history so that back button works as expected #6659\n    * TSDB: ensure compactionsSkipped metric is registered, and log proper error if one is returned from head.Init #6616\n    * TSDB: return an error on ingesting series with duplicate labels #6664\n    * PromQL: Fix unary operator precedence #6579\n    * PromQL: Respect query.timeout even when we reach query.max-concurrency #6712\n    * PromQL: Fix string and parentheses handling in engine, which affected React UI #6612\n    * PromQL: Remove output labels returned by absent() if they are produced by multiple identical label matchers #6493\n    * Scrape: Validate that OpenMetrics input ends with `# EOF` #6505\n    * Remote read: return the correct error if configs can't be marshal'd to JSON #6622\n    * Remote write: Make remote client `Store` use passed context, which can affect shutdown timing #6673\n    * Remote write: Improve sharding calculation in cases where we would always be consistently behind by tracking pendingSamples #6511\n    * Ensure prometheus_rule_group metrics are deleted when a rule group is removed #6693\n- Changes from 2.15.2\n  + Bug fixes\n    * TSDB: Fixed support for TSDB blocks built with Prometheus before 2.1.0. #6564\n    * TSDB: Fixed block compaction issues on Windows. #6547\n- Changes from 2.15.1\n  + Bug fixes\n    * TSDB: Fixed race on concurrent queries against same data. #6512\n- Changes from 2.15.0\n  + Features \n    * API: Added new endpoint for exposing per metric metadata `/metadata`. #6420 #6442\n  + Changes\n    * Discovery: Removed `prometheus_sd_kubernetes_cache_*` metrics. Additionally `prometheus_sd_kubernetes_workqueue_latency_seconds` and `prometheus_sd_kubernetes_workqueue_work_duration_seconds` metrics now show correct values in seconds. #6393\n    * Remote write: Changed `query` label on `prometheus_remote_storage_*` metrics to `remote_name` and `url`. #6043\n  + Enhancements\n    * TSDB: Significantly reduced memory footprint of loaded TSDB blocks. #6418 #6461\n    * TSDB: Significantly optimized what we buffer during compaction which should result in lower memory footprint during compaction. #6422 #6452 #6468 #6475\n    * TSDB: Improve replay latency. #6230\n    * TSDB: WAL size is now used for size based retention calculation. #5886\n    * Remote read: Added query grouping and range hints to the remote read request #6401\n    * Remote write: Added `prometheus_remote_storage_sent_bytes_total` counter per queue. #6344\n    * promql: Improved PromQL parser performance. #6356\n    * React UI: Implemented missing pages like `/targets` #6276, TSDB status page #6281 #6267 and many other fixes and performance improvements.\n    * promql: Prometheus now accepts spaces between time range and square bracket. e.g `[ 5m]` #6065  \n  + Bug fixes\n    * Config: Fixed alertmanager configuration to not miss targets when configurations are similar. #6455\n    * Remote write: Value of `prometheus_remote_storage_shards_desired` gauge shows raw value of desired shards and it's updated correctly. #6378\n    * Rules: Prometheus now fails the evaluation of rules and alerts where metric results collide with labels specified in `labels` field. #6469\n    * API: Targets Metadata API `/targets/metadata` now accepts empty `match_targets` parameter as in the spec. #6303\n- Changes from 2.14.0\n  + Features \n    * API: `/api/v1/status/runtimeinfo` and `/api/v1/status/buildinfo` endpoints added for use by the React UI. #6243\n    * React UI: implement the new experimental React based UI. #5694 and many more\n      * Can be found by under `/new`.\n      * Not all pages are implemented yet.\n    * Status: Cardinality statistics added to the Runtime \u0026 Build Information page. #6125\n  + Enhancements\n    * Remote write: fix delays in remote write after a compaction. #6021\n    * UI: Alerts can be filtered by state. #5758\n  + Bug fixes\n    * Ensure warnings from the API are escaped. #6279\n    * API: lifecycle endpoints return 403 when not enabled. #6057\n    * Build: Fix Solaris build. #6149\n    * Promtool: Remove false duplicate rule warnings when checking rule files with alerts. #6270\n    * Remote write: restore use of deduplicating logger in remote write. #6113\n    * Remote write: do not reshard when unable to send samples. #6111\n    * Service discovery: errors are no longer logged on context cancellation. #6116, #6133\n    * UI: handle null response from API properly. #6071\n- Changes from 2.13.1\n  + Bug fixes\n    * Fix panic in ARM builds of Prometheus. #6110\n    * promql: fix potential panic in the query logger. #6094\n    * Multiple errors of http: superfluous response.WriteHeader call in the logs. #6145\n- Changes from 2.13.0\n  + Enhancements\n    * Metrics: renamed prometheus_sd_configs_failed_total to prometheus_sd_failed_configs and changed to Gauge #5254\n    * Include the tsdb tool in builds. #6089\n    * Service discovery: add new node address types for kubernetes. #5902\n    * UI: show warnings if query have returned some warnings. #5964\n    * Remote write: reduce memory usage of the series cache. #5849\n    * Remote read: use remote read streaming to reduce memory usage. #5703\n    * Metrics: added metrics for remote write max/min/desired shards to queue manager. #5787\n    * Promtool: show the warnings during label query. #5924\n    * Promtool: improve error messages when parsing bad rules. #5965\n    * Promtool: more promlint rules. #5515\n  + Bug fixes\n    * UI: Fix a Stored DOM XSS vulnerability with query history [CVE-2019-10215](http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2019-10215). #6098\n    * Promtool: fix recording inconsistency due to duplicate labels. #6026\n    * UI: fixes service-discovery view when accessed from unhealthy targets. #5915\n    * Metrics format: OpenMetrics parser crashes on short input. #5939\n    * UI: avoid truncated Y-axis values. #6014\n- Changes from 2.12.0\n  + Features \n    * Track currently active PromQL queries in a log file. #5794\n    * Enable and provide binaries for `mips64` / `mips64le` architectures. #5792\n  + Enhancements\n    * Improve responsiveness of targets web UI and API endpoint. #5740\n    * Improve remote write desired shards calculation. #5763\n    * Flush TSDB pages more precisely. tsdb#660\n    * Add `prometheus_tsdb_retention_limit_bytes` metric. tsdb#667\n    * Add logging during TSDB WAL replay on startup. tsdb#662\n    * Improve TSDB memory usage. tsdb#653, tsdb#643, tsdb#654, tsdb#642, tsdb#627\n  + Bug fixes\n    * Check for duplicate label names in remote read. #5829\n    * Mark deleted rules' series as stale on next evaluation. #5759\n    * Fix JavaScript error when showing warning about out-of-sync server time. #5833\n    * Fix `promtool test rules` panic when providing empty `exp_labels`. #5774\n    * Only check last directory when discovering checkpoint number. #5756\n    * Fix error propagation in WAL watcher helper functions. #5741\n    * Correctly handle empty labels from alert templates. #5845\n- Update Uyuni/SUSE Manager service discovery patch\n  + Modified 0003-Add-Uyuni-service-discovery.patch:\n  + Adapt service discovery to the new Uyuni API endpoints\n  + Modified spec file: force golang 1.12 to fix build issues in SLE15SP2\n- Update to Prometheus 2.11.2\n\ngrafana:\n\n- Update to version 7.0.3\n  * Features / Enhancements\n    - Stats: include all fields. #24829, @ryantxu\n    - Variables: change VariableEditorList row action Icon to IconButton. #25217, @hshoff\n  * Bug fixes\n    - Cloudwatch: Fix dimensions of DDoSProtection. #25317, @papagian\n    - Configuration: Fix env var override of sections containing hyphen. #25178, @marefr\n    - Dashboard: Get panels in collapsed rows. #25079, @peterholmberg\n    - Do not show alerts tab when alerting is disabled. #25285, @dprokop\n    - Jaeger: fixes cascader option label duration value. #25129, @Estrax\n    - Transformations: Fixed Transform tab crash \u0026 no update after adding first transform. #25152, @torkelo\n- Update to version 7.0.2\n  * Bug fixes\n    - Security: Urgent security patch release to fix CVE-2020-13379\n- Update to version 7.0.1\n  * Features / Enhancements\n    - Datasource/CloudWatch: Makes CloudWatch Logs query history more readable. #24795, @kaydelaney\n    - Download CSV: Add date and time formatting. #24992, @ryantxu\n    - Table: Make last cell value visible when right aligned. #24921, @peterholmberg\n    - TablePanel: Adding sort order persistance. #24705, @torkelo\n    - Transformations: Display correct field name when using reduce transformation. #25068, @peterholmberg\n    - Transformations: Allow custom number input for binary operations. #24752, @ryantxu\n  * Bug fixes\n    - Dashboard/Links: Fixes dashboard links by tags not working. #24773, @KamalGalrani\n    - Dashboard/Links: Fixes open in new window for dashboard link. #24772, @KamalGalrani\n    - Dashboard/Links: Variables are resolved and limits to 100. #25076, @hugohaggmark\n    - DataLinks: Bring back variables interpolation in title. #24970, @dprokop\n    - Datasource/CloudWatch: Field suggestions no longer limited to prefix-only. #24855, @kaydelaney\n    - Explore/Table: Keep existing field types if possible. #24944, @kaydelaney\n    - Explore: Fix wrap lines toggle for results of queries with filter expression. #24915, @ivanahuckova\n    - Explore: fix undo in query editor. #24797, @zoltanbedi\n    - Explore: fix word break in type head info. #25014, @zoltanbedi\n    - Graph: Legend decimals now work as expected. #24931, @torkelo\n    - LoginPage: Fix hover color for service buttons. #25009, @tskarhed\n    - LogsPanel: Fix scrollbar. #24850, @ivanahuckova\n    - MoveDashboard: Fix for moving dashboard caused all variables to be lost. #25005, @torkelo\n    - Organize transformer: Use display name in field order comparer. #24984, @dprokop\n    - Panel: shows correct panel menu items in view mode. #24912, @hugohaggmark\n    - PanelEditor Fix missing labels and description if there is only single option in category. #24905, @dprokop\n    - PanelEditor: Overrides name matcher still show all original field names even after Field default display name is specified. #24933, @torkelo\n    - PanelInspector: Makes sure Data display options are visible. #24902, @hugohaggmark\n    - PanelInspector: Hides unsupported data display options for Panel type. #24918, @hugohaggmark\n    - PanelMenu: Make menu disappear on button press. #25015, @tskarhed\n    - Postgres: Fix add button. #25087, @phemmer\n    - Prometheus: Fix recording rules expansion. #24977, @ivanahuckova\n    - Stackdriver: Fix creating Service Level Objectives (SLO) datasource query variable. #25023, @papagian\n- Update to version 7.0.0 \n  * Breaking changes\n    - Removed PhantomJS: PhantomJS was deprecated in Grafana v6.4 and starting from Grafana v7.0.0, all PhantomJS support has been removed. This means that Grafana no longer ships with a built-in image renderer, and we advise you to install the Grafana Image Renderer plugin.\n    - Dashboard: A global minimum dashboard refresh interval is now enforced and defaults to 5 seconds.\n    - Interval calculation: There is now a new option Max data points that controls the auto interval $__interval calculation. Interval was previously calculated by dividing the panel width by the time range. With the new max data points option it is now easy to set $__interval to a dynamic value that is time range agnostic. For example if you set Max data points to 10 Grafana will dynamically set $__interval by dividing the current time range by 10.\n    - Datasource/Loki: Support for deprecated Loki endpoints has been removed.\n    - Backend plugins: Grafana now requires backend plugins to be signed, otherwise Grafana will not load/start them. This is an additional security measure to make sure backend plugin binaries and files haven't been tampered with. Refer to Upgrade Grafana for more information.\n    - @grafana/ui: Forms migration notice, see @grafana/ui changelog\n    - @grafana/ui: Select API change for creating custom values, see @grafana/ui changelog\n    + Deprecation warnings\n      - Scripted dashboards is now deprecated. The feature is not removed but will be in a future release. We hope to address the underlying requirement of dynamic dashboards in a different way. #24059\n      - The unofficial first version of backend plugins together with usage of grafana/grafana-plugin-model is now deprecated and support for that will be removed in a future release. Please refer to backend plugins documentation for information about the new officially supported backend plugins.\n  * Features / Enhancements\n    - Backend plugins: Log deprecation warning when using the unofficial first version of backend plugins. #24675, @marefr\n    - Editor: New line on Enter, run query on Shift+Enter. #24654, @davkal\n    - Loki: Allow multiple derived fields with the same name. #24437, @aocenas\n    - Orgs: Add future deprecation notice. #24502, @torkelo\n  * Bug Fixes\n    - @grafana/toolkit: Use process.cwd() instead of PWD to get directory. #24677, @zoltanbedi\n    - Admin: Makes long settings values line break in settings page. #24559, @hugohaggmark\n    - Dashboard: Allow editing provisioned dashboard JSON and add confirmation when JSON is copied to dashboard. #24680, @dprokop\n    - Dashboard: Fix for strange 'dashboard not found' errors when opening links in dashboard settings. #24416, @torkelo\n    - Dashboard: Fix so default data source is selected when data source can't be found in panel editor. #24526, @mckn\n    - Dashboard: Fixed issue changing a panel from transparent back to normal in panel editor. #24483, @torkelo\n    - Dashboard: Make header names reflect the field name when exporting to CSV file from the the panel inspector. #24624, @peterholmberg\n    - Dashboard: Make sure side pane is displayed with tabs by default in panel editor. #24636, @dprokop\n    - Data source: Fix query/annotation help content formatting. #24687, @AgnesToulet\n    - Data source: Fixes async mount errors. #24579, @Estrax\n    - Data source: Fixes saving a data source without failure when URL doesn't specify a protocol. #24497, @aknuds1\n    - Explore/Prometheus: Show results of instant queries only in table. #24508, @ivanahuckova\n    - Explore: Fix rendering of react query editors. #24593, @ivanahuckova\n    - Explore: Fixes loading more logs in logs context view. #24135, @Estrax\n    - Graphite: Fix schema and dedupe strategy in rollup indicators for Metrictank queries. #24685, @torkelo\n    - Graphite: Makes query annotations work again. #24556, @hugohaggmark\n    - Logs: Clicking 'Load more' from context overlay doesn't expand log row. #24299, @kaydelaney\n    - Logs: Fix total bytes process calculation. #24691, @davkal\n    - Org/user/team preferences: Fixes so UI Theme can be set back to Default. #24628, @AgnesToulet\n    - Plugins: Fix manifest validation. #24573, @aknuds1\n    - Provisioning: Use proxy as default access mode in provisioning. #24669, @bergquist\n    - Search: Fix select item when pressing enter and Grafana is served using a sub path. #24634, @tskarhed\n    - Search: Save folder expanded state. #24496, @Clarity-89\n    - Security: Tag value sanitization fix in OpenTSDB data source. #24539, @rotemreiss\n    - Table: Do not include angular options in options when switching from angular panel. #24684, @torkelo\n    - Table: Fixed persisting column resize for time series fields. #24505, @torkelo\n    - Table: Fixes Cannot read property subRows of null. #24578, @hugohaggmark\n    - Time picker: Fixed so you can enter a relative range in the time picker without being converted to absolute range. #24534, @mckn\n    - Transformations: Make transform dropdowns not cropped. #24615, @dprokop\n    - Transformations: Sort order should be preserved as entered by user when using the reduce transformation. #24494, @hugohaggmark\n    - Units: Adds scale symbol for currencies with suffixed symbol. #24678, @hugohaggmark\n    - Variables: Fixes filtering options with more than 1000 entries. #24614, @hugohaggmark\n    - Variables: Fixes so Textbox variables read value from url. #24623, @hugohaggmark\n    - Zipkin: Fix error when span contains remoteEndpoint. #24524, @aocenas\n    - SAML: Switch from email to login for user login attribute mapping (Enterprise)\n- Update Makefile and spec file\n  * Remove phantomJS patch from Makefile \n  * Fix multiline strings in Makefile\n  * Exclude s390 from SLE12 builds, golang 1.14 is not built for s390\n- Add instructions for patching the Grafana javascript frontend.\n- BuildRequires golang(API) instead of go metapackage version range\n  * BuildRequires:  golang(API) \u003e= 1.14   from\n    BuildRequires:  ( go \u003e= 1.14 with go \u003c 1.15 )\n- Update to version 6.7.3\n  - This version fixes bsc#1170557 and its corresponding CVE-2020-12245\n  - Admin: Fix Synced via LDAP message for non-LDAP external users. #23477, @alexanderzobnin\n  - Alerting: Fixes notifications for alerts with empty message in Google Hangouts notifier. #23559, @hugohaggmark\n  - AuthProxy: Fixes bug where long username could not be cached.. #22926, @jcmcken\n  - Dashboard: Fix saving dashboard when editing raw dashboard JSON model. #23314, @peterholmberg\n  - Dashboard: Try to parse 8 and 15 digit numbers as timestamps if parsing of time range as date fails. #21694, @jessetan\n  - DashboardListPanel: Fixed problem with empty panel after going into edit mode (General folder filter being automatically added) . #23426, @torkelo\n  - Data source: Handle datasource withCredentials option properly. #23380, @hvtuananh\n  - Security: Fix annotation popup XSS vulnerability. #23813, @torkelo\n  - Server: Exit Grafana with status code 0 if no error. #23312, @aknuds1\n  - TablePanel: Fix XSS issue in header column rename (backport). #23814, @torkelo\n  - Variables: Fixes error when setting adhoc variable values. #23580, @hugohaggmark\n- Update to version 6.7.2:\n  (see installed changelog for the full list of changes)\n  -  BackendSrv: Adds config to response to fix issue for external plugins that used this property . #23032, @torkelo\n  -  Dashboard: Fixed issue with saving new dashboard after changing title . #23104, @dprokop\n  -  DataLinks: make sure we use the correct datapoint when dataset contains null value.. #22981, @mckn\n  -  Plugins: Fixed issue for plugins that imported dateMath util . #23069, @mckn\n  -  Security: Fix for dashboard snapshot original dashboard link could contain XSS vulnerability in url. #23254, @torkelo\n  -  Variables: Fixes issue with too many queries being issued for nested template variables after value change. #23220, @torkelo\n  -  Plugins: Expose promiseToDigest. #23249, @torkelo\n  -  Reporting (Enterprise): Fixes issue updating a report created by someone else\n- Update to 6.7.1:\n  (see installed changelog for the full list of changes)\n  Bug Fixes\n  - Azure: Fixed dropdowns not showing current value. #22914, @torkelo\n  - BackendSrv: only add content-type on POST, PUT requests. #22910, @hugohaggmark\n  - Panels: Fixed size issue with panel internal size when exiting panel edit mode. #22912, @torkelo\n  - Reporting: fixes migrations compatibility with mysql (Enterprise)\n  - Reporting: Reduce default concurrency limit to 4 (Enterprise)\n- Update to 6.7.0:\n  (see installed changelog for the full list of changes)\n  Bug Fixes\n  - AngularPanels: Fixed inner height calculation for angular panels . #22796, @torkelo\n  - BackendSrv: makes sure provided headers are correctly recognized and set. #22778, @hugohaggmark\n  - Forms: Fix input suffix position (caret-down in Select) . #22780, @torkelo\n  - Graphite: Fixed issue with query editor and next select metric now showing after selecting metric node . #22856, @torkelo\n  - Rich History: UX adjustments and fixes. #22729, @ivanahuckova\n- Update to 6.7.0-beta1:\n  Breaking changes\n  -  Slack: Removed Mention setting and instead introduce Mention Users, Mention Groups, and Mention Channel. The first two settings require user and group IDs, respectively. This change was necessary because the way of mentioning via the Slack API changed and mentions in Slack notifications no longer worked.\n  -  Alerting: Reverts the behavior of diff and percent_diff to not always be absolute. Something we introduced by mistake in 6.1.0. Alerting now support diff(), diff_abs(), percent_diff() and percent_diff_abs(). #21338\n  - Notice about changes in backendSrv for plugin authors\n    In our mission to migrate away from AngularJS to React we have removed all AngularJS dependencies in the core data retrieval service backendSrv.\n    Removing the AngularJS dependencies in backendSrv has the unfortunate side effect of AngularJS digest no longer being triggered for any request made with backendSrv. Because of this, external plugins using backendSrv directly may suffer from strange behaviour in the UI.\n    To remedy this issue, as a plugin author you need to trigger the digest after a direct call to backendSrv.\n  Bug Fixes\n    API: Fix redirect issues. #22285, @papagian\n    Alerting: Don't include image_url field with Slack message if empty. #22372, @aknuds1\n    Alerting: Fixed bad background color for default notifications in alert tab . #22660, @krvajal\n    Annotations: In table panel when setting transform to annotation, they will now show up right away without a manual refresh. #22323, @krvajal\n    Azure Monitor: Fix app insights source to allow for new __timeFrom and __timeTo. #21879, @ChadNedzlek\n    BackendSrv: Fixes POST body for form data. #21714, @hugohaggmark\n    CloudWatch: Credentials cache invalidation fix. #22473, @sunker\n    CloudWatch: Expand alias variables when query yields no result. #22695, @sunker\n    Dashboard: Fix bug with NaN in alerting. #22053, @a-melnyk\n    Explore: Fix display of multiline logs in log panel and explore. #22057, @thomasdraebing\n    Heatmap: Legend color range is incorrect when using custom min/max. #21748, @sv5d\n    Security: Fixed XSS issue in dashboard history diff . #22680, @torkelo\n    StatPanel: Fixes base color is being used for null values .\n    #22646, @torkelo\n- Update to version 6.6.2:\n  (see installed changelog for the full list of changes)\n- Update to version 6.6.1:\n  (see installed changelog for the full list of changes)\n- Update to version 6.6.0:\n  (see installed changelog for the full list of changes)\n- Update to version 6.5.3:\n  (see installed changelog for the full list of changes)\n- Update to version 6.5.2:\n  (see installed changelog for the full list of changes)\n- Update to version 6.5.1:\n  (see installed changelog for the full list of changes)\n- Update to version 6.5.0\n  (see installed changelog for the full list of changes)\n- Update to version 6.4.5:\n  * Create version 6.4.5\n  * CloudWatch: Fix high CPU load (#20579)\n- Add obs-service-go_modules to download required modules into vendor.tar.gz\n- Adjusted spec file to use vendor.tar.gz\n- Adjusted Makefile to work with new filenames\n- BuildRequire go1.14\n- Update to version 6.4.4:\n  * DataLinks: Fix blur issues. #19883, @aocenas\n  * Docker: Makes it possible to parse timezones in the docker image. #20081, @xlson\n  * LDAP: All LDAP servers should be tried even if one of them returns a connection error. #20077, @jongyllen\n  * LDAP: No longer shows incorrectly matching groups based on role in debug page. #20018, @xlson\n  * Singlestat: Fix no data / null value mapping . #19951, @ryantxu\n- Revert the spec file and make script\n- Remove PhantomJS dependency\n- Update to 6.4.3\n  * Bug Fixes\n    - Alerting: All notification channels should send even if one fails to send. #19807, @jan25\n    - AzureMonitor: Fix slate interference with dropdowns. #19799, @aocenas\n    - ContextMenu: make ContextMenu positioning aware of the viewport width. #19699, @krvajal\n    - DataLinks: Fix context menu not showing in singlestat-ish visualisations. #19809, @dprokop\n    - DataLinks: Fix url field not releasing focus. #19804, @aocenas\n    - Datasource: Fixes clicking outside of some query editors required 2 clicks. #19822, @aocenas\n    - Panels: Fixes default tab for visualizations without Queries Tab. #19803, @hugohaggmark\n    - Singlestat: Fixed issue with mapping null to text. #19689, @torkelo\n    - @grafana/toolkit: Don't fail plugin creation when git user.name config is not set. #19821, @dprokop\n    - @grafana/toolkit: TSLint line number off by 1. #19782, @fredwangwang\n- Update to 6.4.2\n  * Bug Fixes\n    - CloudWatch: Changes incorrect dimension wmlid to wlmid . #19679, @ATTron\n    - Grafana Image Renderer: Fixes plugin page. #19664, @hugohaggmark\n    - Graph: Fixes auto decimals logic for y axis ticks that results in too many decimals for high values. #19618, @torkelo\n    - Graph: Switching to series mode should re-render graph. #19623, @torkelo\n    - Loki: Fix autocomplete on label values. #19579, @aocenas\n    - Loki: Removes live option for logs panel. #19533, @davkal\n    - Profile: Fix issue with user profile not showing more than sessions sessions in some cases. #19578, @huynhsamha\n    - Prometheus: Fixes so results in Panel always are sorted by query order. #19597, @hugohaggmark\n    - ShareQuery: Fixed issue when using -- Dashboard -- datasource (to share query result) when dashboard had rows. #19610, @torkelo\n    - Show SAML login button if SAML is enabled. #19591, @papagian\n    - SingleStat: Fixes  postfix/prefix usage. #19687, @hugohaggmark\n    - Table: Proper handling of json data with dataframes. #19596, @marefr\n    - Units: Fixed wrong id for Terabits/sec. #19611, @andreaslangnevyjel\n- Changes from 6.4.1\n  * Bug Fixes\n    - Provisioning: Fixed issue where empty nested keys in YAML provisioning caused a server crash, #19547\n    - ImageRendering: Fixed issue with image rendering in enterprise build (Enterprise)\n    - Reporting: Fixed issue with reporting service when STMP was disabled (Enterprise).\n- Changes from 6.4.0\n  * Features / Enhancements\n    - Build: Upgrade go to 1.12.10. #19499, @marefr\n    - DataLinks: Suggestions menu improvements. #19396, @dprokop\n    - Explore: Take root_url setting into account when redirecting from dashboard to explore. #19447, @ivanahuckova\n    - Explore: Update broken link to logql docs. #19510, @ivanahuckova\n    - Logs: Adds Logs Panel as a visualization. #19504, @davkal\n  * Bug Fixes\n    - CLI: Fix version selection for plugin install. #19498, @aocenas\n    - Graph: Fixes minor issue with series override color picker and custom color . #19516, @torkelo\n- Changes from 6.4.0 Beta 2\n  * Features / Enhancements\n    - Azure Monitor: Remove support for cross resource queries (#19115)'. #19346, @sunker\n    - Docker: Upgrade packages to resolve reported vulnerabilities. #19188, @marefr\n    - Graphite: Time range expansion reduced from 1 minute to 1 second. #19246, @torkelo\n    - grafana/toolkit: Add plugin creation task. #19207, @dprokop\n  * Bug Fixes\n    - Alerting: Prevents creating alerts from unsupported queries. #19250, @hugohaggmark\n    - Alerting: Truncate PagerDuty summary when greater than 1024 characters. #18730, @nvllsvm\n    - Cloudwatch: Fix autocomplete for Gamelift dimensions. #19146, @kevinpz\n    - Dashboard: Fix export for sharing when panels use default data source. #19315, @torkelo\n    - Database: Rewrite system statistics query to perform better. #19178, @papagian\n    - Gauge/BarGauge: Fix issue with [object Object] in titles . #19217, @ryantxu\n    - MSSQL: Revert usage of new connectionstring format introduced by #18384. #19203, @marefr\n    - Multi-LDAP: Do not fail-fast on invalid credentials. #19261, @gotjosh\n    - MySQL, Postgres, MSSQL: Fix validating query with template variables in alert . #19237, @marefr\n    - MySQL, Postgres: Update raw sql when query builder updates. #19209, @marefr\n    - MySQL: Limit datasource error details returned from the backend. #19373, @marefr\n- Changes from 6.4.0 Beta 1\n  * Features / Enhancements\n    - API: Readonly datasources should not be created via the API. #19006, @papagian\n    - Alerting: Include configured AlertRuleTags in Webhooks notifier. #18233, @dominic-miglar\n    - Annotations: Add annotations support to Loki. #18949, @aocenas\n    - Annotations: Use a single row to represent a region. #17673, @ryantxu\n    - Auth: Allow inviting existing users when login form is disabled. #19048, @548017\n    - Azure Monitor: Add support for cross resource queries. #19115, @sunker\n    - CLI: Allow installing custom binary plugins. #17551, @aocenas\n    - Dashboard: Adds Logs Panel (alpha) as visualization option for Dashboards. #18641, @hugohaggmark\n    - Dashboard: Reuse query results between panels . #16660, @ryantxu\n    - Dashboard: Set time to to 23:59:59 when setting To time using calendar. #18595, @simPod\n    - DataLinks: Add DataLinks support to Gauge, BarGauge and SingleStat2 panel. #18605, @ryantxu\n    - DataLinks: Enable access to labels \u0026 field names. #18918, @torkelo\n    - DataLinks: Enable multiple data links per panel. #18434, @dprokop\n    - Docker: switch docker image to alpine base with phantomjs support. #18468, @DanCech\n    - Elasticsearch: allow templating queries to order by doc_count. #18870, @hackery\n    - Explore: Add throttling when doing live queries. #19085, @aocenas\n    - Explore: Adds ability to go back to dashboard, optionally with query changes. #17982, @kaydelaney\n    - Explore: Reduce default time range to last hour. #18212, @davkal\n    - Gauge/BarGauge: Support decimals for min/max. #18368, @ryantxu\n    - Graph: New series override transform constant that renders a single point as a line across the whole graph. #19102, @davkal\n    - Image rendering: Add deprecation warning when PhantomJS is used for rendering images. #18933, @papagian\n    - InfluxDB: Enable interpolation within ad-hoc filter values. #18077, @kvc-code\n    - LDAP: Allow an user to be synchronized against LDAP. #18976, @gotjosh\n    - Ldap: Add ldap debug page. #18759, @peterholmberg\n    - Loki: Remove prefetching of default label values. #18213, @davkal\n    - Metrics: Add failed alert notifications metric. #18089, @koorgoo\n    - OAuth: Support JMES path lookup when retrieving user email. #14683, @bobmshannon\n    - OAuth: return GitLab groups as a part of user info (enable team sync). #18388, @alexanderzobnin\n    - Panels: Add unit for electrical charge - ampere-hour. #18950, @anirudh-ramesh\n    - Plugin: AzureMonitor - Reapply MetricNamespace support. #17282, @raphaelquati\n    - Plugins: better warning when plugins fail to load. #18671, @ryantxu\n    - Postgres: Add support for scram sha 256 authentication. #18397, @nonamef\n    - RemoteCache: Support SSL with Redis. #18511, @kylebrandt\n    - SingleStat: The gauge option in now disabled/hidden (unless it's an old panel with it already enabled) . #18610, @ryantxu\n    - Stackdriver: Add extra alignment period options. #18909, @sunker\n    - Units: Add South African Rand (ZAR) to currencies. #18893, @jeteon\n    - Units: Adding T,P,E,Z,and Y bytes. #18706, @chiqomar\n  * Bug Fixes\n    - Alerting: Notification is sent when state changes from no_data to ok. #18920, @papagian\n    - Alerting: fix duplicate alert states when the alert fails to save to the database. #18216, @kylebrandt\n    - Alerting: fix response popover prompt when add notification channels. #18967, @lzdw\n    - CloudWatch: Fix alerting for queries with Id (using GetMetricData). #17899, @alex-berger\n    - Explore: Fix auto completion on label values for Loki. #18988, @aocenas\n    - Explore: Fixes crash using back button with a zoomed in graph. #19122, @hugohaggmark\n    - Explore: Fixes so queries in Explore are only run if Graph/Table is shown. #19000, @hugohaggmark\n    - MSSQL: Change connectionstring to URL format to fix using passwords with semicolon. #18384, @Russiancold\n    - MSSQL: Fix memory leak when debug enabled. #19049, @briangann\n    - Provisioning: Allow escaping literal '$' with '$$' in configs to avoid interpolation. #18045, @kylebrandt\n    - TimePicker: Fixes hiding time picker dropdown in FireFox. #19154, @hugohaggmark\n  * Breaking changes\n    + Annotations\n      There are some breaking changes in the annotations HTTP API for region annotations. Region annotations are now represented\n      using a single event instead of two seperate events. Check breaking changes in HTTP API below and HTTP API documentation for more details.\n    + Docker\n      Grafana is now using Alpine 3.10 as docker base image.\n    + HTTP API\n      - GET /api/alert-notifications now requires at least editor access.\n        New /api/alert-notifications/lookup returns less information than /api/alert-notifications and can be access by any authenticated user.\n      - GET /api/alert-notifiers now requires at least editor access\n      - GET /api/org/users now requires org admin role.\n        New /api/org/users/lookup returns less information than /api/org/users and can be access by users that are org admins,\n        admin in any folder or admin of any team.\n      - GET /api/annotations no longer returns regionId property.\n      - POST /api/annotations no longer supports isRegion property.\n      - PUT /api/annotations/:id no longer supports isRegion property.\n      - PATCH /api/annotations/:id no longer supports isRegion property.\n      - DELETE /api/annotations/region/:id has been removed.\n  * Deprecation notes\n    + PhantomJS\n      - PhantomJS, which is used for rendering images of dashboards and panels,\n        is deprecated and will be removed in a future Grafana release.\n        A deprecation warning will from now on be logged when Grafana starts up if PhantomJS is in use.\n        Please consider migrating from PhantomJS to the Grafana Image Renderer plugin.\n- Changes from 6.3.6\n  * Features / Enhancements\n    - Metrics: Adds setting for turning off total stats metrics. #19142, @marefr\n  * Bug Fixes\n    - Database: Rewrite system statistics query to perform better. #19178, @papagian\n    - Explore: Fixes error when switching from prometheus to loki data sources. #18599, @kaydelaney\n- Rebase package spec. Use mostly from fedora, fix suse specified things and fix some errors.\n- Add missing directories provisioning/datasources and provisioning/notifiers\n  and sample.yaml as described in packaging/rpm/control from upstream.\n  Missing directories are shown in logfiles.\n- Version 6.3.5\n  * Upgrades\n    + Build: Upgrade to go 1.12.9.\n  * Bug Fixes\n    + Dashboard: Fixes dashboards init failed loading error for dashboards with panel links that had missing properties.\n    + Editor: Fixes issue where only entire lines were being copied.\n    + Explore: Fixes query field layout in splitted view for Safari browsers.\n    + LDAP: multildap + ldap integration.\n    + Profile/UserAdmin: Fix for user agent parser crashes grafana-server on 32-bit builds.\n    + Prometheus: Prevents panel editor crash when switching to Prometheus datasource.\n    + Prometheus: Changes brace-insertion behavior to be less annoying.\n- Version 6.3.4\n  * Security: CVE-2019-15043 - Parts of the HTTP API allow unauthenticated use.\n- Version 6.3.3\n  * Bug Fixes\n    + Annotations: Fix failing annotation query when time series query is cancelled. #18532 1, @dprokop 1\n    + Auth: Do not set SameSite cookie attribute if cookie_samesite is none. #18462 1, @papagian 3\n    + DataLinks: Apply scoped variables to data links correctly. #18454 1, @dprokop 1\n    + DataLinks: Respect timezone when displaying datapoint’s timestamp in graph context menu. #18461 2, @dprokop 1\n    + DataLinks: Use datapoint timestamp correctly when interpolating variables. #18459 1, @dprokop 1\n    + Explore: Fix loading error for empty queries. #18488 1, @davkal\n    + Graph: Fixes legend issue clicking on series line icon and issue with horizontal scrollbar being visible on windows. #18563 1, @torkelo 2\n    + Graphite: Avoid glob of single-value array variables . #18420, @gotjosh\n    + Prometheus: Fix queries with label_replace remove the $1 match when loading query editor. #18480 5, @hugohaggmark 3\n    + Prometheus: More consistently allows for multi-line queries in editor. #18362 2, @kaydelaney 2\n    + TimeSeries: Assume values are all numbers. #18540 4, @ryantxu\n- Version 6.3.2\n  * Bug Fixes\n    + Gauge/BarGauge: Fixes issue with losts thresholds and issue loading Gauge with avg stat. #18375 12\n- Version 6.3.1\n  * Bug Fixes\n    + PanelLinks: Fix crash issue Gauge \u0026 Bar Gauge for panels with panel links (drill down links). #18430 2\n- Version 6.3.0\n  * Features / Enhancements\n    + OAuth: Do not set SameSite OAuth cookie if cookie_samesite is None. #18392 4, @papagian 3\n    + Auth Proxy: Include additional headers as part of the cache key. #18298 6, @gotjosh\n    + Build grafana images consistently. #18224 12, @hassanfarid\n    + Docs: SAML. #18069 11, @gotjosh\n    + Permissions: Show plugins in nav for non admin users but hide plugin configuration. #18234 1, @aocenas\n    + TimePicker: Increase max height of quick range dropdown. #18247 2, @torkelo 2\n    + Alerting: Add tags to alert rules. #10989 13, @Thib17 1\n    + Alerting: Attempt to send email notifications to all given email addresses. #16881 1, @zhulongcheng\n    + Alerting: Improve alert rule testing. #16286 2, @marefr\n    + Alerting: Support for configuring content field for Discord alert notifier. #17017 2, @jan25\n    + Alertmanager: Replace illegal chars with underscore in label names. #17002 5, @bergquist 1\n    + Auth: Allow expiration of API keys. #17678, @papagian 3\n    + Auth: Return device, os and browser when listing user auth tokens in HTTP API. #17504, @shavonn 1\n    + Auth: Support list and revoke of user auth tokens in UI. #17434 2, @shavonn 1\n    + AzureMonitor: change clashing built-in Grafana variables/macro names for Azure Logs. #17140, @shavonn 1\n    + CloudWatch: Made region visible for AWS Cloudwatch Expressions. #17243 2, @utkarshcmu\n    + Cloudwatch: Add AWS DocDB metrics. #17241, @utkarshcmu\n    + Dashboard: Use timezone dashboard setting when exporting to CSV. #18002 1, @dehrax\n    + Data links. #17267 11, @torkelo 2\n    + Docker: Switch base image to ubuntu:latest from debian:stretch to avoid security issues… #17066 5, @bergquist 1\n    + Elasticsearch: Support for visualizing logs in Explore . #17605 7, @marefr\n    + Explore: Adds Live option for supported datasources. #17062 1, @hugohaggmark 3\n    + Explore: Adds orgId to URL for sharing purposes. #17895 1, @kaydelaney 2\n    + Explore: Adds support for new loki ‘start’ and ‘end’ params for labels endpoint. #17512, @kaydelaney 2\n    + Explore: Adds support for toggling raw query mode in explore. #17870, @kaydelaney 2\n    + Explore: Allow switching between metrics and logs . #16959 2, @marefr\n    + Explore: Combines the timestamp and local time columns into one. #17775, @hugohaggmark 3\n    + Explore: Display log lines context . #17097, @dprokop 1\n    + Explore: Don’t parse log levels if provided by field or label. #17180 1, @marefr\n    + Explore: Improves performance of Logs element by limiting re-rendering. #17685, @kaydelaney 2\n    + Explore: Support for new LogQL filtering syntax. #16674 4, @davkal\n    + Explore: Use new TimePicker from Grafana/UI. #17793, @hugohaggmark 3\n    + Explore: handle newlines in LogRow Highlighter. #17425, @rrfeng 1\n    + Graph: Added new fill gradient option. #17528 3, @torkelo 2\n    + GraphPanel: Don’t sort series when legend table \u0026 sort column is not visible . #17095, @shavonn 1\n    + InfluxDB: Support for visualizing logs in Explore. #17450 9, @hugohaggmark 3\n    + Logging: Login and Logout actions (#17760). #17883 1, @ATTron\n    + Logging: Move log package to pkg/infra. #17023, @zhulongcheng\n    + Metrics: Expose stats about roles as metrics. #17469 2, @bergquist 1\n    + MySQL/Postgres/MSSQL: Add parsing for day, weeks and year intervals in macros. #13086 6, @bernardd\n    + MySQL: Add support for periodically reloading client certs. #14892, @tpetr\n    + Plugins: replace dataFormats list with skipDataQuery flag in plugin.json. #16984, @ryantxu\n    + Prometheus: Take timezone into account for step alignment. #17477, @fxmiii\n    + Prometheus: Use overridden panel range for $__range instead of dashboard range. #17352, @patrick246\n    + Prometheus: added time range filter to series labels query. #16851 3, @FUSAKLA\n    + Provisioning: Support folder that doesn’t exist yet in dashboard provisioning. #17407 1, @Nexucis\n    + Refresh picker: Handle empty intervals. #17585 1, @dehrax\n    + Singlestat: Add y min/max config to singlestat sparklines. #17527 4, @pitr\n    + Snapshot: use given key and deleteKey. #16876, @zhulongcheng\n    + Templating: Correctly display __text in multi-value variable after page reload. #17840 1, @EduardSergeev\n    + Templating: Support selecting all filtered values of a multi-value variable. #16873 2, @r66ad\n    + Tracing: allow propagation with Zipkin headers. #17009 4, @jrockway\n    + Users: Disable users removed from LDAP. #16820 2, @alexanderzobnin\n  * Bug Fixes\n    + PanelLinks: Fix render issue when there is no panel description. #18408 3, @dehrax\n    + OAuth: Fix “missing saved state” OAuth login failure due to SameSite cookie policy. #18332 1, @papagian 3\n    + cli: fix for recognizing when in dev mode… #18334, @xlson\n    + DataLinks: Fixes incorrect interpolation of ${__series_name} . #18251 1, @torkelo 2\n    + Loki: Display live tailed logs in correct order in Explore. #18031 3, @kaydelaney 2\n    + PhantomJS: Fixes rendering on Debian Buster. #18162 2, @xlson\n    + TimePicker: Fixed style issue for custom range popover. #18244, @torkelo 2\n    + Timerange: Fixes a bug where custom time ranges didn’t respect UTC. #18248 1, @kaydelaney 2\n    + remote_cache: Fix redis connstr parsing. #18204 1, @mblaschke\n    + AddPanel: Fix issue when removing moved add panel widget . #17659 2, @dehrax\n    + CLI: Fix encrypt-datasource-passwords fails with sql error. #18014, @marefr\n    + Elasticsearch: Fix default max concurrent shard requests. #17770 4, @marefr\n    + Explore: Fix browsing back to dashboard panel. #17061, @jschill\n    + Explore: Fix filter by series level in logs graph. #17798, @marefr\n    + Explore: Fix issues when loading and both graph/table are collapsed. #17113, @marefr\n    + Explore: Fix selection/copy of log lines. #17121, @marefr\n    + Fix: Wrap value of multi variable in array when coming from URL. #16992 1, @aocenas\n    + Frontend: Fix for Json tree component not working. #17608, @srid12\n    + Graphite: Fix for issue with alias function being moved last. #17791, @torkelo 2\n    + Graphite: Fixes issue with seriesByTag \u0026 function with variable param. #17795, @torkelo 2\n    + Graphite: use POST for /metrics/find requests. #17814 2, @papagian 3\n    + HTTP Server: Serve Grafana with a custom URL path prefix. #17048 6, @jan25\n    + InfluxDB: Fixes single quotes are not escaped in label value filters. #17398 1, @Panzki\n    + Prometheus: Correctly escape ‘|’ literals in interpolated PromQL variables. #16932, @Limess\n    + Prometheus: Fix when adding label for metrics which contains colons in Explore. #16760, @tolwi\n    + SinglestatPanel: Remove background color when value turns null. #17552 1, @druggieri\n- Make phantomjs dependency configurable\n- Create plugin directory and clean up (create in %install,\n  add to %files) handling of /var/lib/grafana/* and\n\nkoan:\n\n- Calculate relative path for kernel and inited when generating\n  grub entry (bsc#1170231)\n  Added: fix-grub2-entry-paths.diff\n- Fix os-release version detection for SUSE\n  Modified: sles15.patch\n\nsalt:\n\n- Require python3-distro only for TW (bsc#1173072)\n- Various virt backports from 3000.2\n- Avoid traceback on debug logging for swarm module (bsc#1172075)\n- Add publish_batch to ClearFuncs exposed methods\n- Zypperpkg: filter patterns that start with dot (bsc#1171906)\n- Batch mode now also correctly provides return value (bsc#1168340)\n- Add docker.logout to docker execution module (bsc#1165572)\n- Testsuite fix\n- Add option to enable/disable force refresh for zypper\n- Python3.8 compatibility changes\n- Prevent sporious 'salt-api' stuck processes when managing SSH minions\n  because of logging deadlock (bsc#1159284)\n- Avoid segfault from 'salt-api' under certain conditions of heavy load\n  managing SSH minions (bsc#1169604)\n- Revert broken changes to slspath made on Salt 3000 (saltstack/salt#56341) (bsc#1170104)\n- Returns a the list of IPs filtered by the optional network list\n- Fix CVE-2020-11651 and CVE-2020-11652 (bsc#1170595)\n- Do not require vendored backports-abc (bsc#1170288)\n- Fix partition.mkpart to work without fstype (bsc#1169800)\n\nspacecmd:\n\n- Only report real error, not result (bsc#1171687)\n- Use defined return values for spacecmd methods so scripts can\n  check for failure (bsc#1171687)\n\nspacewalk-client-tools:\n\n- Use 'int' instead of 'long' on rhn_check for both Python 2 and 3\n\nsuseRegisterInfo:\n\n- SuseRegisterInfo only needs perl-base, not full perl (bsc#1168310)\n\nuyuni-common-libs:\n\n- Uyuni-common-libs obsoletes python3-spacewalk-usix and\n  python3-spacewalk-backend-libs (bsc#1170684)\n- Reposync speedup fixes\n\nzypp-plugin-spacewalk:\n\n- Prevent issue with non-ASCII characters in Python 2 systems (bsc#1172462)\n\n",
      "Title": "Details",
      "Type": "General"
    },
    {
      "Text": "The CVRF data is provided by SUSE under the Creative Commons License 4.0 with Attribution (CC-BY-4.0).",
      "Title": "Terms of Use",
      "Type": "Legal Disclaimer"
    },
    {
      "Text": "SUSE-2020-1715,SUSE-SLE-Manager-Tools-15-2020-1715",
      "Title": "Patchnames",
      "Type": "Details"
    }
  ],
  "ProductTree": {
    "Relationships": null
  },
  "References": [
    {
      "URL": "https://www.suse.com/support/update/announcement/2020/suse-su-20201715-1/",
      "Description": "Link for SUSE-SU-2020:1715-1"
    },
    {
      "URL": "https://lists.suse.com/pipermail/sle-security-updates/2020-June/007016.html",
      "Description": "E-Mail link for SUSE-SU-2020:1715-1"
    },
    {
      "URL": "https://www.suse.com/support/security/rating/",
      "Description": "SUSE Security Ratings"
    },
    {
      "URL": "https://bugzilla.suse.com/1159284",
      "Description": "SUSE Bug 1159284"
    },
    {
      "URL": "https://bugzilla.suse.com/1165572",
      "Description": "SUSE Bug 1165572"
    },
    {
      "URL": "https://bugzilla.suse.com/1168310",
      "Description": "SUSE Bug 1168310"
    },
    {
      "URL": "https://bugzilla.suse.com/1168340",
      "Description": "SUSE Bug 1168340"
    },
    {
      "URL": "https://bugzilla.suse.com/1169604",
      "Description": "SUSE Bug 1169604"
    },
    {
      "URL": "https://bugzilla.suse.com/1169800",
      "Description": "SUSE Bug 1169800"
    },
    {
      "URL": "https://bugzilla.suse.com/1170104",
      "Description": "SUSE Bug 1170104"
    },
    {
      "URL": "https://bugzilla.suse.com/1170231",
      "Description": "SUSE Bug 1170231"
    },
    {
      "URL": "https://bugzilla.suse.com/1170288",
      "Description": "SUSE Bug 1170288"
    },
    {
      "URL": "https://bugzilla.suse.com/1170557",
      "Description": "SUSE Bug 1170557"
    },
    {
      "URL": "https://bugzilla.suse.com/1170595",
      "Description": "SUSE Bug 1170595"
    },
    {
      "URL": "https://bugzilla.suse.com/1170684",
      "Description": "SUSE Bug 1170684"
    },
    {
      "URL": "https://bugzilla.suse.com/1170824",
      "Description": "SUSE Bug 1170824"
    },
    {
      "URL": "https://bugzilla.suse.com/1171687",
      "Description": "SUSE Bug 1171687"
    },
    {
      "URL": "https://bugzilla.suse.com/1171906",
      "Description": "SUSE Bug 1171906"
    },
    {
      "URL": "https://bugzilla.suse.com/1172075",
      "Description": "SUSE Bug 1172075"
    },
    {
      "URL": "https://bugzilla.suse.com/1172462",
      "Description": "SUSE Bug 1172462"
    },
    {
      "URL": "https://bugzilla.suse.com/1173072",
      "Description": "SUSE Bug 1173072"
    },
    {
      "URL": "https://www.suse.com/security/cve/CVE-2019-10215/",
      "Description": "SUSE CVE CVE-2019-10215 page"
    },
    {
      "URL": "https://www.suse.com/security/cve/CVE-2019-15043/",
      "Description": "SUSE CVE CVE-2019-15043 page"
    },
    {
      "URL": "https://www.suse.com/security/cve/CVE-2020-11651/",
      "Description": "SUSE CVE CVE-2020-11651 page"
    },
    {
      "URL": "https://www.suse.com/security/cve/CVE-2020-11652/",
      "Description": "SUSE CVE CVE-2020-11652 page"
    },
    {
      "URL": "https://www.suse.com/security/cve/CVE-2020-12245/",
      "Description": "SUSE CVE CVE-2020-12245 page"
    },
    {
      "URL": "https://www.suse.com/security/cve/CVE-2020-13379/",
      "Description": "SUSE CVE CVE-2020-13379 page"
    }
  ],
  "Vulnerabilities": [
    {
      "CVE": "CVE-2019-10215",
      "Description": "Bootstrap-3-Typeahead after version 4.0.2 is vulnerable to a cross-site scripting flaw in the highlighter() function. An attacker could exploit this via user interaction to execute code in the user's browser.",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "moderate"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2019-10215.html",
          "Description": "CVE-2019-10215"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": null
        }
      ],
      "CVSSScoreSets": {}
    },
    {
      "CVE": "CVE-2019-15043",
      "Description": "In Grafana 2.x through 6.x before 6.3.4, parts of the HTTP API allow unauthenticated use. This makes it possible to run a denial of service attack against the server running Grafana.",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "important"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2019-15043.html",
          "Description": "CVE-2019-15043"
        },
        {
          "URL": "https://bugzilla.suse.com/1148383",
          "Description": "SUSE Bug 1148383"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": null
        }
      ],
      "CVSSScoreSets": {}
    },
    {
      "CVE": "CVE-2020-11651",
      "Description": "An issue was discovered in SaltStack Salt before 2019.2.4 and 3000 before 3000.2. The salt-master process ClearFuncs class does not properly validate method calls. This allows a remote user to access some methods without authentication. These methods can be used to retrieve user tokens from the salt master and/or run arbitrary commands on salt minions.",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "critical"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2020-11651.html",
          "Description": "CVE-2020-11651"
        },
        {
          "URL": "https://bugzilla.suse.com/1170595",
          "Description": "SUSE Bug 1170595"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": null
        }
      ],
      "CVSSScoreSets": {}
    },
    {
      "CVE": "CVE-2020-11652",
      "Description": "An issue was discovered in SaltStack Salt before 2019.2.4 and 3000 before 3000.2. The salt-master process ClearFuncs class allows access to some methods that improperly sanitize paths. These methods allow arbitrary directory access to authenticated users.",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "critical"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2020-11652.html",
          "Description": "CVE-2020-11652"
        },
        {
          "URL": "https://bugzilla.suse.com/1170595",
          "Description": "SUSE Bug 1170595"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": null
        }
      ],
      "CVSSScoreSets": {}
    },
    {
      "CVE": "CVE-2020-12245",
      "Description": "Grafana before 6.7.3 allows table-panel XSS via column.title or cellLinkTooltip.",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "moderate"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2020-12245.html",
          "Description": "CVE-2020-12245"
        },
        {
          "URL": "https://bugzilla.suse.com/1170557",
          "Description": "SUSE Bug 1170557"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": null
        }
      ],
      "CVSSScoreSets": {}
    },
    {
      "CVE": "CVE-2020-13379",
      "Description": "The avatar feature in Grafana 3.0.1 through 7.0.1 has an SSRF Incorrect Access Control issue. This vulnerability allows any unauthenticated user/client to make Grafana send HTTP requests to any URL and return its result to the user/client. This can be used to gain information about the network that Grafana is running on. Furthermore, passing invalid URL objects could be used for DOS'ing Grafana via SegFault.",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "moderate"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2020-13379.html",
          "Description": "CVE-2020-13379"
        },
        {
          "URL": "https://bugzilla.suse.com/1172409",
          "Description": "SUSE Bug 1172409"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": null
        }
      ],
      "CVSSScoreSets": {}
    }
  ]
}