{
  "Title": "Security update for conmon, fuse-overlayfs, libcontainers-common, podman",
  "Tracking": {
    "ID": "SUSE-SU-2020:2731-1",
    "Status": "Final",
    "Version": "1",
    "InitialReleaseDate": "2020-09-24T05:42:41Z",
    "CurrentReleaseDate": "2020-09-24T05:42:41Z",
    "RevisionHistory": [
      {
        "Number": "1",
        "Date": "2020-09-24T05:42:41Z",
        "Description": "current"
      }
    ]
  },
  "Notes": [
    {
      "Text": "Security update for conmon, fuse-overlayfs, libcontainers-common, podman",
      "Title": "Topic",
      "Type": "Summary"
    },
    {
      "Text": "This update for conmon, fuse-overlayfs, libcontainers-common, podman fixes the following issues:\n\npodman was updated to v2.0.6 (bsc#1175821)\n\n- install missing systemd units for the new Rest API (bsc#1175957)\n  and a few man-pages that where missing before\n- Drop varlink API related bits (in favor of the new API)\n- fix install location for zsh completions\n\n * Fixed a bug where running systemd in a container on a cgroups v1 system would fail.\n * Fixed a bug where /etc/passwd could be re-created every time a container\n   is restarted if the container's /etc/passwd did not contain an entry\n   for the user the container was started as.\n * Fixed a bug where containers without an /etc/passwd file specifying\n   a non-root user would not start.\n * Fixed a bug where the --remote flag would sometimes not make\n   remote connections and would instead attempt to run Podman locally.\n\nUpdate to v2.0.6:\n\n* Features\n\n  - Rootless Podman will now add an entry to /etc/passwd for the user who ran Podman if run with --userns=keep-id.\n  - The podman system connection command has been reworked to support multiple connections, and reenabled for use!\n  - Podman now has a new global flag, --connection, to specify a connection to a remote Podman API instance.\n\n* Changes\n\n  - Podman's automatic systemd integration (activated by the --systemd=true flag, set by default) will now activate for containers using /usr/local/sbin/init as their command, instead of just /usr/sbin/init and /sbin/init (and any path ending in systemd).\n  - Seccomp profiles specified by the --security-opt seccomp=... flag to podman create and podman run will now be honored even if the container was created using --privileged.\n\n* Bugfixes\n\n  - Fixed a bug where the podman play kube would not honor the hostIP field for port forwarding (#5964).\n  - Fixed a bug where the podman generate systemd command would panic on an invalid restart policy being specified (#7271).\n  - Fixed a bug where the podman images command could take a very long time (several minutes) to complete when a large number of images were present.\n  - Fixed a bug where the podman logs command with the --tail flag would not work properly when a large amount of output would be printed ((#7230)[https://github.com//issues/7230]).\n  - Fixed a bug where the podman exec command with remote Podman would not return a non-zero exit code when the exec session failed to start (e.g. invoking a non-existent command) (#6893).\n  - Fixed a bug where the podman load command with remote Podman would did not honor user-specified tags (#7124).\n  - Fixed a bug where the podman system service command, when run as a non-root user by Systemd, did not properly handle the Podman pause process and would not restart properly as a result (#7180).\n  - Fixed a bug where the --publish flag to podman create, podman run, and podman pod create did not properly handle a host IP of 0.0.0.0 (attempting to bind to literal 0.0.0.0, instead of all IPs on the system) (#7104).\n  - Fixed a bug where the podman start --attach command would not print the container's exit code when the command exited due to the container exiting.\n  - Fixed a bug where the podman rm command with remote Podman would not remove volumes, even if the --volumes flag was specified (#7128).\n  - Fixed a bug where the podman run command with remote Podman and the --rm flag could exit before the container was fully removed.\n  - Fixed a bug where the --pod new:... flag to podman run and podman create would create a pod that did not share any namespaces.\n  - Fixed a bug where the --preserve-fds flag to podman run and podman exec could close the wrong file descriptors while trying to close user-provided descriptors after passing them into the container.\n  - Fixed a bug where default environment variables ($PATH and $TERM) were not set in containers when not provided by the image.\n  - Fixed a bug where pod infra containers were not properly unmounted after exiting.\n  - Fixed a bug where networks created with podman network create with an IPv6 subnet did not properly set an IPv6 default route.\n  - Fixed a bug where the podman save command would not work properly when its output was piped to another command (#7017).\n  - Fixed a bug where containers using a systemd init on a cgroups v1 system could leak mounts under /sys/fs/cgroup/systemd to the host.\n  - Fixed a bug where podman build would not generate an event on completion (#7022).\n  - Fixed a bug where the podman history command with remote Podman printed incorrect creation times for layers (#7122).\n  - Fixed a bug where Podman would not create working directories specified by the container image if they did not exist.\n  - Fixed a bug where Podman did not clear CMD from the container image if the user overrode ENTRYPOINT (#7115).\n  - Fixed a bug where error parsing image names were not fully reported (part of the error message containing the exact issue was dropped).\n  - Fixed a bug where the podman images command with remote Podman did not support printing image tags in Go templates supplied to the --format flag (#7123).\n  - Fixed a bug where the podman rmi --force command would not attempt to unmount containers it was removing, which could cause a failure to remove the image.\n  - Fixed a bug where the podman generate systemd --new command could incorrectly quote arguments to Podman that contained whitespace, leading to nonfunctional unit files (#7285).\n  - Fixed a bug where the podman version command did not properly include build time and Git commit.\n  - Fixed a bug where running systemd in a Podman container on a system that did not use the systemd cgroup manager would fail (#6734).\n  - Fixed a bug where capabilities from --cap-add were not properly added when a container was started as a non-root user via --user.\n  - Fixed a bug where Pod infra containers were not properly cleaned up when they stopped, causing networking issues (#7103).\n\n* API\n\n  - Fixed a bug where the libpod and compat Build endpoints did not accept the application/tar content type (instead only accepting application/x-tar) (#7185).\n  - Fixed a bug where the libpod Exists endpoint would attempt to write a second header in some error conditions (#7197).\n  - Fixed a bug where compat and libpod Network Inspect and Network Remove endpoints would return a 500 instead of 404 when the requested network was not found.\n  - Added a versioned _ping endpoint (e.g. http://localhost/v1.40/_ping).\n  - Fixed a bug where containers started through a systemd-managed instance of the REST API would be shut down when podman system service shut down due to its idle timeout (#7294).\n  - Added stronger parameter verification for the libpod Network Create endpoint to ensure subnet mask is a valid value.\n  - The Pod URL parameter to the Libpod Container List endpoint has been deprecated; the information previously gated by the Pod boolean will now be included in the response unconditionally.\n\n- Change hard requires for AppArmor to Recommends. They are not\n  needed for runtime or with SELinux but already installed if\n  AppArmor is used [jsc#SMO-15]\n- Add BuildRequires for pkg-config(libselinux) to build with\n  SELinux support [jsc#SMO-15] \n\nUpdate to v2.0.4\n\n* Fixed a bug where the output of podman image search did not\n  populate the Description field as it was mistakenly assigned to\n  the ID field.\n* Fixed a bug where podman build - and podman build on an HTTP\n  target would fail.\n* Fixed a bug where rootless Podman would improperly chown the\n  copied-up contents of anonymous volumes (#7130).\n* Fixed a bug where Podman would sometimes HTML-escape special\n  characters in its CLI output.\n* Fixed a bug where the podman start --attach --interactive\n  command would print the container ID of the container attached\n  to when exiting (#7068).\n* Fixed a bug where podman run --ipc=host --pid=host would only\n  set --pid=host and not --ipc=host (#7100).\n* Fixed a bug where the --publish argument to podman run, podman\n  create and podman pod create would not allow binding the same\n  container port to more than one host port (#7062).\n* Fixed a bug where incorrect arguments to podman images --format\n  could cause Podman to segfault.\n* Fixed a bug where podman rmi --force on an image ID with more\n  than one name and at least one container using the image would\n  not completely remove containers using the image (#7153).\n* Fixed a bug where memory usage in bytes and memory use\n  percentage were swapped in the output of podman stats\n  --format=json.\n* Fixed a bug where the libpod and compat events endpoints would\n  fail if no filters were specified (#7078).\n* Fixed a bug where the CgroupVersion field in responses from the\n  compat Info endpoint was prefixed by 'v' (instead of just being\n  '1' or '2', as is documented).\n\n- Suggest katacontainers instead of recommending it. It's not\n  enabled by default, so it's just bloat\n\nUpdate to v2.0.3\n\n* Fix handling of entrypoint\n* log API: add context to allow for cancelling\n* fix API: Create container with an invalid configuration\n* Remove all instances of named return 'err' from Libpod\n* Fix: Correct connection counters for hijacked connections\n* Fix: Hijacking v2 endpoints to follow rfc 7230 semantics\n* Remove hijacked connections from active connections list\n* version/info: format: allow more json variants\n* Correctly print STDOUT on non-terminal remote exec\n* Fix container and pod create commands for remote create\n* Mask out /sys/dev to prevent information leak from the host\n* Ensure sig-proxy default is propagated in start\n* Add SystemdMode to inspect for containers\n* When determining systemd mode, use full command\n* Fix lint\n* Populate remaining unused fields in `pod inspect`\n* Include infra container information in `pod inspect`\n* play-kube: add suport for 'IfNotPresent' pull type\n* docs: user namespace can't be shared in pods\n* Fix 'Error: unrecognized protocol \\'TCP\\' in port mapping'\n* Error on rootless mac and ip addresses\n* Fix \u0026 add notes regarding problematic language in codebase\n* abi: set default umask and rlimits\n* Used reference package with errors for parsing tag\n* fix: system df error when an image has no name\n* Fix Generate API title/description\n* Add noop function disable-content-trust\n* fix play kube doesn't override dockerfile ENTRYPOINT\n* Support default profile for apparmor\n* Bump github.com/containers/common to v0.14.6\n* events endpoint: backwards compat to old type\n* events endpoint: fix panic and race condition\n* Switch references from libpod.conf to containers.conf\n* podman.service: set type to simple\n* podman.service: set doc to podman-system-service\n* podman.service: use default registries.conf\n* podman.service: use default killmode\n* podman.service: remove stop timeout\n* systemd: symlink user-\u003esystem\n* vendor golang.org/x/text@v0.3.3\n* Fix a bug where --pids-limit was parsed incorrectly\n* search: allow wildcards\n* [CI:DOCS]Do not copy policy.json into gating image\n* Fix systemd pid 1 test\n* Cirrus: Rotate keys post repo. rename\n* The libpod.conf(5) man page got removed and all references are\n  now pointing towards containers.conf(5), which will be part\n  of the libcontainers-common package.\n\nUpdate to podman v2.0.2\n\n* fix race condition in `libpod.GetEvents(...)`\n* Fix bug where `podman mount` didn't error as rootless\n* remove podman system connection\n* Fix imports to ensure v2 is used with libpod\n* Update release notes for v2.0.2\n* specgen: fix order for setting rlimits\n* Ensure umask is set appropriately for 'system service'\n* generate systemd: improve pod-flags filter\n* Fix a bug with APIv2 compat network remove to log an ErrNetworkNotFound instead of nil\n* Fixes --remote flag issues\n* Pids-limit should only be set if the user set it\n* Set console mode for windows\n* Allow empty host port in --publish flag\n* Add a note on the APIs supported by `system service`\n* fix: Don't override entrypoint if it's `nil`\n* Set TMPDIR to /var/tmp by default if not set\n* test: add tests for --user and volumes\n* container: move volume chown after spec generation\n* libpod: volume copyup honors namespace mappings\n* Fix `system service` panic from early hangup in events\n* stop podman service in e2e tests\n* Print errors from individual containers in pods\n* auto-update: clarify systemd-unit requirements\n* podman ps truncate the command\n* move go module to v2\n* Vendor containers/common v0.14.4\n* Bump to imagebuilder v1.1.6 on v2 branch\n* Account for non-default port number in image name\n- Changes since v2.0.1\n* Update release notes with further v2.0.1 changes\n* Fix inspect to display multiple label: changes\n* Set syslog for exit commands on log-level=debug\n* Friendly amendment for pr 6751\n* podman run/create: support all transports\n* systemd generate: allow manual restart of container units in pods\n* Revert sending --remote flag to containers\n* Print port mappings in `ps` for ctrs sharing network\n* vendor github.com/containers/common@v0.14.3\n* Update release notes for v2.0.1\n* utils: drop default mapping when running uid!=0\n* Set stop signal to 15 when not explicitly set\n* podman untag: error if tag doesn't exist\n* Reformat inspect network settings\n* APIv2: Return `StatusCreated` from volume creation\n* APIv2:fix: Remove `/json` from compat network EPs\n* Fix ssh-agent support\n* libpod: specify mappings to the storage\n* APIv2:doc: Fix swagger doc to refer to volumes\n* Add podman network to bash command completions\n* Fix typo in manpage for `podman auto update`.\n* Add JSON output field for ps\n* V2 podman system connection\n* image load: no args required\n* Re-add PODMAN_USERNS environment variable\n* Fix conflicts between privileged and other flags\n* Bump required go version to 1.13\n* Add explicit command to alpine container in test case.\n* Use POLL_DURATION for timer\n* Stop following logs using timers\n* 'pod' was being truncated to 'po' in the names of the generated systemd unit files.\n* rootless_linux: improve error message\n* Fix podman build handling of --http-proxy flag\n* correct the absolute path of `rm` executable\n* Makefile: allow customizable GO_BUILD\n* Cirrus: Change DEST_BRANCH to v2.0\n\nUpdate to podman v2.0.0\n\n* The `podman generate systemd` command now supports the `--new`\n  flag when used with pods, allowing portable services for pods\n  to be created.\n* The `podman play kube` command now supports running Kubernetes\n  Deployment YAML.\n* The `podman exec` command now supports the `--detach` flag to\n  run commands in the container in the background.\n* The `-p` flag to `podman run` and `podman create` now supports\n  forwarding ports to IPv6 addresses.\n* The `podman run`, `podman create` and `podman pod create`\n  command now support a `--replace` flag to remove and replace any\n  existing container (or, for `pod create`, pod) with the same name\n* The `--restart-policy` flag to `podman run` and `podman create`\n  now supports the `unless-stopped` restart policy.\n* The `--log-driver` flag to `podman run` and `podman create`\n  now supports the `none` driver, which does not log the\n  container's output.\n* The `--mount` flag to `podman run` and `podman create` now\n  accepts `readonly` option as an alias to `ro`.\n* The `podman generate systemd` command now supports the `--container-prefix`,\n  `--pod-prefix`, and `--separator` arguments to control the\n  name of generated unit files.\n* The `podman network ls` command now supports the `--filter`\n  flag to filter results.\n* The `podman auto-update` command now supports specifying an\n  authfile to use when pulling new images on a per-container\n  basis using the `io.containers.autoupdate.authfile` label.\n* Fixed a bug where the `podman exec` command would log to journald\n  when run in containers loggined to journald\n  ([#6555](https://github.com/containers/libpod/issues/6555)).\n* Fixed a bug where the `podman auto-update` command would not\n  preserve the OS and architecture of the original image when\n  pulling a replacement\n  ([#6613](https://github.com/containers/libpod/issues/6613)).\n* Fixed a bug where the `podman cp` command could create an extra\n  `merged` directory when copying into an existing directory\n  ([#6596](https://github.com/containers/libpod/issues/6596)).\n* Fixed a bug where the `podman pod stats` command would crash\n  on pods run with `--network=host`\n  ([#5652](https://github.com/containers/libpod/issues/5652)).\n* Fixed a bug where containers logs written to journald did not\n  include the name of the container.\n* Fixed a bug where the `podman network inspect` and\n  `podman network rm` commands did not properly handle non-default\n  CNI configuration paths ([#6212](https://github.com/containers/libpod/issues/6212)).\n* Fixed a bug where Podman did not properly remove containers\n  when using the Kata containers OCI runtime.\n* Fixed a bug where `podman inspect` would sometimes incorrectly\n  report the network mode of containers started with `--net=none`.\n* Podman is now better able to deal with cases where `conmon`\n  is killed before the container it is monitoring.\n\nUpdate to podman v1.9.3:\n\n* Fixed a bug where, on FIPS enabled hosts, FIPS mode secrets\n  were not properly mounted into containers\n* Fixed a bug where builds run over Varlink would hang\n* Fixed a bug where podman save would fail when the target\n  image was specified by digest\n* Fixed a bug where rootless containers with ports forwarded to them\n  could panic and dump core due to a concurrency issue (#6018)\n* Fixed a bug where rootless Podman could race when opening the\n  rootless user namespace, resulting in commands failing to run\n* Fixed a bug where HTTP proxy environment variables forwarded into\n  the container by the --http-proxy flag could not be overridden by --env or --env-file\n* Fixed a bug where rootless Podman was setting resource limits on cgroups\n  v2 systems that were not using systemd-managed cgroups\n  (and thus did not support resource limits), resulting in containers failing to start\n\nUpdate podman to v1.9.1:\n\n* Bugfixes\n\n  - Fixed a bug where healthchecks could become nonfunctional if\n    container log paths were manually set with --log-path and\n    multiple container logs were placed in the same directory\n  - Fixed a bug where rootless Podman could, when using an older\n    libpod.conf, print numerous warning messages about an invalid\n    CGroup manager config\n  - Fixed a bug where rootless Podman would sometimes fail to\n    close the rootless user namespace when joining it\n\nUpdate podman to v1.9.0:\n\n* Features\n\n  - Experimental support has been added for podman run\n    --userns=auto, which automatically allocates a unique UID and\n    GID range for the new container's user namespace\n  - The podman play kube command now has a --network flag to\n    place the created pod in one or more CNI networks\n  - The podman commit command now supports an --iidfile flag to\n    write the ID of the committed image to a file\n  - Initial support for the new containers.conf configuration\n    file has been added. containers.conf allows for much more\n    detailed configuration of some Podman functionality\n\n* Changes\n\n  - There has been a major cleanup of the podman info command\n    resulting in breaking changes. Many fields have been renamed\n    to better suit usage with APIv2\n  - All uses of the --timeout flag have been switched to prefer\n    the alternative --time. The --timeout flag will continue to\n    work, but man pages and --help will use the --time flag\n    instead\n\n* Bugfixes\n\n  - Fixed a bug where some volume mounts from the host would\n    sometimes not properly determine the flags they should use\n    when mounting\n  - Fixed a bug where Podman was not propagating $PATH to Conmon\n    and the OCI runtime, causing issues for some OCI runtimes\n    that required it\n  - Fixed a bug where rootless Podman would print error messages\n    about missing support for systemd cgroups when run in a\n    container with no cgroup support\n  - Fixed a bug where podman play kube would not properly handle\n    container-only port mappings (#5610)\n  - Fixed a bug where the podman container prune command was not\n    pruning containers in the created and configured states\n  - Fixed a bug where Podman was not properly removing CNI IP\n    address allocations after a reboot (#5433)\n  - Fixed a bug where Podman was not properly applying the\n    default Seccomp profile when --security-opt was not given at\n    the command line\n\n* HTTP API\n\n  - Many Libpod API endpoints have been added, including Changes,\n    Checkpoint, Init, and Restore\n  - Resolved issues where the podman system service command would\n    time out and exit while there were still active connections\n  - Stability overall has greatly improved as we prepare the API\n    for a beta release soon with Podman 2.0\n\n* Misc\n\n  - The default infra image for pods has been upgraded to\n    k8s.gcr.io/pause:3.2 (from 3.1) to address a bug in the\n    architecture metadata for non-AMD64 images\n  - The slirp4netns networking utility in rootless Podman now\n    uses Seccomp filtering where available for improved security\n  - Updated Buildah to v1.14.8\n  - Updated containers/storage to v1.18.2\n  - Updated containers/image to v5.4.3\n  - Updated containers/common to v0.8.1\n\n- Add 'systemd' BUILDFLAGS to build with support for journald\n  logging (bsc#1162432)\n\nUpdate podman to v1.8.2:\n\n* Features\n\n  - Initial support for automatically updating containers managed\n    via Systemd unit files has been merged. This allows\n    containers to automatically upgrade if a newer version of\n    their image becomes available\n\n* Bugfixes\n\n  - Fixed a bug where unit files generated by podman generate\n    systemd --new would not force containers to detach, causing\n    the unit to time out when trying to start\n  - Fixed a bug where podman system reset could delete important\n    system directories if run as rootless on installations\n    created by older Podman (#4831)\n  - Fixed a bug where image built by podman build would not\n    properly set the OS and Architecture they were built with\n    (#5503)\n  - Fixed a bug where attached podman run with --sig-proxy\n    enabled (the default), when built with Go 1.14, would\n    repeatedly send signal 23 to the process in the container and\n    could generate errors when the container stopped (#5483)\n  - Fixed a bug where rootless podman run commands could hang\n    when forwarding ports\n  - Fixed a bug where rootless Podman would not work when /proc\n    was mounted with the hidepid option set\n  - Fixed a bug where the podman system service command would use\n    large amounts of CPU when --timeout was set to 0 (#5531)\n\n* HTTP API\n\n  - Initial support for Libpod endpoints related to creating and\n    operating on image manifest lists has been added\n  - The Libpod Healthcheck and Events API endpoints are now\n    supported\n  - The Swagger endpoint can now handle cases where no Swagger\n    documentation has been generated\n\nUpdate podman to v1.8.1:\n\n* Features\n\n  - Many networking-related flags have been added to podman pod\n    create to enable customization of pod networks, including\n    --add-host, --dns, --dns-opt, --dns-search, --ip,\n    --mac-address, --network, and --no-hosts\n  - The podman ps --format=json command now includes the ID of\n    the image containers were created with\n  - The podman run and podman create commands now feature an\n    --rmi flag to remove the image the container was using after\n    it exits (if no other containers are using said image)\n    ([#4628](https://github.com/containers/libpod/issues/4628))\n  - The podman create and podman run commands now support the\n    --device-cgroup-rule flag (#4876)\n  - While the HTTP API remains in alpha, many fixes and additions\n    have landed. These are documented in a separate subsection\n    below\n  - The podman create and podman run commands now feature a\n    --no-healthcheck flag to disable healthchecks for a container\n    (#5299)\n  - Containers now recognize the io.containers.capabilities\n    label, which specifies a list of capabilities required by the\n    image to run. These capabilities will be used as long as they\n    are more restrictive than the default capabilities used\n  - YAML produced by the podman generate kube command now\n    includes SELinux configuration passed into the container via\n    --security-opt label=... (#4950)\n\n* Bugfixes\n\n  - Fixed CVE-2020-1726, a security issue where volumes manually\n    populated before first being mounted into a container could\n    have those contents overwritten on first being mounted into a\n    container\n  - Fixed a bug where Podman containers with user namespaces in\n    CNI networks with the DNS plugin enabled would not have the\n    DNS plugin's nameserver added to their resolv.conf\n    ([#5256](https://github.com/containers/libpod/issues/5256))\n  - Fixed a bug where trailing / characters in image volume\n    definitions could cause them to not be overridden by a\n    user-specified mount at the same location\n    ([#5219](https://github.com/containers/libpod/issues/5219))\n  - Fixed a bug where the label option in libpod.conf, used to\n    disable SELinux by default, was not being respected (#5087)\n  - Fixed a bug where the podman login and podman logout commands\n    required the registry to log into be specified (#5146)\n  - Fixed a bug where detached rootless Podman containers could\n    not forward ports (#5167)\n  - Fixed a bug where rootless Podman could fail to run if the\n    pause process had died\n  - Fixed a bug where Podman ignored labels that were specified\n    with only a key and no value (#3854)\n  - Fixed a bug where Podman would fail to create named volumes\n    when the backing filesystem did not support SELinux labelling\n    (#5200)\n  - Fixed a bug where --detach-keys='' would not disable\n    detaching from a container (#5166)\n  - Fixed a bug where the podman ps command was too aggressive\n    when filtering containers and would force --all on in too\n    many situations\n  - Fixed a bug where the podman play kube command was ignoring\n    image configuration, including volumes, working directory,\n    labels, and stop signal (#5174)\n  - Fixed a bug where the Created and CreatedTime fields in\n    podman images --format=json were misnamed, which also broke\n    Go template output for those fields\n    ([#5110](https://github.com/containers/libpod/issues/5110))\n  - Fixed a bug where rootless Podman containers with ports\n    forwarded could hang when started (#5182)\n  - Fixed a bug where podman pull could fail to parse registry\n    names including port numbers\n  - Fixed a bug where Podman would incorrectly attempt to\n    validate image OS and architecture when starting containers\n  - Fixed a bug where Bash completion for podman build -f would\n    not list available files that could be built (#3878)\n  - Fixed a bug where podman commit --change would perform\n    incorrect validation, resulting in valid changes being\n    rejected (#5148)\n  - Fixed a bug where podman logs --tail could take large amounts\n    of memory when the log file for a container was large (#5131)\n  - Fixed a bug where Podman would sometimes incorrectly generate\n    firewall rules on systems using firewalld\n  - Fixed a bug where the podman inspect command would not\n    display network information for containers properly if a\n    container joined multiple CNI networks\n    ([#4907](https://github.com/containers/libpod/issues/4907))\n  - Fixed a bug where the --uts flag to podman create and podman\n    run would only allow specifying containers by full ID (#5289)\n  - Fixed a bug where rootless Podman could segfault when passed\n    a large number of file descriptors\n  - Fixed a bug where the podman port command was incorrectly\n    interpreting additional arguments as container names, instead\n    of port numbers\n  - Fixed a bug where units created by podman generate systemd\n    did not depend on network targets, and so could start before\n    the system network was ready (#4130)\n  - Fixed a bug where exec sessions in containers which did not\n    specify a user would not inherit supplemental groups added to\n    the container via --group-add\n  - Fixed a bug where Podman would not respect the $TMPDIR\n    environment variable for placing large temporary files during\n    some operations (e.g. podman pull)\n    ([#5411](https://github.com/containers/libpod/issues/5411))\n\n* HTTP API\n\n  - Initial support for secure connections to servers via SSH\n    tunneling has been added\n  - Initial support for the libpod create and logs endpoints for\n    containers has been added\n  - Added a /swagger/ endpoint to serve API documentation\n  - The json endpoint for containers has received many fixes\n  - Filtering images and containers has been greatly improved,\n    with many bugs fixed and documentation improved\n  - Image creation endpoints (commit, pull, etc) have seen many\n    fixes\n  - Server timeout has been fixed so that long operations will no\n    longer trigger the timeout and shut the server down\n  - The stats endpoint for containers has seen major fixes and\n    now provides accurate output\n  - Handling the HTTP 304 status code has been fixed for all\n    endpoints\n  - Many fixes have been made to API documentation to ensure it\n    matches the code\n\n* Misc\n\n  - The Created field to podman images --format=json has been\n    renamed to CreatedSince as part of the fix for (#5110). Go\n    templates using the old name shou ld still work\n  - The CreatedTime field to podman images --format=json has been\n    renamed to CreatedAt as part of the fix for (#5110). Go\n    templates using the old name should still work\n  - The before filter to podman images has been renamed to since\n    for Docker compatibility. Using before will still work, but\n      documentation has been changed to use the new since filter\n  - Using the --password flag to podman login now warns that\n    passwords are being passed in plaintext\n  - Some common cases where Podman would deadlock have been fixed\n    to warn the user that podman system renumber must be run to\n    resolve the deadlock\n\n- Configure br_netfilter for podman automatically (bsc#1165738)\n  The trigger is only excuted when updating podman-cni-config while the\n  command was running\n\nconmon was update to v2.0.20 (bsc#1175821)\n\n- journald: fix logging container name\n- container logging: Implement none driver - 'off', 'null' or\n  'none' all work.\n- ctrl: warn if we fail to unlink\n- Drop fsync calls\n- Reap PIDs before running exit command\n- Fix log path parsing\n- Add --sync option to prevent conmon from double forking\n- Add --no-sync-log option to instruct conmon to not sync the\n  logs of the containers upon shutting down. This feature fixes a\n  regression where we unconditionally dropped the log sync. It is\n  possible the container logs could be corrupted on a sudden\n  power-off. If you need container logs to remain in consistent\n  state after a sudden shutdown, please update from v2.0.19 to\n  v2.0.20\n\n- Update to v2.0.17:\n\n  - Add option to delay execution of exit command\n\n- Update to v2.0.16:\n\n  - tty: flush pending data when fd is ready\n\n- Enable support for journald logging (bsc#1162432)\n- Update to v2.0.15:\n\n  - store status while waiting for pid\n\n- Update to v2.0.14:\n\n  - drop usage of splice(2)\n  - avoid hanging on stdin\n  - stdio: sometimes quit main loop after io is done\n  - ignore sigpipe\n\n- Update to v2.0.12\n\n  - oom: fix potential race between verification steps\n\n- Update to v2.0.11\n\n  - log: reject --log-tag with k8s-file\n  - chmod std files pipes\n  - adjust score to -1000 to prevent conmon from ever being OOM\n    killed\n  - container OOM: verify cgroup hasn't been cleaned up before\n    reporting OOM\n  - journal logging: write to /dev/null instead of -1\n\nfuse-overlayfs was updated to 1.1.2 (bsc#1175821):\n\n- fix memory leak when creating whiteout files.\n- fix lookup for overflow uid when it is different than the overflow gid.\n- use openat2(2) when available.\n- accept 'ro' as mount option.\n- fix set mtime for a symlink.\n- fix some issues reported by static analysis.\n- fix potential infinite loop on a short read.\n- fix creating a directory if the destination already exists\n  in the upper layer.\n- report correctly the number of links for a directory also for\n  subsequent stat calls\n- stop looking up the ino in the lower layers if the file could\n  not be opened\n- make sure the destination is deleted before doing a rename(2).\n  It prevents a left over directory to cause delete to fail with\n  EEXIST.\n- honor --debug.\n\nlibcontainers-common was updated to fix:\n\n- Fixes for %_libexecdir changing to /usr/libexec (bsc#1174075)\n- Added containers/common tarball for containers.conf(5) man page\n- Install containers.conf default configuration in\n  /usr/share/containers\n- libpod repository on github got renamed to podman\n- Update to image 5.5.1\n  - Add documentation for credHelpera\n  - Add defaults for using the rootless policy path\n- Update libpod/podman to 2.0.3\n  - docs: user namespace can't be shared in pods\n  - Switch references from libpod.conf to containers.conf\n  - Allow empty host port in --publish flag\n  - update document login see config.json as valid\n- Update storage to 1.20.2\n  - Add back skip_mount_home\n\n- Remove remaining difference between SLE and openSUSE package and\n  ship the some mounts.conf default configuration on both platforms.\n  As the sources for the mount point do not exist on openSUSE by\n  default this config will basically have no effect on openSUSE.\n  (jsc#SLE-12122, bsc#1175821) \n\n- Update to image 5.4.4\n  - Remove registries.conf VERSION 2 references from man page\n  - Intial authfile man page\n  - Add $HOME/.config/containers/certs.d to perHostCertDirPath\n  - Add $HOME/.config/containers/registries.conf to config path\n  - registries.conf.d: add stances for the registries.conf\n- update to libpod 1.9.3\n  - userns: support --userns=auto\n  - Switch to using --time as opposed to --timeout to better match Docker\n  - Add support for specifying CNI networks in podman play kube\n  - man pages: fix inconsistencies\n- Update to storage 1.19.1\n  - userns: add support for auto\n  - store: change the default user to containers\n  - config: honor XDG_CONFIG_HOME\n- Remove the /var/lib/ca-certificates/pem/SUSE.pem workaround again.\n  It never ended up in SLES and a different way to fix the underlying\n  problem is being worked on.\n\n- Add registry.opensuse.org as default registry [bsc#1171578] \n\n- Add /var/lib/ca-certificates/pem/SUSE.pem to the SLES mounts.\n  This for making container-suseconnect working in the public\n  cloud on-demand images. It needs that file for being able to\n  verify the server certificates of the RMT servers hosted\n  in the public cloud.\n  (https://github.com/SUSE/container-suseconnect/issues/41)\n  \n\n      ",
      "Title": "Details",
      "Type": "General"
    },
    {
      "Text": "The CVRF data is provided by SUSE under the Creative Commons License 4.0 with Attribution (CC-BY-4.0).",
      "Title": "Terms of Use",
      "Type": "Legal Disclaimer"
    },
    {
      "Text": "Container rancher/elemental-teal-rt/5.4:latest-2020-2731,Container rancher/elemental-teal/5.4:latest-2020-2731,Container suse/sles/15.3/cdi-importer:1.37.1-2020-2731,SUSE-2020-2731,SUSE-SLE-Module-Basesystem-15-SP1-2020-2731,SUSE-SLE-Module-Basesystem-15-SP2-2020-2731,SUSE-SLE-Module-Containers-15-SP1-2020-2731,SUSE-SLE-Module-Containers-15-SP2-2020-2731",
      "Title": "Patchnames",
      "Type": "Details"
    }
  ],
  "ProductTree": {
    "Relationships": [
      {
        "ProductReference": "fuse-overlayfs-1.1.2-3.9.1",
        "RelatesToProductReference": "Container rancher/elemental-teal-rt/5.4:latest",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "fuse-overlayfs-1.1.2-3.9.1",
        "RelatesToProductReference": "Container rancher/elemental-teal/5.4:latest",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "libcontainers-common-20200727-3.12.1",
        "RelatesToProductReference": "Container suse/sles/15.3/cdi-importer:1.37.1",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "libcontainers-common-20200727-3.12.1",
        "RelatesToProductReference": "SUSE Linux Enterprise Module for Basesystem 15 SP1",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "libcontainers-common-20200727-3.12.1",
        "RelatesToProductReference": "SUSE Linux Enterprise Module for Basesystem 15 SP2",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "conmon-2.0.20-3.6.1",
        "RelatesToProductReference": "SUSE Linux Enterprise Module for Containers 15 SP1",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "fuse-overlayfs-1.1.2-3.9.1",
        "RelatesToProductReference": "SUSE Linux Enterprise Module for Containers 15 SP1",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "podman-2.0.6-4.25.1",
        "RelatesToProductReference": "SUSE Linux Enterprise Module for Containers 15 SP1",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "podman-cni-config-2.0.6-4.25.1",
        "RelatesToProductReference": "SUSE Linux Enterprise Module for Containers 15 SP1",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "conmon-2.0.20-3.6.1",
        "RelatesToProductReference": "SUSE Linux Enterprise Module for Containers 15 SP2",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "fuse-overlayfs-1.1.2-3.9.1",
        "RelatesToProductReference": "SUSE Linux Enterprise Module for Containers 15 SP2",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "podman-2.0.6-4.25.1",
        "RelatesToProductReference": "SUSE Linux Enterprise Module for Containers 15 SP2",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "podman-cni-config-2.0.6-4.25.1",
        "RelatesToProductReference": "SUSE Linux Enterprise Module for Containers 15 SP2",
        "RelationType": "Default Component Of"
      }
    ]
  },
  "References": [
    {
      "URL": "https://www.suse.com/support/update/announcement/2020/suse-su-20202731-1/",
      "Description": "Link for SUSE-SU-2020:2731-1"
    },
    {
      "URL": "https://lists.suse.com/pipermail/sle-security-updates/2020-September/007476.html",
      "Description": "E-Mail link for SUSE-SU-2020:2731-1"
    },
    {
      "URL": "https://www.suse.com/support/security/rating/",
      "Description": "SUSE Security Ratings"
    },
    {
      "URL": "https://bugzilla.suse.com/1162432",
      "Description": "SUSE Bug 1162432"
    },
    {
      "URL": "https://bugzilla.suse.com/1164090",
      "Description": "SUSE Bug 1164090"
    },
    {
      "URL": "https://bugzilla.suse.com/1165738",
      "Description": "SUSE Bug 1165738"
    },
    {
      "URL": "https://bugzilla.suse.com/1171578",
      "Description": "SUSE Bug 1171578"
    },
    {
      "URL": "https://bugzilla.suse.com/1174075",
      "Description": "SUSE Bug 1174075"
    },
    {
      "URL": "https://bugzilla.suse.com/1175821",
      "Description": "SUSE Bug 1175821"
    },
    {
      "URL": "https://bugzilla.suse.com/1175957",
      "Description": "SUSE Bug 1175957"
    },
    {
      "URL": "https://www.suse.com/security/cve/CVE-2020-1726/",
      "Description": "SUSE CVE CVE-2020-1726 page"
    }
  ],
  "Vulnerabilities": [
    {
      "CVE": "CVE-2020-1726",
      "Description": "A flaw was discovered in Podman where it incorrectly allows containers when created to overwrite existing files in volumes, even if they are mounted as read-only. When a user runs a malicious container or a container based on a malicious image with an attached volume that is used for the first time, it is possible to trigger the flaw and overwrite files in the volume.This issue was introduced in version 1.6.0.",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "moderate"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2020-1726.html",
          "Description": "CVE-2020-1726"
        },
        {
          "URL": "https://bugzilla.suse.com/1164090",
          "Description": "SUSE Bug 1164090"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": [
            "Container rancher/elemental-teal-rt/5.4:latest:fuse-overlayfs-1.1.2-3.9.1",
            "Container rancher/elemental-teal/5.4:latest:fuse-overlayfs-1.1.2-3.9.1",
            "Container suse/sles/15.3/cdi-importer:1.37.1:libcontainers-common-20200727-3.12.1",
            "SUSE Linux Enterprise Module for Basesystem 15 SP1:libcontainers-common-20200727-3.12.1",
            "SUSE Linux Enterprise Module for Basesystem 15 SP2:libcontainers-common-20200727-3.12.1",
            "SUSE Linux Enterprise Module for Containers 15 SP1:conmon-2.0.20-3.6.1",
            "SUSE Linux Enterprise Module for Containers 15 SP1:fuse-overlayfs-1.1.2-3.9.1",
            "SUSE Linux Enterprise Module for Containers 15 SP1:podman-2.0.6-4.25.1",
            "SUSE Linux Enterprise Module for Containers 15 SP1:podman-cni-config-2.0.6-4.25.1",
            "SUSE Linux Enterprise Module for Containers 15 SP2:conmon-2.0.20-3.6.1",
            "SUSE Linux Enterprise Module for Containers 15 SP2:fuse-overlayfs-1.1.2-3.9.1",
            "SUSE Linux Enterprise Module for Containers 15 SP2:podman-2.0.6-4.25.1",
            "SUSE Linux Enterprise Module for Containers 15 SP2:podman-cni-config-2.0.6-4.25.1"
          ]
        }
      ],
      "CVSSScoreSets": {}
    }
  ]
}