{
  "Title": "Security update for strongswan",
  "Tracking": {
    "ID": "SUSE-SU-2020:0743-1",
    "Status": "Final",
    "Version": "1",
    "InitialReleaseDate": "2020-03-23T14:32:34Z",
    "CurrentReleaseDate": "2020-03-23T14:32:34Z",
    "RevisionHistory": [
      {
        "Number": "1",
        "Date": "2020-03-23T14:32:34Z",
        "Description": "current"
      }
    ]
  },
  "Notes": [
    {
      "Text": "Security update for strongswan",
      "Title": "Topic",
      "Type": "Summary"
    },
    {
      "Text": "This update for strongswan fixes the following issues:\n\nStrongswan was updated to version 5.8.2 (jsc#SLE-11370).\n\nSecurity issue fixed:\n\n- CVE-2018-6459: Fixed a DoS vulnerability in the parser for PKCS#1 RSASSA-PSS signatures that was caused by insufficient input validation (bsc#1079548).\n\nFull changelogs:\n\nVersion 5.8.2\n\n  * Identity-based CA constraints, which enforce that the certificate chain of the remote\n    peer contains a CA certificate with a specific identity, are supported via\n    vici/swanctl.conf. This is similar to the existing CA constraints but doesn't require\n    that the CA certificate is locally installed, for instance, intermediate CA certificates\n    received from the peers. Wildcard identity matching (e.g. ..., OU=Research, CN=*) could\n    also be used for the latter but requires trust in the intermediate CAs to only issue\n    certificates with legitimate subject DNs (e.g. the 'Sales' CA must not issue certificates\n    with OU=Research). With the new constraint that's not necessary as long as a path length\n    basic constraint (--pathlen for pki --issue) prevents intermediate CAs from issuing further\n    intermediate CAs.\n  * Intermediate CA certificates may now be sent in hash-and-URL encoding by configuring a\n    base URL for the parent CA (#3234, swanctl/rw-hash-and-url-multi-level).\n  * Implemented NIST SP-800-90A Deterministic Random Bit Generator (DRBG) based on AES-CTR\n    and SHA2-HMAC modes. Currently used by the gmp and ntru plugins.\n  * Random nonces sent in an OCSP requests are now expected in the corresponding OCSP responses.\n  * The kernel-netlink plugin now ignores deprecated IPv6 addresses for MOBIKE. Whether temporary\n    or permanent IPv6 addresses are included now depends on the charon.prefer_temporary_addrs\n    setting (#3192).\n  * Extended Sequence Numbers (ESN) are configured via PF_KEY if supported by the kernel.\n  * The PF_KEY socket's receive buffer in the kernel-pfkey plugin is now cleared before sending\n    requests, as many of the messages sent by the kernel are sent as broadcasts to all PF_KEY\n    sockets. This is an issue if an external tool is used to manage SAs/policies unrelated to\n    IPsec (#3225).\n  * The vici plugin now uses unique section names for CHILD_SAs in child-updown events (7c74ce9190).\n  * For individually deleted CHILD_SAs (in particular for IKEv1) the vici child-updown event\n    now includes more information about the CHILD_SAs such as traffic statistics (#3198).\n  * Custom loggers are correctly re-registered if log levels are changed via stroke loglevel (#3182).\n  * Avoid lockups during startup on low entropy systems when using OpenSSL 1.1.1 (095a2c2eac).\n  * Instead of failing later when setting a key, creating HMACs via openssl plugin now fails\n    instantly if the underlying hash algorithm isn't supported (e.g. MD5 in FIPS-mode) so fallbacks\n    to other plugins work properly (#3284).\n  * Exponents of RSA keys read from TPM 2.0 via SAPI are correctly converted (8ee1242f1438).\n  * Routing table IDs \u003e 255 are supported for custom routes on Linux.\n  * To avoid races, the check for hardware offloading support in the kernel-netlink plugin is\n    performed during initialization of the plugin (a605452c03).\n  * The D-Bus config file for charon-nm is now installed in $(datadir)/dbus-1/system.d instead of\n    $(sysconfdir)/dbus-1/system.d, which is intended for sysadmin overrides.\n    INVALID_MAJOR_VERSION notifies are now correctly sent in messages of the same exchange type\n    and with the same message ID as the request.\n  * IKEv2 SAs are now immediately destroyed when sending or receiving INVALID_SYNTAX notifies\n    in authenticated messages.\n  * For developers working from the repository the configure script now aborts if GNU gperf is\n    not found.\n\nVersion 5.8.1\n\n  * RDNs in DNs of X.509 certificates can now optionally be matched less strict. The global\n    strongswan.conf option charon.rdn_matching takes two alternative values that cause the\n    matching algorithm to either ignore the order of matched RDNs (reordered) or additionally\n    (relaxed) accept DNs that contain more RDNs than configured (unmatched RDNs are treated\n    like wildcard matches).\n  * The updown plugin now passes the same interface to the script that is also used for the\n    automatically installed routes, that is, the interface over which the peer is reached\n    instead of the interface on which the local address is found (#3095).\n  * TPM 2.0 contexts are now protected by a mutex to prevent issues if multiple IKE_SAs use\n    the same private key concurrently (4b25885025).\n  * Do a rekey check after the third QM message was received (#3060).\n  * If available, explicit_bzero() is now used as memwipe() instead of our own implementation.\n  * An .editorconfig file has been added, mainly so Github shows files with proper indentation\n    (68346b6962).\n  * The internal certificate of the load-tester plugin has been modified so it can again be\n    used as end-entity cert with 5.6.3 and later (#3139).\n  * The maximum data length of received COOKIE notifies (64 bytes) is now enforced (#3160).\n\nVersion 5.8.0\n\n  * The systemd service units have been renamed. The modern unit, which was called\n    strongswan-swanctl, is now called strongswan (the previous name is configured as alias in\n    the unit, for which a symlink is created when the unit is enabled). The legacy unit is now\n    called strongswan-starter.\n  * Support for XFRM interfaces (available since Linux 4.19) has been added, which are intended\n    to replace VTI devices (they are similar but offer several advantages, for instance, they\n    are not bound to an address or address family).\n  * IPsec SAs and policies are associated with such interfaces via interface IDs that can be\n    configured in swanctl.conf (dynamic IDs may optionally be allocated for each SA and even\n    direction). It's possible to use separate interfaces for in- and outbound traffic (or\n    only use an interface in one direction and regular policies in the other).\n  * Interfaces may be created dynamically via updown/vici scripts, or statically before or after\n    establishing the SAs. Routes must be added manually as needed (the daemon will not install\n    any routes for outbound policies with an interface ID). \n  * When moving XFRM interfaces to other network namespaces they retain access to the SAs and\n    policies installed in the original namespace, which allows providing IPsec tunnels for\n    processes in other network namespaces without giving them access to the IPsec keys or\n    IKE credentials.\n    More information can be found on the page about route-based VPNs.\n  * Initiation of childless IKE_SAs is supported (RFC 6023). If enabled and supported by the\n    responder, no CHILD_SA is established during IKE_AUTH. Instead, all CHILD_SAs are created\n    with CREATE_CHILD_SA exchanges. This allows using a separate DH exchange even for the\n    first CHILD_SA, which is otherwise created during IKE_AUTH with keys derived from the\n    IKE_SA's key material.\n  * The swanctl --initiate command may be used to initiate only the IKE_SA via --ike\n    option if --child is omitted and the peer supports this extension.\n  * The NetworkManager backend and plugin support IPv6.\n  * The new wolfssl plugin is a wrapper around the wolfSSL crypto library. Thanks to Sean\n    Parkinson of wolfSSL Inc. for the initial patch.\n  * IKE SPIs may optionally be labeled via the charon.spi_mask|label options in\n    strongswan.conf. This feature was extracted from charon-tkm, however, now applies the\n    mask/label in network order.\n  * The openssl plugin supports ChaCha20-Poly1305 when built with OpenSSL 1.1.0.\n  * The PB-TNC finite state machine according to section 3.2 of RFC 5793 was not correctly\n    implemented when sending either a CRETRY or SRETRY batch. These batches can only be sent\n    in the 'Decided' state and a CRETRY batch can immediately carry all messages usually\n    transported by a CDATA batch. It is currently not possible to send a SRETRY batch since\n    full-duplex mode for PT-TLS transport is not supported.\n  * Instead of marking IPv6 virtual IPs as deprecated, the kernel-netlink plugin now uses\n    address labels to avoid that such addresses are used for non-VPN traffic (00a953d090).\n  * The agent plugin now creates sockets to the ssh/gpg-agent dynamically and does not keep\n    them open, which otherwise might prevent the agent from getting terminated.\n  * To avoid broadcast loops the forecast plugin now only reinjects packets that are marked\n    or received from the configured interface.\n  * UTF-8 encoded passwords are supported via EAP-MSCHAPv2, which internally uses an UTF-16LE\n    encoding to calculate the NT hash (#3014).\n  * Properly delete temporary drop policies (used when updating IP addresses of SAs) if manual\n    priorities are used, which was broken since 5.6.2 (8e31d65730).\n  * Avoid overwriting start_action when parsing the inactivity timeout in the vici plugin (#2954).\n  * Fixed the automatic termination of reloaded vici connections with start_action=start,\n    which was broken since 5.6.3 (71b22c250f).\n  * The lookup for shared secrets for IKEv1 SAs via sql plugin should now work better\n    (6ec9f68f32).\n  * Fixed a race condition in the trap manager between installation and removal of a policy\n    (69cbe2ca3f).\n  * The IPsec stack detection and module loading in starter has been removed (it wasn't\n    enforced anyway and loading modules doesn't seem necessary, also KLIPS hasn't been\n    supported for a long time and PF_KEY will eventually be removed from the Linux kernel,\n    ba817d2917).\n  * Several IKEv2 protocol details are now handled more strictly: Unrequested virtual IPs are\n    ignored, CFG_REPLY payloads are ignored if no CFG_REQUEST payloads were sent, a USE\n    TRANSPORT_MODE notify received from the responder is checked against the local configuration.\n  * The keys and certificates used by the scenarios in the testing environment are now generated\n    dynamically. Running the testing/scripts/build-certs script after creating the base and root\n    images uses the pki utility installed in the latter to create the keys and certificates for\n    all the CAs and in some cases for individual scenarios. These credentials are stored in the\n    source tree, not the image, so this has to be called only once even if the images are later\n    rebuilt. The script automatically (re-)rebuilds the guest images as that generates fresh\n    CRLs and signs the DNS zones. The only keys/certificates currently not generated are the\n    very large ones used by the ikev2/rw-eap-tls-fragments scenario. \n\nVersion 5.7.2\n\n  * For RSA with PSS padding, the TPM 2.0 specification mandates the maximum salt length\n    (as defined by the length of the key and hash). However, if the TPM is FIPS-168-4 compliant,\n    the salt length equals the hash length. This is assumed for FIPS-140-2 compliant TPMs, but\n    if that's not the case, it might be necessary to manually enable charon.plugins.tpm.fips_186_4\n    if the TPM doesn't use the maximum salt length.\n  * Directories for credentials loaded by swanctl are now accessed relative to the loaded\n    swanctl.conf file, in particular, when loading it from a custom location via --file argument.\n  * The base directory, which is used if no custom location for swanctl.conf is specified, is now\n    also configurable at runtime via SWANCTL_DIR environment variable.\n  * If RADIUS Accounting is enabled, the eap-radius plugin will add the session ID (Acct-Session-Id)\n    to Access-Request messages, which e.g. simplifies associating database entries for IP leases and\n    accounting with sessions (the session ID does not change when IKE_SAs are rekeyed, #2853).\n  * All IP addresses assigned by a RADIUS server are included in Accounting-Stop messages even if\n    the client did not claim them, allowing to release them early in case of connection errors (#2856).\n  * Selectors installed on transport mode SAs by the kernel-netlink plugin are now updated if an\n    IP address changes (e.g. via MOBIKE) and it was part of the selectors.\n  * No deletes are sent anymore when a rekeyed CHILD_SA expires (#2815).\n  * The bypass-lan plugin now tracks interfaces to handle subnets that move from one interface\n    to another and properly update associated routes (#2820).\n  * Only valid and expected inbound IKEv2 messages are used to update the timestamp of the\n    last received message (previously, retransmits also triggered an update).\n  * IKEv2 requests from responders are now ignored until the IKE_SA is fully established (e.g. if a\n    DPD request from the peer arrives before the IKE_AUTH response does, 46bea1add9).\n    Delayed IKE_SA_INIT responses with COOKIE notifies we already recevied are ignored, they caused\n    another reset of the IKE_SA previously (#2837).\n  * Active and queued Quick Mode tasks are now adopted if the peer reauthenticates an IKEv1 SA\n    while creating lots of CHILD_SAs.\n  * Newer versions of the FreeBSD kernel add an SADB_X_EXT_SA2 extension to SADB_ACQUIRE\n    messages, which allows the kernel-pfkey plugin to determine the reqid of the policy even if it\n    wasn't installed by the daemon previously (e.g. when using FreeBSD's if_ipsec(4) VTIs, which\n    install policies themselves, 872b9b3e8d).\n  * Added support for RSA signatures with SHA-256 and SHA-512 to the agent plugin. For older\n    versions of ssh/gpg-agent that only support SHA-1, IKEv2 signature authentication has to be\n    disabled via charon.signature_authentication.\n  * The sshkey and agent plugins support Ed25519/Ed448 SSH keys and signatures.\n  * The openssl plugin supports X25519/X448 Diffie-Hellman and Ed25519/Ed448 keys and\n    signatures when built against OpenSSL 1.1.1.\n  * Support for Ed25519, ChaCha20/Poly1305, SHA-3 and AES-CCM were added to the botan plugin.\n  * The mysql plugin now properly handles database connections with transactions\n    under heavy load (#2779).\n  * IP addresses in ha pools are now distributed evenly among all segments (#2828).\n  * Private key implementations may optionally provide a list of supported signature schemes,\n    which, as described above, is used by the tpm plugin because for each key on a TPM 2.0 the\n    hash algorithm and for RSA also the padding scheme is predefined.\n  * The testing environment is now based on Debian 9 (stretch) by default. This required\n    some changes, in particular, updating to FreeRADIUS 3.x (which forced us to abandon the\n    TNC@FHH patches and scenarios, 2fbe44bef3) and removing FIPS-enabled versions of\n    OpenSSL (the FIPS module only supports OpenSSL 1.0.2).\n  * Most test scenarios were migrated to swanctl.\n\nVersion 5.7.1\n\n  * Fixes a vulnerability in the gmp plugin triggered by crafted certificates with RSA keys with\n    very small moduli. When verifying signatures with such keys, the code patched with the fix\n    for CVE-2018-16151/2 caused an integer underflow and subsequent heap buffer overflow\n    that results in a crash of the daemon.\n  * The vulnerability has been registered as CVE-2018-17540.\n\nVersion 5.7.0\n\n  * Fixes a potential authorization bypass vulnerability in the gmp plugin that was caused by a\n    too lenient verification of PKCS#1 v1.5 signatures. Several flaws could be exploited by a\n    Bleichenbacher-style attack to forge signatures for low-exponent keys (i.e. with e=3).\n  * CVE-2018-16151 has been assigned to the problem of accepting random bytes after the OID\n    of the hash function in such signatures, and CVE-2018-16152 has been assigned to the issue\n    of not verifying that the parameters in the ASN.1 algorithmIdentitifer structure is empty.\n    Other flaws that don't lead to a vulnerability directly (e.g. not checking for at least\n    8 bytes of padding) have no separate CVE assigned.\n  * Dots are not allowed anymore in section names in swanctl.conf and strongswan.conf.\n    This mainly affects the configuration of file loggers. If the path for such a log file\n    contains dots it now has to be configured in the new path setting within the arbitrarily\n    renamed subsection in the filelog section.\n  * Sections in swanctl.conf and strongswan.conf may now reference other sections. All settings\n    and subsections from such a section are inherited. This allows to simplify configs as\n    redundant information has only to be specified once and may then be included in other\n    sections (see strongswan.conf for an example).\n  * The originally selected IKE config (based on the IPs and IKE version) can now change\n    if no matching algorithm proposal is found. This way the order of the configs doesn't\n    matter that much anymore and it's easily possible to specify separate configs for\n    clients that require weaker algorithms (instead of having to also add them in other\n    configs that might be selected).\n  * Support for Postquantum Preshared Keys for IKEv2 (draft-ietf-ipsecme-qr-ikev2) has been added.\n    For an example refer to the swanctl/rw-cert-ppk scenario (or with EAP, or PSK authentication).\n  * The new botan plugin is a wrapper around the Botan C++ crypto library.\n    It requires a fairly recent build from Botan's master branch (or the upcoming 2.8.0 release).\n    Thanks to René Korthaus and his team from Rohde \u0026 Schwarz Cybersecurity for the initial\n    patch and to Jack Lloyd for quickly adding missing functions to Botan's FFI (C89) interface.\n  * Implementation of RFC 8412 'Software Inventory Message and Attributes (SWIMA) for PA-TNC'.\n  * SWIMA subscription option sets CLOSE_WRITE trigger on apt history.log file resulting in\n    a ClientRetry PB-TNC batch to initialize a new measurement cycle. The new imv/imc-swima\n    plugins replace the previous imv/imc-swid plugins, which were removed.\n  * Added support for fuzzing the PA-TNC (RFC 5792) and PB-TNC (RFC 5793) NEA protocols\n    on Google's OSS-Fuzz infrastructure.\n  * Support for version 2 of Intel's TPM2-TSS TGC Software Stack. The presence of the\n    in-kernel /dev/tpmrm0 resource manager is automatically detected.\n  * The pki tool accepts a xmppAddr otherName as a subjectAlternativeName using the\n    syntax --san xmppaddr:\u003cjid\u003e.\n  * swanctl.conf supports the configuration of marks the in- and/or outbound SA should apply\n    to packets after processing on Linux. Configuring such a mark for outbound SAs requires\n    at least a 4.14 kernel. The ability to set a mask and configuring a mark/mask for\n    inbound SAs will be added with the upcoming 4.19 kernel.\n  * New options in swanctl.conf allow configuring how/whether DF, ECN and DS fields in the\n    IP headers are copied during IPsec processing. Controlling this is currently only possible\n    on Linux.\n  * The handling of sequence numbers in IKEv1 DPDs has been improved (#2714).\n  * To avoid conflicts, the dhcp plugin now only uses the DHCP server port if explicitly\n    configured.\n\nVersion 5.6.3\n\n  * Fixed a DoS vulnerability in the IKEv2 key derivation if the openssl plugin is used in FIPS\n    mode and HMAC-MD5 is negotiated as PRF.\n    This vulnerability has been registered as CVE-2018-10811.\n  * Fixed a vulnerability in the stroke plugin, which did not check the received length before\n    reading a message from the socket. Unless a group is configured, root privileges are\n    required to access that socket, so in the default configuration this shouldn't be an issue.\n    This vulnerability has been registered as CVE-2018-5388.\n  * CRLs that are not yet valid are now ignored to avoid problems in scenarios where expired\n    certificates are removed from new CRLs and the clock on the host doing the revocation\n    check is trailing behind that of the host issuing CRLs. Not doing this could result in\n    accepting a revoked and expired certificate, if it's still valid according to the\n    trailing clock but not contained anymore in not yet valid CRLs.\n  * The issuer of fetched CRLs is now compared to the issuer of the checked certificate (#2608).\n  * CRL validation results other than revocation (e.g. a skipped check because the CRL couldn't\n    be fetched) are now stored also for intermediate CA certificates and not only for end-entity\n    certificates, so a strict CRL policy can be enforced in such cases.\n  * In compliance with RFC 4945, section 5.1.3.2, certificates used for IKE must now either\n    not contain a keyUsage extension (like the ones generated by pki), or have at least one of the\n    digitalSignature or nonRepudiation bits set.\n  * New options for vici/swanctl allow forcing the local termination of an IKE_SA. This might be\n    useful in situations where it's known the other end is not reachable anymore, or that it\n    already removed the IKE_SA, so retransmitting a DELETE and waiting for a response would\n    be pointless.\n  * Waiting only a certain amount of time for a response (i.e. shorter than all retransmits\n    would be) before destroying the IKE_SA is also possible by additionally specifying a\n    timeout in the forced termination request.\n  * When removing routes, the kernel-netlink plugin now checks if it tracks other routes for\n    the same destination and replaces the installed route instead of just removing it. Same\n    during installation, where existing routes previously weren't replaced. This should allow\n    using traps with virtual IPs on Linux (#2162).\n  * The dhcp plugin now only sends the client identifier DHCP option if the identity_lease\n    setting is enabled (7b660944b6). It can also send identities of up to 255 bytes length,\n    instead of the previous 64 bytes (30e886fe3b, 0e5b94d038). If a server address is\n    configured, DHCP requests are now sent from port 67 instead of 68 to avoid ICMP port\n    unreachables (becf027cd9).\n  * The handling of faulty INVALID_KE_PAYLOAD notifies (e.g. one containing a DH group\n    that wasn't proposed) during CREATE_CHILD_SA exchanges has been improved (#2536).\n  * Roam events are now completely ignored for IKEv1 SAs (there is no MOBIKE to handle such\n    changes properly).\n  * ChaCha20/Poly1305 is now correctly proposed without key length (#2614). For compatibility with\n    older releases the chacha20poly1305compat keyword may be included in proposals to also propose\n    the algorithm with a key length (c58434aeff).\n  * Configuration of hardware offload of IPsec SAs is now more flexible and allows a new\n    setting (auto), which automatically uses it if the kernel and device both support it. If hw\n    offload is set to yes and offloading is not supported, the CHILD_SA installation now fails.\n  * The kernel-pfkey plugin optionally installs routes via internal interface (one with an IP\n    in the local traffic selector). On FreeBSD, enabling this selects the correct source IP\n    when sending packets from the gateway itself (e811659323).\n  * SHA-2 based PRFs are supported in PKCS#8 files as generated by OpenSSL 1.1 (#2574).\n  * The pki --verify tool may load CA certificates and CRLs from directories.\n  * The IKE daemon now also switches to port 4500 if the remote port is not 500 (e.g. because the\n    remote maps the response to a different port, as might happen on Azure), as long as the local\n    port is 500 (85bfab621d).\n  * Fixed an issue with DNS servers passed to NetworkManager in charon-nm (ee8c25516a).\n  * Logged traffic selectors now always contain the protocol if either protocol or port are set\n    (a36d8097ed).\n  * Only the inbound SA/policy will be updated as reaction to IP address changes for rekeyed\n    CHILD_SAs that are kept around.\n  * The parser for strongswan.conf/swanctl.conf now accepts = characters in values without\n    having to put the value in quotes (e.g. for Base64 encoded shared secrets).\n\n    Notes for developers:\n    * trap_manager_t: Trap policies are now unistalled by peer/child name and not the reqid.\n    * No reqid is returned anymore when installing trap policies.\n    * child_sa_t: A new state (CHILD_DELETED) is used for CHILD_SAs that have been deleted but\n      not yet destroyed (after a rekeying CHILD_SAs are kept around for a while to process\n      delayed packets).\n      This way child_updown events are not triggered anymore for such SAs when an IKE_SA that\n      has such CHILD_SAs assigned is deleted.\n\nVersion 5.6.2\n\n  * Fixed a DoS vulnerability in the parser for PKCS#1 RSASSA-PSS signatures that was caused\n    by insufficient input validation. One of the configurable parameters in algorithm identifier\n    structures for RSASSA-PSS signatures is the mask generation function (MGF). Only MGF1 is\n    currently specified for this purpose. However, this in turn takes itself a parameter that\n    specifies the underlying hash function. strongSwan's parser did not correctly handle the\n    case of this parameter being absent, causing an undefined data read.\n    This vulnerability has been registered as CVE-2018-6459.\n  * When rekeying IKEv2 IKE_SAs the previously negotiated DH group will be reused, instead of\n    using the first configured group, which avoids an additional exchange if the peer previously\n    selected a different DH group via INVALID_KE_PAYLOAD notify. The same is also done when\n    rekeying CHILD_SAs except for the first rekeying of the CHILD_SA that was created with the\n    IKE_SA, where no DH group was negotiated yet.\n    Also, the selected DH group is moved to the front in all sent proposals that contain it\n    and all proposals that don't are moved to the back in order to convey the preference for\n    this group to the peer.\n  * Handling of MOBIKE task queuing has been improved. In particular, the response to an\n    address update (with NAT-D payloads) is not ignored anymore if only an address list update\n    or DPD is queued as that could prevent updating the UDP encapsulation in the kernel.\n  * On Linux, roam events may optionally be triggered by changes to the routing rules, which\n    can be useful if routing rules (instead of e.g. route metrics) are used to switch from one\n    to another interface (i.e. from one to another routing table). Since routing rules are\n    currently not evaluated when doing route lookups this is only useful if the kernel-based\n    route lookup is used (4664992f7d).\n  * The fallback drop policies installed to avoid traffic leaks when replacing addresses in\n    installed policies are now replaced by temporary drop policies, which also prevent\n    acquires because we currently delete and reinstall IPsec SAs to update their addresses\n    (35ef1b032d).\n  * Access X.509 certificates held in non-volatile storage of a TPM 2.0 referenced via the\n    NV index.\n    Adding the --keyid parameter to pki --print allows to print private keys or certificates\n    stored in a smartcard or a TPM 2.0.\n  * Fixed proposal selection if a peer incorrectly sends DH groups in the ESP proposal during\n    IKE_AUTH and also if a DH group is configured in the local ESP proposal and charon.prefer\n    configured_proposals is disabled (d058fd3c32).\n  * The lookup for PSK secrets for IKEv1 has been improved for certain scenarios (see #2497\n    for details).\n  * MSKs received via RADIUS are now padded to 64 bytes to avoid compatibility issues with\n    EAP-MSCHAPv2 and PRFs that have a block size \u003c 64 bytes (e.g. AES-XCBC-PRF-128, see\n    73cbce6013).\n  * The tpm_extendpcr command line tool extends a digest into a TPM PCR.\n  * Ported the NetworkManager backend from the deprecated libnm-glib to libnm.\n  * The save-keys debugging/development plugin saves IKE and/or ESP keys to files compatible\n    with Wireshark.\n\nVersion 5.6.1\n\n  * Several algorithms were removed from the default ESP/AH and IKE proposals in compliance with\n    RFC 8221 and RFC 8247, respectively. Removed from the default ESP/AH proposal were the\n    3DES and Blowfish encryption algorithms and the HMAC-MD5 integrity algorithm. From the IKE\n    default proposal the HMAC-MD5 integrity algorithm and the MODP-1024 Diffie-Hellman group\n    were removed (the latter is significant for Windows clients in their default configuration).\n    These algorithms may still be used in custom proposals.\n  * Support for RSASSA-PSS signatures has been added. For compatibility with previous\n    releases they are currently not used automatically, by default, to change that charon.rsa_pss\n    may be enabled. To explicitly use or require such signatures during IKEv2 signature\n    authentication (RFC 7427) ike:rsa/pss... authentication constraints may be used for specific\n    connections (regardless of whether the strongswan.conf option above is enabled). Only the\n    hash algorithm can be specified in such constraints, the MGF1 will be based on that hash\n    and the salt length will equal the hash length (when verifying the salt length is not\n    enforced).\n    To enforce such signatures during PKI verification use rsa/pss... authentication constraints.\n  * All pki commands that create certificates/CRLs can be made to sign with RSASSA-PSS instead\n    of the classing PKCS#1 scheme with the --rsa-padding pss option. As with signatures during\n    authentication, only the hash algorithm is configurable (via --digest option), the MGF1 will\n    be based on that and the salt length will equal the hash length.\n  * These signatures are supported by all RSA backends except pkcs11 (i.e. gmp, gcrypt, openssl).\n    The gmp plugin requires the mgf1 plugin.\n    Note that RSASSA-PSS algorithm identifiers and parameters in keys (public keys in\n    certificates or private keys in PKCS#8 files) are currently not used as constraints.\n  * The sec-updater tool checks for security updates in dpkg-based repositories\n    (e.g. Debian/Ubuntu) and sets the security flags in the IMV policy database accordingly.\n    Additionally for each new package version a SWID tag for the given OS and HW architecture\n    is created and stored in the database.\n  * Using the sec-updater.sh script template the lookup can be automated (e.g. via an hourly\n    cron job).\n  * When restarting an IKEv2 negotiation after receiving an INVALID_KE_PAYLOAD notify (or due\n    to other reasons like too many retransmits) a new initiator SPI is allocated. This\n    prevents issues caused by retransmits for IKE_SA_INIT messages.\n  * Because the initiator SPI was previously reused when restarting the connection delayed\n    responses for previous connection attempts were processed and might have caused fatal\n    errors due to a failed DH negotiation or because of the internal retry counter in the\n    ike-init task. For instance, if we proposed a DH group the responder rejected we\n    might have later received delayed responses that either contained INVALID_KE_PAYLOAD\n    notifies with the DH group we already switched to, or, if we retransmitted an\n    IKE_SA_INIT with the requested group but then had to restart again, a KE payload with\n    a group different from the one we proposed.\n  * The introduction of file versions in the IMV database scheme broke file reference hash\n    measurements. This has been fixed by creating generic product versions having an empty\n    package name.\n  * A new timeout option for the systime-fix plugin stops periodic system time checks after\n    a while and enforces a certificate verification, closing or reauthenticating all SAs\n    with invalid certificates.\n  * The IKE event counters, previously only available via ipsec listcounters command, may\n    now also be queried and reset via vici and the new swanctl --counters command. They\n    are collected and provided by the optional counters plugin (enabled by default for\n    backwards compatibility if the stroke plugin is built).\n  * Class attributes received in RADIUS Access-Accept messages may optionally be added to\n    RADIUS accounting messages (655924074b).\n  * Basic support for systemd sockets has been added, which may be used for privilege separation\n    (59db98fb94).\n  * Inbound marks may optionally be installed in the SA again (was removed with 5.5.2) by\n    enabling the mark_in_sa option in swanctl.conf.\n  * The timeout of leases in pools configured via pool utility may be configured in other\n    units than hours.\n    INITIAL_CONTACT notifies are now only omitted if never is configured as uniqueness policy.\n  * Outbound FWD policies for shunts are not installed anymore, by default (as is the case\n    for other policies since 5.5.1).\n  * Don't consider a DH group mismatch during CHILD_SA rekeying as failure as responder\n    (e7276f78aa).\n  * Handling of fragmented IPv4 and IPv6 packets in libipsec has been improved (e138003de9).\n  * Trigger expire events for the correct IPsec SA in libipsec (6e861947a0).\n  * A crash in CRL verification via openssl plugin using OpenSSL 1.1 has been fixed (78acaba6a1).\n  * No hard-coded default proposals are passed from starter to the stroke plugin anymore (the\n    IKE proposal used curve25519 since 5.5.2, which is an optional plugin).\n  * A workaround for an issue with virtual IPs on macOS 10.13 (High Sierra) has been added\n    (039b85dd43).\n  * Handling of IKE_SA rekey collisions in charon-tkm has been fixed.\n  * Instead of failing or just silently doing nothing unit tests may now warn about certain\n    conditions (e.g. if a test was not executed due to external dependencies).\n",
      "Title": "Details",
      "Type": "General"
    },
    {
      "Text": "The CVRF data is provided by SUSE under the Creative Commons License 4.0 with Attribution (CC-BY-4.0).",
      "Title": "Terms of Use",
      "Type": "Legal Disclaimer"
    },
    {
      "Text": "SUSE-2020-743,SUSE-SLE-Module-Basesystem-15-SP1-2020-743,SUSE-SLE-Module-Development-Tools-OBS-15-SP1-2020-743",
      "Title": "Patchnames",
      "Type": "Details"
    }
  ],
  "ProductTree": {
    "Relationships": [
      {
        "ProductReference": "strongswan-5.8.2-4.6.14",
        "RelatesToProductReference": "SUSE Linux Enterprise Module for Basesystem 15 SP1",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "strongswan-doc-5.8.2-4.6.14",
        "RelatesToProductReference": "SUSE Linux Enterprise Module for Basesystem 15 SP1",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "strongswan-hmac-5.8.2-4.6.14",
        "RelatesToProductReference": "SUSE Linux Enterprise Module for Basesystem 15 SP1",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "strongswan-ipsec-5.8.2-4.6.14",
        "RelatesToProductReference": "SUSE Linux Enterprise Module for Basesystem 15 SP1",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "strongswan-libs0-5.8.2-4.6.14",
        "RelatesToProductReference": "SUSE Linux Enterprise Module for Basesystem 15 SP1",
        "RelationType": "Default Component Of"
      }
    ]
  },
  "References": [
    {
      "URL": "https://www.suse.com/support/update/announcement/2020/suse-su-20200743-1/",
      "Description": "Link for SUSE-SU-2020:0743-1"
    },
    {
      "URL": "https://lists.suse.com/pipermail/sle-security-updates/2020-March/006635.html",
      "Description": "E-Mail link for SUSE-SU-2020:0743-1"
    },
    {
      "URL": "https://www.suse.com/support/security/rating/",
      "Description": "SUSE Security Ratings"
    },
    {
      "URL": "https://bugzilla.suse.com/1079548",
      "Description": "SUSE Bug 1079548"
    },
    {
      "URL": "https://www.suse.com/security/cve/CVE-2018-6459/",
      "Description": "SUSE CVE CVE-2018-6459 page"
    }
  ],
  "Vulnerabilities": [
    {
      "CVE": "CVE-2018-6459",
      "Description": "The rsa_pss_params_parse function in libstrongswan/credentials/keys/signature_params.c in strongSwan 5.6.1 allows remote attackers to cause a denial of service via a crafted RSASSA-PSS signature that lacks a mask generation function parameter.",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "moderate"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2018-6459.html",
          "Description": "CVE-2018-6459"
        },
        {
          "URL": "https://bugzilla.suse.com/1079548",
          "Description": "SUSE Bug 1079548"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": [
            "SUSE Linux Enterprise Module for Basesystem 15 SP1:strongswan-5.8.2-4.6.14",
            "SUSE Linux Enterprise Module for Basesystem 15 SP1:strongswan-doc-5.8.2-4.6.14",
            "SUSE Linux Enterprise Module for Basesystem 15 SP1:strongswan-hmac-5.8.2-4.6.14",
            "SUSE Linux Enterprise Module for Basesystem 15 SP1:strongswan-ipsec-5.8.2-4.6.14",
            "SUSE Linux Enterprise Module for Basesystem 15 SP1:strongswan-libs0-5.8.2-4.6.14"
          ]
        }
      ],
      "CVSSScoreSets": {}
    }
  ]
}