{
  "Severity": "HIGH",
  "UpdatedAt": "2025-10-02T21:21:34Z",
  "Package": {
    "Ecosystem": "GO",
    "Name": "github.com/lxc/lxd"
  },
  "Advisory": {
    "DatabaseId": 314949,
    "Id": "GSA_kwCzR0hTQS13MmhnLTJ2NHAtdm1oNs4ABM5F",
    "GhsaId": "GHSA-w2hg-2v4p-vmh6",
    "References": [
      {
        "Url": "https://github.com/canonical/lxd/security/advisories/GHSA-w2hg-2v4p-vmh6"
      },
      {
        "Url": "https://nvd.nist.gov/vuln/detail/CVE-2025-54287"
      },
      {
        "Url": "https://github.com/advisories/GHSA-w2hg-2v4p-vmh6"
      }
    ],
    "Identifiers": [
      {
        "Type": "GHSA",
        "Value": "GHSA-w2hg-2v4p-vmh6"
      },
      {
        "Type": "CVE",
        "Value": "CVE-2025-54287"
      }
    ],
    "Description": "### Impact\nIn LXD's instance snapshot creation functionality, the Pongo2 template engine is used in the `snapshots.pattern` configuration for generating snapshot names. While code execution functionality has not been found in this template engine, it has file reading capabilities, creating a vulnerability that allows arbitrary file reading through template injection attacks.\n\n### Reproduction Steps\n\n1. Log in to LXD-UI with an account that has permissions to modify instance settings\n2. Set the following template injection payload in the instance snapshot pattern:\n\n```\n{% filter urlencode|slice:\":100\" %}{% include \"/etc/passwd\" %}{%endfilter %}\n```\n\nNote that the above template uses the Pongo2 template engine's include tag to read system files. It also uses urlencode and slice filters to bypass character count and type restrictions.\n\n3. Set scheduled snapshots to run every minute and wait for snapshot generation\n4. Wait about a minute and confirm that file contents can be obtained from the created snapshot name\n\n### Risk\nThe attack requires having configuration change permissions for LXD instances.\nThe attack allows reading arbitrary files accessible with LXD process permissions. This could lead to leakage of the following information:\n-​ LXD host configuration files (/etc/passwd, /etc/shadow, etc.)\n-​ LXD database files (containing information about all projects and instances)\n-​ Configuration files and data of other instances\n-​ Sensitive information on the host system\n\n### Countermeasures\nPongo2 provides mechanisms for sandboxing templates.\n\n\u003e Template sandboxing (directory patterns, banned tags/filters)\n( https://github.com/flosch/pongo2/tree/master?tab=readme-ov-file#features )\n\nThis functionality allows banning specific tags and filters by generating a custom TemplateSet.\n\nAt minimum, the following tags are considered to pose a risk of file leakage on the LXD host when used. Therefore, banning these can provide countermeasures against file reading attacks.\n-​ include\n-​ ssi\n-​ extends\n-​ import\n\nThe deny-list approach is prone to vulnerability recurrence due to missed countermeasures or new feature additions. Therefore, as the safest approach, we recommend using an allow-list format to permit only necessary functions.\n\nHowever, as far as our investigation shows, pongo2 does not have functionality to retrieve a list of registered tags or filters, nor does it provide means to implement an allow-list approach. Therefore, it is necessary to either forcibly obtain the registration list through reflection and ban anything not on the allow-list, or ban everything from the current implemented list since the library has not been updated for about two years.\n\nIn LXD's implementation, template injection attacks can be prevented by modifying the `RenderTemplate` function in `shared/util.go` to use a restricted `TemplateSet` as shown above.\n\n### Patches\n\n| LXD Series  | Status |\n| ------------- | ------------- |\n| 6 | Fixed in LXD 6.5  |\n| 5.21 | Fixed in LXD 5.21.4  |\n| 5.0 | Ignored - Not critical  |\n| 4.0  | Ignored - EOL and not critical |\n\n### References\nReported by GMO Flatt Security Inc.",
    "Origin": "UNSPECIFIED",
    "PublishedAt": "2025-10-02T21:21:33Z",
    "Severity": "HIGH",
    "Summary": "Canonical LXD Arbitrary File Read via Template Injection in Snapshot Patterns",
    "UpdatedAt": "2025-10-02T21:21:34Z",
    "WithdrawnAt": "",
    "CVSS": {
      "Score": 6.5,
      "VectorString": "CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:N"
    }
  },
  "Versions": [
    {
      "FirstPatchedVersion": {
        "Identifier": "0.0.0-20250827065555-0494f5d47e41"
      },
      "VulnerableVersionRange": "\u003e= 0.0.0-20200331193331-03aab09f5b5c, \u003c 0.0.0-20250827065555-0494f5d47e41"
    },
    {
      "FirstPatchedVersion": {
        "Identifier": "6.5"
      },
      "VulnerableVersionRange": "\u003e= 6.0, \u003c 6.5"
    },
    {
      "FirstPatchedVersion": {
        "Identifier": "5.21.4"
      },
      "VulnerableVersionRange": "\u003e= 4.0, \u003c 5.21.4"
    }
  ]
}