{
  "Severity": "HIGH",
  "UpdatedAt": "2025-09-15T16:28:26Z",
  "Package": {
    "Ecosystem": "ERLANG",
    "Name": "ash"
  },
  "Advisory": {
    "DatabaseId": 311819,
    "Id": "GSA_kwCzR0hTQS1qajRqLXg1d3ctY3doOc4ABMIL",
    "GhsaId": "GHSA-jj4j-x5ww-cwh9",
    "References": [
      {
        "Url": "https://github.com/ash-project/ash/security/advisories/GHSA-jj4j-x5ww-cwh9"
      },
      {
        "Url": "https://nvd.nist.gov/vuln/detail/CVE-2025-48042"
      },
      {
        "Url": "https://github.com/ash-project/ash/commit/5d1b6a5d00771fd468a509778637527b5218be9a"
      },
      {
        "Url": "https://github.com/advisories/GHSA-jj4j-x5ww-cwh9"
      }
    ],
    "Identifiers": [
      {
        "Type": "GHSA",
        "Value": "GHSA-jj4j-x5ww-cwh9"
      },
      {
        "Type": "CVE",
        "Value": "CVE-2025-48042"
      }
    ],
    "Description": "### Summary\nCertain bulk action calls with a `before_transaction` hook and no `after_transaction` hook, will call the `before_transaction` hook before authorization is checked and a Forbidden error is returned, when called as a bulk action.\n\nThe impact is that a malicious user could cause a `before_transaction` to run even though they are not authorized to perform the whole action. The `before_action` could run a sensitive/expensive operation.\n\n### Impact\nA malicious user could cause a `before_action` to run even though they are not authorized to perform the whole action.\n\nYou are affected if you have an create, update or destroy action that:\n\n- has a before_transaction hook on it, and no after_transaction hook on it.\n- is being used via an `Ash.bulk_*` callback (which AshJsonApi and AshGraphql do for update/destroy actions)\n\nWhether or not or how much it matters depends on the nature of those before_transaction callbacks. If those before_transaction callbacks are side-effectful, or just doing something like looking up some external data. If your API endpoints are behind authentication and what kind. \n\n### Severity\n\nThe severity for this was hard to gauge. `before_transaction` hooks are not that commonly used. Additionally, any attacker must know which of these things are available to them, be authenticated to make such a request (i.e you very rarely have policies preventing the running of anonymous queries), so privileges and inside knowledge are required. Additionally, the action will always return a `forbidden` error, so no information is revealed. We will evaluate and adjust the severity in the next few days as needed.\n\nIt is currently marked as High, given that we really don't know what logic folks are putting in their before_transaction hooks and it could theoretically be very bad.\n\n### Workarounds\n\nYou should update ASAP, but if for whatever reason you cannot update, you can add logic to those before_transaction hooks to prevent them from doing their logic before they should.",
    "Origin": "UNSPECIFIED",
    "PublishedAt": "2025-09-15T16:28:24Z",
    "Severity": "HIGH",
    "Summary": "Before action, Ash's hooks may execute in certain scenarios despite a request being forbidden",
    "UpdatedAt": "2025-09-15T16:28:26Z",
    "WithdrawnAt": "",
    "CVSS": {
      "Score": 5.6,
      "VectorString": "CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:U/C:L/I:L/A:L"
    }
  },
  "Versions": [
    {
      "FirstPatchedVersion": {
        "Identifier": "3.5.39"
      },
      "VulnerableVersionRange": "\u003c= 3.5.38"
    }
  ]
}