{
  "Severity": "MODERATE",
  "UpdatedAt": "2023-05-12T20:18:51Z",
  "Package": {
    "Ecosystem": "MAVEN",
    "Name": "com.clickhouse:clickhouse-jdbc"
  },
  "Advisory": {
    "DatabaseId": 210176,
    "Id": "GSA_kwCzR0hTQS1nOHBoLTc0bTYtOG03cs4AAzUA",
    "GhsaId": "GHSA-g8ph-74m6-8m7r",
    "References": [
      {
        "Url": "https://github.com/ClickHouse/clickhouse-java/security/advisories/GHSA-g8ph-74m6-8m7r"
      },
      {
        "Url": "https://github.com/ClickHouse/clickhouse-java/issues/1331"
      },
      {
        "Url": "https://github.com/ClickHouse/clickhouse-java/pull/1334"
      },
      {
        "Url": "https://github.com/ClickHouse/clickhouse-java/releases/tag/v0.4.6"
      },
      {
        "Url": "https://github.com/advisories/GHSA-g8ph-74m6-8m7r"
      }
    ],
    "Identifiers": [
      {
        "Type": "GHSA",
        "Value": "GHSA-g8ph-74m6-8m7r"
      }
    ],
    "Description": "### Summary\nAs initially reported in issue #1331, when client certificate authentication is enabled with password protection, the password (referred to as the client option `sslkey`) may be exposed in client exceptions (e.g., ClickHouseException or SQLException). This vulnerability can potentially lead to unauthorized access, data breaches, and violations of user privacy.\n\n### Details\nDuring the handling of ClickHouseException, the client certificate password may be inadvertently exposed when sslkey is specified. This issue can arise when an exception is thrown during the execution of a query or a database operation. The client certificate password is then included in the exception message, which could be logged or exposed to unauthorized parties.\n\n### Impact\nThis vulnerability enables an attacker with access to client exception error messages or logs to obtain client certificate passwords, potentially allowing unauthorized access to sensitive information, data manipulation, and denial of service attacks. The extent of the risk depends on the specific implementation and usage of the affected systems. However, any exposure of client certificate passwords should be treated as a high-priority security concern.\n",
    "Origin": "UNSPECIFIED",
    "PublishedAt": "2023-05-12T20:18:51Z",
    "Severity": "MODERATE",
    "Summary": "ClickHouse vulnerable to client certificate password exposure in client exception",
    "UpdatedAt": "2023-05-12T20:18:52Z",
    "WithdrawnAt": "",
    "CVSS": {
      "Score": 4.8,
      "VectorString": "CVSS:3.1/AV:L/AC:L/PR:L/UI:R/S:U/C:L/I:L/A:L"
    }
  },
  "Versions": [
    {
      "FirstPatchedVersion": {
        "Identifier": "0.4.6"
      },
      "VulnerableVersionRange": "\u003c 0.4.6"
    }
  ]
}