{
  "Title": "Security update for apptainer",
  "Tracking": {
    "ID": "openSUSE-SU-2024:0244-1",
    "Status": "Final",
    "Version": "1",
    "InitialReleaseDate": "2024-08-16T04:02:52Z",
    "CurrentReleaseDate": "2024-08-16T04:02:52Z",
    "RevisionHistory": [
      {
        "Number": "1",
        "Date": "2024-08-16T04:02:52Z",
        "Description": "current"
      }
    ]
  },
  "Notes": [
    {
      "Text": "Security update for apptainer",
      "Title": "Topic",
      "Type": "Summary"
    },
    {
      "Text": "This update for apptainer fixes the following issues:\n\n- Make sure, digest values handled by the Go library\n  github.com/opencontainers/go-digest and used throughout the\n  Go-implemented containers ecosystem are always validated. This\n  prevents attackers from triggering unexpected authenticated\n  registry accesses. (CVE-2024-3727, boo#1224114).\n \n\n- Updated apptainer to version 1.3.0\n  * FUSE mounts are now supported in setuid mode, enabling full\n    functionality even when kernel filesystem mounts are insecure due to\n    unprivileged users having write access to raw filesystems in\n    containers. When allow `setuid-mount extfs = no` (the default) in\n    apptainer.conf, then the fuse2fs image driver will be used to mount\n    ext3 images in setuid mode instead of the kernel driver (ext3 images\n    are primarily used for the `--overlay` feature), restoring\n    functionality that was removed by default in Apptainer 1.1.8 because\n    of the security risk.\n    The allow `setuid-mount squashfs` configuration option in\n    `apptainer.conf` now has a new default called `iflimited` which allows\n    kernel squashfs mounts only if there is at least one `limit container`\n    option set or if Execution Control Lists are activated in ecl.toml.\n    If kernel squashfs mounts are are not allowed, then the squashfuse\n    image driver will be used instead.\n    `iflimited` is the default because if one of those limits are used\n    the system administrator ensures that unprivileged users do not have\n    write access to the containers, but on the other hand using FUSE\n    would enable a user to theoretically bypass the limits via `ptrace()`\n    because the FUSE process runs as that user.\n    The `fuse-overlayfs` image driver will also now be tried in setuid\n    mode if the kernel overlayfs driver does not work (for example if\n    one of the layers is a FUSE filesystem).  In addition, if `allow\n    setuid-mount encrypted = no` then the unprivileged gocryptfs format\n    will be used for encrypting SIF files instead of the kernel\n    device-mapper. If a SIF file was encrypted using the gocryptfs\n    format, it can now be mounted in setuid mode in addition to\n    non-setuid mode.\n  * Change the default in user namespace mode to use either kernel\n    overlayfs or fuse-overlayfs instead of the underlay feature for the\n    purpose of adding bind mount points. That was already the default in\n    setuid mode; this change makes it consistent. The underlay feature\n    can still be used with the `--underlay` option, but it is deprecated\n    because the implementation is complicated and measurements have\n    shown that the performance of underlay is similar to overlayfs and\n    fuse-overlayfs.\n    For now the underlay feature can be made the default again with a\n    new `preferred` value on the `enable underlay` configuration option.\n    Also the `--underlay` option can be used in setuid mode or as the\n    root user, although it was ignored previously.\n  * Prefer again to use kernel overlayfs over fuse-overlayfs when a\n    lower layer is FUSE and there's no writable upper layer, undoing the\n    change from 1.2.0. Another workaround was found for the problem that\n    change addressed. This applies in both setuid mode and in user\n    namespace mode.\n  * `--cwd` is now the preferred form of the flag for setting the\n    container's working directory, though `--pwd` is still supported for\n    compatibility.\n  * The way `--home` is handled when running as root (e.g. sudo apptainer)\n    or with `--fakeroot` has changed. Previously, we were only modifying\n    the `HOME` environment variable in these cases, while leaving the\n    container's `/etc/passwd` file unchanged (with its homedir field\n    pointing to `/root`, regardless of the value passed to `--home`). With\n    this change, both value of HOME and the contents of `/etc/passwd` in\n    the container will reflect the value passed to `--home` if the\n    container is readonly. If the container is writable, the\n    `/etc/passwd` file is left alone because it can interfere with\n    commands that want to modify it.\n  * The `--vm` and related flags to start apptainer inside a VM have been\n    removed. This functionality was related to the retired Singularity Desktop\n    / SyOS projects.\n  * The keyserver-related commands that were under `remote` have been moved to\n    their own, dedicated `keyserver` command. Run `apptainer help keyserver`\n    for more information.\n  * The commands related to OCI/Docker registries that were under `remote` have\n    been moved to their own, dedicated `registry` command. Run\n    `apptainer help registry` for more information.\n  * The the `remote list` subcommand now outputs only remote endpoints (with\n    keyservers and OCI/Docker registries having been moved to separate\n    commands), and the output has been streamlined.\n  * Adding a new remote endpoint using the `apptainer remote add` command will\n    now set the new endpoint as default. This behavior can be suppressed by\n    supplying the `--no-default` (or `-n`) flag to `remote add`.\n  * Skip parsing build definition file template variables after comments\n    beginning with a hash symbol.\n  * The global `/tmp` directory is no longer used for gocryptfs mountpoints.\n- New Features \u0026 Functionality\n  * The `remote status` command will now print the username, realname, and\n    email of the logged-in user, if available.\n  * Add monitoring feature support, which requires the usage of an\n    additional tool named `apptheus`, this tool will put apptainer starter\n    into a newly created cgroup and collect system metrics.\n  * A new `--no-pid` flag for `apptainer run/shell/exec` disables the PID\n    namespace inferred by `--containall` and `--compat`.\n  * Added `--config` option to `keyserver` commands.\n  * Honor an optional remoteName argument to the `keyserver list` command.\n  * Added the `APPTAINER_ENCRYPTION_PEM_DATA` env var to allow for\n    encrypting and running encrypted containers without a PEM file.\n  * Adding `--sharens` mode for `apptainer exec/run/shell`, which enables to\n    run multiple apptainer instances created by the same parent using\n    the same image in the same user namespace.\n- Make 'gocryptfs' an optional dependency.\n- Make apptainer definition templates version dependent.\n\n- Fix 'apptainer build' using signed packages from the SUSE\n  Registry (boo#1221364).\n\n- Updated apptainer to version 1.2.5\n  * Added `libnvidia-nvvm` to `nvliblist.conf`. Newer NVIDIA\n    Drivers (known with \u003e= 525.85.05) require this lib to compile\n    OpenCL programs against NVIDIA GPUs, i.e. `libnvidia-opencl`\n    depends on `libnvidia-nvvm`.\n  * Disable the usage of cgroup in instance creation when\n    `--fakeroot` is passed.\n  * Disable the usage of cgroup in instance creation when `hidepid`\n    mount option on `/proc` is set.\n  * Fixed a regression introduced in 1.2.0 where the user's\n    password file information was not copied in to the container\n    when there was a parent root-mapped user namespace (as is the\n    case for example in `cvmfsexec`).\n  * Added the upcoming NVIDIA driver library `libnvidia-gpucomp.so`\n    to the list of libraries to add to NVIDIA GPU-enabled\n    containers. Fixed missing error handling during the creation\n    of an encrypted image that lead to the generation of corrupted\n    images.\n  * Use `APPTAINER_TMPDIR` for temporary files during privileged\n    image encryption.\n  * If rootless unified cgroups v2 is available when starting an\n    image but `XDG_RUNTIME_DIR` or `DBUS_SESSION_BUS_ADDRESS` is\n    not set, print an info message that stats will not be available\n    instead of exiting with a fatal error.\n  * Allow templated build arguments to definition files to have\n    empty values.\n- Package .def templates separately for different SPs.\n\n- Do not build squashfuse, require it as a dependency.\n- Replace awkward 'Obsoletes: singularity-*' as well as the\n  'Provides: Singularity' by 'Conflicts:' and drop the provides -\n  the versioning scheme does not match and we do not automatically\n  migrate from one to the other.\n- Exclude platforms which do not provide all build dependencies.\n\n- updated to 1.2.3 with following changes:\n  * The apptainer push/pull commands now show a progress bar for the oras\n    protocol like there was for docker and library protocols.\n  * The --nv and --rocm flags can now be used simultaneously.\n  * Fix the use of APPTAINER_CONFIGDIR with apptainer instance start and action\n    commands that refer to instance://.\n  * Fix the issue that apptainer would not read credentials from the Docker\n    fallback path ~/.docker/config.json if missing in the apptainer\n    credentials.\n\n- updated to 1.2.2 with following changes:\n  * Fix $APPTAINER_MESSAGELEVEL to correctly set the logging level.\n  * Fix build failures when in setuid mode and unprivileged user namespaces are\n    unavailable and the --fakeroot option is not selected.\n\n- updated to 1.2.1 to fix CVE-2023-38496 although not relevant as package is \n  compiled with setuid\n\n- update to 1.2.0 with following changes:\n  * binary is built reproducible which disables plugins\n  * Create the current working directory in a container when it doesn't exist.\n    This restores behavior as it was before singularity 3.6.0. As a result,\n    using --no-mount home won't have any effect when running apptainer from a\n    home directory and will require --no-mount home,cwd to avoid mounting that\n    directory.\n  * Handle current working directory paths containing symlinks both on the host\n    and in a container but pointing to different destinations. If detected, the\n    current working directory is not mounted when the destination directory in\n    the container exists.\n  * Destination mount points are now sorted by shortest path first to ensure\n    that a user bind doesn't override a previous bind path when set in\n    arbitrary order on the CLI. This is also applied to image binds.\n  * When the kernel supports unprivileged overlay mounts in a user namespace,\n    the container will be constructed by default using an overlay instead of an\n    underlay layout for bind mounts. A new --underlay action option can be used\n    to prefer underlay instead of overlay.\n  * sessiondir maxsize in apptainer.conf now defaults to 64 MiB for new\n    installations. This is an increase from 16 MiB in prior versions.\n  * The apptainer cache is now architecture aware, so the same home directory\n    cache can be shared by machines with different architectures.\n  * Overlay is blocked on the panfs filesystem, allowing sandbox directories to\n    be run from panfs without error.\n  * Lookup and store user/group information in stage one prior to entering any\n    namespaces, to fix an issue with winbind not correctly looking up\n    user/group information when using user namespaces.\n- New features / functionalities\n  * Support for unprivileged encryption of SIF files using gocryptfs.  This is\n    not compatible with privileged encryption, so containers encrypted by root\n    need to be rebuilt by an unprivileged user.\n  * Templating support for definition files. Users can now define variables in\n    definition files via a matching pair of double curly brackets. Variables of\n    the form {{ variable }} will be replaced by a value defined either by a\n    variable=value entry in the %arguments section of the definition file or\n    through new build options --build-arg or --build-arg-file.\n  * Add a new instance run command that will execute the runscript when an\n    instance is initiated instead of executing the startscript.\n  * The sign and verify commands now support signing and verification with\n    non-PGP key material by specifying the path to a private key via the --key\n    flag.\n  * The verify command now supports verification with X.509 certificates by\n    specifying the path to a certificate via the --certificate flag. By\n    default, the system root certificate pool is used as trust anchors unless\n    overridden via the --certificate-roots flag. A pool of intermediate\n    certificates that are not trust anchors, but can be used to form a\n    certificate chain, can also be specified via the\n    --certificate-intermediates flag.\n  * Support for online verification checks of X.509 certificates using OCSP\n    protocol via the new verify --ocsp-verify option.\n  * The instance stats command displays the resource usage every second. The\n    --no-stream option disables this interactive mode and shows the\n    point-in-time usage.\n  * Instances are now started in a cgroup by default, when run as root or when\n    unified cgroups v2 with systemd as manager is configured. This allows\n    apptainer instance stats to be supported by default when possible.\n  * The instance start command now accepts an optional --app \u003cname\u003e argument\n    which invokes a start script within the %appstart \u003cname\u003e section in the\n    definition file. The instance stop command still only requires the instance\n    name.\n  * The instance name is now available inside an instance via the new\n    APPTAINER_INSTANCE environment variable.\n  * The --no-mount flag now accepts the value bind-paths to disable mounting of\n    all bind path entries in apptainer.conf.\n    Support for DOCKER_HOST parsing when using docker-daemon://\n    DOCKER_USERNAME and DOCKER_PASSWORD supported without APPTAINER_ prefix.\n    Add new Linux capabilities CAP_PERFMON, CAP_BPF, and CAP_CHECKPOINT_RESTORE.\n  * The remote get-login-password command allows users to retrieve a remote's\n    token. This enables piping the secret directly into docker login while\n    preventing it from showing up in a shell's history.\n  * Define EUID in %environment alongside UID.\n  * In --rocm mode, the whole of /dev/dri is now bound into the container when\n    --contain is in use. This makes /dev/dri/render devices available, required\n    for later ROCm versions.\n\n- update to 1.1.9 with following changes:\n  * Remove warning about unknown xino=on option from fuse-overlayfs, introduced\n    in 1.1.8.\n  * Ignore extraneous warning from fuse-overlayfs about a readonly /proc.\n  * Fix dropped 'n' characters on some platforms in definition file stored as\n    part of SIF metadata.\n  * Remove duplicated group ids.\n  * Fix not being able to handle multiple entries in LD_PRELOAD when binding\n    fakeroot into container during apptainer startup for --fakeroot with\n    fakeroot command.\n\n- Included a fix for CVE-2023-30549 which is a vulnerability in setuid-root\n  installations of Apptainer iwhich was not active in the recent openSUSE\n  packages. Still this is included for completenss. The fix adds allow\n  setuid-mount configuration options encrypted, squashfs, and extfs, and makes\n  the default for extfs be 'no'. That disables the use of extfs mounts\n  including for overlays or binds while in the setuid-root mode, while leaving\n  it enabled for unprivileged user namespace mode. The default for encrypted\n  and squashfs is 'yes'.\n- Other bug fixes:\n  * Fix loop device 'no such device or address' spurious errors when using shared\n    loop devices.\n  * Add xino=on mount option for writable kernel overlay mount points to fix\n    inode numbers consistency after kernel cache flush (not applicable to\n    fuse-overlayfs).\n \n\n- updated to 1.1.7 with following changes:\n  * Allow gpu options such as --nv to be nested by always inheriting all\n    libraries bound in to a parent container's /.singularity.d/libs.\n  * Map the user's home directory to the root home directory by default in the\n    non-subuid fakeroot mode like it was in the subuid fakeroot mode, for both\n    action commands and building containers from definition files.\n  * Make the error message more helpful in another place where a remote is\n    found to have no library client.\n  * Avoid incorrect error when requesting fakeroot network.\n  * Pass computed LD_LIBRARY_PATH to wrapped unsquashfs. Fixes issues where\n    unsquashfs on host uses libraries in non-default paths.\n",
      "Title": "Details",
      "Type": "General"
    },
    {
      "Text": "The CVRF data is provided by SUSE under the Creative Commons License 4.0 with Attribution (CC-BY-4.0).",
      "Title": "Terms of Use",
      "Type": "Legal Disclaimer"
    },
    {
      "Text": "openSUSE-2024-244",
      "Title": "Patchnames",
      "Type": "Details"
    }
  ],
  "ProductTree": {
    "Relationships": [
      {
        "ProductReference": "apptainer-1.3.0-bp155.3.3.2",
        "RelatesToProductReference": "SUSE Package Hub 15 SP5",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "apptainer-leap-1.3.0-bp155.3.3.2",
        "RelatesToProductReference": "SUSE Package Hub 15 SP5",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "apptainer-sle15_5-1.3.0-bp155.3.3.2",
        "RelatesToProductReference": "SUSE Package Hub 15 SP5",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "apptainer-sle15_6-1.3.0-bp155.3.3.2",
        "RelatesToProductReference": "SUSE Package Hub 15 SP5",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "libsquashfuse0-0.5.0-bp155.2.1",
        "RelatesToProductReference": "SUSE Package Hub 15 SP5",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "squashfuse-0.5.0-bp155.2.1",
        "RelatesToProductReference": "SUSE Package Hub 15 SP5",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "squashfuse-devel-0.5.0-bp155.2.1",
        "RelatesToProductReference": "SUSE Package Hub 15 SP5",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "squashfuse-tools-0.5.0-bp155.2.1",
        "RelatesToProductReference": "SUSE Package Hub 15 SP5",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "apptainer-1.3.0-bp155.3.3.2",
        "RelatesToProductReference": "openSUSE Leap 15.5",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "apptainer-leap-1.3.0-bp155.3.3.2",
        "RelatesToProductReference": "openSUSE Leap 15.5",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "apptainer-sle15_5-1.3.0-bp155.3.3.2",
        "RelatesToProductReference": "openSUSE Leap 15.5",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "apptainer-sle15_6-1.3.0-bp155.3.3.2",
        "RelatesToProductReference": "openSUSE Leap 15.5",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "libsquashfuse0-0.5.0-bp155.2.1",
        "RelatesToProductReference": "openSUSE Leap 15.5",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "squashfuse-0.5.0-bp155.2.1",
        "RelatesToProductReference": "openSUSE Leap 15.5",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "squashfuse-devel-0.5.0-bp155.2.1",
        "RelatesToProductReference": "openSUSE Leap 15.5",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "squashfuse-tools-0.5.0-bp155.2.1",
        "RelatesToProductReference": "openSUSE Leap 15.5",
        "RelationType": "Default Component Of"
      }
    ]
  },
  "References": [
    {
      "URL": "https://lists.opensuse.org/archives/list/security-announce@lists.opensuse.org/thread/3BEJQC6TDQZLJ4YE746IHLCFJFUQ2JKQ/",
      "Description": "E-Mail link for openSUSE-SU-2024:0244-1"
    },
    {
      "URL": "https://www.suse.com/support/security/rating/",
      "Description": "SUSE Security Ratings"
    },
    {
      "URL": "https://bugzilla.suse.com/1221364",
      "Description": "SUSE Bug 1221364"
    },
    {
      "URL": "https://bugzilla.suse.com/1224114",
      "Description": "SUSE Bug 1224114"
    },
    {
      "URL": "https://www.suse.com/security/cve/CVE-2023-30549/",
      "Description": "SUSE CVE CVE-2023-30549 page"
    },
    {
      "URL": "https://www.suse.com/security/cve/CVE-2023-38496/",
      "Description": "SUSE CVE CVE-2023-38496 page"
    },
    {
      "URL": "https://www.suse.com/security/cve/CVE-2024-3727/",
      "Description": "SUSE CVE CVE-2024-3727 page"
    }
  ],
  "Vulnerabilities": [
    {
      "CVE": "CVE-2023-30549",
      "Description": "Apptainer is an open source container platform for Linux. There is an ext4 use-after-free flaw that is exploitable through versions of Apptainer \u003c 1.1.0 and installations that include apptainer-suid \u003c 1.1.8 on older operating systems where that CVE has not been patched. That includes Red Hat Enterprise Linux 7, Debian 10 buster (unless the linux-5.10 package is installed), Ubuntu 18.04 bionic and Ubuntu 20.04 focal. Use-after-free flaws in the kernel can be used to attack the kernel for denial of service and potentially for privilege escalation.\n\nApptainer 1.1.8 includes a patch that by default disables mounting of extfs filesystem types in setuid-root mode, while continuing to allow mounting of extfs filesystems in non-setuid \"rootless\" mode using fuse2fs.\n\nSome workarounds are possible. Either do not install apptainer-suid (for versions 1.1.0 through 1.1.7) or set `allow setuid = no` in apptainer.conf.  This requires having unprivileged user namespaces enabled and except for apptainer 1.1.x versions will disallow mounting of sif files, extfs files, and squashfs files in addition to other, less significant impacts.  (Encrypted sif files are also not supported unprivileged in apptainer 1.1.x.). Alternatively, use the `limit containers` options in apptainer.conf/singularity.conf to limit sif files to trusted users, groups, and/or paths, and set `allow container extfs = no` to disallow mounting of extfs overlay files.  The latter option by itself does not disallow mounting of extfs overlay partitions inside SIF files, so that's why the former options are also needed.",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "important"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2023-30549.html",
          "Description": "CVE-2023-30549"
        },
        {
          "URL": "https://bugzilla.suse.com/1210859",
          "Description": "SUSE Bug 1210859"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": [
            "SUSE Package Hub 15 SP5:apptainer-1.3.0-bp155.3.3.2",
            "SUSE Package Hub 15 SP5:apptainer-leap-1.3.0-bp155.3.3.2",
            "SUSE Package Hub 15 SP5:apptainer-sle15_5-1.3.0-bp155.3.3.2",
            "SUSE Package Hub 15 SP5:apptainer-sle15_6-1.3.0-bp155.3.3.2",
            "SUSE Package Hub 15 SP5:libsquashfuse0-0.5.0-bp155.2.1",
            "SUSE Package Hub 15 SP5:squashfuse-0.5.0-bp155.2.1",
            "SUSE Package Hub 15 SP5:squashfuse-devel-0.5.0-bp155.2.1",
            "SUSE Package Hub 15 SP5:squashfuse-tools-0.5.0-bp155.2.1",
            "openSUSE Leap 15.5:apptainer-1.3.0-bp155.3.3.2",
            "openSUSE Leap 15.5:apptainer-leap-1.3.0-bp155.3.3.2",
            "openSUSE Leap 15.5:apptainer-sle15_5-1.3.0-bp155.3.3.2",
            "openSUSE Leap 15.5:apptainer-sle15_6-1.3.0-bp155.3.3.2",
            "openSUSE Leap 15.5:libsquashfuse0-0.5.0-bp155.2.1",
            "openSUSE Leap 15.5:squashfuse-0.5.0-bp155.2.1",
            "openSUSE Leap 15.5:squashfuse-devel-0.5.0-bp155.2.1",
            "openSUSE Leap 15.5:squashfuse-tools-0.5.0-bp155.2.1"
          ]
        }
      ],
      "CVSSScoreSets": {}
    },
    {
      "CVE": "CVE-2023-38496",
      "Description": "Apptainer is an open source container platform. Version 1.2.0-rc.2 introduced an ineffective privilege drop when requesting container network setup, therefore subsequent functions are called with root privileges, the attack surface is rather limited for users but an attacker could possibly craft a starter config to delete any directory on the host filesystems. A security fix has been included in Apptainer 1.2.1. There is no known workaround outside of upgrading to Apptainer 1.2.1.",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "important"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2023-38496.html",
          "Description": "CVE-2023-38496"
        },
        {
          "URL": "https://bugzilla.suse.com/1213659",
          "Description": "SUSE Bug 1213659"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": [
            "SUSE Package Hub 15 SP5:apptainer-1.3.0-bp155.3.3.2",
            "SUSE Package Hub 15 SP5:apptainer-leap-1.3.0-bp155.3.3.2",
            "SUSE Package Hub 15 SP5:apptainer-sle15_5-1.3.0-bp155.3.3.2",
            "SUSE Package Hub 15 SP5:apptainer-sle15_6-1.3.0-bp155.3.3.2",
            "SUSE Package Hub 15 SP5:libsquashfuse0-0.5.0-bp155.2.1",
            "SUSE Package Hub 15 SP5:squashfuse-0.5.0-bp155.2.1",
            "SUSE Package Hub 15 SP5:squashfuse-devel-0.5.0-bp155.2.1",
            "SUSE Package Hub 15 SP5:squashfuse-tools-0.5.0-bp155.2.1",
            "openSUSE Leap 15.5:apptainer-1.3.0-bp155.3.3.2",
            "openSUSE Leap 15.5:apptainer-leap-1.3.0-bp155.3.3.2",
            "openSUSE Leap 15.5:apptainer-sle15_5-1.3.0-bp155.3.3.2",
            "openSUSE Leap 15.5:apptainer-sle15_6-1.3.0-bp155.3.3.2",
            "openSUSE Leap 15.5:libsquashfuse0-0.5.0-bp155.2.1",
            "openSUSE Leap 15.5:squashfuse-0.5.0-bp155.2.1",
            "openSUSE Leap 15.5:squashfuse-devel-0.5.0-bp155.2.1",
            "openSUSE Leap 15.5:squashfuse-tools-0.5.0-bp155.2.1"
          ]
        }
      ],
      "CVSSScoreSets": {}
    },
    {
      "CVE": "CVE-2024-3727",
      "Description": "A flaw was found in the github.com/containers/image library. This flaw allows attackers to trigger unexpected authenticated registry accesses on behalf of a victim user, causing resource exhaustion, local path traversal, and other attacks.",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "important"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2024-3727.html",
          "Description": "CVE-2024-3727"
        },
        {
          "URL": "https://bugzilla.suse.com/1224112",
          "Description": "SUSE Bug 1224112"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": [
            "SUSE Package Hub 15 SP5:apptainer-1.3.0-bp155.3.3.2",
            "SUSE Package Hub 15 SP5:apptainer-leap-1.3.0-bp155.3.3.2",
            "SUSE Package Hub 15 SP5:apptainer-sle15_5-1.3.0-bp155.3.3.2",
            "SUSE Package Hub 15 SP5:apptainer-sle15_6-1.3.0-bp155.3.3.2",
            "SUSE Package Hub 15 SP5:libsquashfuse0-0.5.0-bp155.2.1",
            "SUSE Package Hub 15 SP5:squashfuse-0.5.0-bp155.2.1",
            "SUSE Package Hub 15 SP5:squashfuse-devel-0.5.0-bp155.2.1",
            "SUSE Package Hub 15 SP5:squashfuse-tools-0.5.0-bp155.2.1",
            "openSUSE Leap 15.5:apptainer-1.3.0-bp155.3.3.2",
            "openSUSE Leap 15.5:apptainer-leap-1.3.0-bp155.3.3.2",
            "openSUSE Leap 15.5:apptainer-sle15_5-1.3.0-bp155.3.3.2",
            "openSUSE Leap 15.5:apptainer-sle15_6-1.3.0-bp155.3.3.2",
            "openSUSE Leap 15.5:libsquashfuse0-0.5.0-bp155.2.1",
            "openSUSE Leap 15.5:squashfuse-0.5.0-bp155.2.1",
            "openSUSE Leap 15.5:squashfuse-devel-0.5.0-bp155.2.1",
            "openSUSE Leap 15.5:squashfuse-tools-0.5.0-bp155.2.1"
          ]
        }
      ],
      "CVSSScoreSets": {}
    }
  ]
}