{
  "Title": "Security update for cf-cli",
  "Tracking": {
    "ID": "SUSE-SU-2019:1220-1",
    "Status": "Final",
    "Version": "1",
    "InitialReleaseDate": "2019-05-13T11:27:58Z",
    "CurrentReleaseDate": "2019-05-13T11:27:58Z",
    "RevisionHistory": [
      {
        "Number": "1",
        "Date": "2019-05-13T11:27:58Z",
        "Description": "current"
      }
    ]
  },
  "Notes": [
    {
      "Text": "Security update for cf-cli",
      "Title": "Topic",
      "Type": "Summary"
    },
    {
      "Text": "This update for cf-cli fixes the following issues:\n\ncf-cli was updated: to version 6.43.0 (bsc#1132242)\n\nEnhancements :\n\n- `cf curl` supports a new `--fail` flag (primarily for scripting purposes) which returns exit code `22` for server errors [story](https://www.pivotaltracker.com/story/show/130060949)\n- Improves `cf delete-orphaned-routes` such that it uses a different endpoint, reducing the chance of a race condition when two users are simultaneously deleting orphaned routes and associating routes with applications [story](https://www.pivotaltracker.com/story/show/163156064)\n- we've improved the speed of cf services - it now hits a single endpoint instead of making individual API calls\n\nSecurity:\n\n- CVE-2019-3781: CF CLI does not sanitize user’s password in verbose/trace/debug.\n- Fixes issue with running cf login in verbose mode whereby passwords which contains regex were not completely redacted\n- Fixes issue whilst running commands in verbose mode refresh tokens were not completely redacted\n\nOther Bug Fixes:\n\n- Updates help text for cf curlstory\n- Now refresh tokens work properly whilst using cf curl with V3 CC API endpoints story\n- Fixes performance degradation for cf services story\n- cf delete-service requires that you are targeting a space story\n- cf enable-service access for a service in an org will succeed if you have already enabled access for that service in that org story\n\ncf-cli was updated to version 6.42.0:\n\nMinor Enhancements:\n\n- updated `cf restage` help text and the first line in the command's output to indicate that using this command will cause app downtime [story](https://www.pivotaltracker.com/story/show/151841382)\n- updated the `cf bind-route-service` help text to clarify usage instructions [story](https://www.pivotaltracker.com/story/show/150111078)\n- improved an error message for `cf create-service-boker` to be more helpful when the CC API returns a `502` due to an invalid service broker catalog \n- upgraded to Golang 1.11.4 [story](https://www.pivotaltracker.com/story/show/162745359)\n- added a short name `ue` for `cf unset-env` [story](https://www.pivotaltracker.com/story/show/161632713)\n- updated `cf marketplace` command to include a new `broker` column to prepare for a upcoming services-related feature which will allow services to have the same name as long as they are associated with different service brokers [story](https://www.pivotaltracker.com/story/show/162699756)\n\nBugs:\n\n- fix for `cf enable-service-access -p plan` whereby when we refactored the code in CLI `v6.41.0` it created service plan visibilities as part of a subsequent run of the command (the unrefactored code skipped creating the service plan visibilities); now the command will skip creating service plan visibilities as it did prior to the refactor [story](https://www.pivotaltracker.com/story/show/162747373)\n- updated the `cf rename-buildpack` help text which was missing reference to the `-s` stack flag [story](https://www.pivotaltracker.com/story/show/162428661)\n- updated help text for when users use `brew search cloudfoundry-cli` [story](https://www.pivotaltracker.com/story/show/161770940)\n- now when you run `cf service service-instance` for a route service, the route service url appears in the key value table [story](https://www.pivotaltracker.com/story/show/162498211)\n\nUpdate to version 6.41.0:\n\nEnhancements:\n\n- updated `cf --help` to include the `delete` command [story](https://www.pivotaltracker.com/story/show/161556511)\n\nUpdate to version 6.40.1:\n\nBug Fixes:\n\n- Updates the minimum version for the buildpacks-stacks association feature. In [CLI v6.39.0](https://github.com/cloudfoundry/cli/releases/tag/v6.39.0), when the feature was released, we incorrectly set the minimum to cc api version as`2.114`. The minimum cc api version is now correctly set to [`2.112`](https://github.com/cloudfoundry/capi-release/releases/tag/1.58.0).  [story](https://www.pivotaltracker.com/story/show/161464797)\n- Fixes a bug with inspecting a service instance `cf service service-instance`, now the `documentation` url displays correctly for services which populate that field [story](https://www.pivotaltracker.com/story/show/161251875)\n\nUpdate to version 6.40.0:\n\nBug Fixes:\n\n- Fix bug where trailing slash on cf api would break listing commands for older CC APIs story. For older versions of CC API, if the API URL had a trailing slash, some requests would fail with an 'Unknown request' error. These requests are now handled properly.\n\nUpdate to version 6.39.0:\n\nEnhancements:\n\n- for users on cc api 3.27, cf start is enhanced to display the new cf app v3 output. For users on cc api 3.27 or lower, users will see the same v2 output. Note that if you use v3 commands to create and start your app, if you subsequently use cf stop and cf start, the routes property in cf app will not populate even though the route exists story\n- for users on cc api 3.27, cf restart is enhanced to display the new cf app v3 output. For users on cc api 3.27 or lower, users will see the same v2 output. story\n- for users on cc api 3.27, cf restage is enhanced to display the new cf app v3 output. For users on cc api 3.27 or lower, users will see the same v2 output. story\n- improved help text for -d domains for cf push to include examples of usage story\n- cf v3-scale displays additional app information story\n- if you've created an internal domain, and it is the first domain in cc, the CLI will now ignore the internal domain and instead choose the next non-internal domain when you push an app story\n\nBug Fixes:\n\n- Fix for users on macOS attempting to brew install cf-cli the CF CLI using the unreleased master branch of Homebrew story\n- Fixes an issue whereby, due to a recent cc api change, when you execute cf push and watch the cf app command, the app display returned a 400 error story\n- Fixes a bug whereby if you logged in using client credentials, cf auth user pass --client credentials you were unable to create an org; now create-org will assign the role to the user id specified in your manifest story\n- fixes an issue introduced when we refactored cf start and as part of that work, we stopped blocking on the initial connection with the logging backend; now the CLI blocks until the NOAA connection is made, or the default dial timeout of five seconds is reached story\n\nupdate to version 6.38.0:\n\nEnhancements:\n\n- v3-ssh process type now defaults to web story\n- Support added for setting tags for user provided service instances story\n- Now a warning appears if you attempt to use deprecated properties and variable substitution story\n- Updated usage so now you can rename the cf binary use it with every command story\n- cf events now displays the Diego cell_id and instance guid in crash events story\n- Includes cf service service-instance table display improvements wherein the service instance information is now grouped separately from the binding information story\n- cf service service-instance table display information for user provided services changed: status has been added to the table story\n\nBug Fixes:\n\n- the CLI now properly handles escaped commas in the X-Cf-Warnings header\n\nUpdate to version 6.37.0:\n\nEnhancements\n\n- The api/cloudcontroller/ccv2 package has been updated with more functions #1343\n- Now a warning appears if you are using a API version older than 2.69.0, which is no longer officially supported\n- Now the CLI reads the username and password from the environment variables #1358\n\nBug Fixes:\n\n- Fixes bug whereby X-Cf-Warnings were not being unescaped when displayed to user #1361\n- When using CF_TRACE=1, passwords are now sanitized #1375 and tracker\n\nUpdate to version 6.36.0:\n\nBug Fixes:\n\n- int64 support for cf/flags library, #1333\n- Debian package, #1336\n- Web action flag not working on CLI 0.6.5, #1337\n- When a cf push upload fails/Consul is down, a panic occurs, #1340 and #1351\n\nupdate to version 6.35.2:\n\nBug Fixes:\n\n- Providing a clearer services authorization warning message when a service has been disabled for the organization, fixing #1344\n\n",
      "Title": "Details",
      "Type": "General"
    },
    {
      "Text": "The CVRF data is provided by SUSE under the Creative Commons License 4.0 with Attribution (CC-BY-4.0).",
      "Title": "Terms of Use",
      "Type": "Legal Disclaimer"
    },
    {
      "Text": "SUSE-2019-1220,SUSE-SLE-Module-CAP-Tools-15-2019-1220",
      "Title": "Patchnames",
      "Type": "Details"
    }
  ],
  "ProductTree": {
    "Relationships": [
      {
        "ProductReference": "cf-cli-6.43.0-3.3.2",
        "RelatesToProductReference": "SUSE Linux Enterprise Module for CAP 15",
        "RelationType": "Default Component Of"
      }
    ]
  },
  "References": [
    {
      "URL": "https://www.suse.com/support/update/announcement/2019/suse-su-20191220-1/",
      "Description": "Link for SUSE-SU-2019:1220-1"
    },
    {
      "URL": "https://lists.suse.com/pipermail/sle-security-updates/2019-May/005445.html",
      "Description": "E-Mail link for SUSE-SU-2019:1220-1"
    },
    {
      "URL": "https://www.suse.com/support/security/rating/",
      "Description": "SUSE Security Ratings"
    },
    {
      "URL": "https://bugzilla.suse.com/1132242",
      "Description": "SUSE Bug 1132242"
    },
    {
      "URL": "https://www.suse.com/security/cve/CVE-2019-3781/",
      "Description": "SUSE CVE CVE-2019-3781 page"
    }
  ],
  "Vulnerabilities": [
    {
      "CVE": "CVE-2019-3781",
      "Description": "Cloud Foundry CLI, versions prior to v6.43.0, improperly exposes passwords when verbose/trace/debugging is turned on. A local unauthenticated or remote authenticated malicious user with access to logs may gain part or all of a users password.",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "moderate"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2019-3781.html",
          "Description": "CVE-2019-3781"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": [
            "SUSE Linux Enterprise Module for CAP 15:cf-cli-6.43.0-3.3.2"
          ]
        }
      ],
      "CVSSScoreSets": {}
    }
  ]
}