{
  "Severity": "CRITICAL",
  "UpdatedAt": "2023-07-11T22:46:28Z",
  "Package": {
    "Ecosystem": "COMPOSER",
    "Name": "orchid/platform"
  },
  "Advisory": {
    "DatabaseId": 215477,
    "Id": "GSA_kwCzR0hTQS1waDZnLXA3MnYtcGMzcM4AA0m1",
    "GhsaId": "GHSA-ph6g-p72v-pc3p",
    "References": [
      {
        "Url": "https://github.com/orchidsoftware/platform/security/advisories/GHSA-ph6g-p72v-pc3p"
      },
      {
        "Url": "https://nvd.nist.gov/vuln/detail/CVE-2023-36825"
      },
      {
        "Url": "https://github.com/orchidsoftware/platform/releases/tag/14.5.0"
      },
      {
        "Url": "https://github.com/advisories/GHSA-ph6g-p72v-pc3p"
      }
    ],
    "Identifiers": [
      {
        "Type": "GHSA",
        "Value": "GHSA-ph6g-p72v-pc3p"
      },
      {
        "Type": "CVE",
        "Value": "CVE-2023-36825"
      }
    ],
    "Description": "Orchid is a Laravel package that allows application development of back-office applications, admin/user panels, and dashboards.\n\n### Impact\n\nA vulnerability present starting in version 14.0.0-alpha4 and prior to version 14.5.0 is related to the deserialization of untrusted data from the `_state` query parameter, which can result in remote code execution. This vulnerability is related to the deserialization of untrusted data from the `_state` query parameter, which can result in remote code execution.\n\n### Patches\n\nThe issue has been addressed in version 14.5.0. Users are advised to upgrade their software to this version or any subsequent versions that include the patch. There are no known workarounds.\n\n### Workarounds\n\nIn this case, it is recommended for users to upgrade to the patched version rather than relying on workarounds. Upgrading to the fixed version ensures that the vulnerability is no longer present and provides the best protection against remote code execution\n\n### References\n\nFor more detailed information about this workaround and its effectiveness, users should consult the support channels provided by the software or system developer. They can provide specific guidance on implementing this workaround and any potential limitations or caveats associated with it.\n\n----\n\nThis vulnerability was discovered by Vladislav Gladkiy (Positive Technologies)",
    "Origin": "UNSPECIFIED",
    "PublishedAt": "2023-07-11T22:46:27Z",
    "Severity": "CRITICAL",
    "Summary": "Orchid Deserialization of Untrusted Data vulnerability leads to Remote Code Execution",
    "UpdatedAt": "2023-11-07T05:04:41Z",
    "WithdrawnAt": "",
    "CVSS": {
      "Score": 9.8,
      "VectorString": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H"
    }
  },
  "Versions": [
    {
      "FirstPatchedVersion": {
        "Identifier": "14.5.0"
      },
      "VulnerableVersionRange": "\u003e= 14.0.0-alpha4, \u003c 14.5.0"
    }
  ]
}