{
  "Severity": "LOW",
  "UpdatedAt": "2025-10-21T18:53:29Z",
  "Package": {
    "Ecosystem": "PIP",
    "Name": "uv"
  },
  "Advisory": {
    "DatabaseId": 317864,
    "Id": "GSA_kwCzR0hTQS13NDc2LXAyaDMtNzlnOc4ABNmo",
    "GhsaId": "GHSA-w476-p2h3-79g9",
    "References": [
      {
        "Url": "https://github.com/astral-sh/uv/security/advisories/GHSA-w476-p2h3-79g9"
      },
      {
        "Url": "https://github.com/astral-sh/uv/pull/16387"
      },
      {
        "Url": "https://github.com/astral-sh/uv/commit/ae450662d1546e9853f67a8c61a506d3a892d963"
      },
      {
        "Url": "https://github.com/advisories/GHSA-j5gw-2vrg-8fgx"
      },
      {
        "Url": "https://github.com/astral-sh/uv/releases/tag/0.9.5"
      },
      {
        "Url": "https://github.com/advisories/GHSA-w476-p2h3-79g9"
      }
    ],
    "Identifiers": [
      {
        "Type": "GHSA",
        "Value": "GHSA-w476-p2h3-79g9"
      }
    ],
    "Description": "### Impact\n\nIn versions 0.9.4 and earlier of uv, tar archives containing PAX headers with file size overrides were not handled properly. As a result, an attacker could contrive a source distribution (as a tar archive) that would extract differently when installed via uv versus other Python package installers.\n\nThe underlying parsing differential here originates with astral-tokio-tar, which disclosed this vulnerability as CVE-2025-62518.\n\nIn practice, the impact of this vulnerability is **low**: only source distributions can be formatted as tar archives, and source distributions execute arbitrary code at build/installation time by definition. Consequently, a parser differential in tar extraction is strictly less powerful than the capabilities already exposed to an attacker who has the ability to control source distributions. \n\nHowever, this particular source of malleability in source distributions is unintentional and not operating by design, and therefore we consider it a vulnerability despite its overlap in capabilities with intended behavior.\n\n### Patches\n\nVersions 0.9.5 and newer of uv address the vulnerability above. Users should upgrade to 0.9.5 or newer.\n\n### Workarounds\n\nUsers are advised to upgrade to version 0.9.5 or newer to address this advisory.\n\nUsers should experience no breaking changes as a result of the patch above.\n\n### References\n\n* See CVE-2025-62518 for the corresponding advisory against astral-tokio-tar",
    "Origin": "UNSPECIFIED",
    "PublishedAt": "2025-10-21T18:53:27Z",
    "Severity": "LOW",
    "Summary": "uv has differential in tar extraction with PAX headers",
    "UpdatedAt": "2025-10-21T18:53:29Z",
    "WithdrawnAt": "",
    "CVSS": {
      "Score": 0,
      "VectorString": ""
    }
  },
  "Versions": [
    {
      "FirstPatchedVersion": {
        "Identifier": "0.9.5"
      },
      "VulnerableVersionRange": "\u003c= 0.9.4"
    }
  ]
}