{
  "Severity": "HIGH",
  "UpdatedAt": "2025-11-14T21:49:28Z",
  "Package": {
    "Ecosystem": "NPM",
    "Name": "@apollo/composition"
  },
  "Advisory": {
    "DatabaseId": 321799,
    "Id": "GSA_kwCzR0hTQS1tOGpyLWZ4cXgtOHh4Ns4ABOkH",
    "GhsaId": "GHSA-m8jr-fxqx-8xx6",
    "References": [
      {
        "Url": "https://github.com/apollographql/federation/security/advisories/GHSA-m8jr-fxqx-8xx6"
      },
      {
        "Url": "https://github.com/apollographql/federation/commit/09e596e6a0c753071ca822e84f525d73ada395cf"
      },
      {
        "Url": "https://github.com/apollographql/federation/commit/0d8fca1c8cc375bb8486f11f339984b69267417d"
      },
      {
        "Url": "https://github.com/apollographql/federation/commit/20c75d1d60a48fc289d88c8d29652f1afc7553e4"
      },
      {
        "Url": "https://github.com/apollographql/federation/commit/e1c58611c3c996b4fff98a54e49f00549ff2115d"
      },
      {
        "Url": "https://github.com/advisories/GHSA-m8jr-fxqx-8xx6"
      }
    ],
    "Identifiers": [
      {
        "Type": "GHSA",
        "Value": "GHSA-m8jr-fxqx-8xx6"
      }
    ],
    "Description": "# Summary\nA vulnerability in Apollo Federation's composition logic did not enforce that fields depending on protected data through `@requires` and/or `@fromContext` directives have the same access control requirements as the fields they reference. This allowed queries to access protected fields indirectly through their dependencies, bypassing access control checks. A fix to composition logic in Federation now enforces that dependent fields match the access control requirements from of the fields they reference.\n\n## Details\nApollo Federation allows users to specify [`@authenticated`, `@requiresScopes`, and `@policy` directives](https://www.apollographql.com/docs/graphos/routing/security/authorization#authorization-directives) to protect fields at the field level. The `@requires` directive allows a field to depend on data from other fields in the schema, and `@fromContext` allows a field to use values from the execution context. However, Apollo Router does not enforce access control requirements on these transitively-accessed fields, and Apollo Federation did not require that fields using `@requires` or `@fromContext` have the same access control as the fields they depend on. \n\nAt execution time, when a field decorated with `@requires` or `@fromContext` was resolved, the Router would fetch the required dependency fields from subgraphs without checking whether those fields had their own access control requirements. Access control directives applied to these dependency fields were only enforced when those fields appeared explicitly in the query. If the protected fields were accessed solely as transitive dependencies (in other words, fetched to satisfy `@requires` or `@fromContext` but not directly requested) their access control requirements were silently ignored.\n\nThis discrepancy between where access controls could be defined (on any field) and where it was enforced (only on explicitly queried fields) leads to unexpected runtime security gaps.\n\n## Who is impacted\nThis vulnerability impacts Apollo Federation customers with supergraphs defining `@authenticated`, `@requiresScopes`, or `@policy` directives on fields that are also specified as dependencies in `@requires` or `@fromContext` directives.\n\n### Scope of Impact\nThe vulnerability could allow a malicious actor to craft a query that indirectly accesses protected fields, allowing them to bypass field-level access control. By querying only fields that depend on protected data (via `@requires` or `@fromContext`) without explicitly requesting the protected fields themselves, an attacker could retrieve sensitive information without meeting the access control requirements. \n\n## Patches\nThis vulnerability has been fixed in Apollo Federation by updating composition logic to validate that access control requirements on `@requires` and `@fromContext` dependency fields match the resolving field's requirements.\n\n_Note that this is a breaking change to Apollo Federation, as it no longer allows fields using `@requires` or `@fromContext` to have different access control directives from the fields they depend on. You will need to update your subgraphs to ensure that the access control requirements on fields using `@requires` or `@fromContext` match the access control directives on the referenced fields._\n\nIf you are using the Apollo Studio build pipeline with Federation version 2.9 or above, then this patch version update is automatic and you only need to adjust the access control requirements in your subgraph schemas as mentioned above.\n\nIf you are using Apollo Rover for local composition, you will need to update its composition version (after updating Apollo Router, [if necessary](https://www.apollographql.com/docs/graphos/platform/graph-management/updates#recommended-update-order)) to one of the following versions:\n\n- 2.9.5+\n- 2.10.4+\n- 2.11.5+\n- 2.12.1+\n\nYou will then need to adjust the access control requirements in your subgraph schemas as mentioned above.\n\n## Workarounds\n- If you are using Apollo Rover with an unpatched composition version or are using the Apollo Studio build pipeline with Federation version 2.8 or below, you should review your schema for any sensitive fields that are accessed via `@requires` or `@fromContext` and explicitly apply matching access control directives on those transitive fields. Alternatively, consider restructuring your schema so that protected fields are queried directly.\n* Customers not using Apollo Router access control features (`@authenticated`, `@requiresScopes`, or `@policy` directives) or not using `@requires` or `@fromContext` directives in combination with field-level access control are not affected and do not need to take action.",
    "Origin": "UNSPECIFIED",
    "PublishedAt": "2025-11-14T21:49:26Z",
    "Severity": "HIGH",
    "Summary": "Apollo Federation has Improper Enforcement of Access Control on Transitive Fields",
    "UpdatedAt": "2025-11-14T21:50:08Z",
    "WithdrawnAt": "",
    "CVSS": {
      "Score": 7.5,
      "VectorString": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N"
    }
  },
  "Versions": [
    {
      "FirstPatchedVersion": {
        "Identifier": "2.12.1"
      },
      "VulnerableVersionRange": "\u003e= 2.12.0-preview.0, \u003c 2.12.1"
    },
    {
      "FirstPatchedVersion": {
        "Identifier": "2.11.5"
      },
      "VulnerableVersionRange": "\u003e= 2.11.0-preview.1, \u003c 2.11.5"
    },
    {
      "FirstPatchedVersion": {
        "Identifier": "2.10.4"
      },
      "VulnerableVersionRange": "\u003e= 2.10.0-alpha.3, \u003c 2.10.4"
    },
    {
      "FirstPatchedVersion": {
        "Identifier": "2.9.5"
      },
      "VulnerableVersionRange": "\u003c 2.9.5"
    }
  ]
}