{
  "Identifier": "GHSA-3v33-3wmw-3785",
  "PackageSlug": "pypi/yt-dlp",
  "Title": "yt-dlp has dependency on potentially malicious third-party code in Douyu extractors",
  "Description": "yt-dlp's DouyuTV and DouyuShow extractors used a `cdn.bootcdn.net` URL as a fallback for fetching a component of the crypto-js JavaScript library. When the Douyu extractor is used, yt-dlp extracts this JavaScript code and attempts to execute it externally using [PhantomJS](https://github.com/ariya/phantomjs). `bootcdn.net` is owned by the bad actor responsible for the [Polyfill JS supply chain attack](https://sansec.io/research/polyfill-supply-chain-attack) that has been ongoing since at least June 2023. While there is no evidence that PhantomJS has been targeted by or is vulnerable to any attacks carried out by the Polyfill JS actor, there is the possibility that malicious JavaScript code may have been downloaded/cached by yt-dlp or executed by PhantomJS.\n\nIn order for this potential vulnerability to be exploited by any hypothetical attack, all 3 of the following conditions must be met:\n1. The user has PhantomJS installed on their system.\n2. The user passes a `douyu.com` or `douyutv.com` URL to yt-dlp as input, or passes a URL that redirects to one of these domains.\n3. `cdnjs.cloudflare.com` is unavailable or blocked at the time of extraction, necessitating the usage of the `cdn.bootcdn.net` fallback; or it had been unavailable during a previous run of the Douyu extractor and JavaScript code from `cdn.bootcdn.net` had been cached to disk.",
  "Date": "2024-07-08",
  "Pubdate": "2024-07-08",
  "AffectedRange": "\u003e=2023.09.24,\u003c2024.07.07",
  "FixedVersions": [
    "2024.07.07"
  ],
  "AffectedVersions": "All versions starting from 2023.09.24 before 2024.07.07",
  "NotImpacted": "All versions before 2023.09.24, all versions starting from 2024.07.07",
  "Solution": "Upgrade to version 2024.07.07 or above.",
  "Urls": [
    "https://github.com/advisories/GHSA-3v33-3wmw-3785",
    "https://github.com/yt-dlp/yt-dlp/security/advisories/GHSA-3v33-3wmw-3785",
    "https://github.com/yt-dlp/yt-dlp/commit/6075a029dba70a89675ae1250e7cdfd91f0eba41",
    "https://github.com/yt-dlp/yt-dlp",
    "https://sansec.io/research/polyfill-supply-chain-attack"
  ],
  "CvssV2": "",
  "CvssV3": "",
  "UUID": "4470542c-bbbf-4c5e-b4da-4b2be2be70d2"
}