{
  "Severity": "MODERATE",
  "UpdatedAt": "2025-10-21T18:03:17Z",
  "Package": {
    "Ecosystem": "COMPOSER",
    "Name": "shopware/core"
  },
  "Advisory": {
    "DatabaseId": 317840,
    "Id": "GSA_kwCzR0hTQS0yN2M5LXZwM3ctNnd3OM4ABNmQ",
    "GhsaId": "GHSA-27c9-vp3w-6ww8",
    "References": [
      {
        "Url": "https://github.com/shopware/shopware/security/advisories/GHSA-27c9-vp3w-6ww8"
      },
      {
        "Url": "https://github.com/shopware/shopware/commit/c2c98050aff7b90fe7232f6dac9b6b7143183083"
      },
      {
        "Url": "https://github.com/advisories/GHSA-27c9-vp3w-6ww8"
      }
    ],
    "Identifiers": [
      {
        "Type": "GHSA",
        "Value": "GHSA-27c9-vp3w-6ww8"
      }
    ],
    "Description": "### Impact\nMalicious actors can exploit this finding to export sensitive customer information from a Shopware application, including password hashes and password reset tokens. In SaaS deployments, this primarily affects customer accounts. In on-premise deployments, however, it also includes the hashes and recovery tokens of administrator-level accounts, which increases\nthe potential impact. \nThis risk is noteworthy because users may reuse the same or similar passwords across different services. In such cases, exposed hashes could allow attackers to recover credentials that might also be valid outside of Shopware.\n\n#### Description\nSensitive information disclosure occurs when an application inadvertently displays sensitive information to its users. Depending on the context, websites can leak all kinds of information including:\n• Data regarding other users, such as usernames and/or e-mail addresses\n• Sensitive commercial data such as customer names\n• Technical details about the website and/or the underlying infrastructure\nDisclosing technical details, such as detailed version information, allows malicious actors to look for targeted vulnerabilities and/or misconfigurations in the application or in the underlying infrastructure. In addition, an application is more likely to be targeted by attacks that specifically target a particular version of the software used.\n\n#### Applicability\nThe Shopware application exposes sensitive information to users within the export section.\nThe Shopware application allows admins to import and export data within the application. To do this import/export profiles can be created. These profiles tell the application which tables within the database map to which columns in the generated file. During testing it was noticed that sensitive information such as password hashes or reset codes can also be included within the export. This can be done by creating a custom mapping that includes these fields within the export.\nTo exploit this vulnerability, an account with permissions to create import/export profiles and to create exports, is required.\n\n#### Reproduction \nTo reproduce this vulnerability, the steps below can be followed.\n1. Log in to Shopware application with an admin account capable of creating import/export profiles and creating exports\n2. Create a new import/export profile\n3. Add a new mapping for the ‘password’ database entry\n4. Create an export using the new profile\n5. Notice that the password hashes of the users are available within the export file.",
    "Origin": "UNSPECIFIED",
    "PublishedAt": "2025-10-21T18:03:16Z",
    "Severity": "MODERATE",
    "Summary": "Shopware exposes sensitive user information via CSV export mapping",
    "UpdatedAt": "2025-10-21T18:03:17Z",
    "WithdrawnAt": "",
    "CVSS": {
      "Score": 4.9,
      "VectorString": "CVSS:3.1/AV:N/AC:L/PR:H/UI:N/S:U/C:H/I:N/A:N"
    }
  },
  "Versions": [
    {
      "FirstPatchedVersion": {
        "Identifier": "6.6.10.7"
      },
      "VulnerableVersionRange": "\u003c 6.6.10.7"
    },
    {
      "FirstPatchedVersion": {
        "Identifier": "6.7.3.1"
      },
      "VulnerableVersionRange": "\u003e= 6.7.0.0, \u003c 6.7.3.1"
    }
  ]
}