{
  "Severity": "HIGH",
  "UpdatedAt": "2025-09-10T20:46:21Z",
  "Package": {
    "Ecosystem": "COMPOSER",
    "Name": "shopware/core"
  },
  "Advisory": {
    "DatabaseId": 311060,
    "Id": "GSA_kwCzR0hTQS05djgyLXZjangtbTc2as4ABL8U",
    "GhsaId": "GHSA-9v82-vcjx-m76j",
    "References": [
      {
        "Url": "https://github.com/shopware/shopware/security/advisories/GHSA-9v82-vcjx-m76j"
      },
      {
        "Url": "https://github.com/shopware/shopware/commit/12fb537c5ebe009f2a0f58b9c24dbd2d6b4c508f"
      },
      {
        "Url": "https://github.com/shopware/shopware/releases/tag/v6.7.2.1"
      },
      {
        "Url": "https://github.com/advisories/GHSA-9v82-vcjx-m76j"
      }
    ],
    "Identifiers": [
      {
        "Type": "GHSA",
        "Value": "GHSA-9v82-vcjx-m76j"
      }
    ],
    "Description": "### Impact\nBy exploiting XSS vulnerabilities, malicious actors can perform harmful actions in the user's web browser in the session context of the affected user. \n\nSome examples of this include, but are not limited to:\n- Obtaining user session tokens.\n- Performing administrative actions (when an administrative user is affected).\n\nThese vulnerabilities pose a high security risk. Since a sensitive cookie is not configured with the HttpOnly attribute and administrator JWTs are stored in sessionStorage, any successful XSS attack could enable the theft of session cookies and administrative tokens.\n\n#### Description\nWhen an application uses input fields, it is important that user input is adequately filtered for malicious HTML and JavaScript characters. When adequate input validation is not applied, Cross-Site Scripting (XSS) vulnerabilities may arise. These allow malicious actors to inject malicious code into application pages. When a user visits the page, the code is executed in the user's web browser. This allows malicious actors to perform malicious actions in the name of that user. XSS can be divided into three variants: Persistent XSS, Reflective XSS and DOM-based XSS. In Reflective XSS, a malicious actor injects malicious JavaScript code into a URL. Every time the user visits this URL, the JavaScript code is executed in the user’s browser.\n\n#### Applicability \nDue to a lack of input validation, the Shopware application contain XSS vulnerabilities. The JavaScript variable 'activeRouteParameters' lacks input validation, which makes it vulnerable to XSS attacks at the following endpoints:\n\n- /page/cms/*\n- /widget/cms/*\n\nThe lack of input validation enables malicious actors to inject harmful JavaScript-code into the affected pages. When a user visits the page, the code is executed within the user’s web browser. This enables malicious actors to perform (harmful) actions on behalf of the affected user. No user account is required to exploit this vulnerability.\n\n#### Reproduction\nTo reproduce this vulnerability, the steps below can be followed.\n1. Navigate to the URL below containing the XSS payload:\nhttps://pentest-saas-2025-2.shopware.store/page/cms/'+alert('REQON')+'\n2. Observe that a pop-up is shown indicating that the JavaScript code has been executed.\n\n#### Workarounds\nFor older versions of 6.7, corresponding security measures are also available via a plugin. For the full range of functions, we recommend updating to the latest Shopware version.",
    "Origin": "UNSPECIFIED",
    "PublishedAt": "2025-09-10T20:46:20Z",
    "Severity": "HIGH",
    "Summary": "Shopware: Reflective Cross Site-Scripting (XSS) in CMS components",
    "UpdatedAt": "2025-09-10T20:46:21Z",
    "WithdrawnAt": "",
    "CVSS": {
      "Score": 8.8,
      "VectorString": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:C/C:H/I:L/A:L"
    }
  },
  "Versions": [
    {
      "FirstPatchedVersion": {
        "Identifier": "6.7.2.1"
      },
      "VulnerableVersionRange": "\u003e= 6.7.0.0, \u003c 6.7.2.1"
    }
  ]
}