{
  "Severity": "LOW",
  "UpdatedAt": "2024-10-01T20:31:10Z",
  "Package": {
    "Ecosystem": "COMPOSER",
    "Name": "librenms/librenms"
  },
  "Advisory": {
    "DatabaseId": 261747,
    "Id": "GSA_kwCzR0hTQS1nY2dwLXEyanEtZnc1Ms4AA_5z",
    "GhsaId": "GHSA-gcgp-q2jq-fw52",
    "References": [
      {
        "Url": "https://github.com/librenms/librenms/security/advisories/GHSA-gcgp-q2jq-fw52"
      },
      {
        "Url": "https://github.com/librenms/librenms/commit/f259edc19b9f0ccca484c60b1ba70a0bfff97ef5"
      },
      {
        "Url": "https://github.com/librenms/librenms/blob/0e741e365aa974a74aee6b43d1b4b759158a5c7e/includes/html/forms/alert-templates.inc.php#L40"
      },
      {
        "Url": "https://github.com/librenms/librenms/blob/0e741e365aa974a74aee6b43d1b4b759158a5c7e/includes/html/modal/alert_template.inc.php#L205"
      },
      {
        "Url": "https://nvd.nist.gov/vuln/detail/CVE-2024-47526"
      },
      {
        "Url": "https://github.com/advisories/GHSA-gcgp-q2jq-fw52"
      }
    ],
    "Identifiers": [
      {
        "Type": "GHSA",
        "Value": "GHSA-gcgp-q2jq-fw52"
      },
      {
        "Type": "CVE",
        "Value": "CVE-2024-47526"
      }
    ],
    "Description": "### Summary\nA Self Cross-Site Scripting (Self-XSS) vulnerability in the \"Alert Templates\" feature allows users to inject arbitrary JavaScript into the alert template's name. This script executes immediately upon submission but does not persist after a page refresh.\n\n### Details\nThe vulnerability occurs when creating an alert template in the LibreNMS interface. Although the application sanitizes the \"name\" field when storing it in the database, this newly created template is immediately added to the table without any sanitization being applied to the name, allowing users to inject arbitrary JavaScript. This script executes when the template is created but does not persist in the database, thus preventing stored XSS.\n\nFor instance, the following payload can be used to exploit the vulnerability:\n```test1\u003cscript\u003e{onerror=alert}throw 1337\u003c/script\u003e```\n\nThe root cause of this vulnerability lies in the lack of sanitization of the \"name\" variable before it is rendered in the table. The vulnerability exists because the bootgrid function of the jQuery grid plugin does not sanitize the text being added to the table. Although tags are stripped before being added to the database (as shown in the code below), the vulnerability still allows Self-XSS during the creation of the template.\n\nWhere the variable is being sanitized before being stored in the database:\nhttps://github.com/librenms/librenms/blob/0e741e365aa974a74aee6b43d1b4b759158a5c7e/includes/html/forms/alert-templates.inc.php#L40\n\nWhere the vulnerability is happening:\nhttps://github.com/librenms/librenms/blob/0e741e365aa974a74aee6b43d1b4b759158a5c7e/includes/html/modal/alert_template.inc.php#L205 \n\n### PoC\n1. Navigate to the \"Alert Templates\" creation page in the LibreNMS interface.\n2. In the \"Name\" field, input the following payload:\n```test1\u003cscript\u003e{onerror=alert}throw 1337\u003c/script\u003e```\n3. Submit the form to create the alert template.\n4. Observe that the JavaScript executes immediately, triggering an alert popup. However, this code does not persist after refreshing the page.\n\n### Impact\nThis is a Self Cross-Site Scripting (Self-XSS) vulnerability. Although the risk is lower compared to traditional XSS, it can still be exploited through social engineering or tricking users into entering or interacting with malicious code. This can lead to unauthorized actions or data exposure in the context of the affected user's session.\n",
    "Origin": "UNSPECIFIED",
    "PublishedAt": "2024-10-01T20:31:09Z",
    "Severity": "LOW",
    "Summary": "LibreNMS has Stored Cross-site Scripting vulnerability in \"Alert Templates\" feature",
    "UpdatedAt": "2024-10-01T21:52:26Z",
    "WithdrawnAt": "",
    "CVSS": {
      "Score": 3.5,
      "VectorString": "CVSS:3.1/AV:N/AC:L/PR:H/UI:R/S:U/C:L/I:L/A:N"
    }
  },
  "Versions": [
    {
      "FirstPatchedVersion": {
        "Identifier": "24.9.0"
      },
      "VulnerableVersionRange": "\u003c 24.9.0"
    }
  ]
}