{
  "Identifier": "GHSA-pcx7-8hxg-j823",
  "PackageSlug": "maven/org.keycloak/keycloak-quarkus-server",
  "Title": "Duplicate Advisory: Keycloak proxy header handling Denial-of-Service (DoS) vulnerability",
  "Description": "## Duplicate Advisory\nThis advisory has been withdrawn because it is a duplicate of GHSA-jgwc-jh89-rpgq. This link is maintained to preserve external references.\n\n## Original Description\nA vulnerability was found in the Keycloak Server. The Keycloak Server is vulnerable to a denial of service (DoS) attack due to improper handling of proxy headers. When Keycloak is configured to accept incoming proxy headers, it may accept non-IP values, such as obfuscated identifiers, without proper validation. This issue can lead to costly DNS resolution operations, which an attacker could exploit to tie up IO threads and potentially cause a denial of service.\nThe attacker must have access to send requests to a Keycloak instance that is configured to accept proxy headers, specifically when reverse proxies do not overwrite incoming headers, and Keycloak is configured to trust these headers.",
  "Date": "2024-11-25",
  "Pubdate": "2024-11-25",
  "AffectedRange": "[,24.0.9),[25.0.0,26.0.6)",
  "FixedVersions": [
    "24.0.9",
    "26.0.6"
  ],
  "AffectedVersions": "All versions before 24.0.9, all versions starting from 25.0.0 before 26.0.6",
  "NotImpacted": "All versions starting from 24.0.9 before 25.0.0, all versions starting from 26.0.6",
  "Solution": "Upgrade to versions 24.0.9, 26.0.6 or above.",
  "Urls": [
    "https://github.com/advisories/GHSA-pcx7-8hxg-j823",
    "https://nvd.nist.gov/vuln/detail/CVE-2024-9666",
    "https://access.redhat.com/errata/RHSA-2024:10175",
    "https://access.redhat.com/errata/RHSA-2024:10176",
    "https://access.redhat.com/errata/RHSA-2024:10177",
    "https://access.redhat.com/errata/RHSA-2024:10178",
    "https://access.redhat.com/security/cve/CVE-2024-9666",
    "https://bugzilla.redhat.com/show_bug.cgi?id=2317440"
  ],
  "CvssV2": "",
  "CvssV3": "CVSS:3.1/AV:L/AC:H/PR:L/UI:N/S:U/C:N/I:N/A:H",
  "UUID": "6ee62aad-4bbc-4623-99ef-7c4ca0a667af"
}