{
  "Identifier": "GHSA-6vjm-54vp-mxhx",
  "PackageSlug": "go/github.com/juju/juju",
  "Title": "Juju's unprivileged user running on charm node can leak any secret or relation data accessible to the local charm",
  "Description": "An issue was discovered in Juju that resulted in the leak of the sensitive context ID, which allows a local unprivileged attacker to access other sensitive data or relation accessible to the local charm. A potential exploit where a user can run a bash loop attempting to execute hook tools. If running while another hook is executing, we log an error with the context ID, making it possible for the user to then use that ID in a following call successfully. This means an unprivileged user can access anything available via a hook tool such as config, relation data and secrets.",
  "Date": "2024-08-05",
  "Pubdate": "2024-08-05",
  "AffectedRange": "\u003c2.9.50||\u003e=3.0.0 \u003c3.1.9||\u003e=3.2.0 \u003c3.3.6||\u003e=3.4.0 \u003c3.4.5||\u003e=3.5.0 \u003c3.5.3",
  "FixedVersions": [
    "2.9.50",
    "3.1.9",
    "3.3.6",
    "3.4.5",
    "3.5.3"
  ],
  "AffectedVersions": "All versions before 2.9.50, all versions starting from 3.0.0 before 3.1.9, all versions starting from 3.2.0 before 3.3.6, all versions starting from 3.4.0 before 3.4.5, all versions starting from 3.5.0 before 3.5.3",
  "NotImpacted": "All versions starting from 2.9.50 before 3.0.0, all versions starting from 3.1.9 before 3.2.0, all versions starting from 3.3.6 before 3.4.0, all versions starting from 3.4.5 before 3.5.0, all versions starting from 3.5.3",
  "Solution": "Upgrade to versions 2.9.50, 3.1.9, 3.3.6, 3.4.5, 3.5.3 or above.",
  "Urls": [
    "https://github.com/advisories/GHSA-6vjm-54vp-mxhx",
    "https://github.com/juju/juju/security/advisories/GHSA-6vjm-54vp-mxhx",
    "https://nvd.nist.gov/vuln/detail/CVE-2024-6984",
    "https://github.com/juju/juju/commit/da929676853092a29ddf8d589468cf85ba3efaf2",
    "https://github.com/juju/juju"
  ],
  "CvssV2": "",
  "CvssV3": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:C/C:H/I:H/A:H",
  "UUID": "e5a900c6-b139-4f52-8b18-957a120d51a3"
}