{
  "Title": "Security update for rsyslog",
  "Tracking": {
    "ID": "SUSE-SU-2022:2314-1",
    "Status": "Final",
    "Version": "1",
    "InitialReleaseDate": "2022-07-06T15:31:28Z",
    "CurrentReleaseDate": "2022-07-06T15:31:28Z",
    "RevisionHistory": [
      {
        "Number": "1",
        "Date": "2022-07-06T15:31:28Z",
        "Description": "current"
      }
    ]
  },
  "Notes": [
    {
      "Text": "Security update for rsyslog",
      "Title": "Topic",
      "Type": "Summary"
    },
    {
      "Text": "This update for rsyslog fixes the following issues:\n\n- CVE-2022-24903: fix potential heap buffer overflow in modules for TCP syslog reception (bsc#1199061)\n\nUpgrade to rsyslog 8.2106.0 (bsc#1188039)\n\n  * NOTE: the prime new feature is support for TLS and non-TLS connections\n    via imtcp in parallel. Furthermore, most TLS parameters can now be overriden\n    at the input() level. The notable exceptions are certificate files, something\n    that is due to be implemented as next step.\n  * 2021-06-14: new global option 'parser.supportCompressionExtension'\n    This permits to turn off rsyslog's single-message compression extension\n    when it interferes with non-syslog message processing (the parser\n    subsystem expects syslog messages, not generic text)\n    closes https://github.com/rsyslog/rsyslog/issues/4598\n  * 2021-05-12: imtcp: add more override config params to input()\n    It is now possible to override all module parameters at the input() level. Module\n    parameters serve as defaults. Existing configs need no modification.\n  * 2021-05-06: imtcp: add stream driver parameter to input() configuration\n    This permits to have different inputs use different stream drivers\n    and stream driver parameters.\n    closes https://github.com/rsyslog/rsyslog/issues/3727\n  * 2021-04-29: imtcp: permit to run multiple inputs in parallel\n    Previously, a single server was used to run all imtcp inputs. This\n    had a couple of drawsbacks. First and foremost, we could not use\n    different stream drivers in the varios inputs. This patch now\n    provides a baseline to do that, but does still not implement the\n    capability (in this sense it is a staging patch).\n    Secondly, we now ensure that each input has at least one exclusive\n    thread for processing, untangling the performance of multiple\n    inputs from each other.\n    see also: https://github.com/rsyslog/rsyslog/issues/3727\n  * 2021-04-27: tcpsrv bugfix: potential sluggishnes and hang on shutdown\n    tcpsrv is used by multiple other modules (imtcp, imdiag, imgssapi, and,\n    in theory, also others - even ones we do not know about). However, the\n    internal synchornization did not properly take multiple tcpsrv users\n    in consideration.\n    As such, a single user could hang under some circumstances. This was\n    caused by improperly awaking all users from a pthread condition wait.\n    That in turn could lead to some sluggish behaviour and, in rare cases,\n    a hang at shutdown.\n    Note: it was highly unlikely to experience real problems with the\n    officially provided modules.\n  * 2021-04-22: refactoring of syslog/tcp driver parameter passing\n    This has now been generalized to a parameter block, which makes it much cleaner and\n    also easier to add new parameters in the future.\n  * 2021-04-22: config script: add re_match_i() and re_extract_i() functions\n    This provides case-insensitive regex functionality.\n    closes https://github.com/rsyslog/rsyslog/issues/4429\n    \n- Update to rsyslog 8.2104.0:\n  * rainerscript: call getgrnam_r repeatedly to get all group members\n  * new contributed module imhiredis\n  * new built-in function get_property() to access property vars\n  * mmdblookup: add support for mmdb DB reload on HUP\n  * script bugfix: empty array in foreach() improperly handled\n  * imjournal bugfixes (handle leak, empty file)\n  * new contributed function module fmunflatten\n  * test bugfix: some tests did not work with newer TLS library versions\n  * some improvements to project CI\n\n- Update to rsyslog 8.2102.0:\n  * omfwd: add stats counter for sent bytes\n  * omfwd: add error reporting configuration option\n  * action stats counter bugfix: failure count was not properly incremented\n  * action stats counter bugfix: resume count was not incremented\n  * omfwd bugfix: segfault or error if port not given\n  * lookup table bugfix: data race on lookup table reload\n  * testbench modernization\n  * testbench: fix invalid sequence of kafka tests runs\n  * testbench: fix kafkacat issues\n  * testbench: fix year-dependendt clickhouse test\n\n- Update to rsyslog 8.2012.0:\n  * testbench bugfix: some tests did not work in make distcheck\n  * immark: rewrite with many improvements\n  * usability: re-phrase error message to help users better understand cause\n  * add new system property $now-unixtimestamp\n  * omfwd: add new rate limit option\n  * omfwd bug: param 'StreamDriver.PermitExpiredCerts' is not 'off' by default\n\n- Update to rsyslog 8.2010.0:\n  * gnutls TLS subsystem bugfix: handshake error handling\n  * core/msg bugfix: memory leak\n  * core/msg bugfix: segfault in jsonPathFindNext() when root not an object\n  * openssl TLS subsystem: improvments of error and status messages\n  * add 'exists()' script function to check if variable exists\n  * core bugfix: do not create empty JSON objects on non-existent key access\n  * gnutls subsysem bugfix: potential hang on session closure\n  * core/network bugfix: obey net.enableDNS=off when querying local hostname\n  * core bugfix: potential segfault on query of PROGRAMNAME property\n  * imtcp bugfix: broken connection not necessariy detected\n  * new module: imhttp - http input\n  * mmdarwin bugfix: potential zero uuid when reusing existing one\n  * imdocker bugfix: build issue on some platforms\n  * omudpspoof bugfix: make compatbile with Solaris build\n  * testbench fix: python 3 incompatibility\n  * core bugfix: segfault if disk-queue file cannot be created\n  * cosmetic: fix dummy module name in debug output\n  * config bugfix: intended warning emitted as error\n\n- Update to rsyslog 8.39.0\n  * imfile: improve truncation detection\n  * imjournal: work around journald excessive reloading behavior\n  * errmsg: remove no longer needed code\n  * queue bugfix: invalid error message on queue startup\n  * bugfix imrelp: regression with legacy configuration startup fail\n  * bugfix imudp: stall of connection and/or potential segfault\n  * bugfix gcry crypto driver: small memleak\n  * fix potential misadressing in encryption subsystem\n  * ksi subsystem changes\n  * bugfix core: regex compile error messages could be incorrect\n  * bugfix core: potential hang on rsyslog termination\n  * bugfix imkafka: system hang when backgrounded\n  * bugfix imfile: file change was not reliably detected\n  * bugfix imrelp: do not fail build if librelp does not have relpSrvSetLstnAddr\n  * bugfix queue subsystem: DA queue did ignore encryption settings\n  * bugfix KSI: lmsig-ksils12 module skips signing the last block\n  * bugfix fmhash: function hash64mod sometimes returned wrong result\n  * bugfix core/debug: data written to random fd 2 under some debug settings\n\n- Update to rsyslog 8.38.0:\n  * imfile: support for endmsg.regex\n  * omhttp: new contribued module\n  * imrelp: add support for seting address to bind to (#894)\n  * ommysql: support mysql unix domain socket\n  * omusrmsg: do not fall back to max username length of 8\n  * various bug fixes and minor updates to other modules and core\n  * various fixes for memory leaks\n\n- Update to rsyslog 8.36.0:\n  * Liblogging-stdlog deprecated\n  * OpenSSL based TLS driver added in addition to GnuTLS\n  * GnuTLS TLS driver: support intermediate certificates\n  * imptcp: add ability to configure socket backlog\n  * fmhash: new hash function module\n  * updates and fixes to various modules\n  * omfwd: add support for bind-to-address for UDP\n  * mmkubernetes: new module\n\n- Update to rsyslog 8.33.1:\n  * devcontainer: use some more sensible defaults\n  * auto-detect if running inside a container (as pid 1)\n  * config: add include() script object\n  * template: add option to generate json 'container'\n  * core/template: add format jsonf to constant template entries\n  * config: add ability to disable config parameter ('config.enable')\n  * script: permit to use environment variables during configuration\n  * new global config parameter 'shutdown.enable.ctlc'\n  * config optimizer: detect totally empty 'if' statements and optimize them out\n  * template: constant entry can now also be formatted as json field\n  * omstdout: support for new-style configuration parameters added\n  * core: set TZ on startup if not already set\n  * imjournal bugfix: file handle leak during journal rotation\n  * lmsig_ksils12 bugfix: dirOwner and dirGroup config was not respected\n  * script bugfix: replace() function worked incorrectly in some cases\n  * core bugfix: misadressing in external command parser\n  * core bugfix: small memory leak in external command parser\n  * core bugfix: string not properly terminated when RFC5424 MSGID is used\n  * bugfix: strndup() compatibility layer func copies too much\n\n- Update to rsyslog 8.32.0\n  * libfastjson 0.99.8 required\n  * libczmq \u003e= 3.0.2 is now required for omczmq\n  * libcurl is now needed for rsyslog core\n  * rsyslogd: add capability to specify that no pid file shall be written\n  * core improvements and bug fixes\n  * RainerScript improvements and bug fixes\n  * build fixes, including gcc7 fixes\n  * various bug fixes in multiple modules\n  * imudp: fix segfault in ratelimit code\n\n- Update to rsyslog 8.30.0\n  * changed behaviour: all variables are now case-insensitive by default\n  * core: handle (JSON) variables in case-insensitive way\n  * imjournal: made switching to persistent journal in runtime possible\n  * mmanon: complete refactor and enhancements\n  * imfile: add 'fileoffset' metadata\n  * RainerScript: add ltrim and rtrim functions\n  * core: report module name when suspending action\n  * core: add ability to limit number of error messages going to stderr\n  * tcpsrv subsystem: improvate clarity of some error messages\n  * imptcp: include module name in error msg\n  * imtcp: include module name in error msg\n  * tls improvement: better error message if certificate file cannot be read\n  * omfwd: slightly improved error messages during config parsing\n  * ommysql improvements\n  * ommysql bugfix: do not duplicate entries on failed transaction\n  * imtcp bugfix: parameter priorityString was ignored\n  * template/bugfix: invalid template option conflict detection\n  * core/actions: fix handling of data-induced errors\n  * core/action bugfix: no 'action suspended' message during retry processing\n  * core/action: if commitTransaction fails, try individual messages\n  * core/ratelimit bugfix: race can lead to segfault\n  * core bugfix: rsyslog aborts if errmsg is generated in early startup\n  * core bugfix: informational messages was logged with error severity\n  * core bugfix: --enable-debugless build was broken\n  * queue bugfix: file write error message was incorrect\n  * omrelp bugfix:  segfault when rebindinterval parameter is used\n  * omkafka bugfix: invalid load of failedmsg file on startup if disabled\n  * kafka bugfix: problem on invalid kafka configuration values\n  * imudp bugfix: UDP oversize message not properly handled\n  * core bugfix: memory corruption during configuration parsing\n  * core bugfix: race on worker thread termination during shutdown\n  * omelasticsearch: avoid ES5 warnings while sending json in bulkmode\n  * omelasticsearch bugfix: incompatibility with newer ElasticSearch version\n  * imptcp bugfix: invalid mutex addressing on some platforms\n  * imptcp bugfix: do not accept missing port in legacy listener definition\n\n- Update to rsyslog 8.29.0:\n  * imptcp: add experimental parameter 'multiline'\n  * imptcp: framing-related error messages now also indicate remote peer\n  * imtcp: framing-related error messages now also indicate remote peer\n  * imptcp: add session statistics conunter\n  * imtcp: add ability to specify GnuTLS priority string\n  * impstats: add new ressoure counter 'openfiles'\n  * pmnormalize: new parser module\n  * core/queue: provide informational messages on thread startup and shutdown\n  * omfwd/udp: improve error reporting, depricate maxerrormessages parameter\n  * core: add parameters debug.file and debug.whitelist\n  * core/net.c: improve UDP socket creation error messages\n  * omfwd/udp: add 'udp.sendbuf' parameter\n  * core: make rsyslog internal message rate-limiter configurable\n  * omelasticsearch bugfixes and changed ES5 API support\n    + avoid 404 during health check\n    + avoid ES5 warnings while sending json\n    + bugfix for memomry leak while writing error file\n  * imfile bugfix: wildcard detection issue on path wildcards\n  * omfwd bugfix: always give reason for suspension\n  * omfwd bugfix: configured compression level was not properly used\n  * imptcp bugfix: potential socket leak on session shutdown\n  * omfwd/omudpspoof bugfix: switch udp client sockets to nonblocking mode\n  * imklog: fix permitnonkernelfacility not working\n  * impstats bugfix: impstats does not handle HUP\n  * core bugfix: segfault after configuration errors\n  * core/queue bugfixes\n  * lmsig_ksi: removed pre-KSI_LS12 components\n\n- Update to rsyslog 8.28.0\n  * omfwd: add parameter 'tcp_frameDelimiter'\n  * omkafka: large refactor of kafka subsystem\n  * imfile: improved handling of atomically renamed file (w/ wildcards)\n  * imfile: add capability to truncate oversize messages or split into multiple\n  * mmdblookup fixes and extensions\n  * bugfix: fixed multiple memory leaks\n  * imptcp: add new parameter 'flowControl'\n  * imrelp: add 'maxDataSize' config parameter\n  * multiple modules: gtls: improve error if certificate file can't be opened\n  * omsnare: allow different tab escapes\n  * omelasticsearch: converted to use libfastjson instead of json-c\n  * imjournal: _PID fallback\n  * added fallback for _PID proprety when SYSLOG_PID is not available\n  * introduced new option 'usepid' which sets which property should\n    rsyslog use, it has 3 states system|syslog|both, default is both\n  * deprecated 'usepidfromsystem' option, still can be used\n    and override the 'usepid'\n  * it is possible to revert previous default with usepid='syslog'\n  * multiple modules: add better error messages when regcomp is failing\n  * omhiredis: fix build warnings\n  * imfile bugfix: files mv-ed in into directory were not handled\n  * omprog bugfix: execve() incorrectly called\n  * imfile bugfix: multiline timeout did not work if state file exists\n  * lmsig_ksi-ls12 bugfix: build problems on some platforms\n  * core bugfix: invalid object type assertion\n  * regression fix: local hostname was not always detected properly...\n  * bugfix: format security issues in zmq3 modules\n  * bugfix build system: add libksi only to those binaries that need it\n  * bugfix KSI ls12 components: invalid tree height calculation\n  * bugfix imfile: fix multiline timeout code\n\n- Update to rsyslog 8.27.0\n- imkafka: add module\n- imptcp enhancements:\n  * optionally emit an error message if incoming messages are truncated\n  * optionally emit connection tracking message (on connection create and\n    close)\n  * add 'maxFrameSize' parameter to specify the maximum size permitted\n    in octet-counted mode\n  * add parameter 'discardTruncatedMsg' to permit truncation of\n    oversize messages\n  * improve octect-counted mode detection: if the octet count is larger\n    then the set frame size (or overly large in general), it is now\n    assumed that octet-stuffing mode is used. This probably solves a\n    number of issues seen in real deployments.\n- imtcp enhancements:\n  * add parameter 'discardTruncatedMsg' to permit truncation of\n    oversize messages\n  * add 'maxFrameSize' parameter to specify the maximum size permitted\n    in octet-counted mode\n- imfile bugfix: 'file not found error' repeatedly being reported\n  for configured non-existing file. In polling mode, this message\n  appeared once in each polling cycle, causing a potentially very large\n  amout of error messages. Note that they were usually emitted too\n  infrequently to trigger the error message rate limiter, albeit often\n  enough to be a major annoance.\n- imfile: in inotify mode, add error message if configured file cannot\n  be found\n- imfile: add parameter 'fileNotFoundError' to optinally disable\n  'file not found' error messages\n- core: replaced gethostbyname() with getaddrinfo() call\n  Gethostbyname() is generally considered obsolete, is not reentrant and\n  cannot really work with IPv6. Changed the only place in rsyslog where\n  this call remained.\n  Thanks to github user jvymazal for the patch\n- omkafka: add 'origin' field to stats output\n  See also https://github.com/rsyslog/rsyslog/issues/1508\n  Thanks to Yury Bushmelev for providing the patch.\n- imuxsock: rate-limiting also uses process name\n  both for the actual limit procesing as well as warning messages emitted\n  see also https://github.com/rsyslog/rsyslog/pull/1520\n  Thanks to github user jvymazal for the patch\n- Added new module: KSI log signing ver. 1.2 (lmsig_ksi_ls12)\n- rsylsog base functionality now builds on osx (Mac)\n  Thanks to github user hdatma for his help in getting this done.\n- build now works on solaris again\n- imfile: fix cross-platform build issue\n  see also https://github.com/rsyslog/rsyslog/issues/1494\n  Thanks to Felix Janda for bug report and solution suggestion.\n- bugfix core: segfault when no parser could parse message\n- core bugfix: memory leak when internal messages not processed\n  internally\n\n- Update to rsyslog 8.26.0:\n  * liblognorm 2.0.3 is required for mmnormalize\n  * enable internal error messages at all times\n  * core: added logging name of source of rate-limited messages\n  * omfwd: omfwd: add support for network namespaces\n  * imrelp: honor input name if provided when submitting to impstats\n  * imptcp: add ability to set owner/group/access perms for uds\n  * mmnormalize: add ability to load a rulebase from action() parameter\n  * pmrfc3164 improvements\n    + permit to ignore leading space in MSG\n    + permit to use at-sign in host names\n    + permit to require tag to end in colon\n  * add new global parameter 'umask'\n  * core: make use of -T command line option more secure\n  * omfile: add error if both file and dynafile are set\n  * bugfix: build problem on MacOS (not a supported platform)\n  * regression fix: in 8.25, str2num() returned error on empty string\n  * bugfix omsnmp: improper handling of new-style configuration parameters\n  * bugfix: rsyslog identifies itself as 'liblogging-stdlog' in internal messages\n  * bugfix imfile: wrong files were monitored when using multiple imfile inputs\n  * bugfix: setting net.aclResolveHostname/net.acladdhostnameonfail segfaults\n  * bugfix: immark emitted error messages with text 'imuxsock'\n  * bugfix tcpflood: build failed if RELP was disabled\n  * fix gcc6 compiler warnings\n  * the output module array passing interface has been removed\n\n- Update to rsyslog 8.25.0:\n  * imfile: add support for wildcards in directory names\n  * add new global option 'parser.PermitSlashInProgramname'\n  * mmdblookup: fix build issues, code cleanup\n  * improved debug output for queue corruption cases\n  * an error message is now displayed when a directory owner cannot be set\n  * rainerscript: add new function ipv42num\n  * rainerscript: add new function num2ipv4\n  * bugfix: ratelimiter does not work correctly is time is set back\n  * core: fix potential message loss in old-style transactional interface\n  * bugfix queue subsystem: queue corrupted if certain msg props are used\n  * bugfix imjournal: fixed situation when time goes backwards\n  * bugfix: bFlushOnTxEnd == 0 not honored when writing w/o async writer\n  * bugfix core: str2num mishandling empty strings\n  * bugfix rainerscript: set/unset statement do not check variable name validity\n  * bugfix mmrm1stspace: last character of rawmsg property was doubled\n  * bugfix imtcp: fix very small (cosmetic) memory leak\n  * However, the leak breaks memleak checks in the testbench.\n  * fix segfault in libc\n\n",
      "Title": "Details",
      "Type": "General"
    },
    {
      "Text": "The CVRF data is provided by SUSE under the Creative Commons License 4.0 with Attribution (CC-BY-4.0).",
      "Title": "Terms of Use",
      "Type": "Legal Disclaimer"
    },
    {
      "Text": "Image SLES12-SP5-Azure-BYOS-2022-2314,Image SLES12-SP5-Azure-Basic-On-Demand-2022-2314,Image SLES12-SP5-Azure-HPC-BYOS-2022-2314,Image SLES12-SP5-Azure-HPC-On-Demand-2022-2314,Image SLES12-SP5-Azure-SAP-BYOS-2022-2314,Image SLES12-SP5-Azure-SAP-On-Demand-2022-2314,Image SLES12-SP5-Azure-Standard-On-Demand-2022-2314,Image SLES12-SP5-EC2-BYOS-2022-2314,Image SLES12-SP5-EC2-ECS-On-Demand-2022-2314,Image SLES12-SP5-EC2-On-Demand-2022-2314,Image SLES12-SP5-EC2-SAP-BYOS-2022-2314,Image SLES12-SP5-EC2-SAP-On-Demand-2022-2314,Image SLES12-SP5-GCE-BYOS-2022-2314,Image SLES12-SP5-GCE-On-Demand-2022-2314,Image SLES12-SP5-GCE-SAP-BYOS-2022-2314,Image SLES12-SP5-GCE-SAP-On-Demand-2022-2314,Image SLES12-SP5-SAP-Azure-VLI-BYOS-Production-2022-2314,SUSE-2022-2314,SUSE-SLE-SERVER-12-SP5-2022-2314",
      "Title": "Patchnames",
      "Type": "Details"
    }
  ],
  "ProductTree": {
    "Relationships": [
      {
        "ProductReference": "rsyslog-8.2106.0-8.5.2",
        "RelatesToProductReference": "Image SLES12-SP5-Azure-BYOS",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "rsyslog-8.2106.0-8.5.2",
        "RelatesToProductReference": "Image SLES12-SP5-Azure-Basic-On-Demand",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "rsyslog-8.2106.0-8.5.2",
        "RelatesToProductReference": "Image SLES12-SP5-Azure-HPC-BYOS",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "rsyslog-8.2106.0-8.5.2",
        "RelatesToProductReference": "Image SLES12-SP5-Azure-HPC-On-Demand",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "rsyslog-8.2106.0-8.5.2",
        "RelatesToProductReference": "Image SLES12-SP5-Azure-SAP-BYOS",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "rsyslog-8.2106.0-8.5.2",
        "RelatesToProductReference": "Image SLES12-SP5-Azure-SAP-On-Demand",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "rsyslog-8.2106.0-8.5.2",
        "RelatesToProductReference": "Image SLES12-SP5-Azure-Standard-On-Demand",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "rsyslog-8.2106.0-8.5.2",
        "RelatesToProductReference": "Image SLES12-SP5-EC2-BYOS",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "rsyslog-8.2106.0-8.5.2",
        "RelatesToProductReference": "Image SLES12-SP5-EC2-ECS-On-Demand",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "rsyslog-8.2106.0-8.5.2",
        "RelatesToProductReference": "Image SLES12-SP5-EC2-On-Demand",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "rsyslog-8.2106.0-8.5.2",
        "RelatesToProductReference": "Image SLES12-SP5-EC2-SAP-BYOS",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "rsyslog-8.2106.0-8.5.2",
        "RelatesToProductReference": "Image SLES12-SP5-EC2-SAP-On-Demand",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "rsyslog-8.2106.0-8.5.2",
        "RelatesToProductReference": "Image SLES12-SP5-GCE-BYOS",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "rsyslog-8.2106.0-8.5.2",
        "RelatesToProductReference": "Image SLES12-SP5-GCE-On-Demand",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "rsyslog-8.2106.0-8.5.2",
        "RelatesToProductReference": "Image SLES12-SP5-GCE-SAP-BYOS",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "rsyslog-8.2106.0-8.5.2",
        "RelatesToProductReference": "Image SLES12-SP5-GCE-SAP-On-Demand",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "rsyslog-8.2106.0-8.5.2",
        "RelatesToProductReference": "Image SLES12-SP5-SAP-Azure-VLI-BYOS-Production",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "rsyslog-8.2106.0-8.5.2",
        "RelatesToProductReference": "SUSE Linux Enterprise Server 12 SP5",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "rsyslog-diag-tools-8.2106.0-8.5.2",
        "RelatesToProductReference": "SUSE Linux Enterprise Server 12 SP5",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "rsyslog-doc-8.2106.0-8.5.2",
        "RelatesToProductReference": "SUSE Linux Enterprise Server 12 SP5",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "rsyslog-module-gssapi-8.2106.0-8.5.2",
        "RelatesToProductReference": "SUSE Linux Enterprise Server 12 SP5",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "rsyslog-module-gtls-8.2106.0-8.5.2",
        "RelatesToProductReference": "SUSE Linux Enterprise Server 12 SP5",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "rsyslog-module-mmnormalize-8.2106.0-8.5.2",
        "RelatesToProductReference": "SUSE Linux Enterprise Server 12 SP5",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "rsyslog-module-mysql-8.2106.0-8.5.2",
        "RelatesToProductReference": "SUSE Linux Enterprise Server 12 SP5",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "rsyslog-module-pgsql-8.2106.0-8.5.2",
        "RelatesToProductReference": "SUSE Linux Enterprise Server 12 SP5",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "rsyslog-module-relp-8.2106.0-8.5.2",
        "RelatesToProductReference": "SUSE Linux Enterprise Server 12 SP5",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "rsyslog-module-snmp-8.2106.0-8.5.2",
        "RelatesToProductReference": "SUSE Linux Enterprise Server 12 SP5",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "rsyslog-module-udpspoof-8.2106.0-8.5.2",
        "RelatesToProductReference": "SUSE Linux Enterprise Server 12 SP5",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "rsyslog-8.2106.0-8.5.2",
        "RelatesToProductReference": "SUSE Linux Enterprise Server for SAP Applications 12 SP5",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "rsyslog-diag-tools-8.2106.0-8.5.2",
        "RelatesToProductReference": "SUSE Linux Enterprise Server for SAP Applications 12 SP5",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "rsyslog-doc-8.2106.0-8.5.2",
        "RelatesToProductReference": "SUSE Linux Enterprise Server for SAP Applications 12 SP5",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "rsyslog-module-gssapi-8.2106.0-8.5.2",
        "RelatesToProductReference": "SUSE Linux Enterprise Server for SAP Applications 12 SP5",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "rsyslog-module-gtls-8.2106.0-8.5.2",
        "RelatesToProductReference": "SUSE Linux Enterprise Server for SAP Applications 12 SP5",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "rsyslog-module-mmnormalize-8.2106.0-8.5.2",
        "RelatesToProductReference": "SUSE Linux Enterprise Server for SAP Applications 12 SP5",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "rsyslog-module-mysql-8.2106.0-8.5.2",
        "RelatesToProductReference": "SUSE Linux Enterprise Server for SAP Applications 12 SP5",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "rsyslog-module-pgsql-8.2106.0-8.5.2",
        "RelatesToProductReference": "SUSE Linux Enterprise Server for SAP Applications 12 SP5",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "rsyslog-module-relp-8.2106.0-8.5.2",
        "RelatesToProductReference": "SUSE Linux Enterprise Server for SAP Applications 12 SP5",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "rsyslog-module-snmp-8.2106.0-8.5.2",
        "RelatesToProductReference": "SUSE Linux Enterprise Server for SAP Applications 12 SP5",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "rsyslog-module-udpspoof-8.2106.0-8.5.2",
        "RelatesToProductReference": "SUSE Linux Enterprise Server for SAP Applications 12 SP5",
        "RelationType": "Default Component Of"
      }
    ]
  },
  "References": [
    {
      "URL": "https://www.suse.com/support/update/announcement/2022/suse-su-20222314-1/",
      "Description": "Link for SUSE-SU-2022:2314-1"
    },
    {
      "URL": "https://lists.suse.com/pipermail/sle-security-updates/2022-July/011439.html",
      "Description": "E-Mail link for SUSE-SU-2022:2314-1"
    },
    {
      "URL": "https://www.suse.com/support/security/rating/",
      "Description": "SUSE Security Ratings"
    },
    {
      "URL": "https://bugzilla.suse.com/1051798",
      "Description": "SUSE Bug 1051798"
    },
    {
      "URL": "https://bugzilla.suse.com/1068678",
      "Description": "SUSE Bug 1068678"
    },
    {
      "URL": "https://bugzilla.suse.com/1080238",
      "Description": "SUSE Bug 1080238"
    },
    {
      "URL": "https://bugzilla.suse.com/1082318",
      "Description": "SUSE Bug 1082318"
    },
    {
      "URL": "https://bugzilla.suse.com/1101642",
      "Description": "SUSE Bug 1101642"
    },
    {
      "URL": "https://bugzilla.suse.com/1110456",
      "Description": "SUSE Bug 1110456"
    },
    {
      "URL": "https://bugzilla.suse.com/1160414",
      "Description": "SUSE Bug 1160414"
    },
    {
      "URL": "https://bugzilla.suse.com/1178288",
      "Description": "SUSE Bug 1178288"
    },
    {
      "URL": "https://bugzilla.suse.com/1178490",
      "Description": "SUSE Bug 1178490"
    },
    {
      "URL": "https://bugzilla.suse.com/1182653",
      "Description": "SUSE Bug 1182653"
    },
    {
      "URL": "https://bugzilla.suse.com/1188039",
      "Description": "SUSE Bug 1188039"
    },
    {
      "URL": "https://bugzilla.suse.com/1199061",
      "Description": "SUSE Bug 1199061"
    },
    {
      "URL": "https://www.suse.com/security/cve/CVE-2022-24903/",
      "Description": "SUSE CVE CVE-2022-24903 page"
    }
  ],
  "Vulnerabilities": [
    {
      "CVE": "CVE-2022-24903",
      "Description": "Rsyslog is a rocket-fast system for log processing. Modules for TCP syslog reception have a potential heap buffer overflow when octet-counted framing is used. This can result in a segfault or some other malfunction. As of our understanding, this vulnerability can not be used for remote code execution. But there may still be a slight chance for experts to do that. The bug occurs when the octet count is read. While there is a check for the maximum number of octets, digits are written to a heap buffer even when the octet count is over the maximum, This can be used to overrun the memory buffer. However, once the sequence of digits stop, no additional characters can be added to the buffer. In our opinion, this makes remote exploits impossible or at least highly complex. Octet-counted framing is one of two potential framing modes. It is relatively uncommon, but enabled by default on receivers. Modules `imtcp`, `imptcp`, `imgssapi`, and `imhttp` are used for regular syslog message reception. It is best practice not to directly expose them to the public. When this practice is followed, the risk is considerably lower. Module `imdiag` is a diagnostics module primarily intended for testbench runs. We do not expect it to be present on any production installation. Octet-counted framing is not very common. Usually, it needs to be specifically enabled at senders. If users do not need it, they can turn it off for the most important modules. This will mitigate the vulnerability.",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "important"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2022-24903.html",
          "Description": "CVE-2022-24903"
        },
        {
          "URL": "https://bugzilla.suse.com/1199061",
          "Description": "SUSE Bug 1199061"
        },
        {
          "URL": "https://bugzilla.suse.com/1201736",
          "Description": "SUSE Bug 1201736"
        },
        {
          "URL": "https://bugzilla.suse.com/1206201",
          "Description": "SUSE Bug 1206201"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": [
            "Image SLES12-SP5-Azure-BYOS:rsyslog-8.2106.0-8.5.2",
            "Image SLES12-SP5-Azure-Basic-On-Demand:rsyslog-8.2106.0-8.5.2",
            "Image SLES12-SP5-Azure-HPC-BYOS:rsyslog-8.2106.0-8.5.2",
            "Image SLES12-SP5-Azure-HPC-On-Demand:rsyslog-8.2106.0-8.5.2",
            "Image SLES12-SP5-Azure-SAP-BYOS:rsyslog-8.2106.0-8.5.2",
            "Image SLES12-SP5-Azure-SAP-On-Demand:rsyslog-8.2106.0-8.5.2",
            "Image SLES12-SP5-Azure-Standard-On-Demand:rsyslog-8.2106.0-8.5.2",
            "Image SLES12-SP5-EC2-BYOS:rsyslog-8.2106.0-8.5.2",
            "Image SLES12-SP5-EC2-ECS-On-Demand:rsyslog-8.2106.0-8.5.2",
            "Image SLES12-SP5-EC2-On-Demand:rsyslog-8.2106.0-8.5.2",
            "Image SLES12-SP5-EC2-SAP-BYOS:rsyslog-8.2106.0-8.5.2",
            "Image SLES12-SP5-EC2-SAP-On-Demand:rsyslog-8.2106.0-8.5.2",
            "Image SLES12-SP5-GCE-BYOS:rsyslog-8.2106.0-8.5.2",
            "Image SLES12-SP5-GCE-On-Demand:rsyslog-8.2106.0-8.5.2",
            "Image SLES12-SP5-GCE-SAP-BYOS:rsyslog-8.2106.0-8.5.2",
            "Image SLES12-SP5-GCE-SAP-On-Demand:rsyslog-8.2106.0-8.5.2",
            "Image SLES12-SP5-SAP-Azure-VLI-BYOS-Production:rsyslog-8.2106.0-8.5.2",
            "SUSE Linux Enterprise Server 12 SP5:rsyslog-8.2106.0-8.5.2",
            "SUSE Linux Enterprise Server 12 SP5:rsyslog-diag-tools-8.2106.0-8.5.2",
            "SUSE Linux Enterprise Server 12 SP5:rsyslog-doc-8.2106.0-8.5.2",
            "SUSE Linux Enterprise Server 12 SP5:rsyslog-module-gssapi-8.2106.0-8.5.2",
            "SUSE Linux Enterprise Server 12 SP5:rsyslog-module-gtls-8.2106.0-8.5.2",
            "SUSE Linux Enterprise Server 12 SP5:rsyslog-module-mmnormalize-8.2106.0-8.5.2",
            "SUSE Linux Enterprise Server 12 SP5:rsyslog-module-mysql-8.2106.0-8.5.2",
            "SUSE Linux Enterprise Server 12 SP5:rsyslog-module-pgsql-8.2106.0-8.5.2",
            "SUSE Linux Enterprise Server 12 SP5:rsyslog-module-relp-8.2106.0-8.5.2",
            "SUSE Linux Enterprise Server 12 SP5:rsyslog-module-snmp-8.2106.0-8.5.2",
            "SUSE Linux Enterprise Server 12 SP5:rsyslog-module-udpspoof-8.2106.0-8.5.2",
            "SUSE Linux Enterprise Server for SAP Applications 12 SP5:rsyslog-8.2106.0-8.5.2",
            "SUSE Linux Enterprise Server for SAP Applications 12 SP5:rsyslog-diag-tools-8.2106.0-8.5.2",
            "SUSE Linux Enterprise Server for SAP Applications 12 SP5:rsyslog-doc-8.2106.0-8.5.2",
            "SUSE Linux Enterprise Server for SAP Applications 12 SP5:rsyslog-module-gssapi-8.2106.0-8.5.2",
            "SUSE Linux Enterprise Server for SAP Applications 12 SP5:rsyslog-module-gtls-8.2106.0-8.5.2",
            "SUSE Linux Enterprise Server for SAP Applications 12 SP5:rsyslog-module-mmnormalize-8.2106.0-8.5.2",
            "SUSE Linux Enterprise Server for SAP Applications 12 SP5:rsyslog-module-mysql-8.2106.0-8.5.2",
            "SUSE Linux Enterprise Server for SAP Applications 12 SP5:rsyslog-module-pgsql-8.2106.0-8.5.2",
            "SUSE Linux Enterprise Server for SAP Applications 12 SP5:rsyslog-module-relp-8.2106.0-8.5.2",
            "SUSE Linux Enterprise Server for SAP Applications 12 SP5:rsyslog-module-snmp-8.2106.0-8.5.2",
            "SUSE Linux Enterprise Server for SAP Applications 12 SP5:rsyslog-module-udpspoof-8.2106.0-8.5.2"
          ]
        }
      ],
      "CVSSScoreSets": {}
    }
  ]
}