{
  "Title": "Security update for the Linux Kernel",
  "Tracking": {
    "ID": "SUSE-SU-2022:0079-1",
    "Status": "Final",
    "Version": "1",
    "InitialReleaseDate": "2022-01-14T11:07:51Z",
    "CurrentReleaseDate": "2022-01-14T11:07:51Z",
    "RevisionHistory": [
      {
        "Number": "1",
        "Date": "2022-01-14T11:07:51Z",
        "Description": "current"
      }
    ]
  },
  "Notes": [
    {
      "Text": "Security update for the Linux Kernel",
      "Title": "Topic",
      "Type": "Summary"
    },
    {
      "Text": "\nThe SUSE Linux Enterprise 15 SP3 RT kernel was updated to receive various security and bugfixes.\n\nThe following security bugs were fixed:\n\n- CVE-2020-24504: Fixed an uncontrolled resource consumption in some Intel(R) Ethernet E810 Adapter drivers that may have allowed an authenticated user to potentially enable denial of service via local access. (bnc#1182404)\n- CVE-2020-27820: Fixed a vulnerability where a use-after-frees in nouveau's postclose() handler could happen if removing device. (bnc#1179599)\n- CVE-2021-4001: Fixed a race condition when the EBPF map is frozen. (bsc#1192990)\n- CVE-2021-4002: Added a missing TLB flush that could lead to leak or corruption of data in hugetlbfs. (bsc#1192946)\n- CVE-2021-28711: Fixed a rogue backends that could cause DoS of guests via high frequency events by hardening blkfront against event channel storms. (bsc#1193440)\n- CVE-2021-28712: Fixed a rogue backends that could cause DoS of guests via high frequency events by hardening netfront against event channel storms. (bsc#1193440)\n- CVE-2021-28713: Fixed a rogue backends that could cause DoS of guests via high frequency events by hardening hvc_xen against event channel storms. (bsc#1193440)\n- CVE-2021-28714: Fixed an issue where a guest could force Linux netback driver to hog large amounts of kernel memory by fixing rx queue stall detection. (bsc#1193442)\n- CVE-2021-28715: Fixed an issue where a guest could force Linux netback driver to hog large amounts of kernel memory by do not queueing unlimited number of packages.  (bsc#1193442)\n- CVE-2021-33098: Fixed improper input validation in the Intel(R) Ethernet ixgbe driver that could allow an authenticate user to cause a denial of service (bnc#1192877).\n- CVE-2021-43975: Fixed a flaw in hw_atl_utils_fw_rpc_wait that could allow an attacker (who can introduce a crafted device) to trigger an out-of-bounds write via a crafted length value. (bnc#1192845)\n- CVE-2021-43976: Fixed a flaw that could allow an attacker (who can connect a crafted USB device) to cause a denial of service. (bnc#1192847)\n- CVE-2021-45485: Fixed an information leak because of certain use of a hash table which use IPv6 source addresses. (bsc#1194094)\n- CVE-2021-45486: Fixed an information leak because the hash table is very small in net/ipv4/route.c. (bnc#1194087).\n\nThe following non-security bugs were fixed:\n\n- acpi: PMIC: Fix intel_pmic_regs_handler() read accesses (git-fixes).\n- acpi: battery: Accept charges over the design capacity as full (git-fixes).\n- acpica: Avoid evaluating methods too early during system resume (git-fixes).\n- alsa: ISA: not for M68K (git-fixes).\n- alsa: ctxfi: Fix out-of-range access (git-fixes).\n- alsa: gus: fix null pointer dereference on pointer block (git-fixes).\n- alsa: hda/realtek: Add a quirk for Acer Spin SP513-54N (git-fixes).\n- alsa: hda/realtek: Add quirk for ASUS UX550VE (git-fixes).\n- alsa: hda/realtek: Add quirk for Clevo PC70HS (git-fixes).\n- alsa: hda/realtek: Add quirk for HP EliteBook 840 G7 mute LED (git-fixes).\n- alsa: hda: hdac_ext_stream: fix potential locking issues (git-fixes).\n- alsa: hda: hdac_stream: fix potential locking issue in snd_hdac_stream_assign() (git-fixes).\n- alsa: synth: missing check for possible NULL after the call to kstrdup (git-fixes).\n- alsa: timer: Fix use-after-free problem (git-fixes).\n- alsa: timer: Unconditionally unlink slave instances, too (git-fixes).\n- alsa: usb-audio: Add registration quirk for JBL Quantum 400 (git-fixes).\n- arm: 8970/1: decompressor: increase tag size (git-fixes).\n- arm: 8974/1: use SPARSMEM_STATIC when SPARSEMEM is enabled (git-fixes)\n- arm: 8986/1: hw_breakpoint: Do not invoke overflow handler on uaccess watchpoints (git-fixes)\n- arm: 9007/1: l2c: fix prefetch bits init in L2X0_AUX_CTRL using DT (git-fixes)\n- arm: 9019/1: kprobes: Avoid fortify_panic() when copying optprobe (git-fixes)\n- arm: 9046/1: decompressor: Do not clear SCTLR.nTLSMD for ARMv7+ cores (git-fixes)\n- arm: 9064/1: hw_breakpoint: Do not directly check the event's (git-fixes)\n- arm: 9071/1: uprobes: Do not hook on thumb instructions (git-fixes)\n- arm: 9081/1: fix gcc-10 thumb2-kernel regression (git-fixes)\n- arm: 9091/1: Revert 'mm: qsd8x50: Fix incorrect permission faults' (git-fixes)\n- arm: 9133/1: mm: proc-macros: ensure *_tlb_fns are 4B aligned (git-fixes)\n- arm: 9134/1: remove duplicate memcpy() definition (git-fixes)\n- arm: 9139/1: kprobes: fix arch_init_kprobes() prototype (git-fixes)\n- arm: 9141/1: only warn about XIP address when not compile testing (git-fixes)\n- arm: 9155/1: fix early early_iounmap() (git-fixes)\n- arm: OMAP2+: Fix legacy mode dss_reset (git-fixes)\n- arm: OMAP2+: omap_device: fix idling of devices during probe (git-fixes)\n- arm: OMAP2+: pm33xx-core: Make am43xx_get_rtc_base_addr static (git-fixes)\n- arm: at91: pm: add missing put_device() call in at91_pm_sram_init() (git-fixes)\n- arm: at91: pm: of_node_put() after its usage (git-fixes)\n- arm: at91: pm: use proper master clock register offset (git-fixes)\n- arm: bcm: Select ARM_TIMER_SP804 for ARCH_BCM_NSP (git-fixes)\n- arm: dts sunxi: Relax a bit the CMA pool allocation range (git-fixes)\n- arm: dts: BCM5301X: Add interrupt properties to GPIO node (git-fixes)\n- arm: dts: BCM5301X: Fix I2C controller interrupt (git-fixes)\n- arm: dts: BCM5301X: Fixed QSPI compatible string (git-fixes)\n- arm: dts: Configure missing thermal interrupt for 4430 (git-fixes)\n- arm: dts: Fix dcan driver probe failed on am437x platform (git-fixes)\n- arm: dts: Fix duovero smsc interrupt for suspend (git-fixes)\n- arm: dts: N900: fix onenand timings (git-fixes).\n- arm: dts: NSP: Correct FA2 mailbox node (git-fixes)\n- arm: dts: NSP: Disable PL330 by default, add dma-coherent property (git-fixes)\n- arm: dts: NSP: Fixed QSPI compatible string (git-fixes)\n- arm: dts: Remove non-existent i2c1 from 98dx3236 (git-fixes)\n- arm: dts: am335x-pocketbeagle: Fix mmc0 Write Protect (git-fixes)\n- arm: dts: am335x: align ti,pindir-d0-out-d1-in property with dt-shema (git-fixes)\n- arm: dts: am437x-idk-evm: Fix incorrect OPP node names (git-fixes)\n- arm: dts: am437x-l4: fix typo in can@0 node (git-fixes)\n- arm: dts: armada-38x: fix NETA lockup when repeatedly switching speeds (git-fixes)\n- arm: dts: armada388-helios4: assign pinctrl to LEDs (git-fixes)\n- arm: dts: armada388-helios4: assign pinctrl to each fan (git-fixes)\n- arm: dts: aspeed: s2600wf: Fix VGA memory region location (git-fixes)\n- arm: dts: aspeed: tiogapass: Remove vuart (git-fixes)\n- arm: dts: at91-sama5d27_som1: fix phy address to 7 (git-fixes)\n- arm: dts: at91: add pinctrl-{names, 0} for all gpios (git-fixes)\n- arm: dts: at91: at91sam9rl: fix ADC triggers (git-fixes)\n- arm: dts: at91: sama5d2: fix CAN message ram offset and size (git-fixes)\n- arm: dts: at91: sama5d2: map securam as device (git-fixes)\n- arm: dts: at91: sama5d2_ptc_ek: fix sdmmc0 node description (git-fixes)\n- arm: dts: at91: sama5d2_ptc_ek: fix vbus pin (git-fixes)\n- arm: dts: at91: sama5d2_xplained: classd: pull-down the R1 and R3 lines (git-fixes)\n- arm: dts: at91: sama5d3_xplained: add pincontrol for USB Host (git-fixes)\n- arm: dts: at91: sama5d4: fix pinctrl muxing (git-fixes)\n- arm: dts: at91: sama5d4_xplained: add pincontrol for USB Host (git-fixes)\n- arm: dts: at91: tse850: the emac\u0026lt;-\u003ephy interface is rmii (git-fixes)\n- arm: dts: bcm2835-rpi-zero-w: Fix led polarity (git-fixes)\n- arm: dts: bcm: HR2: Fix PPI interrupt types (git-fixes)\n- arm: dts: bcm: HR2: Fixed QSPI compatible string (git-fixes)\n- arm: dts: colibri-imx6ull: limit SDIO clock to 25MHz (git-fixes)\n- arm: dts: dra76x: Fix mmc3 max-frequency (git-fixes)\n- arm: dts: dra76x: m_can: fix order of clocks (git-fixes)\n- arm: dts: dra7xx-clocks: Fixup IPU1 mux clock parent source (git-fixes)\n- arm: dts: exynos: Fix GPIO polarity for thr GalaxyS3 CM36651 sensor's bus (git-fixes)\n- arm: dts: exynos: correct MUIC interrupt trigger level on Midas (git-fixes)\n- arm: dts: exynos: correct PMIC interrupt trigger level on Arndale (git-fixes)\n- arm: dts: exynos: correct PMIC interrupt trigger level on Artik 5 (git-fixes)\n- arm: dts: exynos: correct PMIC interrupt trigger level on Midas (git-fixes)\n- arm: dts: exynos: correct PMIC interrupt trigger level on Monk (git-fixes)\n- arm: dts: exynos: correct PMIC interrupt trigger level on Odroid X/U3 (git-fixes)\n- arm: dts: exynos: correct PMIC interrupt trigger level on Odroid XU3 (git-fixes)\n- arm: dts: exynos: correct PMIC interrupt trigger level on Rinato (git-fixes)\n- arm: dts: exynos: correct PMIC interrupt trigger level on SMDK5250 (git-fixes)\n- arm: dts: exynos: correct PMIC interrupt trigger level on Snow (git-fixes)\n- arm: dts: exynos: correct PMIC interrupt trigger level on Spring (git-fixes)\n- arm: dts: exynos: correct fuel gauge interrupt trigger level on Midas (git-fixes)\n- arm: dts: exynos: fix PWM LED max brightness on Odroid HC1 (git-fixes)\n- arm: dts: exynos: fix PWM LED max brightness on Odroid XU/XU3 (git-fixes)\n- arm: dts: exynos: fix PWM LED max brightness on Odroid XU4 (git-fixes)\n- arm: dts: exynos: fix USB 3.0 VBUS control and over-current pins on (git-fixes)\n- arm: dts: exynos: fix USB 3.0 pins supply being turned off on Odroid (git-fixes)\n- arm: dts: exynos: fix roles of USB 3.0 ports on Odroid XU (git-fixes)\n- arm: dts: gemini-rut1xx: remove duplicate ethernet node (git-fixes)\n- arm: dts: gose: Fix ports node name for adv7180 (git-fixes)\n- arm: dts: gose: Fix ports node name for adv7612 (git-fixes)\n- arm: dts: imx27-phytec-phycard-s-rdk: Fix the I2C1 pinctrl entries (git-fixes)\n- arm: dts: imx50-evk: Fix the chip select 1 IOMUX (git-fixes)\n- arm: dts: imx6: Use gpc for FEC interrupt controller to fix wake on LAN (git-fixes)\n- arm: dts: imx6: pbab01: Set vmmc supply for both SD interfaces (git-fixes)\n- arm: dts: imx6: phycore-som: fix arm and soc minimum voltage (git-fixes)\n- arm: dts: imx6: phycore-som: fix emmc supply (git-fixes)\n- arm: dts: imx6dl-colibri-eval-v3: fix sram compatible properties (git-fixes).\n- arm: dts: imx6dl-yapp4: Fix RGMII connection to QCA8334 switch (git-fixes)\n- arm: dts: imx6dl-yapp4: Fix Ursa board Ethernet connection (git-fixes)\n- arm: dts: imx6q-dhcom: Add PU,VDD1P1,VDD2P5 regulators (git-fixes)\n- arm: dts: imx6q-dhcom: Add gpios pinctrl for i2c bus recovery (git-fixes)\n- arm: dts: imx6q-dhcom: Fix ethernet plugin detection problems (git-fixes)\n- arm: dts: imx6q-dhcom: Fix ethernet reset time properties (git-fixes)\n- arm: dts: imx6qdl-gw52xx: fix duplicate regulator naming (git-fixes)\n- arm: dts: imx6qdl-gw551x: Do not use 'simple-audio-card,dai-link' (git-fixes)\n- arm: dts: imx6qdl-gw551x: fix audio SSI (git-fixes)\n- arm: dts: imx6qdl-icore: Fix OTG_ID pin and sdcard detect (git-fixes)\n- arm: dts: imx6qdl-kontron-samx6i: fix I2C_PM scl pin (git-fixes)\n- arm: dts: imx6qdl-kontron-samx6i: fix i2c_lcd/cam default status (git-fixes)\n- arm: dts: imx6qdl-sr-som: Increase the PHY reset duration to 10ms (git-fixes)\n- arm: dts: imx6qdl-udoo: fix rgmii phy-mode for ksz9031 phy (git-fixes)\n- arm: dts: imx6sl: fix rng node (git-fixes)\n- arm: dts: imx6sx-sabreauto: Fix the phy-mode on fec2 (git-fixes)\n- arm: dts: imx6sx-sdb: Fix the phy-mode on fec2 (git-fixes)\n- arm: dts: imx6sx: Add missing UART RTS/CTS pins mux (git-fixes)\n- arm: dts: imx6sx: Improve UART pins macro defines (git-fixes)\n- arm: dts: imx6sx: fix the pad QSPI1B_SCLK mux mode for uart3 (git-fixes)\n- arm: dts: imx7-colibri: Fix frequency for sd/mmc (git-fixes)\n- arm: dts: imx7-colibri: fix muxing of usbc_det pin (git-fixes)\n- arm: dts: imx7-colibri: prepare module device tree for FlexCAN (git-fixes)\n- arm: dts: imx7d-meerkat96: Fix the 'tuning-step' property (git-fixes)\n- arm: dts: imx7d-pico: Fix the 'tuning-step' property (git-fixes)\n- arm: dts: imx7d: Correct speed grading fuse settings (git-fixes)\n- arm: dts: imx7d: fix opp-supported-hw (git-fixes)\n- arm: dts: imx7ulp: Correct gpio ranges (git-fixes)\n- arm: dts: imx: Fix USB host power regulator polarity on M53Menlo (git-fixes)\n- arm: dts: imx: Swap M53Menlo pinctrl_power_button/pinctrl_power_out (git-fixes)\n- arm: dts: imx: emcon-avari: Fix nxp,pca8574 #gpio-cells (git-fixes)\n- arm: dts: logicpd-som-lv-baseboard: Fix broken audio (git-fixes)\n- arm: dts: logicpd-som-lv-baseboard: Fix missing video (git-fixes)\n- arm: dts: logicpd-torpedo-baseboard: Fix broken audio (git-fixes)\n- arm: dts: lpc32xx: Revert set default clock rate of HCLK PLL (git-fixes)\n- arm: dts: ls1021a: Restore MDIO compatible to gianfar (git-fixes)\n- arm: dts: ls1021a: fix QuadSPI-memory reg range (git-fixes)\n- arm: dts: meson8: Use a higher default GPU clock frequency (git-fixes)\n- arm: dts: meson8: remove two invalid interrupt lines from the GPU (git-fixes)\n- arm: dts: meson8b: ec100: Fix the pwm regulator supply properties (git-fixes)\n- arm: dts: meson8b: mxq: Fix the pwm regulator supply properties (git-fixes)\n- arm: dts: meson8b: odroidc1: Fix the pwm regulator supply properties (git-fixes)\n- arm: dts: meson: fix PHY deassert timing requirements (git-fixes)\n- arm: dts: mt7623: add missing pause for switchport (git-fixes)\n- arm: dts: omap3-gta04a4: accelerometer irq fix (git-fixes)\n- arm: dts: omap3430-sdp: Fix NAND device node (git-fixes)\n- arm: dts: owl-s500: Fix incorrect PPI interrupt specifiers (git-fixes)\n- arm: dts: oxnas: Fix clear-mask property (git-fixes)\n- arm: dts: pandaboard: fix pinmux for gpio user button of Pandaboard (git-fixes)\n- arm: dts: qcom: apq8064: Use 27MHz PXO clock as DSI PLL reference (git-fixes)\n- arm: dts: qcom: msm8974: Add xo_board reference clock to DSI0 PHY (git-fixes)\n- arm: dts: r7s9210: Remove bogus clock-names from OSTM nodes (git-fixes)\n- arm: dts: r8a73a4: Add missing CMT1 interrupts (git-fixes)\n- arm: dts: r8a7740: Add missing extal2 to CPG node (git-fixes)\n- arm: dts: r8a7779, marzen: Fix DU clock names (git-fixes)\n- arm: dts: renesas: Fix IOMMU device node names (git-fixes)\n- arm: dts: s5pv210: Set keep-power-in-suspend for SDHCI1 on Aries (git-fixes)\n- arm: dts: socfpga: Align L2 cache-controller nodename with dtschema (git-fixes)\n- arm: dts: socfpga: fix register entry for timer3 on Arria10 (git-fixes)\n- arm: dts: stm32: fix a typo for DAC io-channel-cells on stm32f429 (git-fixes)\n- arm: dts: stm32: fix a typo for DAC io-channel-cells on stm32h743 (git-fixes)\n- arm: dts: sun6i: a31-hummingbird: Enable RGMII RX/TX delay on (git-fixes)\n- arm: dts: sun7i: a20: bananapro: Fix ethernet phy-mode (git-fixes)\n- arm: dts: sun7i: bananapi-m1-plus: Enable RGMII RX/TX delay on (git-fixes)\n- arm: dts: sun7i: bananapi: Enable RGMII RX/TX delay on Ethernet PHY (git-fixes)\n- arm: dts: sun7i: cubietruck: Enable RGMII RX/TX delay on Ethernet PHY (git-fixes)\n- arm: dts: sun7i: pcduino3-nano: enable RGMII RX/TX delay on PHY (git-fixes)\n- arm: dts: sun8i-a83t-tbs-a711: Fix USB OTG mode detection (git-fixes)\n- arm: dts: sun8i-h2-plus-bananapi-m2-zero: Fix led polarity (git-fixes)\n- arm: dts: sun8i: a83t: Enable both RGMII RX/TX delay on Ethernet PHY (git-fixes)\n- arm: dts: sun8i: h3: orangepi-plus2e: Enable RGMII RX/TX delay on (git-fixes)\n- arm: dts: sun8i: r40: Move AHCI device node based on address order (git-fixes)\n- arm: dts: sun8i: r40: bananapi-m2-berry: Fix dcdc1 regulator (git-fixes)\n- arm: dts: sun8i: r40: bananapi-m2-ultra: Fix dcdc1 regulator (git-fixes)\n- arm: dts: sun8i: r40: bananapi-m2-ultra: Fix ethernet node (git-fixes)\n- arm: dts: sun8i: v3s: fix GIC node memory range (git-fixes)\n- arm: dts: sun8i: v40: bananapi-m2-berry: Fix ethernet node (git-fixes)\n- arm: dts: sun9i: Enable both RGMII RX/TX delay on Ethernet PHY (git-fixes)\n- arm: dts: sunxi: Fix DE2 clocks register range (git-fixes)\n- arm: dts: sunxi: bananapi-m2-plus-v1.2: Fix CPU supply voltages (git-fixes)\n- arm: dts: sunxi: bananapi-m2-plus: Enable RGMII RX/TX delay on (git-fixes)\n- arm: dts: turris-omnia: add SFP node (git-fixes)\n- arm: dts: turris-omnia: add comphy handle to eth2 (git-fixes)\n- arm: dts: turris-omnia: configure LED[2]/INTn pin as interrupt pin (git-fixes)\n- arm: dts: turris-omnia: describe switch interrupt (git-fixes)\n- arm: dts: turris-omnia: enable HW buffer management (git-fixes)\n- arm: dts: turris-omnia: fix hardware buffer management (git-fixes)\n- arm: dts: uniphier: Change phy-mode to RGMII-ID to enable delay pins (git-fixes)\n- arm: dts: uniphier: Set SCSSI clock and reset IDs for each channel (git-fixes).\n- arm: dts: vf610-zii-dev-rev-b: Remove #address-cells and #size-cells (git-fixes)\n- arm: dts: vfxxx: Add syscon compatible with OCOTP (git-fixes)\n- arm: exynos: MCPM: Restore big.LITTLE cpuidle support (git-fixes)\n- arm: exynos: add missing of_node_put for loop iteration (git-fixes)\n- arm: footbridge: fix PCI interrupt mapping (git-fixes)\n- arm: imx5: add missing put_device() call in imx_suspend_alloc_ocram() (git-fixes)\n- arm: imx6: disable the GIC CPU interface before calling stby-poweroff (git-fixes)\n- arm: imx: add missing clk_disable_unprepare() (git-fixes)\n- arm: imx: add missing iounmap() (git-fixes)\n- arm: imx: build suspend-imx6.S with arm instruction set (git-fixes)\n- arm: imx: fix missing 3rd argument in macro imx_mmdc_perf_init (git-fixes)\n- arm: mvebu: drop pointless check for coherency_base (git-fixes)\n- arm: p2v: fix handling of LPAE translation in BE mode (git-fixes)\n- arm: s3c24xx: fix missing system reset (git-fixes)\n- arm: s3c24xx: fix mmc gpio lookup tables (git-fixes)\n- arm: s3c: irq-s3c24xx: Fix return value check for s3c24xx_init_intc() (git-fixes)\n- arm: samsung: do not build plat/pm-common for Exynos (git-fixes)\n- arm: samsung: fix PM debug build with DEBUG_LL but !MMU (git-fixes)\n- arm: socfpga: PM: add missing put_device() call in socfpga_setup_ocram_self_refresh() (git-fixes)\n- asoc: DAPM: Cover regression by kctl change notification fix (git-fixes).\n- asoc: SOF: Intel: hda-dai: fix potential locking issue (git-fixes).\n- asoc: nau8824: Add DMI quirk mechanism for active-high jack-detect (git-fixes).\n- asoc: qdsp6: q6routing: Conditionally reset FrontEnd Mixer (git-fixes).\n- asoc: topology: Add missing rwsem around snd_ctl_remove() calls (git-fixes).\n- ath10k: fix invalid dma_addr_t token assignment (git-fixes).\n- ath10k: high latency fixes for beacon buffer (git-fixes).\n- ath: dfs_pattern_detector: Fix possible null-pointer dereference in channel_detector_create() (git-fixes).\n- bfq: Limit number of requests consumed by each cgroup (bsc#1184318).\n- bfq: Store full bitmap depth in bfq_data (bsc#1184318).\n- bfq: Track number of allocated requests in bfq_entity (bsc#1184318).\n- blacklist scsi commit that breaks kabi (git-fixes)\n- block: Fix use-after-free issue accessing struct io_cq (bsc#1193042).\n- block: Provide blk_mq_sched_get_icq() (bsc#1184318).\n- bluetooth: btrtl: Refine the ic_id_table for clearer and more regular (bsc#1193655).\n- bluetooth: btusb: Add another Bluetooth part for Realtek 8852AE (bsc#1193655).\n- bluetooth: btusb: Add the more support IDs for Realtek RTL8822CE (bsc#1193655).\n- bluetooth: btusb: Add the new support ID for Realtek RTL8852A (bsc#1193655).\n- bluetooth: btusb: btrtl: Add support for RTL8852A (bsc#1193655).\n- bluetooth: fix use-after-free error in lock_sock_nested() (git-fixes).\n- bnxt_en: reject indirect blk offload when hw-tc-offload is off (jsc#SLE-8372 bsc#1153275).\n- bonding: Fix a use-after-free problem when bond_sysfs_slave_add() failed (git-fixes).\n- bpf, arm: Fix register clobbering in div/mod implementation (git-fixes)\n- bpf, s390: Fix potential memory leak about jit_data (git-fixes).\n- bpf, x86: Fix 'no previous prototype' warning (git-fixes).\n- brcmfmac: Add DMI nvram filename quirk for Cyberbook T116 tablet (git-fixes).\n- btrfs: do not ignore error from btrfs_next_leaf() when inserting checksums (bsc#1193002).\n- btrfs: fix fsync failure and transaction abort after writes to prealloc extents (bsc#1193002).\n- btrfs: fix lost inode on log replay after mix of fsync, rename and inode eviction (bsc#1192998).\n- btrfs: fix race causing unnecessary inode logging during link and rename (bsc#1192998).\n- btrfs: make checksum item extension more efficient (bsc#1193002).\n- cfg80211: call cfg80211_stop_ap when switch from P2P_GO type (git-fixes).\n- cifs: Add get_security_type_str function to return sec type (bsc#1192606).\n- cifs: Add missing sentinel to smb3_fs_parameters (bsc#1192606).\n- cifs: Add new mount parameter 'acdirmax' to allow caching directory metadata (bsc#1192606).\n- cifs: Add new parameter 'acregmax' for distinct file and directory metadata timeout (bsc#1192606).\n- cifs: Add support for setting owner info, dos attributes, and create time (bsc#1164565).\n- cifs: Add tracepoints for errors on flush or fsync (bsc#1164565).\n- cifs: Add witness information to debug data dump (bsc#1192606).\n- cifs: Adjust indentation in smb2_open_file (bsc#1164565).\n- cifs: Adjust key sizes and key generation routines for AES256 encryption (bsc#1192606).\n- cifs: Allocate crypto structures on the fly for calculating signatures of incoming packets (bsc#1192606).\n- cifs: Allocate encryption header through kmalloc (bsc#1192606).\n- cifs: Always update signing key of first channel (bsc#1192606).\n- cifs: Avoid doing network I/O while holding cache lock (bsc#1164565).\n- cifs: Avoid error pointer dereference (bsc#1192606).\n- cifs: Avoid field over-reading memcpy() (bsc#1192606).\n- cifs: Change SIDs in ACEs while transferring file ownership (bsc#1192606).\n- cifs: Clarify SMB1 code for POSIX Create (bsc#1192606).\n- cifs: Clarify SMB1 code for POSIX Lock (bsc#1192606).\n- cifs: Clarify SMB1 code for POSIX delete file (bsc#1192606).\n- cifs: Clarify SMB1 code for SetFileSize (bsc#1192606).\n- cifs: Clarify SMB1 code for UnixCreateSymLink (bsc#1192606).\n- cifs: Clarify SMB1 code for UnixSetPathInfo (bsc#1192606).\n- cifs: Clarify SMB1 code for delete (bsc#1192606).\n- cifs: Clarify SMB1 code for rename open file (bsc#1192606).\n- cifs: Clean up DFS referral cache (bsc#1164565).\n- cifs: Close cached root handle only if it had a lease (bsc#1164565).\n- cifs: Close open handle after interrupted close (bsc#1164565).\n- cifs: Constify static struct genl_ops (bsc#1192606).\n- cifs: Convert to use the fallthrough macro (bsc#1192606).\n- cifs: Create a new shared file holding smb2 pdu definitions (bsc#1192606).\n- cifs: Deal with some warnings from W=1 (bsc#1192606).\n- cifs: Delete a stray unlock in cifs_swn_reconnect() (bsc#1192606).\n- cifs: Display local UID details for SMB sessions in DebugData (bsc#1192606).\n- cifs: Do not display RDMA transport on reconnect (bsc#1164565).\n- cifs: Do not leak EDEADLK to dgetents64 for STATUS_USER_SESSION_DELETED (bsc#1192606).\n- cifs: Do not miss cancelled OPEN responses (bsc#1164565).\n- cifs: Do not use iov_iter::type directly (bsc#1192606).\n- cifs: Do not use the original cruid when following DFS links for multiuser mounts (bsc#1192606).\n- cifs: Enable sticky bit with cifsacl mount option (bsc#1192606).\n- cifs: Fix NULL pointer dereference in mid callback (bsc#1164565).\n- cifs: Fix NULL-pointer dereference in smb2_push_mandatory_locks (bnc#1151927 5.3.16).\n- cifs: Fix SMB2 oplock break processing (bsc#1154355 bnc#1151927 5.3.16).\n- cifs: Fix an error pointer dereference in cifs_mount() (bsc#1178270).\n- cifs: Fix bug which the return value by asynchronous read is error (bsc#1192606).\n- cifs: Fix cached_fid refcnt leak in open_shroot (bsc#1192606).\n- cifs: Fix chmod with modefromsid when an older ACE already exists (bsc#1192606).\n- cifs: Fix cifsInodeInfo lock_sem deadlock when reconnect occurs (bnc#1151927 5.3.10).\n- cifs: Fix cifsacl ACE mask for group and others (bsc#1192606).\n- cifs: Fix double add page to memcg when cifs_readpages (bsc#1192606).\n- cifs: Fix fall-through warnings for Clang (bsc#1192606).\n- cifs: Fix in error types returned for out-of-credit situations (bsc#1192606).\n- cifs: Fix incomplete memory allocation on setxattr path (bsc#1179211).\n- cifs: Fix inconsistent IS_ERR and PTR_ERR (bsc#1192606).\n- cifs: Fix inconsistent indenting (bsc#1192606).\n- cifs: Fix leak when handling lease break for cached root fid (bsc#1176242).\n- cifs: Fix lookup of SMB connections on multichannel (bsc#1192606).\n- cifs: Fix lookup of root ses in DFS referral cache (bsc#1164565).\n- cifs: Fix memory allocation in __smb2_handle_cancelled_cmd() (bsc#1164565).\n- cifs: Fix missed free operations (bnc#1151927 5.3.8).\n- cifs: Fix mode output in debugging statements (bsc#1164565).\n- cifs: Fix mount options set in automount (bsc#1164565).\n- cifs: Fix null pointer check in cifs_read (bsc#1192606).\n- cifs: Fix oplock handling for SMB 2.1+ protocols (bnc#1151927 5.3.4).\n- cifs: Fix potential deadlock when updating vol in cifs_reconnect() (bsc#1164565).\n- cifs: Fix potential softlockups while refreshing DFS cache (bsc#1164565).\n- cifs: Fix preauth hash corruption (git-fixes).\n- cifs: Fix retrieval of DFS referrals in cifs_mount() (bsc#1164565).\n- cifs: Fix retry mid list corruption on reconnects (bnc#1151927 5.3.10).\n- cifs: Fix return value in __update_cache_entry (bsc#1164565).\n- cifs: Fix some error pointers handling detected by static checker (bsc#1192606).\n- cifs: Fix spelling of 'security' (bsc#1192606).\n- cifs: Fix support for remount when not changing rsize/wsize (bsc#1192606).\n- cifs: Fix task struct use-after-free on reconnect (bsc#1164565).\n- cifs: Fix the target file was deleted when rename failed (bsc#1192606).\n- cifs: Fix unix perm bits to cifsacl conversion for 'other' bits (bsc#1192606).\n- cifs: Fix use after free of file info structures (bnc#1151927 5.3.8).\n- cifs: Fix use-after-free bug in cifs_reconnect() (bsc#1164565).\n- cifs: Force reval dentry if LOOKUP_REVAL flag is set (bnc#1151927 5.3.7).\n- cifs: Force revalidate inode when dentry is stale (bnc#1151927 5.3.7).\n- cifs: Get rid of kstrdup_const()'d paths (bsc#1164565).\n- cifs: Grab a reference for the dentry of the cached directory during the lifetime of the cache (bsc#1192606).\n- cifs: Gracefully handle QueryInfo errors during open (bnc#1151927 5.3.7).\n- cifs: Handle witness client move notification (bsc#1192606).\n- cifs: Identify a connection by a conn_id (bsc#1192606).\n- cifs: If a corrupted DACL is returned by the server, bail out (bsc#1192606).\n- cifs: In the new mount api we get the full devname as source= (bsc#1192606).\n- cifs: Increment num_remote_opens stats counter even in case of smb2_query_dir_first (bsc#1192606).\n- cifs: Introduce helpers for finding TCP connection (bsc#1164565).\n- cifs: Make extract_hostname function public (bsc#1192606).\n- cifs: Make extract_sharename function public (bsc#1192606).\n- cifs: Merge is_path_valid() into get_normalized_path() (bsc#1164565).\n- cifs: Move SMB2_Create definitions to the shared area (bsc#1192606).\n- cifs: Move more definitions into the shared area (bsc#1192606).\n- cifs: New optype for session operations (bsc#1181507).\n- cifs: On cifs_reconnect, resolve the hostname again (bsc#1192606).\n- cifs: Optimize readdir on reparse points (bsc#1164565).\n- cifs: Print the address and port we are connecting to in generic_ip_connect() (bsc#1192606).\n- cifs: Properly process SMB3 lease breaks (bsc#1164565).\n- cifs: Re-indent cifs_swn_reconnect() (bsc#1192606).\n- cifs: Reformat DebugData and index connections by conn_id (bsc#1192606).\n- cifs: Register generic netlink family (bsc#1192606). Update configs with CONFIG_SWN_UPCALL unset.\n- cifs: Remove the superfluous break (bsc#1192606).\n- cifs: Remove unused inline function is_sysvol_or_netlogon() (bsc#1185902).\n- cifs: Remove useless variable (bsc#1192606).\n- cifs: Respect O_SYNC and O_DIRECT flags during reconnect (bsc#1164565).\n- cifs: Retain old ACEs when converting between mode bits and ACL (bsc#1192606).\n- cifs: Return correct error code from smb2_get_enc_key (git-fixes).\n- cifs: Return directly after a failed build_path_from_dentry() in cifs_do_create() (bsc#1164565).\n- cifs: Return the error from crypt_message when enc/dec key not found (bsc#1179426).\n- cifs: Send witness register and unregister commands to userspace daemon (bsc#1192606).\n- cifs: Send witness register messages to userspace daemon in echo task (bsc#1192606).\n- cifs: Set CIFS_MOUNT_USE_PREFIX_PATH flag on setting cifs_sb-\u003eprepath (bsc#1192606).\n- cifs: Set witness notification handler for messages from userspace daemon (bsc#1192606).\n- cifs: Silently ignore unknown oplock break handle (bsc#1192606).\n- cifs: Simplify reconnect code when dfs upcall is enabled (bsc#1192606).\n- cifs: Spelling s/EACCESS/EACCES/ (bsc#1192606).\n- cifs: Standardize logging output (bsc#1192606).\n- cifs: To match file servers, make sure the server hostname matches (bsc#1192606).\n- cifs: Tracepoints and logs for tracing credit changes (bsc#1181507).\n- cifs: Unlock on errors in cifs_swn_reconnect() (bsc#1192606).\n- cifs: Use #define in cifs_dbg (bsc#1164565).\n- cifs: Use common error handling code in smb2_ioctl_query_info() (bsc#1164565).\n- cifs: Use memdup_user() rather than duplicating its implementation (bsc#1164565).\n- cifs: Warn less noisily on default mount (bsc#1192606).\n- cifs: add FALLOC_FL_INSERT_RANGE support (bsc#1192606).\n- cifs: add NULL check for ses-\u003etcon_ipc (bsc#1178270).\n- cifs: add SMB2_open() arg to return POSIX data (bsc#1164565).\n- cifs: add SMB3 change notification support (bsc#1164565).\n- cifs: add a debug macro that prints \\\\server\\share for errors (bsc#1164565).\n- cifs: add a function to get a cached dir based on its dentry (bsc#1192606).\n- cifs: add a helper to find an existing readable handle to a file (bsc#1154355).\n- cifs: add a timestamp to track when the lease of the cached dir was taken (bsc#1192606).\n- cifs: add an smb3_fs_context to cifs_sb (bsc#1192606).\n- cifs: add files to host new mount api (bsc#1192606).\n- cifs: add fs_context param to parsing helpers (bsc#1192606).\n- cifs: add initial reconfigure support (bsc#1192606).\n- cifs: add missing mount option to /proc/mounts (bsc#1164565).\n- cifs: add missing parsing of backupuid (bsc#1192606).\n- cifs: add mount parameter tcpnodelay (bsc#1192606).\n- cifs: add multichannel mount options and data structs (bsc#1192606).\n- cifs: add new debugging macro cifs_server_dbg (bsc#1164565).\n- cifs: add passthrough for smb2 setinfo (bsc#1164565).\n- cifs: add server param (bsc#1192606).\n- cifs: add shutdown support (bsc#1192606).\n- cifs: add smb 2 support for getting and setting SACLs (bsc#1192606).\n- cifs: add smb2 POSIX info level (bsc#1164565).\n- cifs: add support for FALLOC_FL_COLLAPSE_RANGE (bsc#1192606).\n- cifs: add support for fallocate mode 0 for non-sparse files (bsc#1164565).\n- cifs: add support for flock (bsc#1164565).\n- cifs: add witness mount option and data structs (bsc#1192606).\n- cifs: added WARN_ON for all the count decrements (bsc#1192606).\n- cifs: allocate buffer in the caller of build_path_from_dentry() (bsc#1192606).\n- cifs: allow chmod to set mode bits using special sid (bsc#1164565).\n- cifs: allow syscalls to be restarted in __smb_send_rqst() (bsc#1176956).\n- cifs: allow unlock flock and OFD lock across fork (bsc#1192606).\n- cifs: ask for more credit on async read/write code paths (bsc#1192606).\n- cifs: avoid extra calls in posix_info_parse (bsc#1192606).\n- cifs: avoid starvation when refreshing dfs cache (bsc#1185902).\n- cifs: avoid using MID 0xFFFF (bnc#1151927 5.3.8).\n- cifs: call wake_up(\u0026server-\u003eresponse_q) inside of cifs_reconnect() (bsc#1164565).\n- cifs: change confusing field serverName (to ip_addr) (bsc#1192606).\n- cifs: change format of CIFS_FULL_KEY_DUMP ioctl (bsc#1192606).\n- cifs: change noisy error message to FYI (bsc#1181507).\n- cifs: check all path components in resolved dfs target (bsc#1181710).\n- cifs: check new file size when extending file by fallocate (bsc#1192606).\n- cifs: check pointer before freeing (bsc#1183534).\n- cifs: check the timestamp for the cached dirent when deciding on revalidate (bsc#1192606).\n- cifs: cifs: we do not allow changing username/password/unc/... during remount (bsc#1192606).\n- cifs: cifs_atomic_open(): fix double-put on late allocation failure (bsc#1192606).\n- cifs: cifs_debug: use %pd instead of messing with -\u003ed_name (bsc#1192606).\n- cifs: cifs_md4 convert to SPDX identifier (bsc#1192606).\n- cifs: cifspdu.h: Replace one-element array with flexible-array member (bsc#1192606).\n- cifs: cifspdu.h: Replace zero-length array with flexible-array member (bsc#1192606).\n- cifs: clarify SMB1 code for UnixCreateHardLink (bsc#1192606).\n- cifs: clarify comment about timestamp granularity for old servers (bsc#1192606).\n- cifs: clarify hostname vs ip address in /proc/fs/cifs/DebugData (bsc#1192606).\n- cifs: cleanup a few le16 vs. le32 uses in cifsacl.c (bsc#1192606).\n- cifs: cleanup misc.c (bsc#1192606).\n- cifs: clear PF_MEMALLOC before exiting demultiplex thread (bsc#1192606).\n- cifs: close the shared root handle on tree disconnect (bsc#1164565).\n- cifs: compute full_path already in cifs_readdir() (bsc#1192606).\n- cifs: connect individual channel servers to primary channel server (bsc#1192606).\n- cifs: connect: style: Simplify bool comparison (bsc#1192606).\n- cifs: constify get_normalized_path() properly (bsc#1185902).\n- cifs: constify path argument of -\u003emake_node() (bsc#1192606).\n- cifs: constify pathname arguments in a bunch of helpers (bsc#1192606).\n- cifs: convert list_for_each to entry variant (bsc#1192606, jsc#SLE-20042).\n- cifs: convert list_for_each to entry variant in cifs_debug.c (bsc#1192606).\n- cifs: convert list_for_each to entry variant in smb2misc.c (bsc#1192606).\n- cifs: convert revalidate of directories to using directory metadata cache timeout (bsc#1192606).\n- cifs: convert to use be32_add_cpu() (bsc#1192606).\n- cifs: correct comments explaining internal semaphore usage in the module (bsc#1192606).\n- cifs: correct four aliased mount parms to allow use of previous names (bsc#1192606).\n- cifs: create a MD4 module and switch cifs.ko to use it (bsc#1192606).\n- cifs: create a helper function to parse the query-directory response buffer (bsc#1164565).\n- cifs: create a helper to find a writeable handle by path name (bsc#1154355).\n- cifs: create sd context must be a multiple of 8 (bsc#1192606).\n- cifs: delete duplicated words in header files (bsc#1192606).\n- cifs: detect dead connections only when echoes are enabled (bsc#1192606).\n- cifs: do d_move in rename (bsc#1164565).\n- cifs: do not allow changing posix_paths during remount (bsc#1192606).\n- cifs: do not cargo-cult strndup() (bsc#1185902).\n- cifs: do not create a temp nls in cifs_setup_ipc (bsc#1192606).\n- cifs: do not disable noperm if multiuser mount option is not provided (bsc#1192606).\n- cifs: do not duplicate fscache cookie for secondary channels (bsc#1192606).\n- cifs: do not fail __smb_send_rqst if non-fatal signals are pending (git-fixes).\n- cifs: do not ignore the SYNC flags in getattr (bsc#1164565).\n- cifs: do not leak -EAGAIN for stat() during reconnect (bsc#1164565).\n- cifs: do not negotiate session if session already exists (bsc#1192606).\n- cifs: do not send close in compound create+close requests (bsc#1181507).\n- cifs: do not send tree disconnect to ipc shares (bsc#1185902).\n- cifs: do not share tcons with DFS (bsc#1178270).\n- cifs: do not share tcp servers with dfs mounts (bsc#1185902).\n- cifs: do not share tcp sessions of dfs connections (bsc#1185902).\n- cifs: do not use 'pre:' for MODULE_SOFTDEP (bsc#1164565).\n- cifs: do_cifs_create(): do not set -\u003ei_mode of something we had not created (bsc#1192606).\n- cifs: document and cleanup dfs mount (bsc#1178270).\n- cifs: dump Security Type info in DebugData (bsc#1192606).\n- cifs: dump channel info in DebugData (bsc#1192606).\n- cifs: dump the session id and keys also for SMB2 sessions (bsc#1192606).\n- cifs: enable change notification for SMB2.1 dialect (bsc#1164565).\n- cifs: enable extended stats by default (bsc#1192606).\n- cifs: ensure correct super block for DFS reconnect (bsc#1178270).\n- cifs: escape spaces in share names (bsc#1192606).\n- cifs: export supported mount options via new mount_params /proc file (bsc#1192606).\n- cifs: fail i/o on soft mounts if sessionsetup errors out (bsc#1164565).\n- cifs: fiemap: do not return EINVAL if get nothing (bsc#1192606).\n- cifs: fix DFS failover (bsc#1192606).\n- cifs: fix DFS mount with cifsacl/modefromsid (bsc#1178270).\n- cifs: fix NULL dereference in match_prepath (bsc#1164565).\n- cifs: fix NULL dereference in smb2_check_message() (bsc#1192606).\n- cifs: fix SMB1 error path in cifs_get_file_info_unix (bsc#1192606).\n- cifs: fix a comment for the timeouts when sending echos (bsc#1164565).\n- cifs: fix a memleak with modefromsid (bsc#1192606).\n- cifs: fix a sign extension bug (bsc#1192606).\n- cifs: fix a white space issue in cifs_get_inode_info() (bsc#1164565).\n- cifs: fix allocation size on newly created files (bsc#1192606).\n- cifs: fix channel signing (bsc#1192606).\n- cifs: fix check of dfs interlinks (bsc#1185902).\n- cifs: fix check of tcon dfs in smb1 (bsc#1178270).\n- cifs: fix chown and chgrp when idsfromsid mount option enabled (bsc#1192606).\n- cifs: fix credit accounting for extra channel (bsc#1192606).\n- cifs: fix dereference on ses before it is null checked (bsc#1164565).\n- cifs: fix dfs domain referrals (bsc#1192606).\n- cifs: fix dfs-links (bsc#1192606).\n- cifs: fix doc warnings in cifs_dfs_ref.c (bsc#1192606).\n- cifs: fix double free error on share and prefix (bsc#1178270).\n- cifs: fix fallocate when trying to allocate a hole (bsc#1192606).\n- cifs: fix handling of escaped ',' in the password mount argument (bsc#1192606).\n- cifs: fix incorrect check for null pointer in header_assemble (bsc#1192606).\n- cifs: fix incorrect kernel doc comments (bsc#1192606).\n- cifs: fix interrupted close commands (git-fixes).\n- cifs: fix ipv6 formating in cifs_ses_add_channel (bsc#1192606).\n- cifs: fix leak in cifs_smb3_do_mount() ctx (bsc#1192606).\n- cifs: fix leaked reference on requeued write (bsc#1178270).\n- cifs: fix max ea value size (bnc#1151927 5.3.4).\n- cifs: fix memory leak in smb2_copychunk_range (git-fixes).\n- cifs: fix memory leak of smb3_fs_context_dup::server_hostname (bsc#1192606).\n- cifs: fix minor typos in comments and log messages (bsc#1192606).\n- cifs: fix missing null session check in mount (bsc#1192606).\n- cifs: fix missing spinlock around update to ses-\u003estatus (bsc#1192606).\n- cifs: fix mode bits from dir listing when mounted with modefromsid (bsc#1164565).\n- cifs: fix mount option display for sec=krb5i (bsc#1161907).\n- cifs: fix mounts to subdirectories of target (bsc#1192606).\n- cifs: fix nodfs mount option (bsc#1181710).\n- cifs: fix out-of-bound memory access when calling smb3_notify() at mount point (bsc#1192606).\n- cifs: fix path comparison and hash calc (bsc#1185902).\n- cifs: fix possible uninitialized access and race on iface_list (bsc#1192606).\n- cifs: fix potential mismatch of UNC paths (bsc#1164565).\n- cifs: fix potential use-after-free bugs (bsc#1192606, jsc#SLE-20042).\n- cifs: fix potential use-after-free in cifs_echo_request() (bsc#1139944).\n- cifs: fix print of hdr_flags in dfscache_proc_show() (bsc#1192606, jsc#SLE-20042).\n- cifs: fix reference leak for tlink (bsc#1192606).\n- cifs: fix regression when mounting shares with prefix paths (bsc#1192606).\n- cifs: fix rename() by ensuring source handle opened with DELETE bit (bsc#1164565).\n- cifs: fix rsize/wsize to be negotiated values (bsc#1192606).\n- cifs: fix soft mounts hanging in the reconnect code (bsc#1164565).\n- cifs: fix soft mounts hanging in the reconnect code (bsc#1164565).\n- cifs: fix string declarations and assignments in tracepoints (bsc#1192606).\n- cifs: fix the out of range assignment to bit fields in parse_server_interfaces (bsc#1192606).\n- cifs: fix trivial typo (bsc#1192606).\n- cifs: fix uninitialised lease_key in open_shroot() (bsc#1178270).\n- cifs: fix uninitialized variable in smb3_fs_context_parse_param (bsc#1192606).\n- cifs: fix unitialized variable poential problem with network I/O cache lock patch (bsc#1164565).\n- cifs: fix unneeded null check (bsc#1192606).\n- cifs: fix use after free in cifs_smb3_do_mount() (bsc#1192606).\n- cifs: fix wrong release in sess_alloc_buffer() failed path (bsc#1192606).\n- cifs: for compound requests, use open handle if possible (bsc#1192606).\n- cifs: fork arc4 and create a separate module for it for cifs and other users (bsc#1192606).\n- cifs: get mode bits from special sid on stat (bsc#1164565).\n- cifs: get rid of @noreq param in __dfs_cache_find() (bsc#1185902).\n- cifs: get rid of cifs_sb-\u003emountdata (bsc#1192606).\n- cifs: get rid of unused parameter in reconn_setup_dfs_targets() (bsc#1178270).\n- cifs: handle 'guest' mount parameter (bsc#1192606).\n- cifs: handle 'nolease' option for vers=1.0 (bsc#1192606).\n- cifs: handle -EINTR in cifs_setattr (bsc#1192606).\n- cifs: handle ERRBaduid for SMB1 (bsc#1192606).\n- cifs: handle RESP_GET_DFS_REFERRAL.PathConsumed in reconnect (bsc#1178270).\n- cifs: handle different charsets in dfs cache (bsc#1185902).\n- cifs: handle empty list of targets in cifs_reconnect() (bsc#1178270).\n- cifs: handle hostnames that resolve to same ip in failover (bsc#1178270).\n- cifs: handle prefix paths in reconnect (bsc#1164565).\n- cifs: handle reconnect of tcon when there is no cached dfs referral (bsc#1192606).\n- cifs: have -\u003emkdir() handle race with another client sanely (bsc#1192606).\n- cifs: have cifs_fattr_to_inode() refuse to change type on live inode (bsc#1192606).\n- cifs: ignore auto and noauto options if given (bsc#1192606).\n- cifs: ignore cached share root handle closing errors (bsc#1166780).\n- cifs: improve fallocate emulation (bsc#1192606).\n- cifs: improve read performance for page size 64KB \u0026 cache=strict \u0026 vers=2.1+ (bsc#1192606).\n- cifs: introduce cifs_ses_mark_for_reconnect() helper (bsc#1192606).\n- cifs: introduce helper for finding referral server (bsc#1181710).\n- cifs: introduce new helper for cifs_reconnect() (bsc#1192606, jsc#SLE-20042).\n- cifs: keep referral server sessions alive (bsc#1185902).\n- cifs: log mount errors using cifs_errorf() (bsc#1192606).\n- cifs: log warning message (once) if out of disk space (bsc#1164565).\n- cifs: make build_path_from_dentry() return const char * (bsc#1192606).\n- cifs: make const array static, makes object smaller (bsc#1192606).\n- cifs: make fs_context error logging wrapper (bsc#1192606).\n- cifs: make locking consistent around the server session status (bsc#1192606).\n- cifs: make multichannel warning more visible (bsc#1192606).\n- cifs: make sure we do not overflow the max EA buffer size (bsc#1164565).\n- cifs: make use of cap_unix(ses) in cifs_reconnect_tcon() (bsc#1164565).\n- cifs: map STATUS_ACCOUNT_LOCKED_OUT to -EACCES (bsc#1192606).\n- cifs: merge __{cifs,smb2}_reconnect[_tcon]() into cifs_tree_connect() (bsc#1178270).\n- cifs: minor fix to two debug messages (bsc#1192606).\n- cifs: minor kernel style fixes for comments (bsc#1192606).\n- cifs: minor simplification to smb2_is_network_name_deleted (bsc#1192606).\n- cifs: minor update to comments around the cifs_tcp_ses_lock mutex (bsc#1192606).\n- cifs: minor updates to Kconfig (bsc#1192606).\n- cifs: misc: Use array_size() in if-statement controlling expression (bsc#1192606).\n- cifs: missed ref-counting smb session in find (bsc#1192606).\n- cifs: missing null check for newinode pointer (bsc#1192606).\n- cifs: missing null pointer check in cifs_mount (bsc#1185902).\n- cifs: modefromsid: make room for 4 ACE (bsc#1164565).\n- cifs: modefromsid: write mode ACE first (bsc#1164565).\n- cifs: move NEGOTIATE_PROTOCOL definitions out into the common area (bsc#1192606).\n- cifs: move SMB FSCTL definitions to common code (bsc#1192606).\n- cifs: move [brw]size from cifs_sb to cifs_sb-\u003ectx (bsc#1192606).\n- cifs: move cache mount options to fs_context.ch (bsc#1192606).\n- cifs: move cifsFileInfo_put logic into a work-queue (bsc#1154355).\n- cifs: move cifs_cleanup_volume_info[_content] to fs_context.c (bsc#1192606).\n- cifs: move cifs_parse_devname to fs_context.c (bsc#1192606).\n- cifs: move debug print out of spinlock (bsc#1192606).\n- cifs: move security mount options into fs_context.ch (bsc#1192606).\n- cifs: move smb version mount options into fs_context.c (bsc#1192606).\n- cifs: move some variables off the stack in smb2_ioctl_query_info (bsc#1192606).\n- cifs: move the check for nohandlecache into open_shroot (bsc#1192606).\n- cifs: move the enum for cifs parameters into fs_context.h (bsc#1192606).\n- cifs: move update of flags into a separate function (bsc#1192606).\n- cifs: multichannel: always zero struct cifs_io_parms (bsc#1192606).\n- cifs: multichannel: move channel selection above transport layer (bsc#1192606).\n- cifs: multichannel: move channel selection in function (bsc#1192606).\n- cifs: multichannel: try to rebind when reconnecting a channel (bsc#1192606).\n- cifs: multichannel: use pointer for binding channel (bsc#1192606).\n- cifs: nosharesock should be set on new server (bsc#1192606).\n- cifs: nosharesock should not share socket with future sessions (bsc#1192606).\n- cifs: only update prefix path of DFS links in cifs_tree_connect() (bsc#1178270).\n- cifs: only write 64kb at a time when fallocating a small region of a file (bsc#1192606).\n- cifs: pass a path to open_shroot and check if it is the root or not (bsc#1192606).\n- cifs: pass the dentry instead of the inode down to the revalidation check functions (bsc#1192606).\n- cifs: plumb smb2 POSIX dir enumeration (bsc#1164565).\n- cifs: populate server_hostname for extra channels (bsc#1192606).\n- cifs: potential unintitliazed error code in cifs_getattr() (bsc#1164565).\n- cifs: prepare SMB2_Flush to be usable in compounds (bsc#1154355).\n- cifs: prepare SMB2_query_directory to be used with compounding (bsc#1164565).\n- cifs: prevent NULL deref in cifs_compose_mount_options() (bsc#1185902).\n- cifs: prevent truncation from long to int in wait_for_free_credits (bsc#1192606).\n- cifs: print MIDs in decimal notation (bsc#1181507).\n- cifs: print warning mounting with vers=1.0 (bsc#1164565).\n- cifs: properly invalidate cached root handle when closing it (bsc#1192606).\n- cifs: protect session channel fields with chan_lock (bsc#1192606).\n- cifs: protect srv_count with cifs_tcp_ses_lock (bsc#1192606).\n- cifs: protect updating server-\u003edstaddr with a spinlock (bsc#1192606).\n- cifs: reduce number of referral requests in DFS link lookups (bsc#1178270).\n- cifs: reduce stack use in smb2_compound_op (bsc#1192606).\n- cifs: refactor cifs_get_inode_info() (bsc#1164565).\n- cifs: refactor create_sd_buf() and and avoid corrupting the buffer (bsc#1192606).\n- cifs: release lock earlier in dequeue_mid error case (bsc#1192606).\n- cifs: remove [gu]id/backup[gu]id/file_mode/dir_mode from cifs_sb (bsc#1192606).\n- cifs: remove actimeo from cifs_sb (bsc#1192606).\n- cifs: remove bogus debug code (bsc#1179427).\n- cifs: remove ctx argument from cifs_setup_cifs_sb (bsc#1192606).\n- cifs: remove duplicated prototype (bsc#1192606).\n- cifs: remove old dead code (bsc#1192606).\n- cifs: remove pathname for file from SPDX header (bsc#1192606).\n- cifs: remove redundant assignment to pointer pneg_ctxt (bsc#1164565).\n- cifs: remove redundant assignment to variable rc (bsc#1164565).\n- cifs: remove redundant initialization of variable rc (bsc#1192606).\n- cifs: remove redundant initialization of variable rc (bsc#1192606).\n- cifs: remove set but not used variable 'server' (bsc#1164565).\n- cifs: remove set but not used variables 'cinode' and 'netfid' (bsc#1164565).\n- cifs: remove set but not used variables (bsc#1164565).\n- cifs: remove some minor warnings pointed out by kernel test robot (bsc#1192606).\n- cifs: remove the devname argument to cifs_compose_mount_options (bsc#1192606).\n- cifs: remove the retry in cifs_poxis_lock_set (bsc#1192606).\n- cifs: remove two cases where rc is set unnecessarily in sid_to_id (bsc#1192606).\n- cifs: remove unnecessary copies of tcon-\u003ecrfid.fid (bsc#1192606).\n- cifs: remove unused variable 'server' (bsc#1192606).\n- cifs: remove unused variable 'sid_user' (bsc#1164565).\n- cifs: remove unused variable (bsc#1164565).\n- cifs: remove various function description warnings (bsc#1192606).\n- cifs: rename a variable in SendReceive() (bsc#1164565).\n- cifs: rename cifs_common to smbfs_common (bsc#1192606).\n- cifs: rename dup_vol to smb3_fs_context_dup and move it into fs_context.c (bsc#1192606).\n- cifs: rename posix create rsp (bsc#1164565).\n- cifs: rename reconn_inval_dfs_target() (bsc#1178270).\n- cifs: rename smb_vol as smb3_fs_context and move it to fs_context.h (bsc#1192606).\n- cifs: rename the *_shroot* functions to *_cached_dir* (bsc#1192606).\n- cifs: replace http links with https ones (bsc#1192606).\n- cifs: report error instead of invalid when revalidating a dentry fails (bsc#1177440).\n- cifs: retry lookup and readdir when EAGAIN is returned (bsc#1192606).\n- cifs: return cached_fid from open_shroot (bsc#1192606).\n- cifs: return proper error code in statfs(2) (bsc#1181507).\n- cifs: returning mount parm processing errors correctly (bsc#1192606).\n- cifs: revalidate mapping when we open files for SMB1 POSIX (bsc#1192606).\n- cifs: send workstation name during ntlmssp session setup (bsc#1192606).\n- cifs: set a minimum of 120s for next dns resolution (bsc#1192606).\n- cifs: set a minimum of 2 minutes for refreshing dfs cache (bsc#1185902).\n- cifs: set correct max-buffer-size for smb2_ioctl_init() (bsc#1164565).\n- cifs: set server-\u003ecipher_type to AES-128-CCM for SMB3.0 (bsc#1192606).\n- cifs: set up next DFS target before generic_ip_connect() (bsc#1178270).\n- cifs: simplify SWN code with dummy funcs instead of ifdefs (bsc#1192606).\n- cifs: simplify handling of cifs_sb/ctx-\u003elocal_nls (bsc#1192606).\n- cifs: smb1: Try failing back to SetFileInfo if SetPathInfo fails (bsc#1192606).\n- cifs: smb2pdu.h: Replace zero-length array with flexible-array member (bsc#1192606).\n- cifs: smb3: Fix data inconsistent when punch hole (bsc#1176544).\n- cifs: smb3: Fix data inconsistent when zero file range (bsc#1176536).\n- cifs: smbd: Add messages on RDMA session destroy and reconnection (bsc#1164565).\n- cifs: smbd: Calculate the correct maximum packet size for segmented SMBDirect send/receive (bsc#1192606).\n- cifs: smbd: Check and extend sender credits in interrupt context (bsc#1192606).\n- cifs: smbd: Check send queue size before posting a send (bsc#1192606).\n- cifs: smbd: Do not schedule work to send immediate packet on every receive (bsc#1192606).\n- cifs: smbd: Invalidate and deregister memory registration on re-send for direct I/O (bsc#1164565).\n- cifs: smbd: Merge code to track pending packets (bsc#1192606).\n- cifs: smbd: Only queue work for error recovery on memory registration (bsc#1164565).\n- cifs: smbd: Properly process errors on ib_post_send (bsc#1192606).\n- cifs: smbd: Return -EAGAIN when transport is reconnecting (bsc#1164565).\n- cifs: smbd: Return -ECONNABORTED when trasnport is not in connected state (bsc#1164565).\n- cifs: smbd: Return -EINVAL when the number of iovs exceeds SMBDIRECT_MAX_SGE (bsc#1164565).\n- cifs: smbd: Update receive credits before sending and deal with credits roll back on failure before sending (bsc#1192606).\n- cifs: sort interface list by speed (bsc#1192606).\n- cifs: split out dfs code from cifs_reconnect() (bsc#1192606, jsc#SLE-20042).\n- cifs: store a pointer to the root dentry in cifs_sb_info once we have completed mounting the share (bsc#1192606).\n- cifs: style: replace one-element array with flexible-array (bsc#1192606).\n- cifs: support nested dfs links over reconnect (bsc#1192606, jsc#SLE-20042).\n- cifs: support share failover when remounting (bsc#1192606, jsc#SLE-20042).\n- cifs: switch build_path_from_dentry() to using dentry_path_raw() (bsc#1192606).\n- cifs: switch servers depending on binding state (bsc#1192606).\n- cifs: switch to new mount api (bsc#1192606).\n- cifs: try harder to open new channels (bsc#1192606).\n- cifs: try opening channels after mounting (bsc#1192606).\n- cifs: uncomplicate printing the iocharset parameter (bsc#1192606).\n- cifs: update FSCTL definitions (bsc#1192606).\n- cifs: update ctime and mtime during truncate (bsc#1192606).\n- cifs: update internal module version number (bsc#1192606).\n- cifs: update internal module version number (bsc#1192606).\n- cifs: update internal module version number (bsc#1192606).\n- cifs: update internal module version number (bsc#1192606).\n- cifs: update internal module version number (bsc#1192606).\n- cifs: update internal module version number (bsc#1192606).\n- cifs: update internal module version number (bsc#1192606).\n- cifs: update internal module version number (bsc#1192606).\n- cifs: update internal version number (bsc#1192606).\n- cifs: update internal version number (bsc#1192606).\n- cifs: update internal version number (bsc#1192606).\n- cifs: update internal version number (bsc#1192606).\n- cifs: update mnt_cifs_flags during reconfigure (bsc#1192606).\n- cifs: update new ACE pointer after populate_new_aces (bsc#1192606).\n- cifs: update super_operations to show_devname (bsc#1192606).\n- cifs: use PTR_ERR_OR_ZERO() to simplify code (bsc#1164565).\n- cifs: use SPDX-Licence-Identifier (bsc#1192606).\n- cifs: use cifsInodeInfo-\u003eopen_file_lock while iterating to avoid a panic (bnc#1151927 5.3.7).\n- cifs: use compounding for open and first query-dir for readdir() (bsc#1164565).\n- cifs: use discard iterator to discard unneeded network data more efficiently (bsc#1192606).\n- cifs: use echo_interval even when connection not ready (bsc#1192606).\n- cifs: use existing handle for compound_op(OP_SET_INFO) when possible (bsc#1154355).\n- cifs: use helpers when parsing uid/gid mount options and validate them (bsc#1192606).\n- cifs: use mod_delayed_work() for \u0026server-\u003ereconnect if already queued (bsc#1164565).\n- cifs: use the expiry output of dns_query to schedule next resolution (bsc#1192606).\n- cifs: warn and fail if trying to use rootfs without the config option (bsc#1192606).\n- clk: imx: imx6ul: Move csi_sel mux to correct base register (git-fixes).\n- clk: ingenic: Fix bugs with divided dividers (git-fixes).\n- constraints: Build aarch64 on recent ARMv8.1 builders. Request asimdrdm feature which is available only on recent ARMv8.1 CPUs. This should prevent scheduling the kernel on an older slower builder.\n- crypto: ecc - fix CRYPTO_DEFAULT_RNG dependency (git-fixes).\n- crypto: s5p-sss - Add error handling in s5p_aes_probe() (git-fixes).\n- cxgb4: fix eeprom len when diagnostics not implemented (git-fixes).\n- dm raid: remove unnecessary discard limits for raid0 and raid10 (bsc#1192320).\n- dm: fix deadlock when swapping to encrypted device (bsc#1186332).\n- dmaengine: at_xdmac: fix AT_XDMAC_CC_PERID() macro (git-fixes).\n- dmaengine: dmaengine_desc_callback_valid(): Check for `callback_result` (git-fixes).\n- drm/amd/display: Set plane update flags for all planes in reset (git-fixes).\n- drm/amdgpu: fix set scaling mode Full/Full aspect/Center not works on vga and dvi connectors (git-fixes).\n- drm/msm/a6xx: Allocate enough space for GMU registers (git-fixes).\n- drm/msm: Do hw_init() before capturing GPU state (git-fixes).\n- drm/nouveau/acr: fix a couple NULL vs IS_ERR() checks (git-fixes).\n- drm/nouveau/svm: Fix refcount leak bug and missing check against null bug (git-fixes).\n- drm/nouveau: hdmigv100.c: fix corrupted HDMI Vendor InfoFrame (git-fixes).\n- drm/pl111: Actually fix CONFIG_VEXPRESS_CONFIG depends (git-fixes).\n- drm/plane-helper: fix uninitialized variable reference (git-fixes).\n- drm/vc4: fix error code in vc4_create_object() (git-fixes).\n- drm: panel-orientation-quirks: Add quirk for Aya Neo 2021 (git-fixes).\n- drm: panel-orientation-quirks: Add quirk for GPD Win3 (git-fixes).\n- drm: panel-orientation-quirks: Add quirk for KD Kurio Smart C15200 2-in-1 (git-fixes).\n- drm: panel-orientation-quirks: Add quirk for the Samsung Galaxy Book 10.6 (git-fixes).\n- drm: panel-orientation-quirks: Update the Lenovo Ideapad D330 quirk (v2) (git-fixes).\n- drm: panel-orientation-quirks: add Valve Steam Deck (git-fixes).\n- edac/amd64: Handle three rank interleaving mode (bsc#1152489).\n- elfcore: correct reference to CONFIG_UML (git-fixes).\n- elfcore: fix building with clang (bsc#1169514).\n- ethtool: fix ethtool msg len calculation for pause stats (jsc#SLE-15075).\n- firmware: qcom_scm: Mark string array const (git-fixes).\n- fix memory leak in large read decrypt offload (bsc#1164565).\n- fs: cifs: Assign boolean values to a bool variable (bsc#1192606).\n- fs: cifs: Fix atime update check vs mtime (bsc#1164565).\n- fs: cifs: Fix resource leak (bsc#1192606).\n- fs: cifs: Initialize filesystem timestamp ranges (bsc#1164565).\n- fs: cifs: Remove repeated struct declaration (bsc#1192606).\n- fs: cifs: Remove unnecessary struct declaration (bsc#1192606).\n- fs: cifs: Simplify bool comparison (bsc#1192606).\n- fs: cifs: cifssmb.c: use true,false for bool variable (bsc#1164565).\n- fs: cifs: cifsssmb: remove redundant assignment to variable ret (bsc#1164565).\n- fs: cifs: fix gcc warning in sid_to_id (bsc#1192606).\n- fs: cifs: fix misspellings using codespell tool (bsc#1192606).\n- fs: cifs: mute -Wunused-const-variable message (bnc#1151927 5.3.9).\n- fs: cifs: remove unneeded variable in smb3_fs_context_dup (bsc#1192606).\n- fs: cifs: sess.c: Remove set but not used variable 'capabilities' (bsc#1164565).\n- fs: cifs: smb2ops.c: use true,false for bool variable (bsc#1164565).\n- fs: cifs: smb2pdu.c: Make SMB2_notify_init static (bsc#1164565).\n- fuse: release pipe buf after last use (bsc#1193318).\n- gve: Add netif_set_xps_queue call (bsc#1176940).\n- gve: Add rx buffer pagecnt bias (bsc#1176940).\n- gve: Allow pageflips on larger pages (bsc#1176940).\n- gve: DQO: avoid unused variable warnings (bsc#1176940).\n- gve: Do lazy cleanup in TX path (git-fixes).\n- gve: Switch to use napi_complete_done (git-fixes).\n- gve: Track RX buffer allocation failures (bsc#1176940).\n- handle status_io_timeout gracefully (bsc#1192606).\n- hwmon: (k10temp) Add additional missing Zen2 and Zen3 APUs (jsc#SLE-17823 jsc#SLE-23139 jsc#ECO-3666).\n- hwmon: (k10temp) Add support for Zen3 CPUs (jsc#SLE-17823 jsc#SLE-23139 jsc#ECO-3666).\n- hwmon: (k10temp) Add support for yellow carp (jsc#SLE-17823 jsc#SLE-23139 jsc#ECO-3666).\n- hwmon: (k10temp) Create common functions and macros for Zen CPU families (jsc#SLE-17823 jsc#SLE-23139 jsc#ECO-3666).\n- hwmon: (k10temp) Define SVI telemetry and current factors for Zen2 CPUs (jsc#SLE-17823 jsc#SLE-23139 jsc#ECO-3666).\n- hwmon: (k10temp) Do not show Tdie for all Zen/Zen2/Zen3 CPU/APU (jsc#SLE-17823 jsc#SLE-23139 jsc#ECO-3666).\n- hwmon: (k10temp) Remove residues of current and voltage (jsc#SLE-17823 jsc#SLE-23139 jsc#ECO-3666).\n- hwmon: (k10temp) Remove support for displaying voltage and current on Zen CPUs (jsc#SLE-17823 jsc#SLE-23139 jsc#ECO-3666).\n- hwmon: (k10temp) Reorganize and simplify temperature support detection (jsc#SLE-17823 jsc#SLE-23139 jsc#ECO-3666).\n- hwmon: (k10temp) Rework the temperature offset calculation (jsc#SLE-17823 jsc#SLE-23139 jsc#ECO-3666).\n- hwmon: (k10temp) Swap Tdie and Tctl on Family 17h CPUs (jsc#SLE-17823 jsc#SLE-23139 jsc#ECO-3666).\n- hwmon: (k10temp) Update documentation and add temp2_input info (jsc#SLE-17823 jsc#SLE-23139 jsc#ECO-3666).\n- hwmon: (k10temp) Update driver documentation (jsc#SLE-17823 jsc#SLE-23139 jsc#ECO-3666).\n- hwmon: (k10temp) Zen3 Ryzen Desktop CPUs support (jsc#SLE-17823 jsc#SLE-23139 jsc#ECO-3666).\n- hwmon: (k10temp) make some symbols static (jsc#SLE-17823 jsc#SLE-23139 jsc#ECO-3666).\n- hwmon: (k10temp) support Zen3 APUs (jsc#SLE-17823 jsc#SLE-23139 jsc#ECO-3666).\n- i2c: cbus-gpio: set atomic transfer callback (git-fixes).\n- i2c: stm32f7: flush TX FIFO upon transfer errors (git-fixes).\n- i2c: stm32f7: recover the bus on access timeout (git-fixes).\n- i2c: stm32f7: stop dma transfer in case of NACK (git-fixes).\n- i2c: xlr: Fix a resource leak in the error handling path of 'xlr_i2c_probe()' (git-fixes).\n- i40e: Fix NULL ptr dereference on VSI filter sync (git-fixes).\n- i40e: Fix changing previously set num_queue_pairs for PFs (git-fixes).\n- i40e: Fix correct max_pkt_size on VF RX queue (git-fixes).\n- i40e: Fix creation of first queue by omitting it if is not power of two (git-fixes).\n- i40e: Fix display error code in dmesg (git-fixes).\n- i40e: Fix failed opcode appearing if handling messages from VF (git-fixes).\n- i40e: Fix ping is lost after configuring ADq on VF (git-fixes).\n- i40e: Fix pre-set max number of queues for VF (git-fixes).\n- i40e: Fix warning message and call stack during rmmod i40e driver (git-fixes).\n- iavf: Fix failure to exit out from last all-multicast mode (git-fixes).\n- iavf: Fix for setting queues to 0 (jsc#SLE-12877).\n- iavf: Fix for the false positive ASQ/ARQ errors while issuing VF reset (git-fixes).\n- iavf: Fix reporting when setting descriptor count (git-fixes).\n- iavf: Fix return of set the new channel count (jsc#SLE-12877).\n- iavf: Prevent changing static ITR values if adaptive moderation is on (git-fixes).\n- iavf: Restore VLAN filters after link down (git-fixes).\n- iavf: check for null in iavf_fix_features (git-fixes).\n- iavf: do not clear a lock we do not hold (git-fixes).\n- iavf: free q_vectors before queues in iavf_disable_vf (git-fixes).\n- iavf: prevent accidental free of filter structure (git-fixes).\n- iavf: validate pointers (git-fixes).\n- ibmvnic: drop bad optimization in reuse_rx_pools() (bsc#1193349 ltc#195568).\n- ibmvnic: drop bad optimization in reuse_tx_pools() (bsc#1193349 ltc#195568).\n- ice: Delete always true check of PF pointer (git-fixes).\n- ice: Fix VF true promiscuous mode (jsc#SLE-12878).\n- ice: Fix not stopping Tx queues for VFs (jsc#SLE-7926).\n- ice: Remove toggling of antispoof for VF trusted promiscuous mode (jsc#SLE-12878).\n- ice: avoid bpf_prog refcount underflow (jsc#SLE-7926).\n- ice: avoid bpf_prog refcount underflow (jsc#SLE-7926).\n- ice: fix vsi-\u003etxq_map sizing (jsc#SLE-7926).\n- ice: ignore dropped packets during init (git-fixes).\n- igb: fix netpoll exit with traffic (git-fixes).\n- igc: Remove _I_PHY_ID checking (bsc#1193169).\n- igc: Remove phy-\u003etype checking (bsc#1193169).\n- iio: imu: st_lsm6dsx: Avoid potential array overflow in st_lsm6dsx_set_odr() (git-fixes).\n- input: iforce - fix control-message timeout (git-fixes).\n- iommu/amd: Relocate GAMSup check to early_enable_iommus (git-fixes).\n- iommu/amd: Remove iommu_init_ga() (git-fixes).\n- iommu/mediatek: Fix out-of-range warning with clang (git-fixes).\n- iommu/vt-d: Consolidate duplicate cache invaliation code (git-fixes).\n- iommu/vt-d: Fix incomplete cache flush in intel_pasid_tear_down_entry() (git-fixes).\n- iommu/vt-d: Update the virtual command related registers (git-fixes).\n- iommu: Check if group is NULL before remove device (git-fixes).\n- ipmi: Disable some operations during a panic (git-fixes).\n- kabi: dm: fix deadlock when swapping to encrypted device (bsc#1186332).\n- kabi: hide changes to struct uv_info (git-fixes).\n- kernel-obs-build: include the preferred kernel parameters Currently the Open Build Service hardcodes the kernel boot parameters globally. Recently functionality was added to control the parameters by the kernel-obs-build package, so make use of that. parameters here will overwrite what is used by OBS otherwise.\n- kernel-obs-build: inform build service about virtio-serial Inform the build worker code that this kernel supports virtio-serial, which improves performance and relability of logging.\n- kernel-obs-build: remove duplicated/unused parameters lbs=0 - this parameters is just giving 'unused parameter' and it looks like I can not find any version that implemented this. rd.driver.pre=binfmt_misc is not needed when setup_obs is used, it alread loads the kernel module. quiet and panic=1 will now be also always added by OBS, so we do not have to set it here anymore.\n- kernel-source.spec: install-kernel-tools also required on 15.4\n- lib/xz: Avoid overlapping memcpy() with invalid input with in-place decompression (git-fixes).\n- lib/xz: Validate the value before assigning it to an enum variable (git-fixes).\n- libata: fix checking of DMA state (git-fixes).\n- linux/parser.h: add include guards (bsc#1192606).\n- lpfc: Reintroduce old IRQ probe logic (bsc#1183897).\n- mark commit as not needed (git-fixes)\n- md/raid10: Remove unnecessary rcu_dereference in raid10_handle_discard (bsc#1192320).\n- md/raid10: extend r10bio devs to raid disks (bsc#1192320).\n- md/raid10: improve discard request for far layout (bsc#1192320).\n- md/raid10: improve raid10 discard request (bsc#1192320).\n- md/raid10: initialize r10_bio-\u003eread_slot before use (bsc#1192320).\n- md/raid10: pull the code that wait for blocked dev into one function (bsc#1192320).\n- md: add md_submit_discard_bio() for submitting discard bio (bsc#1192320).\n- md: fix a lock order reversal in md_alloc (git-fixes).\n- mdio: aspeed: Fix 'Link is Down' issue (bsc#1176447).\n- media: imx: set a media_device bus_info string (git-fixes).\n- media: ipu3-imgu: VIDIOC_QUERYCAP: Fix bus_info (git-fixes).\n- media: ipu3-imgu: imgu_fmt: Handle properly try (git-fixes).\n- media: ir-kbd-i2c: improve responsiveness of hauppauge zilog receivers (git-fixes).\n- media: mceusb: return without resubmitting URB in case of -EPROTO error (git-fixes).\n- media: mt9p031: Fix corrupted frame after restarting stream (git-fixes).\n- media: netup_unidvb: handle interrupt properly according to the firmware (git-fixes).\n- media: rcar-csi2: Add checking to rcsi2_start_receiver() (git-fixes).\n- media: s5p-mfc: fix possible null-pointer dereference in s5p_mfc_probe() (git-fixes).\n- media: stm32: Potential NULL pointer dereference in dcmi_irq_thread() (git-fixes).\n- media: usb: dvd-usb: fix uninit-value bug in dibusb_read_eeprom_byte() (git-fixes).\n- media: uvcvideo: Return -EIO for control errors (git-fixes).\n- media: uvcvideo: Set capability in s_param (git-fixes).\n- media: uvcvideo: Set unique vdev name based in type (git-fixes).\n- memstick: r592: Fix a UAF bug when removing the driver (git-fixes).\n- mm: reclaim mustn't enter FS for swap-over-NFS (bsc#1191876).\n- mmc: dw_mmc: Dont wait for DRTO on Write RSP error (git-fixes).\n- mmc: winbond: do not build on M68K (git-fixes).\n- move upstreamed usb fix into sorted section\n- mtd: core: do not remove debugfs directory if device is in use (git-fixes).\n- mwifiex: Properly initialize private structure on interface type changes (git-fixes).\n- mwifiex: Read a PCI register after writing the TX ring write pointer (git-fixes).\n- mwifiex: Run SET_BSS_MODE when changing from P2P to STATION vif-type (git-fixes).\n- mwl8k: Fix use-after-free in mwl8k_fw_state_machine() (git-fixes).\n- net: asix: fix uninit value bugs (git-fixes).\n- net: bnx2x: fix variable dereferenced before check (git-fixes).\n- net: bridge: fix under estimation in br_get_linkxstats_size() (bsc#1176447).\n- net: cdc_ncm: Allow for dwNtbOutMaxSize to be unset or zero (git-fixes).\n- net: delete redundant function declaration (git-fixes).\n- net: hns3: change affinity_mask to numa node range (bsc#1154353).\n- net: hns3: fix misuse vf id and vport id in some logs (bsc#1154353).\n- net: hns3: remove check VF uc mac exist when set by PF (bsc#1154353).\n- net: hso: fix control-request directions (git-fixes).\n- net: hso: fix muxed tty registration (git-fixes).\n- net: linkwatch: fix failure to restore device state across suspend/resume (bsc#1192511).\n- net: mana: Allow setting the number of queues while the NIC is down (jsc#SLE-18779, bsc#1185726).\n- net: mana: Fix memory leak in mana_hwc_create_wq (jsc#SLE-18779, bsc#1185726).\n- net: mana: Fix spelling mistake 'calledd' -\u003e 'called' (jsc#SLE-18779, bsc#1185726).\n- net: mana: Fix the netdev_err()'s vPort argument in mana_init_port() (jsc#SLE-18779, bsc#1185726).\n- net: mana: Improve the HWC error handling (jsc#SLE-18779, bsc#1185726).\n- net: mana: Support hibernation and kexec (jsc#SLE-18779, bsc#1185726).\n- net: mana: Use kcalloc() instead of kzalloc() (jsc#SLE-18779, bsc#1185726).\n- net: mlx4_en: Fix an use-after-free bug in mlx4_en_try_alloc_resources() (git-fixes).\n- net: mlx5: E-Switch, return error if encap isn't supported (jsc#SLE-15172).\n- net: mlx5: Update error handler for UCTX and UMEM (git-fixes).\n- net: mlx5e: reset XPS on error flow if netdev isn't registered yet (git-fixes).\n- net: pegasus: fix uninit-value in get_interrupt_interval (git-fixes).\n- net: qlogic: qlcnic: Fix a NULL pointer dereference in qlcnic_83xx_add_rings() (git-fixes).\n- net: sched: sch_ets: do not peek at classes beyond 'nbands' (bsc#1176774).\n- net: usb: Merge cpu_to_le32s + memcpy to put_unaligned_le32 (git-fixes).\n- net: usb: lan78xx: lan78xx_phy_init(): use PHY_POLL instead of '0' if no IRQ is available (git-fixes).\n- net: usb: lan78xx: lan78xx_phy_init(): use PHY_POLL instead of '0' if no IRQ is available (git-fixes).\n- netfilter: ctnetlink: do not erase error code with EINVAL (bsc#1176447).\n- netfilter: ctnetlink: fix filtering with CTA_TUPLE_REPLY (bsc#1176447).\n- netfilter: flowtable: fix IPv6 tunnel addr match (bsc#1176447).\n- nfc: add NCI_UNREG flag to eliminate the race (git-fixes).\n- nfc: pn533: Fix double free when pn533_fill_fragment_skbs() fails (git-fixes).\n- nfc: reorder the logic in nfc_{un,}register_device (git-fixes).\n- nfc: reorganize the functions in nci_request (git-fixes).\n- nfp: Fix memory leak in nfp_cpp_area_cache_add() (git-fixes).\n- nfp: checking parameter process for rx-usecs/tx-usecs is invalid (git-fixes).\n- nfs: Do not set NFS_INO_DATA_INVAL_DEFER and NFS_INO_INVALID_DATA (git-fixes).\n- nfs: Fix a regression in nfs_set_open_stateid_locked() (git-fixes).\n- nfs: Fix deadlocks in nfs_scan_commit_list() (git-fixes).\n- nfs: Fix up commit deadlocks (git-fixes).\n- nfs: do not take i_rwsem for swap IO (bsc#1191876).\n- nfs: move generic_write_checks() call from nfs_file_direct_write() to nfs_file_write() (bsc#1191876).\n- nfsd4: Handle the NFSv4 READDIR 'dircount' hint being zero (git-fixes).\n- nfsd: do not alloc under spinlock in rpc_parse_scope_id (git-fixes).\n- nfsd: fix error handling of register_pernet_subsys() in init_nfsd() (git-fixes).\n- nvme-multipath: Skip not ready namespaces when revalidating paths (bsc#1191793 bsc#1192507 bsc#1192969).\n- nvme-pci: add NO APST quirk for Kioxia device (git-fixes).\n- objtool: Support Clang non-section symbols in ORC generation (bsc#1169514).\n- pci/msi: Deal with devices lying about their MSI mask capability (git-fixes).\n- pci: Add PCI_EXP_DEVCTL_PAYLOAD_* macros (git-fixes).\n- pci: Mark Atheros QCA6174 to avoid bus reset (git-fixes).\n- perf/x86/intel/uncore: Fix Intel ICX IIO event constraints (git-fixes).\n- perf/x86/intel/uncore: Fix M2M event umask for Ice Lake server (git-fixes).\n- perf/x86/intel/uncore: Fix the scale of the IMC free-running events (git-fixes).\n- perf/x86/intel/uncore: Support extra IMC channel on Ice Lake server (git-fixes).\n- perf/x86/intel: Fix unchecked MSR access error caused by VLBR_EVENT (git-fixes).\n- perf/x86/vlbr: Add c-\u003eflags to vlbr event constraints (git-fixes).\n- perf: Correctly handle failed perf_get_aux_event() (git-fixes).\n- platform/x86: hp_accel: Fix an error handling path in 'lis3lv02d_probe()' (git-fixes).\n- platform/x86: wmi: do not fail if disabling fails (git-fixes).\n- pm: hibernate: Get block device exclusively in swsusp_check() (git-fixes).\n- pm: hibernate: use correct mode for swsusp_close() (git-fixes).\n- pnfs/flexfiles: Fix misplaced barrier in nfs4_ff_layout_prepare_ds (git-fixes).\n- powerpc/iommu: Report the correct most efficient DMA mask for PCI devices (git-fixes).\n- powerpc/paravirt: correct preempt debug splat in vcpu_is_preempted() (bsc#1181148 ltc#190702 git-fixes).\n- powerpc/paravirt: vcpu_is_preempted() commentary (bsc#1181148 ltc#190702 git-fixes).\n- powerpc/perf: Fix cycles/instructions as PM_CYC/PM_INST_CMPL in power10 (jsc#SLE-13513 git-fixes).\n- powerpc/pseries: Move some PAPR paravirt functions to their own file (bsc#1181148 ltc#190702 git-fixes).\n- powerpc/watchdog: Avoid holding wd_smp_lock over printk and smp_send_nmi_ipi (bsc#1187541 ltc#192129).\n- powerpc/watchdog: Fix missed watchdog reset due to memory ordering race (bsc#1187541 ltc#192129).\n- powerpc/watchdog: Fix wd_smp_last_reset_tb reporting (bsc#1187541 ltc#192129).\n- powerpc/watchdog: read TB close to where it is used (bsc#1187541 ltc#192129).\n- powerpc/watchdog: tighten non-atomic read-modify-write access (bsc#1187541 ltc#192129).\n- powerpc: fix unbalanced node refcount in check_kvm_guest() (jsc#SLE-15869 jsc#SLE-16321 git-fixes).\n- printk: Remove printk.h inclusion in percpu.h (bsc#1192987).\n- qede: validate non LSO skb length (git-fixes).\n- r8169: Add device 10ec:8162 to driver r8169 (git-fixes).\n- rdma/bnxt_re: Update statistics counter name (jsc#SLE-16649).\n- recordmcount.pl: fix typo in s390 mcount regex (bsc#1192267).\n- recordmcount.pl: look for jgnop instruction as well as bcrl on s390 (bsc#1192267).\n- reset: socfpga: add empty driver allowing consumers to probe (git-fixes).\n- rpm/*.spec.in: use buildroot macro instead of env variable The RPM_BUILD_ROOT variable is considered deprecated over a buildroot macro. future proof the spec files.\n- rpm/kernel-binary.spec.in: do not strip vmlinux again (bsc#1193306) After usrmerge, vmlinux file is not named vmlinux-\u0026lt;version\u003e, but simply vmlinux. And this is not reflected in STRIP_KEEP_SYMTAB we set. So fix this by removing the dash...\n- rpm/kernel-obs-build.spec.in: move to zstd for the initrd Newer distros have capability to decompress zstd, which provides a 2-5% better compression ratio at very similar cpu overhead. Plus this tests the zstd codepaths now as well.\n- rt2x00: do not mark device gone on EPROTO errors during start (git-fixes).\n- rxrpc: Fix rxrpc_local leak in rxrpc_lookup_peer() (bsc#1154353 bnc#1151927 5.3.9).\n- s390/bpf: Fix branch shortening during codegen pass (bsc#1193993).\n- s390/uv: fully validate the VMA before calling follow_page() (git-fixes).\n- s390: mm: Fix secure storage access exception handling (git-fixes).\n- scsi: iscsi: Adjust iface sysfs attr detection (git-fixes).\n- scsi: lpfc: Add additional debugfs support for CMF (bsc#1194266).\n- scsi: lpfc: Adjust CMF total bytes and rxmonitor (bsc#1194266).\n- scsi: lpfc: Cap CMF read bytes to MBPI (bsc#1194266).\n- scsi: lpfc: Change return code on I/Os received during link bounce (bsc#1194266).\n- scsi: lpfc: Fix NPIV port deletion crash (bsc#1194266).\n- scsi: lpfc: Fix leaked lpfc_dmabuf mbox allocations with NPIV (bsc#1194266).\n- scsi: lpfc: Fix lpfc_force_rscn ndlp kref imbalance (bsc#1194266).\n- scsi: lpfc: Fix non-recovery of remote ports following an unsolicited LOGO (bsc#1189126).\n- scsi: lpfc: Trigger SLI4 firmware dump before doing driver cleanup (bsc#1194266).\n- scsi: lpfc: Update lpfc version to 14.0.0.4 (bsc#1194266).\n- scsi: mpi3mr: Fix duplicate device entries when scanning through sysfs (git-fixes).\n- scsi: mpt3sas: Fix kernel panic during drive powercycle test (git-fixes).\n- scsi: mpt3sas: Fix system going into read-only mode (git-fixes).\n- scsi: pm80xx: Do not call scsi_remove_host() in pm8001_alloc() (git-fixes).\n- scsi: qla2xxx: Fix gnl list corruption (git-fixes).\n- scsi: qla2xxx: Fix mailbox direction flags in qla2xxx_get_adapter_id() (git-fixes).\n- scsi: qla2xxx: Format log strings only if needed (git-fixes).\n- scsi: qla2xxx: Relogin during fabric disturbance (git-fixes).\n- scsi: qla2xxx: Turn off target reset during issue_lip (git-fixes).\n- scsi: qla2xxx: edif: Fix EDIF bsg (git-fixes).\n- scsi: qla2xxx: edif: Fix app start delay (git-fixes).\n- scsi: qla2xxx: edif: Fix app start fail (git-fixes).\n- scsi: qla2xxx: edif: Fix off by one bug in qla_edif_app_getfcinfo() (git-fixes).\n- scsi: qla2xxx: edif: Flush stale events and msgs on session down (git-fixes).\n- scsi: qla2xxx: edif: Increase ELS payload (git-fixes).\n- serial: 8250: Fix RTS modem control while in rs485 mode (git-fixes).\n- serial: 8250_pci: Fix ACCES entries in pci_serial_quirks array (git-fixes).\n- serial: 8250_pci: rewrite pericom_do_set_divisor() (git-fixes).\n- serial: core: fix transmit-buffer reset and memleak (git-fixes).\n- smb2: clarify rc initialization in smb2_reconnect (bsc#1192606).\n- smb2: fix use-after-free in smb2_ioctl_query_info() (bsc#1192606).\n- smb3: Add debug message for new file creation with idsfromsid mount option (bsc#1192606).\n- smb3: Add defines for new information level, FileIdInformation (bsc#1164565).\n- smb3: Add missing reparse tags (bsc#1164565).\n- smb3: Add new compression flags (bsc#1192606).\n- smb3: Add new info level for query directory (bsc#1192606).\n- smb3: Add new parm 'nodelete' (bsc#1192606).\n- smb3: Add support for SMB311 query info (non-compounded) (bsc#1192606).\n- smb3: Add support for getting and setting SACLs (bsc#1192606).\n- smb3: Add support for lookup with posix extensions query info (bsc#1192606).\n- smb3: Add support for negotiating signing algorithm (bsc#1192606).\n- smb3: Add support for query info using posix extensions (level 100) (bsc#1192606).\n- smb3: Add tracepoints for new compound posix query info (bsc#1192606).\n- smb3: Additional compression structures (bsc#1192606).\n- smb3: Avoid Mid pending list corruption (bsc#1192606).\n- smb3: Backup intent flag missing from some more ops (bsc#1164565).\n- smb3: Call cifs reconnect from demultiplex thread (bsc#1192606).\n- smb3: Fix crash in SMB2_open_init due to uninitialized field in compounding path (bsc#1164565).\n- smb3: Fix ids returned in POSIX query dir (bsc#1192606).\n- smb3: Fix mkdir when idsfromsid configured on mount (bsc#1192606).\n- smb3: Fix out-of-bounds bug in SMB2_negotiate() (bsc#1183540).\n- smb3: Fix persistent handles reconnect (bnc#1151927 5.3.11).\n- smb3: Fix regression in time handling (bsc#1164565).\n- smb3: Handle error case during offload read path (bsc#1192606).\n- smb3: Honor 'handletimeout' flag for multiuser mounts (bsc#1176558).\n- smb3: Honor 'posix' flag for multiuser mounts (bsc#1176559).\n- smb3: Honor 'seal' flag for multiuser mounts (bsc#1176545).\n- smb3: Honor lease disabling for multiuser mounts (git-fixes).\n- smb3: Honor persistent/resilient handle flags for multiuser mounts (bsc#1176546).\n- smb3: Incorrect size for netname negotiate context (bsc#1154355).\n- smb3: Minor cleanup of protocol definitions (bsc#1192606).\n- smb3: Resolve data corruption of TCP server info fields (bsc#1192606).\n- smb3: add additional null check in SMB2_ioctl (bsc#1192606).\n- smb3: add additional null check in SMB2_open (bsc#1192606).\n- smb3: add additional null check in SMB2_tcon (bsc#1192606).\n- smb3: add additional null check in SMB311_posix_mkdir (bsc#1192606).\n- smb3: add debug messages for closing unmatched open (bsc#1164565).\n- smb3: add defines for new crypto algorithms (bsc#1192606).\n- smb3: add defines for new signing negotiate context (bsc#1192606).\n- smb3: add dynamic trace point to trace when credits obtained (bsc#1181507).\n- smb3: add dynamic trace points for socket connection (bsc#1192606).\n- smb3: add dynamic tracepoints for flush and close (bsc#1164565).\n- smb3: add indatalen that can be a non-zero value to calculation of credit charge in smb2 ioctl (bsc#1192606).\n- smb3: add missing flag definitions (bsc#1164565).\n- smb3: add missing worker function for SMB3 change notify (bsc#1164565).\n- smb3: add mount option to allow RW caching of share accessed by only 1 client (bsc#1164565).\n- smb3: add mount option to allow forced caching of read only share (bsc#1164565).\n- smb3: add new module load parm enable_gcm_256 (bsc#1192606).\n- smb3: add new module load parm require_gcm_256 (bsc#1192606).\n- smb3: add one more dynamic tracepoint missing from strict fsync path (bsc#1164565).\n- smb3: add rasize mount parameter to improve readahead performance (bsc#1192606).\n- smb3: add some missing definitions from MS-FSCC (bsc#1192606).\n- smb3: add some more descriptive messages about share when mounting cache=ro (bsc#1164565).\n- smb3: add support for recognizing WSL reparse tags (bsc#1192606).\n- smb3: add support for stat of WSL reparse points for special file types (bsc#1192606).\n- smb3: add support for using info level for posix extensions query (bsc#1192606).\n- smb3: allow decryption keys to be dumped by admin for debugging (bsc#1164565).\n- smb3: allow disabling requesting leases (bnc#1151927 5.3.4).\n- smb3: allow dumping GCM256 keys to improve debugging of encrypted shares (bsc#1192606).\n- smb3: allow dumping keys for multiuser mounts (bsc#1192606).\n- smb3: allow parallelizing decryption of reads (bsc#1164565).\n- smb3: allow skipping signature verification for perf sensitive configurations (bsc#1164565).\n- smb3: allow uid and gid owners to be set on create with idsfromsid mount option (bsc#1192606).\n- smb3: avoid confusing warning message on mount to Azure (bsc#1192606).\n- smb3: change noisy error message to FYI (bsc#1192606).\n- smb3: cleanup some recent endian errors spotted by updated sparse (bsc#1164565).\n- smb3: correct server pointer dereferencing check to be more consistent (bsc#1192606).\n- smb3: correct smb3 ACL security descriptor (bsc#1192606).\n- smb3: default to minimum of two channels when multichannel specified (bsc#1192606).\n- smb3: display max smb3 requests in flight at any one time (bsc#1164565).\n- smb3: do not attempt multichannel to server which does not support it (bsc#1192606).\n- smb3: do not error on fsync when readonly (bsc#1192606).\n- smb3: do not fail if no encryption required but server does not support it (bsc#1192606).\n- smb3: do not log warning message if server does not populate salt (bsc#1192606).\n- smb3: do not setup the fscache_super_cookie until fsinfo initialized (bsc#1192606).\n- smb3: do not try to cache root directory if dir leases not supported (bsc#1192606).\n- smb3: dump in_send and num_waiters stats counters by default (bsc#1164565).\n- smb3: enable negotiating stronger encryption by default (bsc#1192606).\n- smb3: enable offload of decryption of large reads via mount option (bsc#1164565).\n- smb3: enable swap on SMB3 mounts (bsc#1192606).\n- smb3: extend fscache mount volume coherency check (bsc#1192606).\n- smb3: fix access denied on change notify request to some servers (bsc#1192606).\n- smb3: fix cached file size problems in duplicate extents (reflink) (bsc#1192606).\n- smb3: fix crediting for compounding when only one request in flight (bsc#1181507).\n- smb3: fix default permissions on new files when mounting with modefromsid (bsc#1164565).\n- smb3: fix incorrect number of credits when ioctl MaxOutputResponse \u003e 64K (bsc#1192606).\n- smb3: fix leak in 'open on server' perf counter (bnc#1151927 5.3.4).\n- smb3: fix mode passed in on create for modetosid mount option (bsc#1164565).\n- smb3: fix mount failure to some servers when compression enabled (bsc#1192606).\n- smb3: fix performance regression with setting mtime (bsc#1164565).\n- smb3: fix posix extensions mount option (bsc#1192606).\n- smb3: fix possible access to uninitialized pointer to DACL (bsc#1192606).\n- smb3: fix potential null dereference in decrypt offload (bsc#1164565).\n- smb3: fix problem with null cifs super block with previous patch (bsc#1164565).\n- smb3: fix readpage for large swap cache (bsc#1192606).\n- smb3: fix refcount underflow warning on unmount when no directory leases (bsc#1164565).\n- smb3: fix signing verification of large reads (bsc#1154355).\n- smb3: fix stat when special device file and mounted with modefromsid (bsc#1192606).\n- smb3: fix typo in compression flag (bsc#1192606).\n- smb3: fix typo in header file (bsc#1192606).\n- smb3: fix typo in mount options displayed in /proc/mounts (bsc#1192606).\n- smb3: fix uninitialized value for port in witness protocol move (bsc#1192606).\n- smb3: fix unmount hang in open_shroot (bnc#1151927 5.3.4).\n- smb3: fix unneeded error message on change notify (bsc#1192606).\n- smb3: if max_channels set to more than one channel request multichannel (bsc#1192606).\n- smb3: improve check for when we send the security descriptor context on create (bsc#1164565).\n- smb3: improve handling of share deleted (and share recreated) (bsc#1154355).\n- smb3: incorrect file id in requests compounded with open (bsc#1192606).\n- smb3: limit noisy error (bsc#1192606).\n- smb3: log warning if CSC policy conflicts with cache mount option (bsc#1164565).\n- smb3: minor update to compression header definitions (bsc#1192606).\n- smb3: missing ACL related flags (bsc#1164565).\n- smb3: negotiate current dialect (SMB3.1.1) when version 3 or greater requested (bsc#1192606).\n- smb3: only offload decryption of read responses if multiple requests (bsc#1164565).\n- smb3: pass mode bits into create calls (bsc#1164565).\n- smb3: prevent races updating CurrentMid (bsc#1192606).\n- smb3: print warning if server does not support requested encryption type (bsc#1192606).\n- smb3: print warning once if posix context returned on open  (bsc#1164565).\n- smb3: query attributes on file close (bsc#1164565).\n- smb3: rc uninitialized in one fallocate path (bsc#1192606).\n- smb3: remind users that witness protocol is experimental (bsc#1192606).\n- smb3: remove confusing dmesg when mounting with encryption ('seal') (bsc#1164565).\n- smb3: remove confusing mount warning when no SPNEGO info on negprot rsp (bsc#1192606).\n- smb3: remove dead code for non compounded posix query info (bsc#1192606).\n- smb3: remove noisy debug message and minor cleanup (bsc#1164565).\n- smb3: remove overly noisy debug line in signing errors (bsc#1192606).\n- smb3: remove static checker warning (bsc#1192606).\n- smb3: remove trivial dfs compile warning (bsc#1192606, jsc#SLE-20042).\n- smb3: remove two unused variables (bsc#1192606).\n- smb3: remove unused flag passed into close functions (bsc#1164565).\n- smb3: rename nonces used for GCM and CCM encryption (bsc#1192606).\n- smb3: set COMPOUND_FID to FileID field of subsequent compound request (bsc#1192606).\n- smb3: set gcm256 when requested (bsc#1192606).\n- smb3: smbdirect support can be configured by default (bsc#1192606).\n- smb3: update comments clarifying SPNEGO info in negprot response (bsc#1192606).\n- smb3: update protocol header definitions based to include new flags (bsc#1192606).\n- smb3: update structures for new compression protocol definitions (bsc#1192606).\n- smb3: use SMB2_SIGNATURE_SIZE define (bsc#1192606).\n- smb3: warn on confusing error scenario with sec=krb5 (bsc#1176548).\n- smb3: when mounting with multichannel include it in requested capabilities (bsc#1192606).\n- smbdirect: missing rc checks while waiting for rdma events (bsc#1192606).\n- soc/tegra: Fix an error handling path in tegra_powergate_power_up() (git-fixes).\n- soc/tegra: pmc: Fix imbalanced clock disabling in error code path (git-fixes).\n- spi: bcm-qspi: Fix missing clk_disable_unprepare() on error in bcm_qspi_probe() (git-fixes).\n- spi: spl022: fix Microwire full duplex mode (git-fixes).\n- sunrpc/auth: async tasks mustn't block waiting for memory (bsc#1191876).\n- sunrpc/call_alloc: async tasks mustn't block waiting for memory (bsc#1191876).\n- sunrpc/xprt: async tasks mustn't block waiting for memory (bsc#1191876).\n- sunrpc: improve 'swap' handling: scheduling and PF_MEMALLOC (bsc#1191876).\n- sunrpc: remove scheduling boost for 'SWAPPER' tasks (bsc#1191876).\n- swiotlb: Fix the type of index (git-fixes).\n- tlb: mmu_gather: add tlb_flush_*_range APIs\n- tracing: Add length protection to histogram string copies (git-fixes).\n- tracing: Change STR_VAR_MAX_LEN (git-fixes).\n- tracing: Check pid filtering when creating events (git-fixes).\n- tracing: Fix pid filtering when triggers are attached (git-fixes).\n- tty: hvc: replace BUG_ON() with negative return value (git-fixes).\n- tty: serial: msm_serial: Deactivate RX DMA for polling support (git-fixes).\n- tty: tty_buffer: Fix the softlockup issue in flush_to_ldisc (git-fixes).\n- usb-storage: Add compatibility quirk flags for iODD 2531/2541 (git-fixes).\n- usb: chipidea: ci_hdrc_imx: fix potential error pointer dereference in probe (git-fixes).\n- usb: dwc2: gadget: Fix ISOC flow for elapsed frames (git-fixes).\n- usb: dwc2: hcd_queue: Fix use of floating point literal (git-fixes).\n- usb: host: ohci-tmio: check return value after calling platform_get_resource() (git-fixes).\n- usb: musb: tusb6010: check return value after calling platform_get_resource() (git-fixes).\n- usb: serial: option: add Fibocom FM101-GL variants (git-fixes).\n- usb: serial: option: add Telit LE910S1 0x9200 composition (git-fixes).\n- usb: typec: fusb302: Fix masking of comparator and bc_lvl interrupts (git-fixes).\n- usb: typec: tcpm: Wait in SNK_DEBOUNCED until disconnect (git-fixes).\n- usb: typec: tcpm: Wait in SNK_DEBOUNCED until disconnect (git-fixes).\n- usb: xhci: Enable runtime-pm by default on AMD Yellow Carp platform (git-fixes).\n- vfs: do not parse forbidden flags (bsc#1192606).\n- wireguard: allowedips: add missing __rcu annotation to satisfy sparse (git-fixes).\n- wireguard: device: reset peer src endpoint when netns exits (git-fixes).\n- wireguard: ratelimiter: use kvcalloc() instead of kvzalloc() (git-fixes).\n- wireguard: receive: drop handshakes if queue lock is contended (git-fixes).\n- wireguard: receive: use ring buffer for incoming handshakes (git-fixes).\n- wireguard: selftests: actually test for routing loops (git-fixes).\n- wireguard: selftests: increase default dmesg log size (git-fixes).\n- x86/amd_nb: Add AMD family 19h model 50h PCI ids (jsc#SLE-17823 jsc#SLE-23139 jsc#ECO-3666).\n- x86/cpu: Fix migration safety with X86_BUG_NULL_SEL (bsc#1152489).\n- x86/efi: Restore Firmware IDT before calling ExitBootServices() (git-fixes).\n- x86/entry: Add a fence for kernel entry SWAPGS in paranoid_entry() (bsc#1178134).\n- x86/mpx: Disable MPX for 32-bit userland (bsc#1193139).\n- x86/pkey: Fix undefined behaviour with PKRU_WD_BIT (bsc#1152489).\n- x86/pvh: add prototype for xen_pvh_init() (git-fixes).\n- x86/sev: Allow #VC exceptions on the VC2 stack (git-fixes).\n- x86/sev: Fix SEV-ES INS/OUTS instructions for word, dword, and qword (bsc#1178134).\n- x86/sev: Fix stack type check in vc_switch_off_ist() (git-fixes).\n- x86/xen: Add xenpv_restore_regs_and_return_to_usermode() (bsc#1152489).\n- xen/blkfront: do not take local copy of a request from the ring page (git-fixes).\n- xen/blkfront: do not trust the backend response data blindly (git-fixes).\n- xen/blkfront: read response from backend only once (git-fixes).\n- xen/netfront: disentangle tx_skb_freelist (git-fixes).\n- xen/netfront: do not read data from request on the ring page (git-fixes).\n- xen/netfront: do not trust the backend response data blindly (git-fixes).\n- xen/netfront: read response from backend only once (git-fixes).\n- xen/pvh: add missing prototype to header (git-fixes).\n- xen: sync include/xen/interface/io/ring.h with Xen's newest version (git-fixes).\n- xhci: Fix USB 3.1 enumeration issues by increasing roothub power-on-good delay (git-fixes).\n- xhci: Fix commad ring abort, write all 64 bits to CRCR register (bsc#1192569).\n- xhci: Fix commad ring abort, write all 64 bits to CRCR register (bsc#1192569).\n- xhci: Fix commad ring abort, write all 64 bits to CRCR register (git-fixes).\n- zram: fix return value on writeback_store (git-fixes).\n- zram: off by one in read_block_state() (git-fixes).\n",
      "Title": "Details",
      "Type": "General"
    },
    {
      "Text": "The CVRF data is provided by SUSE under the Creative Commons License 4.0 with Attribution (CC-BY-4.0).",
      "Title": "Terms of Use",
      "Type": "Legal Disclaimer"
    },
    {
      "Text": "SUSE-2022-79,SUSE-SLE-Module-RT-15-SP3-2022-79,SUSE-SUSE-MicroOS-5.1-2022-79",
      "Title": "Patchnames",
      "Type": "Details"
    }
  ],
  "ProductTree": {
    "Relationships": [
      {
        "ProductReference": "kernel-rt-5.3.18-68.1",
        "RelatesToProductReference": "SUSE Linux Enterprise Micro 5.1",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "cluster-md-kmp-rt-5.3.18-68.1",
        "RelatesToProductReference": "SUSE Real Time Module 15 SP3",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "dlm-kmp-rt-5.3.18-68.1",
        "RelatesToProductReference": "SUSE Real Time Module 15 SP3",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "gfs2-kmp-rt-5.3.18-68.1",
        "RelatesToProductReference": "SUSE Real Time Module 15 SP3",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "kernel-devel-rt-5.3.18-68.1",
        "RelatesToProductReference": "SUSE Real Time Module 15 SP3",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "kernel-rt-5.3.18-68.1",
        "RelatesToProductReference": "SUSE Real Time Module 15 SP3",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "kernel-rt-devel-5.3.18-68.1",
        "RelatesToProductReference": "SUSE Real Time Module 15 SP3",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "kernel-rt_debug-devel-5.3.18-68.1",
        "RelatesToProductReference": "SUSE Real Time Module 15 SP3",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "kernel-source-rt-5.3.18-68.1",
        "RelatesToProductReference": "SUSE Real Time Module 15 SP3",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "kernel-syms-rt-5.3.18-68.1",
        "RelatesToProductReference": "SUSE Real Time Module 15 SP3",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "ocfs2-kmp-rt-5.3.18-68.1",
        "RelatesToProductReference": "SUSE Real Time Module 15 SP3",
        "RelationType": "Default Component Of"
      }
    ]
  },
  "References": [
    {
      "URL": "https://www.suse.com/support/update/announcement/2022/suse-su-20220079-1/",
      "Description": "Link for SUSE-SU-2022:0079-1"
    },
    {
      "URL": "https://lists.suse.com/pipermail/sle-security-updates/2022-January/010004.html",
      "Description": "E-Mail link for SUSE-SU-2022:0079-1"
    },
    {
      "URL": "https://www.suse.com/support/security/rating/",
      "Description": "SUSE Security Ratings"
    },
    {
      "URL": "https://bugzilla.suse.com/1139944",
      "Description": "SUSE Bug 1139944"
    },
    {
      "URL": "https://bugzilla.suse.com/1151927",
      "Description": "SUSE Bug 1151927"
    },
    {
      "URL": "https://bugzilla.suse.com/1152489",
      "Description": "SUSE Bug 1152489"
    },
    {
      "URL": "https://bugzilla.suse.com/1153275",
      "Description": "SUSE Bug 1153275"
    },
    {
      "URL": "https://bugzilla.suse.com/1154353",
      "Description": "SUSE Bug 1154353"
    },
    {
      "URL": "https://bugzilla.suse.com/1154355",
      "Description": "SUSE Bug 1154355"
    },
    {
      "URL": "https://bugzilla.suse.com/1161907",
      "Description": "SUSE Bug 1161907"
    },
    {
      "URL": "https://bugzilla.suse.com/1164565",
      "Description": "SUSE Bug 1164565"
    },
    {
      "URL": "https://bugzilla.suse.com/1166780",
      "Description": "SUSE Bug 1166780"
    },
    {
      "URL": "https://bugzilla.suse.com/1169514",
      "Description": "SUSE Bug 1169514"
    },
    {
      "URL": "https://bugzilla.suse.com/1176242",
      "Description": "SUSE Bug 1176242"
    },
    {
      "URL": "https://bugzilla.suse.com/1176447",
      "Description": "SUSE Bug 1176447"
    },
    {
      "URL": "https://bugzilla.suse.com/1176536",
      "Description": "SUSE Bug 1176536"
    },
    {
      "URL": "https://bugzilla.suse.com/1176544",
      "Description": "SUSE Bug 1176544"
    },
    {
      "URL": "https://bugzilla.suse.com/1176545",
      "Description": "SUSE Bug 1176545"
    },
    {
      "URL": "https://bugzilla.suse.com/1176546",
      "Description": "SUSE Bug 1176546"
    },
    {
      "URL": "https://bugzilla.suse.com/1176548",
      "Description": "SUSE Bug 1176548"
    },
    {
      "URL": "https://bugzilla.suse.com/1176558",
      "Description": "SUSE Bug 1176558"
    },
    {
      "URL": "https://bugzilla.suse.com/1176559",
      "Description": "SUSE Bug 1176559"
    },
    {
      "URL": "https://bugzilla.suse.com/1176774",
      "Description": "SUSE Bug 1176774"
    },
    {
      "URL": "https://bugzilla.suse.com/1176940",
      "Description": "SUSE Bug 1176940"
    },
    {
      "URL": "https://bugzilla.suse.com/1176956",
      "Description": "SUSE Bug 1176956"
    },
    {
      "URL": "https://bugzilla.suse.com/1177440",
      "Description": "SUSE Bug 1177440"
    },
    {
      "URL": "https://bugzilla.suse.com/1178134",
      "Description": "SUSE Bug 1178134"
    },
    {
      "URL": "https://bugzilla.suse.com/1178270",
      "Description": "SUSE Bug 1178270"
    },
    {
      "URL": "https://bugzilla.suse.com/1179211",
      "Description": "SUSE Bug 1179211"
    },
    {
      "URL": "https://bugzilla.suse.com/1179426",
      "Description": "SUSE Bug 1179426"
    },
    {
      "URL": "https://bugzilla.suse.com/1179427",
      "Description": "SUSE Bug 1179427"
    },
    {
      "URL": "https://bugzilla.suse.com/1179599",
      "Description": "SUSE Bug 1179599"
    },
    {
      "URL": "https://bugzilla.suse.com/1181148",
      "Description": "SUSE Bug 1181148"
    },
    {
      "URL": "https://bugzilla.suse.com/1181507",
      "Description": "SUSE Bug 1181507"
    },
    {
      "URL": "https://bugzilla.suse.com/1181710",
      "Description": "SUSE Bug 1181710"
    },
    {
      "URL": "https://bugzilla.suse.com/1182404",
      "Description": "SUSE Bug 1182404"
    },
    {
      "URL": "https://bugzilla.suse.com/1183534",
      "Description": "SUSE Bug 1183534"
    },
    {
      "URL": "https://bugzilla.suse.com/1183540",
      "Description": "SUSE Bug 1183540"
    },
    {
      "URL": "https://bugzilla.suse.com/1183897",
      "Description": "SUSE Bug 1183897"
    },
    {
      "URL": "https://bugzilla.suse.com/1184318",
      "Description": "SUSE Bug 1184318"
    },
    {
      "URL": "https://bugzilla.suse.com/1185726",
      "Description": "SUSE Bug 1185726"
    },
    {
      "URL": "https://bugzilla.suse.com/1185902",
      "Description": "SUSE Bug 1185902"
    },
    {
      "URL": "https://bugzilla.suse.com/1186332",
      "Description": "SUSE Bug 1186332"
    },
    {
      "URL": "https://bugzilla.suse.com/1187541",
      "Description": "SUSE Bug 1187541"
    },
    {
      "URL": "https://bugzilla.suse.com/1189126",
      "Description": "SUSE Bug 1189126"
    },
    {
      "URL": "https://bugzilla.suse.com/1191793",
      "Description": "SUSE Bug 1191793"
    },
    {
      "URL": "https://bugzilla.suse.com/1191876",
      "Description": "SUSE Bug 1191876"
    },
    {
      "URL": "https://bugzilla.suse.com/1192267",
      "Description": "SUSE Bug 1192267"
    },
    {
      "URL": "https://bugzilla.suse.com/1192320",
      "Description": "SUSE Bug 1192320"
    },
    {
      "URL": "https://bugzilla.suse.com/1192507",
      "Description": "SUSE Bug 1192507"
    },
    {
      "URL": "https://bugzilla.suse.com/1192511",
      "Description": "SUSE Bug 1192511"
    },
    {
      "URL": "https://bugzilla.suse.com/1192569",
      "Description": "SUSE Bug 1192569"
    },
    {
      "URL": "https://bugzilla.suse.com/1192606",
      "Description": "SUSE Bug 1192606"
    },
    {
      "URL": "https://bugzilla.suse.com/1192845",
      "Description": "SUSE Bug 1192845"
    },
    {
      "URL": "https://bugzilla.suse.com/1192847",
      "Description": "SUSE Bug 1192847"
    },
    {
      "URL": "https://bugzilla.suse.com/1192877",
      "Description": "SUSE Bug 1192877"
    },
    {
      "URL": "https://bugzilla.suse.com/1192946",
      "Description": "SUSE Bug 1192946"
    },
    {
      "URL": "https://bugzilla.suse.com/1192969",
      "Description": "SUSE Bug 1192969"
    },
    {
      "URL": "https://bugzilla.suse.com/1192987",
      "Description": "SUSE Bug 1192987"
    },
    {
      "URL": "https://bugzilla.suse.com/1192990",
      "Description": "SUSE Bug 1192990"
    },
    {
      "URL": "https://bugzilla.suse.com/1192998",
      "Description": "SUSE Bug 1192998"
    },
    {
      "URL": "https://bugzilla.suse.com/1193002",
      "Description": "SUSE Bug 1193002"
    },
    {
      "URL": "https://bugzilla.suse.com/1193042",
      "Description": "SUSE Bug 1193042"
    },
    {
      "URL": "https://bugzilla.suse.com/1193139",
      "Description": "SUSE Bug 1193139"
    },
    {
      "URL": "https://bugzilla.suse.com/1193169",
      "Description": "SUSE Bug 1193169"
    },
    {
      "URL": "https://bugzilla.suse.com/1193306",
      "Description": "SUSE Bug 1193306"
    },
    {
      "URL": "https://bugzilla.suse.com/1193318",
      "Description": "SUSE Bug 1193318"
    },
    {
      "URL": "https://bugzilla.suse.com/1193349",
      "Description": "SUSE Bug 1193349"
    },
    {
      "URL": "https://bugzilla.suse.com/1193440",
      "Description": "SUSE Bug 1193440"
    },
    {
      "URL": "https://bugzilla.suse.com/1193442",
      "Description": "SUSE Bug 1193442"
    },
    {
      "URL": "https://bugzilla.suse.com/1193655",
      "Description": "SUSE Bug 1193655"
    },
    {
      "URL": "https://bugzilla.suse.com/1193993",
      "Description": "SUSE Bug 1193993"
    },
    {
      "URL": "https://bugzilla.suse.com/1194087",
      "Description": "SUSE Bug 1194087"
    },
    {
      "URL": "https://bugzilla.suse.com/1194094",
      "Description": "SUSE Bug 1194094"
    },
    {
      "URL": "https://bugzilla.suse.com/1194266",
      "Description": "SUSE Bug 1194266"
    },
    {
      "URL": "https://www.suse.com/security/cve/CVE-2020-24504/",
      "Description": "SUSE CVE CVE-2020-24504 page"
    },
    {
      "URL": "https://www.suse.com/security/cve/CVE-2020-27820/",
      "Description": "SUSE CVE CVE-2020-27820 page"
    },
    {
      "URL": "https://www.suse.com/security/cve/CVE-2021-28711/",
      "Description": "SUSE CVE CVE-2021-28711 page"
    },
    {
      "URL": "https://www.suse.com/security/cve/CVE-2021-28712/",
      "Description": "SUSE CVE CVE-2021-28712 page"
    },
    {
      "URL": "https://www.suse.com/security/cve/CVE-2021-28713/",
      "Description": "SUSE CVE CVE-2021-28713 page"
    },
    {
      "URL": "https://www.suse.com/security/cve/CVE-2021-28714/",
      "Description": "SUSE CVE CVE-2021-28714 page"
    },
    {
      "URL": "https://www.suse.com/security/cve/CVE-2021-28715/",
      "Description": "SUSE CVE CVE-2021-28715 page"
    },
    {
      "URL": "https://www.suse.com/security/cve/CVE-2021-33098/",
      "Description": "SUSE CVE CVE-2021-33098 page"
    },
    {
      "URL": "https://www.suse.com/security/cve/CVE-2021-4001/",
      "Description": "SUSE CVE CVE-2021-4001 page"
    },
    {
      "URL": "https://www.suse.com/security/cve/CVE-2021-4002/",
      "Description": "SUSE CVE CVE-2021-4002 page"
    },
    {
      "URL": "https://www.suse.com/security/cve/CVE-2021-43975/",
      "Description": "SUSE CVE CVE-2021-43975 page"
    },
    {
      "URL": "https://www.suse.com/security/cve/CVE-2021-43976/",
      "Description": "SUSE CVE CVE-2021-43976 page"
    },
    {
      "URL": "https://www.suse.com/security/cve/CVE-2021-45485/",
      "Description": "SUSE CVE CVE-2021-45485 page"
    },
    {
      "URL": "https://www.suse.com/security/cve/CVE-2021-45486/",
      "Description": "SUSE CVE CVE-2021-45486 page"
    }
  ],
  "Vulnerabilities": [
    {
      "CVE": "CVE-2020-24504",
      "Description": "Uncontrolled resource consumption in some Intel(R) Ethernet E810 Adapter drivers for Linux before version 1.0.4 may allow an authenticated user to potentially enable denial of service via local access.",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "moderate"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2020-24504.html",
          "Description": "CVE-2020-24504"
        },
        {
          "URL": "https://bugzilla.suse.com/1182404",
          "Description": "SUSE Bug 1182404"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": [
            "SUSE Linux Enterprise Micro 5.1:kernel-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:cluster-md-kmp-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:dlm-kmp-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:gfs2-kmp-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-devel-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-rt-devel-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-rt_debug-devel-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-source-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-syms-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:ocfs2-kmp-rt-5.3.18-68.1"
          ]
        }
      ],
      "CVSSScoreSets": {}
    },
    {
      "CVE": "CVE-2020-27820",
      "Description": "A vulnerability was found in Linux kernel, where a use-after-frees in nouveau's postclose() handler could happen if removing device (that is not common to remove video card physically without power-off, but same happens if \"unbind\" the driver).",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "low"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2020-27820.html",
          "Description": "CVE-2020-27820"
        },
        {
          "URL": "https://bugzilla.suse.com/1179599",
          "Description": "SUSE Bug 1179599"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": [
            "SUSE Linux Enterprise Micro 5.1:kernel-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:cluster-md-kmp-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:dlm-kmp-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:gfs2-kmp-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-devel-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-rt-devel-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-rt_debug-devel-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-source-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-syms-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:ocfs2-kmp-rt-5.3.18-68.1"
          ]
        }
      ],
      "CVSSScoreSets": {}
    },
    {
      "CVE": "CVE-2021-28711",
      "Description": "Rogue backends can cause DoS of guests via high frequency events T[his CNA information record relates to multiple CVEs; the text explains which aspects/vulnerabilities correspond to which CVE.] Xen offers the ability to run PV backends in regular unprivileged guests, typically referred to as \"driver domains\". Running PV backends in driver domains has one primary security advantage: if a driver domain gets compromised, it doesn't have the privileges to take over the system. However, a malicious driver domain could try to attack other guests via sending events at a high frequency leading to a Denial of Service in the guest due to trying to service interrupts for elongated amounts of time. There are three affected backends: * blkfront patch 1, CVE-2021-28711 * netfront patch 2, CVE-2021-28712 * hvc_xen (console) patch 3, CVE-2021-28713",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "moderate"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2021-28711.html",
          "Description": "CVE-2021-28711"
        },
        {
          "URL": "https://bugzilla.suse.com/1193440",
          "Description": "SUSE Bug 1193440"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": [
            "SUSE Linux Enterprise Micro 5.1:kernel-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:cluster-md-kmp-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:dlm-kmp-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:gfs2-kmp-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-devel-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-rt-devel-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-rt_debug-devel-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-source-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-syms-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:ocfs2-kmp-rt-5.3.18-68.1"
          ]
        }
      ],
      "CVSSScoreSets": {}
    },
    {
      "CVE": "CVE-2021-28712",
      "Description": "Rogue backends can cause DoS of guests via high frequency events T[his CNA information record relates to multiple CVEs; the text explains which aspects/vulnerabilities correspond to which CVE.] Xen offers the ability to run PV backends in regular unprivileged guests, typically referred to as \"driver domains\". Running PV backends in driver domains has one primary security advantage: if a driver domain gets compromised, it doesn't have the privileges to take over the system. However, a malicious driver domain could try to attack other guests via sending events at a high frequency leading to a Denial of Service in the guest due to trying to service interrupts for elongated amounts of time. There are three affected backends: * blkfront patch 1, CVE-2021-28711 * netfront patch 2, CVE-2021-28712 * hvc_xen (console) patch 3, CVE-2021-28713",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "moderate"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2021-28712.html",
          "Description": "CVE-2021-28712"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": [
            "SUSE Linux Enterprise Micro 5.1:kernel-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:cluster-md-kmp-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:dlm-kmp-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:gfs2-kmp-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-devel-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-rt-devel-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-rt_debug-devel-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-source-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-syms-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:ocfs2-kmp-rt-5.3.18-68.1"
          ]
        }
      ],
      "CVSSScoreSets": {}
    },
    {
      "CVE": "CVE-2021-28713",
      "Description": "Rogue backends can cause DoS of guests via high frequency events T[his CNA information record relates to multiple CVEs; the text explains which aspects/vulnerabilities correspond to which CVE.] Xen offers the ability to run PV backends in regular unprivileged guests, typically referred to as \"driver domains\". Running PV backends in driver domains has one primary security advantage: if a driver domain gets compromised, it doesn't have the privileges to take over the system. However, a malicious driver domain could try to attack other guests via sending events at a high frequency leading to a Denial of Service in the guest due to trying to service interrupts for elongated amounts of time. There are three affected backends: * blkfront patch 1, CVE-2021-28711 * netfront patch 2, CVE-2021-28712 * hvc_xen (console) patch 3, CVE-2021-28713",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "moderate"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2021-28713.html",
          "Description": "CVE-2021-28713"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": [
            "SUSE Linux Enterprise Micro 5.1:kernel-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:cluster-md-kmp-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:dlm-kmp-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:gfs2-kmp-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-devel-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-rt-devel-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-rt_debug-devel-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-source-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-syms-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:ocfs2-kmp-rt-5.3.18-68.1"
          ]
        }
      ],
      "CVSSScoreSets": {}
    },
    {
      "CVE": "CVE-2021-28714",
      "Description": "Guest can force Linux netback driver to hog large amounts of kernel memory T[his CNA information record relates to multiple CVEs; the text explains which aspects/vulnerabilities correspond to which CVE.] Incoming data packets for a guest in the Linux kernel's netback driver are buffered until the guest is ready to process them. There are some measures taken for avoiding to pile up too much data, but those can be bypassed by the guest: There is a timeout how long the client side of an interface can stop consuming new packets before it is assumed to have stalled, but this timeout is rather long (60 seconds by default). Using a UDP connection on a fast interface can easily accumulate gigabytes of data in that time. (CVE-2021-28715) The timeout could even never trigger if the guest manages to have only one free slot in its RX queue ring page and the next package would require more than one free slot, which may be the case when using GSO, XDP, or software hashing. (CVE-2021-28714)",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "moderate"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2021-28714.html",
          "Description": "CVE-2021-28714"
        },
        {
          "URL": "https://bugzilla.suse.com/1193442",
          "Description": "SUSE Bug 1193442"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": [
            "SUSE Linux Enterprise Micro 5.1:kernel-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:cluster-md-kmp-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:dlm-kmp-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:gfs2-kmp-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-devel-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-rt-devel-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-rt_debug-devel-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-source-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-syms-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:ocfs2-kmp-rt-5.3.18-68.1"
          ]
        }
      ],
      "CVSSScoreSets": {}
    },
    {
      "CVE": "CVE-2021-28715",
      "Description": "Guest can force Linux netback driver to hog large amounts of kernel memory T[his CNA information record relates to multiple CVEs; the text explains which aspects/vulnerabilities correspond to which CVE.] Incoming data packets for a guest in the Linux kernel's netback driver are buffered until the guest is ready to process them. There are some measures taken for avoiding to pile up too much data, but those can be bypassed by the guest: There is a timeout how long the client side of an interface can stop consuming new packets before it is assumed to have stalled, but this timeout is rather long (60 seconds by default). Using a UDP connection on a fast interface can easily accumulate gigabytes of data in that time. (CVE-2021-28715) The timeout could even never trigger if the guest manages to have only one free slot in its RX queue ring page and the next package would require more than one free slot, which may be the case when using GSO, XDP, or software hashing. (CVE-2021-28714)",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "moderate"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2021-28715.html",
          "Description": "CVE-2021-28715"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": [
            "SUSE Linux Enterprise Micro 5.1:kernel-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:cluster-md-kmp-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:dlm-kmp-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:gfs2-kmp-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-devel-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-rt-devel-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-rt_debug-devel-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-source-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-syms-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:ocfs2-kmp-rt-5.3.18-68.1"
          ]
        }
      ],
      "CVSSScoreSets": {}
    },
    {
      "CVE": "CVE-2021-33098",
      "Description": "Improper input validation in the Intel(R) Ethernet ixgbe driver for Linux before version 3.17.3 may allow an authenticated user to potentially enable denial of service via local access.",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "moderate"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2021-33098.html",
          "Description": "CVE-2021-33098"
        },
        {
          "URL": "https://bugzilla.suse.com/1192877",
          "Description": "SUSE Bug 1192877"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": [
            "SUSE Linux Enterprise Micro 5.1:kernel-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:cluster-md-kmp-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:dlm-kmp-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:gfs2-kmp-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-devel-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-rt-devel-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-rt_debug-devel-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-source-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-syms-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:ocfs2-kmp-rt-5.3.18-68.1"
          ]
        }
      ],
      "CVSSScoreSets": {}
    },
    {
      "CVE": "CVE-2021-4001",
      "Description": "A race condition was found in the Linux kernel's ebpf verifier between bpf_map_update_elem and bpf_map_freeze due to a missing lock in kernel/bpf/syscall.c. In this flaw, a local user with a special privilege (cap_sys_admin or cap_bpf) can modify the frozen mapped address space. This flaw affects kernel versions prior to 5.16 rc2.",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "important"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2021-4001.html",
          "Description": "CVE-2021-4001"
        },
        {
          "URL": "https://bugzilla.suse.com/1192990",
          "Description": "SUSE Bug 1192990"
        },
        {
          "URL": "https://bugzilla.suse.com/1192991",
          "Description": "SUSE Bug 1192991"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": [
            "SUSE Linux Enterprise Micro 5.1:kernel-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:cluster-md-kmp-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:dlm-kmp-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:gfs2-kmp-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-devel-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-rt-devel-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-rt_debug-devel-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-source-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-syms-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:ocfs2-kmp-rt-5.3.18-68.1"
          ]
        }
      ],
      "CVSSScoreSets": {}
    },
    {
      "CVE": "CVE-2021-4002",
      "Description": "A memory leak flaw in the Linux kernel's hugetlbfs memory usage was found in the way the user maps some regions of memory twice using shmget() which are aligned to PUD alignment with the fault of some of the memory pages. A local user could use this flaw to get unauthorized access to some data.",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "moderate"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2021-4002.html",
          "Description": "CVE-2021-4002"
        },
        {
          "URL": "https://bugzilla.suse.com/1192946",
          "Description": "SUSE Bug 1192946"
        },
        {
          "URL": "https://bugzilla.suse.com/1192973",
          "Description": "SUSE Bug 1192973"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": [
            "SUSE Linux Enterprise Micro 5.1:kernel-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:cluster-md-kmp-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:dlm-kmp-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:gfs2-kmp-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-devel-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-rt-devel-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-rt_debug-devel-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-source-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-syms-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:ocfs2-kmp-rt-5.3.18-68.1"
          ]
        }
      ],
      "CVSSScoreSets": {}
    },
    {
      "CVE": "CVE-2021-43975",
      "Description": "In the Linux kernel through 5.15.2, hw_atl_utils_fw_rpc_wait in drivers/net/ethernet/aquantia/atlantic/hw_atl/hw_atl_utils.c allows an attacker (who can introduce a crafted device) to trigger an out-of-bounds write via a crafted length value.",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "moderate"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2021-43975.html",
          "Description": "CVE-2021-43975"
        },
        {
          "URL": "https://bugzilla.suse.com/1192845",
          "Description": "SUSE Bug 1192845"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": [
            "SUSE Linux Enterprise Micro 5.1:kernel-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:cluster-md-kmp-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:dlm-kmp-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:gfs2-kmp-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-devel-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-rt-devel-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-rt_debug-devel-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-source-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-syms-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:ocfs2-kmp-rt-5.3.18-68.1"
          ]
        }
      ],
      "CVSSScoreSets": {}
    },
    {
      "CVE": "CVE-2021-43976",
      "Description": "In the Linux kernel through 5.15.2, mwifiex_usb_recv in drivers/net/wireless/marvell/mwifiex/usb.c allows an attacker (who can connect a crafted USB device) to cause a denial of service (skb_over_panic).",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "moderate"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2021-43976.html",
          "Description": "CVE-2021-43976"
        },
        {
          "URL": "https://bugzilla.suse.com/1192847",
          "Description": "SUSE Bug 1192847"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": [
            "SUSE Linux Enterprise Micro 5.1:kernel-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:cluster-md-kmp-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:dlm-kmp-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:gfs2-kmp-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-devel-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-rt-devel-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-rt_debug-devel-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-source-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-syms-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:ocfs2-kmp-rt-5.3.18-68.1"
          ]
        }
      ],
      "CVSSScoreSets": {}
    },
    {
      "CVE": "CVE-2021-45485",
      "Description": "In the IPv6 implementation in the Linux kernel before 5.13.3, net/ipv6/output_core.c has an information leak because of certain use of a hash table which, although big, doesn't properly consider that IPv6-based attackers can typically choose among many IPv6 source addresses.",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "low"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2021-45485.html",
          "Description": "CVE-2021-45485"
        },
        {
          "URL": "https://bugzilla.suse.com/1194094",
          "Description": "SUSE Bug 1194094"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": [
            "SUSE Linux Enterprise Micro 5.1:kernel-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:cluster-md-kmp-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:dlm-kmp-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:gfs2-kmp-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-devel-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-rt-devel-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-rt_debug-devel-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-source-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-syms-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:ocfs2-kmp-rt-5.3.18-68.1"
          ]
        }
      ],
      "CVSSScoreSets": {}
    },
    {
      "CVE": "CVE-2021-45486",
      "Description": "In the IPv4 implementation in the Linux kernel before 5.12.4, net/ipv4/route.c has an information leak because the hash table is very small.",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "low"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2021-45486.html",
          "Description": "CVE-2021-45486"
        },
        {
          "URL": "https://bugzilla.suse.com/1194087",
          "Description": "SUSE Bug 1194087"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": [
            "SUSE Linux Enterprise Micro 5.1:kernel-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:cluster-md-kmp-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:dlm-kmp-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:gfs2-kmp-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-devel-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-rt-devel-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-rt_debug-devel-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-source-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:kernel-syms-rt-5.3.18-68.1",
            "SUSE Real Time Module 15 SP3:ocfs2-kmp-rt-5.3.18-68.1"
          ]
        }
      ],
      "CVSSScoreSets": {}
    }
  ]
}