{
  "Identifier": "GHSA-g5xx-c4hv-9ccc",
  "PackageSlug": "go/github.com/cometbft/cometbft",
  "Title": "CometBFT's state syncing validator from malicious node may lead to a chain split",
  "Description": "The state sync protocol retrieves a snapshot of the application and installs it in a fresh node. In order for this node to be ready to run consensus and block sync from the installed snapshot height, we also need to install a valid `State` in the node, which is the starting state from which it is able to validate new blocks and append them to the blockchain.\n\nThe `State` object used by state sync is computed using the light client protocol, which retrieves information about committed blocks from at least two RPC endpoints. The light client protocol performs several state validations and, in particular, compares the state provided by different RPC endpoints, looking for inconsistencies.\n\nThe `State` object contains, among other fields, a `Validators` field which stores the current validator set. A validator set is a list of validator addresses, public keys and associated voting powers, one per validator. It also stores, for historical reasons, the state of the proposer selection algorithm, in the form of the `ProposerPriority` field associated with each `Validator`.\n\nWhile the light client is able to validate the `ValidatorSet` retrieved from RPC endpoints, this validation does not include the `ProposerPriority` field associated with each `Validator`. As a result, when state sync adopts RPC endpoints that, for unknown reasons, provide an invalid state of the proposer selection algorithm, the node will not be able to properly run the consensus protocol, as their local view of which validator is the proposer of a given round and height will disagree with the views of the correct validators. If an increasing number of validators state sync using RPC endpoints with invalid states, the network eventually halts.",
  "Date": "2024-11-18",
  "Pubdate": "2024-09-03",
  "AffectedRange": "\u003e=0.34.0 \u003c0.34.34||\u003e=0.37.0 \u003c0.37.11||\u003e=0.38.0 \u003c0.38.12",
  "FixedVersions": [
    "0.34.34",
    "0.37.11",
    "0.38.12"
  ],
  "AffectedVersions": "All versions starting from 0.34.0 before 0.34.34, all versions starting from 0.37.0 before 0.37.11, all versions starting from 0.38.0 before 0.38.12",
  "NotImpacted": "All versions before 0.34.0, all versions starting from 0.34.34 before 0.37.0, all versions starting from 0.37.11 before 0.38.0, all versions starting from 0.38.12",
  "Solution": "Upgrade to versions 0.34.34, 0.37.11, 0.38.12 or above.",
  "Urls": [
    "https://github.com/advisories/GHSA-g5xx-c4hv-9ccc",
    "https://github.com/cometbft/cometbft/security/advisories/GHSA-g5xx-c4hv-9ccc",
    "https://github.com/cometbft/cometbft/commit/3937e00a339ee6b861d75997b4f6c87d867b74f2",
    "https://github.com/cometbft/cometbft/commit/52c00a537f8f56ed94b4a5c8af6e3fecff468b55",
    "https://github.com/cometbft/cometbft",
    "https://pkg.go.dev/vuln/GO-2024-3112"
  ],
  "CvssV2": "",
  "CvssV3": "CVSS:3.1/AV:N/AC:H/PR:N/UI:R/S:C/C:N/I:L/A:L",
  "UUID": "8681069c-8d98-47ee-830f-d427a7f2a16d"
}