{
  "Identifier": "GHSA-qr8r-m495-7hc4",
  "PackageSlug": "go/github.com/cometbft/cometbft",
  "Title": "Validation of `VoteExtensionsEnableHeight` can cause chain halt in Go package github.com/cometbft/cometbft",
  "Description": "## Summary\n\nA vulnerability in CometBFT’s validation logic for `VoteExtensionsEnableHeight` can result in a chain halt when triggered through a governance parameter change proposal on an ABCI2 Application Chain. If a parameter change proposal including a `VoteExtensionsEnableHeight` modification is passed, nodes running the affected versions may panic, halting the network.\n\nThe CometBFT team addressed this issue by improving validation logic for the `VoteExtensionsEnableHeight` to correctly handle governance proposals addressing this parameter.\n\n## Next Steps for Impacted Parties\n\nIf you are a chain developer with an active network running on CometBFT v. 0.38.x, we recommend updating your chain application to v0.38.3 or later of CometBFT to patch this issue. \n\nThis issue can be resolved with a “soft patch” to an active network, i.e. nodes can be patched and restarted at different times without the need for a coordinated upgrade that halts a chain. If this patching methodology is used, the risk of a network halt triggered by this issue is mitigated once more than 66.7% of voting power on the network has applied the update, which provides protection from exploitation while on-chain governance processes for software upgrades take place. Once all validator nodes operating a network have been updated, the risk of a network halt due to this issue will be fully resolved. \n\nFor more information about CometBFT, see https://docs.cometbft.com/. \n\nThis issue was found by Dongsam ([@b_harvest](https://twitter.com/b__harvest?lang=en)) who reported it to the Cosmos Bug Bounty Program on HackerOne on January 15, 2024. If you believe you have found a bug in the Interchain Stack or would like to contribute to the program by reporting a bug, please see https://hackerone.com/cosmos.",
  "Date": "2024-01-19",
  "Pubdate": "2024-01-19",
  "AffectedRange": "\u003e=v0.38.0 \u003cv0.38.3",
  "FixedVersions": [
    "v0.38.3"
  ],
  "AffectedVersions": "All versions starting from 0.38.0 before 0.38.3",
  "NotImpacted": "All versions before 0.38.0, all versions starting from 0.38.3",
  "Solution": "Upgrade to version 0.38.3 or above.",
  "Urls": [
    "https://github.com/cometbft/cometbft/security/advisories/GHSA-qr8r-m495-7hc4",
    "https://github.com/cometbft/cometbft/commit/5fbc97378b94b0945febe9549399e7c9c5df13ed",
    "https://github.com/advisories/GHSA-qr8r-m495-7hc4"
  ],
  "CvssV2": "",
  "CvssV3": "",
  "UUID": "7f018012-c13e-4b3a-9d1a-e8b5ce772f8d"
}