{
  "Severity": "MODERATE",
  "UpdatedAt": "2024-04-17T17:37:24Z",
  "Package": {
    "Ecosystem": "GO",
    "Name": "github.com/evmos/evmos/v13"
  },
  "Advisory": {
    "DatabaseId": 242234,
    "Id": "GSA_kwCzR0hTQS1tOTljLXEyNnItbTdtN84AA7I6",
    "GhsaId": "GHSA-m99c-q26r-m7m7",
    "References": [
      {
        "Url": "https://github.com/evmos/evmos/security/advisories/GHSA-m99c-q26r-m7m7"
      },
      {
        "Url": "https://github.com/advisories/GHSA-m99c-q26r-m7m7"
      }
    ],
    "Identifiers": [
      {
        "Type": "GHSA",
        "Value": "GHSA-m99c-q26r-m7m7"
      }
    ],
    "Description": "### Impact\n_What kind of vulnerability is it? Who is impacted?_\n\nUsing the vesting module, a malicious attacker can create a new vesting account at a given\naddress, before a contract is created on that address.\n\nAddresses of smart contracts deployed to the EVM are deterministic. Therefore, it would be possible for an attacker to front-run a contract creation and create a vesting account at that address. \nWhen an address has been initialized without any contract code deployed to it, it will not be possible to upload any afterwards. In the described attack, this would mean that a malicious actor could prevent smart contracts from being deployed correctly.\n\nIn order to remediate this, an alternative user flow is being implemented for the vesting module:\n- only the account receiving the vesting funds will be able to create such an account by calling the `CreateClawbackVestingAccount` method and defining a funder address\n- vesting and lockup periods can then be created by that funder address using `FundClawbackAccount`\n\n### Patches\n_Has the problem been patched? What versions should users upgrade to?_\n\n### Workarounds\n_Is there a way for users to fix or remediate the vulnerability without upgrading?_\n\n### References\n_Are there any links users can visit to find out more?_\n",
    "Origin": "UNSPECIFIED",
    "PublishedAt": "2024-04-17T17:37:23Z",
    "Severity": "MODERATE",
    "Summary": "Evmos vulnerable to unauthorized account creation with vesting module",
    "UpdatedAt": "2024-04-17T17:37:24Z",
    "WithdrawnAt": "",
    "CVSS": {
      "Score": 0,
      "VectorString": ""
    }
  },
  "Versions": [
    {
      "FirstPatchedVersion": {
        "Identifier": ""
      },
      "VulnerableVersionRange": "\u003c= 13.0.2"
    }
  ]
}