{
  "id": "GHSA-66q9-2rvx-qfj5",
  "modified": "2024-12-04T16:59:19.612601Z",
  "published": "2024-12-03T20:56:58Z",
  "aliases": [
    "CVE-2024-54131",
    "GO-2024-3308"
  ],
  "summary": "Kolide Agent Privilege Escalation (Windows, Versions \u003e= 1.5.3, \u003c 1.12.3)",
  "details": "An implementation bug in the Kolide Agent (known as `launcher`) allows for local privilege escalation to the SYSTEM user on Windows 10 and 11. Impacted versions include versions \u003e= 1.5.3 and the fix has been released in 1.12.3. \n\nThe bug was introduced in version 1.5.3 when launcher started storing upgraded binaries in the ProgramData directory (#1510). This move to the new directory meant the launcher root directory inherited default permissions that are not as strict as the previous location. These incorrect default permissions in conjunction with an omitted SystemDrive environmental variable (when launcher starts osqueryd), allows a malicious actor with access to the local Windows device to successfully place an arbitrary DLL into the osqueryd process's search path. Under some circumstances, this DLL will be executed when osqueryd performs a WMI query. This combination of events could then allow the attacker to escalate their privileges to SYSTEM.\n\nThis issue was found by Bryan Alexander of Atredis Partners and responsibly reported through the Kolide bug bounty program. Kolide made the appropriate changes and released a fix in version 1.12.3 of the `launcher` package.\n",
  "affected": [
    {
      "package": {
        "ecosystem": "Go",
        "name": "github.com/kolide/launcher",
        "purl": "pkg:golang/github.com/kolide/launcher"
      },
      "ranges": [
        {
          "type": "SEMVER",
          "events": [
            {
              "introduced": "1.5.3"
            },
            {
              "fixed": "1.12.3"
            }
          ]
        }
      ],
      "database_specific": {
        "source": "https://github.com/github/advisory-database/blob/main/advisories/github-reviewed/2024/12/GHSA-66q9-2rvx-qfj5/GHSA-66q9-2rvx-qfj5.json"
      }
    }
  ],
  "references": [
    {
      "type": "WEB",
      "url": "https://github.com/kolide/launcher/security/advisories/GHSA-66q9-2rvx-qfj5"
    },
    {
      "type": "WEB",
      "url": "https://github.com/kolide/launcher/pull/1510"
    },
    {
      "type": "PACKAGE",
      "url": "https://github.com/kolide/launcher"
    }
  ]
}