{
  "Severity": "HIGH",
  "UpdatedAt": "2024-05-15T21:19:08Z",
  "Package": {
    "Ecosystem": "COMPOSER",
    "Name": "ezsystems/ezpublish-kernel"
  },
  "Advisory": {
    "DatabaseId": 246250,
    "Id": "GSA_kwCzR0hTQS0zdndyLWpqNGYtaDk4eM4AA8Hq",
    "GhsaId": "GHSA-3vwr-jj4f-h98x",
    "References": [
      {
        "Url": "https://ezplatform.com/security-advisories/ezsa-2020-001-remote-code-execution-in-file-uploads"
      },
      {
        "Url": "https://github.com/FriendsOfPHP/security-advisories/blob/master/ezsystems/ezpublish-kernel/2020-03-03-1.yaml"
      },
      {
        "Url": "https://web.archive.org/web/20210304031629/https://developers.ibexa.co/security-advisories/ezsa-2020-001-remote-code-execution-in-file-uploads"
      },
      {
        "Url": "https://github.com/advisories/GHSA-3vwr-jj4f-h98x"
      }
    ],
    "Identifiers": [
      {
        "Type": "GHSA",
        "Value": "GHSA-3vwr-jj4f-h98x"
      }
    ],
    "Description": "This Security Advisory is about a vulnerability in the way eZ Platform and eZ Publish Legacy handles file uploads, which can in the worst case lead to remote code execution (RCE), a very serious threat. An attacker would need access to uploading files to be able to exploit the vulnerability, so if you have strict controls on this and trust all who have this permission, you're not affected. On the basis of the tests we have made, we also believe the vulnerability cannot be exploited as long as our recommended vhost configuration is used. Here is the v2.5 recommendation for Nginx, as an example:\n\nhttps://github.com/ezsystems/ezplatform/blob/2.5/doc/nginx/vhost.template#L31\n\nThis vhost template specifies that only the file app.php in the web root is executed, while vulnerable configurations allow execution of any php file. Apache is affected in the same way as Nginx, and is also protected by using the recommended configuration. The build-in webserver in PHP stays vulnerable, as it doesn't use this type of configuration (this webserver should only be used for development, never for production). We cannot be 100% certain our configuration is not vulnerable. We also do not know if all our users use the recommended configuration, so we send out this fix to be on the safe side.\n\nThe fix includes a blacklist feature for uploaded filenames, such as \".php\". The file types on the blacklist cannot be uploaded. The blacklist is configurable. In eZ Platform you will find it as ezsettings.default.io.file_storage.file_type_blacklist in eZ/Bundle/EzPublishCoreBundle/Resources/config/default_settings.yml in vendors/ezsystems/ezpublish-kernel. In eZ Publish Legacy you will find it as FileExtensionBlackList in settings/file.ini. By default it blocks these file types: php, php3, phar, phpt, pht, phtml, pgif. The fix also inclues a new block against path traversal attacks, though this kind of attack was not reproducible in our tests.\n",
    "Origin": "UNSPECIFIED",
    "PublishedAt": "2024-05-15T21:19:07Z",
    "Severity": "HIGH",
    "Summary": "eZ Publish Remote code execution in file uploads",
    "UpdatedAt": "2024-05-15T21:19:08Z",
    "WithdrawnAt": "",
    "CVSS": {
      "Score": 0,
      "VectorString": ""
    }
  },
  "Versions": [
    {
      "FirstPatchedVersion": {
        "Identifier": "5.4.14.1"
      },
      "VulnerableVersionRange": "\u003e= 5.4.0, \u003c 5.4.14.1"
    },
    {
      "FirstPatchedVersion": {
        "Identifier": "6.13.6.2"
      },
      "VulnerableVersionRange": "\u003e= 6.13.0, \u003c 6.13.6.2"
    },
    {
      "FirstPatchedVersion": {
        "Identifier": "7.5.6.2"
      },
      "VulnerableVersionRange": "\u003e= 7.5.0, \u003c 7.5.6.2"
    }
  ]
}