{
  "id": "GHSA-wr2m-38xh-rpc9",
  "modified": "2025-04-08T17:38:59Z",
  "published": "2025-04-08T17:38:59Z",
  "summary": "Lemmy user purging users or communities or banning users can delete images they didn't upload/exclusively use",
  "details": "### Summary\nAn improper uploaded media ownership check can result in inadvertent deletion of media when a user is banned with content removal or purged. This can lead to deletion of media that was not uploaded by the banned/purged user. This also applies to purged communities, in which case all media posted in that community will get deleted without proper ownership check.\nThis is limited to media with an `image/*` content-type returned by pict-rs.\n\n### Details\nLemmy did not associate users with media uploads until version 0.19.0 ([#3927](https://github.com/LemmyNet/lemmy/pull/3927)).\nBack when the first parts of content purging were implemented for 0.17.0 ([#1809](https://github.com/LemmyNet/lemmy/pull/1809)), it was therefore not possible to properly identify media belonging to a specific user for situations in which this data should get erased from pict-rs, Lemmy's media storage backend.\n\nPict-rs deduplicates uploaded files transparently. As a result, it has two types of media deletion. A regular deletion will only remove the referenced alias, and if there are not other aliases pointing to the same file, the backing file will also be deleted. A purge on the other hand will delete all aliases pointing to the specified file, as well as the file itself.\n\nThe logic implemented in 0.17.0 iterated over media URLs related to users and communities when purging them and purged them from pict-rs. This results in a full deletion of the backing media, even if either the same URL was the result of an upload by a different user, or the same media being uploaded by another user with a different alias.\nFor user purges, Lemmy iterated over all posts they created and applied this to all media referenced in post URLs and post thumbnails. For community purges, this applied to all posts within this community.\n\nAdditionally, the deletion of user avatars, banners, as well as the media from all their posts was implemented when users were banned with content removal. This includes local bans and also bans received via federation, when a user gets banned on their home instance.\n\nThe function for purging images from pict-rs performs a check at the start to verify that the media `Content-Type` header returned by pict-rs starts with `image/`, which limits this to not affect other media types supported by Lemmy and pict-rs, such as videos.\n\n### Impact\n\n#### Instances with open federation\nThe vast majority of Lemmy instances has open federation, which means that this can be exploited remotely without any authentication.\n\n#### Instances with limited or no federation\nExploitation requires user interaction by an admin of the targeted instance or a federation-linked instance if federation is enabled.\nIt may also require authentication, as instances may not have open registrations.",
  "affected": [
    {
      "package": {
        "ecosystem": "crates.io",
        "name": "lemmy_server",
        "purl": "pkg:cargo/lemmy_server"
      },
      "ranges": [
        {
          "type": "SEMVER",
          "events": [
            {
              "introduced": "0.17.0"
            },
            {
              "fixed": "0.19.11"
            }
          ]
        }
      ],
      "database_specific": {
        "source": "https://github.com/github/advisory-database/blob/main/advisories/github-reviewed/2025/04/GHSA-wr2m-38xh-rpc9/GHSA-wr2m-38xh-rpc9.json"
      }
    }
  ],
  "references": [
    {
      "type": "WEB",
      "url": "https://github.com/LemmyNet/lemmy/security/advisories/GHSA-wr2m-38xh-rpc9"
    },
    {
      "type": "WEB",
      "url": "https://github.com/LemmyNet/lemmy/pull/1809"
    },
    {
      "type": "WEB",
      "url": "https://github.com/LemmyNet/lemmy/pull/3927"
    },
    {
      "type": "WEB",
      "url": "https://github.com/LemmyNet/lemmy/pull/5566"
    },
    {
      "type": "PACKAGE",
      "url": "https://github.com/LemmyNet/lemmy"
    }
  ]
}