{
  "Severity": "HIGH",
  "UpdatedAt": "2025-10-10T17:03:02Z",
  "Package": {
    "Ecosystem": "GO",
    "Name": "github.com/quic-go/quic-go"
  },
  "Advisory": {
    "DatabaseId": 316448,
    "Id": "GSA_kwCzR0hTQS00N20yLTRjcjctbWhjd84ABNQg",
    "GhsaId": "GHSA-47m2-4cr7-mhcw",
    "References": [
      {
        "Url": "https://github.com/quic-go/quic-go/security/advisories/GHSA-47m2-4cr7-mhcw"
      },
      {
        "Url": "https://github.com/quic-go/quic-go/pull/5354"
      },
      {
        "Url": "https://github.com/quic-go/quic-go/commit/bc5bccf10fd02728eef150683eb4dfaa5c0e749c"
      },
      {
        "Url": "https://github.com/quic-go/quic-go/commit/ce7c9ea8834b9d2ed79efa9269467f02c0895d42"
      },
      {
        "Url": "https://github.com/quic-go/quic-go/blob/v0.55.0/connection.go#L2682-L2685"
      },
      {
        "Url": "https://nvd.nist.gov/vuln/detail/CVE-2025-59530"
      },
      {
        "Url": "https://pkg.go.dev/vuln/GO-2025-4017"
      },
      {
        "Url": "https://github.com/advisories/GHSA-47m2-4cr7-mhcw"
      }
    ],
    "Identifiers": [
      {
        "Type": "GHSA",
        "Value": "GHSA-47m2-4cr7-mhcw"
      },
      {
        "Type": "CVE",
        "Value": "CVE-2025-59530"
      }
    ],
    "Description": "## Summary\n\nA misbehaving or malicious server can trigger an assertion in a quic-go client (and crash the process) by sending a premature HANDSHAKE_DONE frame during the handshake.\n\n## Impact\n\nA misbehaving or malicious server can cause a denial-of-service (DoS) attack on the quic-go client by triggering an assertion failure, leading to a process crash. This requires no authentication and can be exploited during the handshake phase. Observed in the wild with certain server implementations (e.g. Solana's Firedancer QUIC).\n\n## Affected Versions\n\n- All versions prior to v0.49.1 (for the 0.49 branch)\n- Versions v0.50.0 to v0.54.0 (inclusive)\n- Fixed in v0.49.1, v0.54.1, and v0.55.0 onward\n\nUsers are recommended to upgrade to the latest patched version in their respective maintenance branch or to v0.55.0 or later.\n\n## Details\n\nFor a regular 1-RTT handshake, QUIC uses three sets of keys to encrypt / decrypt QUIC packets:\n\n- Initial keys (derived from a static key and the connection ID)\n- Handshake keys (derived from the client's and server's key shares in the TLS handshake)\n- 1-RTT keys (derived when the TLS handshake finishes)\n\nOn the client side, Initial keys are discarded when the first Handshake packet is sent. Handshake keys are discarded when the server's HANDSHAKE_DONE frame is received, as specified in section 4.9.2 of RFC 9001. Crucially, Initial keys are always dropped before Handshake keys in a standard handshake.\n\nDue to packet reordering, it is possible to receive a packet with a higher encryption level before the key for that encryption level has been derived. For example, the server's Handshake packets (containing, among others, the TLS certificate) might arrive before the server's Initial packet (which contains the TLS ServerHello). In that case, the client queues the Handshake packets and decrypts them as soon as it has processed the ServerHello and derived Handshake keys.\n\nAfter completion of the handshake, Initial and Handshake packets are not needed anymore and will be dropped. quic-go implements an [assertion](https://github.com/quic-go/quic-go/blob/v0.55.0/connection.go#L2682-L2685) that no packets are queued after completion of the handshake.\n\nA misbehaving or malicious server can trigger this assertion, and thereby cause a panic, by sending a HANDSHAKE_DONE frame before actually completing the handshake. In that case, Handshake keys would be dropped before Initial keys.\n\nThis can only happen if the server implementation is misbehaving: the server can only complete the handshake after receiving the client's TLS Finished message (which is sent in Handshake packets).\n\n## The Fix\n\nquic-go needs to be able to handle misbehaving server implementations, including those that prematurely send a HANDSHAKE_DONE frame. We now discard Initial keys when receiving a HANDSHAKE_DONE frame, thereby correctly handling premature HANDSHAKE_DONE frames. The fix was implemented in https://github.com/quic-go/quic-go/pull/5354.",
    "Origin": "UNSPECIFIED",
    "PublishedAt": "2025-10-10T17:03:01Z",
    "Severity": "HIGH",
    "Summary": "quic-go: Panic occurs when queuing undecryptable packets after handshake completion",
    "UpdatedAt": "2025-11-05T22:06:27Z",
    "WithdrawnAt": "",
    "CVSS": {
      "Score": 7.5,
      "VectorString": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H"
    }
  },
  "Versions": [
    {
      "FirstPatchedVersion": {
        "Identifier": "0.54.1"
      },
      "VulnerableVersionRange": "\u003e= 0.50.0, \u003c 0.54.1"
    },
    {
      "FirstPatchedVersion": {
        "Identifier": "0.49.1"
      },
      "VulnerableVersionRange": "\u003c 0.49.1"
    }
  ]
}