{
  "Severity": "MODERATE",
  "UpdatedAt": "2025-11-14T21:45:37Z",
  "Package": {
    "Ecosystem": "NPM",
    "Name": "directus"
  },
  "Advisory": {
    "DatabaseId": 321798,
    "Id": "GSA_kwCzR0hTQS12djJ2LXB3NjktOGNyZs4ABOkG",
    "GhsaId": "GHSA-vv2v-pw69-8crf",
    "References": [
      {
        "Url": "https://github.com/directus/directus/security/advisories/GHSA-vv2v-pw69-8crf"
      },
      {
        "Url": "https://nvd.nist.gov/vuln/detail/CVE-2025-64747"
      },
      {
        "Url": "https://github.com/directus/directus/commit/d23525317f0780f04aa1fe7a99171a358e43cb2e"
      },
      {
        "Url": "https://github.com/advisories/GHSA-vv2v-pw69-8crf"
      }
    ],
    "Identifiers": [
      {
        "Type": "GHSA",
        "Value": "GHSA-vv2v-pw69-8crf"
      },
      {
        "Type": "CVE",
        "Value": "CVE-2025-64747"
      }
    ],
    "Description": "### Summary\n\nA stored cross-site scripting (XSS) vulnerability exists that allows users with `upload files` and `edit item` permissions to inject malicious JavaScript through the Block Editor interface. Attackers can bypass Content Security Policy (CSP) restrictions by combining file uploads with iframe srcdoc attributes, resulting in persistent XSS execution.\n\n### Details\n\nThe vulnerability arises from insufficient sanitization in the Block Editor interface when processing JSON content containing HTML elements. The attack requires two permissions:\n- `upload files` - To upload malicious JavaScript files\n- `edit item` - To create or modify content with the Block Editor\n\n**Attack Vector:**\n\n1. **JavaScript File Upload**: Attackers upload a malicious JavaScript file via the files endpoint, obtaining a file ID accessible through the assets directory\n\n2. **Block Editor Exploitation**: Using a JSON field with Block Editor interface, attackers inject raw HTML containing an iframe with srcdoc attribute that references the uploaded file\n\n3. **CSP Bypass**: The iframe srcdoc technique circumvents existing CSP protections by creating a new document context that loads the uploaded script\n\nThe payload is injected through direct API manipulation (PATCH request) to bypass client-side validation, targeting the Block Editor's paragraph data structure within the JSON content field.\n\n### Impact\n\nThis vulnerability enables:\n- **Persistent XSS** - Malicious scripts execute whenever affected content is viewed\n- **Session hijacking** - Access to authentication tokens and cookies of users viewing the content\n- **Administrative compromise** - If administrators view infected content, their elevated privileges can be exploited\n- **CSP bypass** - Demonstrates ineffective security controls, potentially affecting other protections\n- **Data exfiltration** - Ability to steal sensitive information displayed in the application\n- **Phishing attacks** - Injection of convincing fake login forms or malicious redirects",
    "Origin": "UNSPECIFIED",
    "PublishedAt": "2025-11-14T21:45:36Z",
    "Severity": "MODERATE",
    "Summary": "Directus is Vulnerable to Stored Cross-site Scripting",
    "UpdatedAt": "2025-11-14T21:45:37Z",
    "WithdrawnAt": "",
    "CVSS": {
      "Score": 5.5,
      "VectorString": "CVSS:3.1/AV:N/AC:L/PR:L/UI:R/S:U/C:L/I:L/A:L"
    }
  },
  "Versions": [
    {
      "FirstPatchedVersion": {
        "Identifier": "11.13.0"
      },
      "VulnerableVersionRange": "\u003c 11.13.0"
    }
  ]
}