{
  "Title": "Security update for mbedtls",
  "Tracking": {
    "ID": "openSUSE-SU-2015:2257-1",
    "Status": "Final",
    "Version": "1",
    "InitialReleaseDate": "2015-12-13T08:52:10Z",
    "CurrentReleaseDate": "2015-12-13T08:52:10Z",
    "RevisionHistory": [
      {
        "Number": "1",
        "Date": "2015-12-13T08:52:10Z",
        "Description": "current"
      }
    ]
  },
  "Notes": [
    {
      "Text": "Security update for mbedtls",
      "Title": "Topic",
      "Type": "Summary"
    },
    {
      "Text": "\nThis update for mbedtls fixes the following security and non-security issues: \n\n- Update to 1.3.15\n  * Fix potential double free if ssl_set_psk() is called more than once and\n    some allocation fails. Cannot be forced remotely. Found by Guido Vranken,\n    Intelworks.\n  * Fix potential heap corruption on windows when\n    x509_crt_parse_path() is passed a path longer than 2GB. Cannot be\n    triggered remotely. Found by Guido Vranken, Intelworks.\n  * Fix potential buffer overflow in some asn1_write_xxx() functions.\n    Cannot be triggered remotely unless you create X.509 certificates based\n    on untrusted input or write keys of untrusted origin. Found by Guido\n    Vranken, Intelworks.\n  * The x509 max_pathlen constraint was not enforced on intermediate\n    certificates. Found by Nicholas Wilson, fix and tests provided by\n    Janos Follath. #280 and #319\n  * Self-signed certificates were not excluded from pathlen counting,\n    resulting in some valid X.509 being incorrectly rejected. Found and fix\n    provided by Janos Follath. #319\n  * Fix bug causing some handshakes to fail due to some non-fatal alerts not\n    begin properly ignored. Found by mancha and Kasom Koht-arsa, #308\n  * Fix build error with configurations where ecdhe-psk is the only key\n    exchange. Found and fix provided by Chris Hammond. #270\n  * Fix failures in mpi on sparc(64) due to use of bad assembly code.\n    Found by Kurt Danielson. #292\n  * Fix typo in name of the extkeyusage oid. found by inestlerode, #314\n  * Fix bug in asn.1 encoding of booleans that caused generated ca\n    certificates to be rejected by some applications, including OS X\n    Keychain. Found and fixed by Jonathan Leroy, Inikup.\n  * Fix 'destination buffer is too small' error in cert_write program.\n    Found and fixed by Jonathan Leroy, Inikup.\n\n- Update to 1.3.14\n  * Added fix for CVE-2015-5291 (boo#949380) to prevent heap corruption due to buffer\n    overflow of the hostname or session ticket. Found by Guido Vranken,\n    Intelworks.\n  * Fix stack buffer overflow in pkcs12 decryption (used by\n    mbedtls_pk_parse_key(file)() when the password is \u003e 129 bytes. Found by\n    Guido Vranken, Intelworks. Not triggerable remotely.\n  * Fix potential buffer overflow in mbedtls_mpi_read_string().\n    Found by Guido Vranken, Intelworks. Not exploitable remotely in the context\n    of TLS, but might be in other uses. On 32 bit machines, requires reading a\n    string of close to or larger than 1GB to exploit; on 64 bit machines, would\n    require reading a string of close to or larger than 2^62 bytes.\n  * Fix potential random memory allocation in mbedtls_pem_read_buffer()\n    on crafted PEM input data. Found and fix provided by Guido Vranken,\n    Intelworks. Not triggerable remotely in TLS. Triggerable remotely if you\n    accept PEM data from an untrusted source.\n  * Fix potential double-free if ssl_set_psk() is called repeatedly on\n    the same ssl_context object and some memory allocations fail. Found by\n    Guido Vranken, Intelworks. Can not be forced remotely.\n  * Fix possible heap buffer overflow in base64_encode() when the input\n    buffer is 512MB or larger on 32-bit platforms. Found by Guido Vranken,\n    Intelworks. Found by Guido Vranken. Not trigerrable remotely in TLS.\n  * Fix potential heap buffer overflow in servers that perform client\n    authentication against a crafted CA cert. Cannot be triggered remotely\n    unless you allow third parties to pick trust CAs for client auth. Found by\n    Guido Vranken, Intelworks.\n  * Fix compile error in net.c with musl libc. found and patch provided by\n    zhasha (#278).\n  * Fix macroization of 'inline' keywork when building as c++. (#279)\n  * Added checking of hostname length in ssl_set_hostname() to ensure domain\n    names are compliant with RFC 1035.\n- Changes for 1.3.13\n  * Fix possible client-side null pointer dereference (read) when the client\n    tries to continue the handshake after it failed (a misuse of the API).\n    (Found and patch provided by Fabian Foerg, Gotham Digital Science using afl-fuzz.)\n  * Add countermeasure against lenstra's rsa-crt attack for pkcs#1 v1.5\n    signatures. (Found by Florian Weimer, Red Hat.)\n    https://securityblog.redhat.com/2015/09/02/factoring-rsa-keys-with-tls-perfect-forward-secrecy/\n  * Setting ssl_min_dhm_bytes in config.h had no effect (overriden in ssl.h)\n    (found by Fabio Solari) (#256)\n  * Fix bug in mbedtls_rsa_public() and mbedtls_rsa_private() that could\n    result trying to unlock an unlocked mutex on invalid input (found by\n    Fredrik Axelsson) (#257)\n  * Fix -wshadow warnings (found by hnrkp) (#240)\n  * Fix unused function warning when using mbedtls_mdx_alt or\n    MBEDTLS_SHAxxx_ALT (found by Henrik) (#239)\n  * Fix memory corruption in pkey programs (found by yankuncheng) (#210)\n  * Fix memory corruption on client with overlong psk identity, around\n    SSL_MAX_CONTENT_LEN or higher - not triggerrable remotely (found by\n    Aleksandrs Saveljevs) (#238)\n  * Fix off-by-one error in parsing supported point format extension that\n    caused some handshakes to fail.\n  * When verifying a certificate chain, if an intermediate certificate is\n    trusted, no later cert is checked. (suggested by hannes-landeholm)\n    (#220).\n- Changes for 1.3.12\n  * Increase the minimum size of diffie-hellman parameters accepted by the\n    client to 1024 bits, to protect against Logjam attack.\n  * Increase the size of default diffie-hellman parameters on the server to\n    2048 bits. This can be changed with ssl_set_dh_params().\n  * Fix thread-safety issue in ssl debug module (found by edwin van vliet).\n  * Some example programs were not built using make, not included in visual\n    Studio projects (found by Kristian Bendiksen).\n  * Fix build error with cmake and pre-4.5 versions of gcc (found by hugo\n    Leisink).\n  * Fix missing -static-ligcc when building shared libraries for windows with\n    make.\n  * Fix compile error with armcc5 --gnu.\n  * Add ssl_min_dhm_bytes configuration parameter in config.h to choose the\n    minimum size of Diffie-Hellman parameters accepted by the client.\n  * The pem parser now accepts a trailing space at end of lines (#226).\n",
      "Title": "Details",
      "Type": "General"
    },
    {
      "Text": "The CVRF data is provided by SUSE under the Creative Commons License 4.0 with Attribution (CC-BY-4.0).",
      "Title": "Terms of Use",
      "Type": "Legal Disclaimer"
    }
  ],
  "ProductTree": {
    "Relationships": [
      {
        "ProductReference": "libmbedtls9-1.3.15-6.1",
        "RelatesToProductReference": "openSUSE Leap 42.1",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "libmbedtls9-32bit-1.3.15-6.1",
        "RelatesToProductReference": "openSUSE Leap 42.1",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "mbedtls-1.3.15-6.1",
        "RelatesToProductReference": "openSUSE Leap 42.1",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "mbedtls-devel-1.3.15-6.1",
        "RelatesToProductReference": "openSUSE Leap 42.1",
        "RelationType": "Default Component Of"
      }
    ]
  },
  "References": [
    {
      "URL": "https://lists.opensuse.org/opensuse-security-announce/2015-12/msg00013.html",
      "Description": "E-Mail link for openSUSE-SU-2015:2257-1"
    },
    {
      "URL": "https://www.suse.com/support/security/rating/",
      "Description": "SUSE Security Ratings"
    }
  ],
  "Vulnerabilities": [
    {
      "CVE": "CVE-2015-5291",
      "Description": "Heap-based buffer overflow in PolarSSL 1.x before 1.2.17 and ARM mbed TLS (formerly PolarSSL) 1.3.x before 1.3.14 and 2.x before 2.1.2 allows remote SSL servers to cause a denial of service (client crash) and possibly execute arbitrary code via a long hostname to the server name indication (SNI) extension, which is not properly handled when creating a ClientHello message.  NOTE: this identifier has been SPLIT per ADT3 due to different affected version ranges. See CVE-2015-8036 for the session ticket issue that was introduced in 1.3.0.",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "important"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2015-5291.html",
          "Description": "CVE-2015-5291"
        },
        {
          "URL": "https://bugzilla.suse.com/949380",
          "Description": "SUSE Bug 949380"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": [
            "openSUSE Leap 42.1:libmbedtls9-1.3.15-6.1",
            "openSUSE Leap 42.1:libmbedtls9-32bit-1.3.15-6.1",
            "openSUSE Leap 42.1:mbedtls-1.3.15-6.1",
            "openSUSE Leap 42.1:mbedtls-devel-1.3.15-6.1"
          ]
        }
      ],
      "CVSSScoreSets": {}
    }
  ]
}