{
  "id": "ALAS2-2020-1413",
  "title": "Amazon Linux 2 2017.12 - ALAS2-2020-1413: medium priority package update for python-virtualenv",
  "issued": {
    "date": "2020-04-20 20:48"
  },
  "updated": {
    "date": "2020-04-23 23:23"
  },
  "severity": "medium",
  "description": "Package updates are available for Amazon Linux 2 that fix the following vulnerabilities:\nCVE-2019-11236:\n\tIn the urllib3 library through 1.24.1 for Python, CRLF injection is possible if the attacker controls the request parameter.\n1700824: CVE-2019-11236 python-urllib3: CRLF injection due to not encoding the '\\r\\n' sequence leading to possible attack on internal service\n1700824: \nCVE-2019-11236 python-urllib3: CRLF injection due to not encoding the '\\r\\n' sequence leading to possible attack on internal service.\n\nCVE-2018-20060:\n\turllib3 before version 1.23 does not remove the Authorization HTTP header when following a cross-origin redirect (i.e., a redirect that differs in host, port, or scheme). This can allow for credentials in the Authorization header to be exposed to unintended hosts or transmitted in cleartext.\n1649153: CVE-2018-20060 python-urllib3: Cross-host redirect does not remove Authorization header allow for credential exposure\n1649153: \nCVE-2018-20060 python-urllib3: Cross-host redirect does not remove Authorization header allow for credential exposure\n\nCVE-2018-18074:\n\tThe Requests package before 2.20.0 for Python sends an HTTP Authorization header to an http URI upon receiving a same-hostname https-to-http redirect, which makes it easier for remote attackers to discover credentials by sniffing the network.\nA credentials-exposure flaw was found in python-requests, where if a request with authentication is redirected (302) from an HTTPS endpoint to an HTTP endpoint on the same host, the Authorization header is not stripped and the credentials can be read in plain text. A man-in-the-middle attacker could exploit this flaw to obtain a user\u0026#039;s valid credentials.\n99999: \nCVE-2018-18074 python-requests: Redirect from HTTPS to HTTP does not remove Authorization header\n1643829: CVE-2018-18074 python-requests: Redirect from HTTPS to HTTP does not remove Authorization header\n",
  "packages": [
    {
      "name": "python-virtualenv",
      "epoch": "0",
      "version": "15.1.0",
      "release": "4.amzn2",
      "arch": "noarch",
      "filename": "Packages/python-virtualenv-15.1.0-4.amzn2.noarch.rpm"
    }
  ],
  "references": [
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2018-18074",
      "id": "CVE-2018-18074",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2018-20060",
      "id": "CVE-2018-20060",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2019-11236",
      "id": "CVE-2019-11236",
      "type": "cve"
    }
  ],
  "cveids": [
    "CVE-2018-18074",
    "CVE-2018-20060",
    "CVE-2019-11236"
  ]
}