{
  "id": "ALAS2-2022-1789",
  "title": "Amazon Linux 2 2017.12 - ALAS2-2022-1789: important priority package update for thunderbird",
  "issued": {
    "date": "2022-04-25 23:45"
  },
  "updated": {
    "date": "2022-04-27 16:36"
  },
  "severity": "important",
  "description": "Package updates are available for Amazon Linux 2 that fix the following vulnerabilities:\nCVE-2022-28289:\n\tThe Mozilla Foundation Security Advisory describes this flaw as:\n\nMozilla developers and community members Nika Layzell, Andrew McCreight, Gabriele Svelto, and the Mozilla Fuzzing Team reported memory safety bugs present in Thunderbird 91.7. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code.\n\nCVE-2022-28286:\n\tThe Mozilla Foundation Security Advisory describes this flaw as:\n\nDue to a layout change, iframe contents could have been rendered outside of its border. This could have led to user confusion or spoofing attacks.\n\nCVE-2022-28285:\n\tThe Mozilla Foundation Security Advisory describes this flaw as:\n\nWhen generating the assembly code for MLoadTypedArrayElementHole, an incorrect AliasSet was used. In conjunction with another vulnerability this could have been used for an out of bounds memory read.\n\nCVE-2022-28282:\n\tThe Mozilla Foundation Security Advisory describes this flaw as:\n\nBy using a link with rel=\"localization\" a use-after-free could have been triggered by destroying an object during JavaScript execution and then referencing the object through a freed pointer, leading to a potential exploitable crash.\n\nCVE-2022-28281:\n\tThe Mozilla Foundation Security Advisory describes this flaw as:\n\nIf a compromised content process sent an unexpected number of WebAuthN Extensions in a Register command to the parent process, an out of bounds write would have occurred leading to memory corruption and a potentially exploitable crash.\n\nCVE-2022-24713:\n\tregex is an implementation of regular expressions for the Rust language. The regex crate features built-in mitigations to prevent denial of service attacks caused by untrusted regexes, or untrusted input matched by trusted regexes. Those (tunable) mitigations already provide sane defaults to prevent attacks. This guarantee is documented and it's considered part of the crate's API. Unfortunately a bug was discovered in the mitigations designed to prevent untrusted regexes to take an arbitrary amount of time during parsing, and it's possible to craft regexes that bypass such mitigations. This makes it possible to perform denial of service attacks by sending specially crafted regexes to services accepting user-controlled, untrusted regexes. All versions of the regex crate before or equal to 1.5.4 are affected by this issue. The fix is include starting from regex 1.5.5. All users accepting user-controlled regexes are recommended to upgrade immediately to the latest version of the regex crate. Unfortunately there is no fixed set of problematic regexes, as there are practically infinite regexes that could be crafted to exploit this vulnerability. Because of this, it us not recommend to deny known problematic regexes.\n\nCVE-2022-1197:\n\tThe Mozilla Foundation Security Advisory describes this flaw as:\n\nWhen importing a revoked key that specified key compromise as the revocation reason, Thunderbird did not update the existing copy of the key that was not yet revoked, and the existing key was kept as non-revoked. Revocation statements that used another revocation reason, or that didn't specify a revocation reason, were unaffected.\n\nCVE-2022-1196:\n\tThe Mozilla Foundation Security Advisory describes this flaw as:\n\nAfter a VR Process is destroyed, a reference to it may have been retained and used, leading to a use-after-free and potentially exploitable crash.\n\nCVE-2022-1097:\n\tThe Mozilla Foundation Security Advisory describes this flaw as:\n\nNSSToken objects were referenced via direct points, and could have been accessed in an unsafe way on different threads, leading to a use-after-free and potentially exploitable crash.\n",
  "packages": [
    {
      "name": "thunderbird",
      "epoch": "0",
      "version": "91.8.0",
      "release": "1.amzn2.0.1",
      "arch": "x86_64",
      "filename": "Packages/thunderbird-91.8.0-1.amzn2.0.1.x86_64.rpm"
    },
    {
      "name": "thunderbird-debuginfo",
      "epoch": "0",
      "version": "91.8.0",
      "release": "1.amzn2.0.1",
      "arch": "x86_64",
      "filename": "Packages/thunderbird-debuginfo-91.8.0-1.amzn2.0.1.x86_64.rpm"
    },
    {
      "name": "thunderbird",
      "epoch": "0",
      "version": "91.8.0",
      "release": "1.amzn2.0.1",
      "arch": "aarch64",
      "filename": "Packages/thunderbird-91.8.0-1.amzn2.0.1.aarch64.rpm"
    },
    {
      "name": "thunderbird-debuginfo",
      "epoch": "0",
      "version": "91.8.0",
      "release": "1.amzn2.0.1",
      "arch": "aarch64",
      "filename": "Packages/thunderbird-debuginfo-91.8.0-1.amzn2.0.1.aarch64.rpm"
    }
  ],
  "references": [
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-1097",
      "id": "CVE-2022-1097",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-1196",
      "id": "CVE-2022-1196",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-1197",
      "id": "CVE-2022-1197",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-24713",
      "id": "CVE-2022-24713",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-28281",
      "id": "CVE-2022-28281",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-28282",
      "id": "CVE-2022-28282",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-28285",
      "id": "CVE-2022-28285",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-28286",
      "id": "CVE-2022-28286",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-28289",
      "id": "CVE-2022-28289",
      "type": "cve"
    }
  ],
  "cveids": [
    "CVE-2022-1097",
    "CVE-2022-1196",
    "CVE-2022-1197",
    "CVE-2022-24713",
    "CVE-2022-28281",
    "CVE-2022-28282",
    "CVE-2022-28285",
    "CVE-2022-28286",
    "CVE-2022-28289"
  ]
}