{
  "id": "ALAS2-2018-1034",
  "title": "Amazon Linux 2 2017.12 - ALAS2-2018-1034: important priority package update for qemu-kvm",
  "issued": {
    "date": "2018-06-07 23:41"
  },
  "updated": {
    "date": "2018-06-11 22:08"
  },
  "severity": "important",
  "description": "Package updates are available for Amazon Linux 2 that fix the following vulnerabilities:\nCVE-2018-7858:\n\tQuick Emulator (aka QEMU), when built with the Cirrus CLGD 54xx VGA Emulator support, allows local guest OS privileged users to cause a denial of service (out-of-bounds access and QEMU process crash) by leveraging incorrect region calculation when updating VGA display.\n1553402: \nCVE-2018-7858 QEMU: cirrus: OOB access when updating VGA display\n\nCVE-2018-5683:\n\tAn out-of-bounds read access issue was found in the VGA emulator of QEMU. It could occur in vga_draw_text routine, while updating display area for a vnc client. A privileged user inside a guest could use this flaw to crash the QEMU process resulting in DoS.\n1530356: \nCVE-2018-5683 Qemu: Out-of-bounds read in vga_draw_text routine\n\nCVE-2018-3639:\n\tAn industry-wide issue was found in the way many modern microprocessor designs have implemented speculative execution of Load \u0026amp; Store instructions (a commonly used performance optimization). It relies on the presence of a precisely-defined instruction sequence in the privileged code as well as the fact that memory read from address to which a recent memory write has occurred may see an older value and subsequently cause an update into the microprocessor\u0026#039;s data cache even for speculatively executed instructions that never actually commit (retire). As a result, an unprivileged attacker could use this flaw to read privileged memory by conducting targeted cache side-channel attacks.\n1566890: \nCVE-2018-3639 hw: cpu: speculative store bypass\n\nCVE-2017-15268:\n\tA memory leakage issue was found in the I/O channels websockets implementation of the Quick Emulator (QEMU). It could occur while sending screen updates to a client, which is slow to read and process them further. A privileged guest user could use this flaw to cause a denial of service on the host and/or potentially crash the QEMU process instance on the host.\n1496879: \nCVE-2017-15268 QEMU: I/O: potential memory exhaustion via websock connection to VNC\n\nCVE-2017-15124:\n\tVNC server implementation in Quick Emulator (QEMU) was found to be vulnerable to an unbounded memory allocation issue, as it did not throttle the framebuffer updates sent to its client. If the client did not consume these updates, VNC server allocates growing memory to hold onto this data. A malicious remote VNC client could use this flaw to cause DoS to the server host.\n1525195: \nCVE-2017-15124 Qemu: memory exhaustion through framebuffer update request message in VNC server\n\nCVE-2017-13711:\n\tA use-after-free issue was found in the Slirp networking implementation of the Quick emulator (QEMU). It occurs when a Socket referenced from multiple packets is freed while responding to a message. A user/process could use this flaw to crash the QEMU process on the host resulting in denial of service.\n1486400: \nCVE-2017-13711 QEMU: Slirp: use-after-free when sending response\n\nCVE-2017-13672:\n\tAn out-of-bounds read access issue was found in the VGA display emulator built into the Quick emulator (QEMU). It could occur while reading VGA memory to update graphics display. A privileged user/process inside guest could use this flaw to crash the QEMU process on the host resulting in denial of service situation.\n1486560: \nCVE-2017-13672 QEMU: vga: OOB read access during display update\n",
  "packages": [
    {
      "name": "qemu-kvm",
      "epoch": "10",
      "version": "1.5.3",
      "release": "156.amzn2.2.3",
      "arch": "x86_64",
      "filename": "Packages/qemu-kvm-1.5.3-156.amzn2.2.3.x86_64.rpm"
    },
    {
      "name": "qemu-img",
      "epoch": "10",
      "version": "1.5.3",
      "release": "156.amzn2.2.3",
      "arch": "x86_64",
      "filename": "Packages/qemu-img-1.5.3-156.amzn2.2.3.x86_64.rpm"
    },
    {
      "name": "qemu-kvm-common",
      "epoch": "10",
      "version": "1.5.3",
      "release": "156.amzn2.2.3",
      "arch": "x86_64",
      "filename": "Packages/qemu-kvm-common-1.5.3-156.amzn2.2.3.x86_64.rpm"
    },
    {
      "name": "qemu-kvm-tools",
      "epoch": "10",
      "version": "1.5.3",
      "release": "156.amzn2.2.3",
      "arch": "x86_64",
      "filename": "Packages/qemu-kvm-tools-1.5.3-156.amzn2.2.3.x86_64.rpm"
    },
    {
      "name": "qemu-kvm-debuginfo",
      "epoch": "10",
      "version": "1.5.3",
      "release": "156.amzn2.2.3",
      "arch": "x86_64",
      "filename": "Packages/qemu-kvm-debuginfo-1.5.3-156.amzn2.2.3.x86_64.rpm"
    }
  ],
  "references": [
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2017-13672",
      "id": "CVE-2017-13672",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2017-13711",
      "id": "CVE-2017-13711",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2017-15124",
      "id": "CVE-2017-15124",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2017-15268",
      "id": "CVE-2017-15268",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2018-3639",
      "id": "CVE-2018-3639",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2018-5683",
      "id": "CVE-2018-5683",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2018-7858",
      "id": "CVE-2018-7858",
      "type": "cve"
    }
  ],
  "cveids": [
    "CVE-2017-13672",
    "CVE-2017-13711",
    "CVE-2017-15124",
    "CVE-2017-15268",
    "CVE-2018-3639",
    "CVE-2018-5683",
    "CVE-2018-7858"
  ]
}