{
  "id": "ALAS2-2025-3120",
  "title": "Amazon Linux 2 2017.12 - ALAS2-2025-3120: important priority package update for amazon-cloudwatch-agent",
  "issued": {
    "date": "2025-12-30 23:15:00"
  },
  "updated": {
    "date": "2025-12-30 23:15:00"
  },
  "severity": "important",
  "description": "Package updates are available for Amazon Linux 2 that fix the following vulnerabilities:\nCVE-2025-68156:\n\tExpr is an expression language and expression evaluation for Go. Prior to version 1.17.7, several builtin functions in Expr, including `flatten`, `min`, `max`, `mean`, and `median`, perform recursive traversal over user-provided data structures without enforcing a maximum recursion depth. If the evaluation environment contains deeply nested or cyclic data structures, these functions may recurse indefinitely until exceed the Go runtime stack limit. This results in a stack overflow panic, causing the host application to crash. While exploitability depends on whether an attacker can influence or inject cyclic or pathologically deep data into the\nevaluation environment, this behavior represents a denial-of-service (DoS) risk and affects overall library robustness. Instead of returning a recoverable evaluation error, the process may terminate unexpectedly. In affected versions, evaluation of expressions that invoke certain builtin functions on untrusted or insufficiently validated data structures can lead to a process-level crash due to stack exhaustion. This issue is most relevant in scenarios where Expr is used to evaluate expressions against externally supplied or dynamically constructed environments; cyclic references (directly or indirectly) can be introduced into arrays, maps, or structs; and there are no application-level safeguards preventing deeply nested input data. In typical use cases with controlled, acyclic data, the issue may not manifest. However, when present, the resulting panic can be used to reliably crash the application, constituting a denial of service. The issue has been fixed in the v1.17.7 versions of Expr. The patch introduces a maximum recursion depth limit for affected builtin functions. When this limit is exceeded, evaluation aborts gracefully and returns a descriptive error instead of panicking. Additionally, the maximum depth can be customized by users via `builtin.MaxDepth`, allowing applications with legitimate deep structures to raise the limit in a controlled manner. Users are strongly encouraged to upgrade to the patched release, which includes both the recursion guard and comprehensive test coverage to prevent regressions. For users who cannot immediately upgrade, some mitigations are recommended. Ensure that evaluation environments cannot contain cyclic references, validate or sanitize externally supplied data structures before passing them to Expr, and/or wrap expression evaluation with panic recovery to prevent a full process crash (as a last-resort defensive measure). These workarounds reduce risk but do not fully eliminate the issue without the patch.\n\nCVE-2025-61729:\n\tWithin HostnameError.Error(), when constructing an error string, there is no limit to the number of hosts that will be printed out. Furthermore, the error string is constructed by repeated string concatenation, leading to quadratic runtime. Therefore, a certificate provided by a malicious actor can result in excessive resource consumption.\n\nCVE-2025-61727:\n\tcrypto/x509: excluded subdomain constraint does not restrict wildcard SANs\n\nAn excluded subdomain constraint in a certificate chain does not restrict the usage of wildcard SANs in the leaf certificate. For example a constraint that excludes the subdomain test.example.com does not prevent a leaf certificate from claiming the SAN *.example.com.\n\nCVE-2025-58181:\n\tSSH servers parsing GSSAPI authentication requests do not validate the number of mechanisms specified in the request, allowing an attacker to cause unbounded memory consumption.\n\nCVE-2025-47914:\n\tSSH Agent servers do not validate the size of messages when processing new identity requests, which may cause the program to panic if the message is malformed due to an out of bounds read.\n",
  "packages": [
    {
      "name": "amazon-cloudwatch-agent",
      "epoch": "0",
      "version": "1.300062.1",
      "release": "1.amzn2",
      "arch": "x86_64",
      "filename": "Packages/amazon-cloudwatch-agent-1.300062.1-1.amzn2.x86_64.rpm"
    },
    {
      "name": "amazon-cloudwatch-agent",
      "epoch": "0",
      "version": "1.300062.1",
      "release": "1.amzn2",
      "arch": "aarch64",
      "filename": "Packages/amazon-cloudwatch-agent-1.300062.1-1.amzn2.aarch64.rpm"
    }
  ],
  "references": [
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2025-47914",
      "id": "CVE-2025-47914",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2025-58181",
      "id": "CVE-2025-58181",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2025-61727",
      "id": "CVE-2025-61727",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2025-61729",
      "id": "CVE-2025-61729",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2025-68156",
      "id": "CVE-2025-68156",
      "type": "cve"
    }
  ],
  "cveids": [
    "CVE-2025-47914",
    "CVE-2025-58181",
    "CVE-2025-61727",
    "CVE-2025-61729",
    "CVE-2025-68156"
  ]
}