{
  "id": "ALAS2-2019-1267",
  "title": "Amazon Linux 2 2017.12 - ALAS2-2019-1267: critical priority package update for thunderbird",
  "issued": {
    "date": "2019-08-08 15:57"
  },
  "updated": {
    "date": "2019-08-09 13:38"
  },
  "severity": "critical",
  "description": "Package updates are available for Amazon Linux 2 that fix the following vulnerabilities:\nCVE-2019-9811:\n\tAs part of a winning Pwn2Own entry, a researcher demonstrated a sandbox escape by installing a malicious language pack and then opening a browser feature that used the compromised translation. This vulnerability affects Firefox ESR \u0026lt; 60.8, Firefox \u0026lt; 68, and Thunderbird \u0026lt; 60.8.\n1728439: \nCVE-2019-9811 Mozilla: Sandbox escape via installation of malicious language pack\n\nCVE-2019-11730:\n\tA vulnerability exists where if a user opens a locally saved HTML file, this file can use file: URIs to access other files in the same directory or sub-directories if the names are known or guessed. The Fetch API can then be used to read the contents of any files stored in these directories and they may uploaded to a server. It was demonstrated that in combination with a popular Android messaging app, if a malicious HTML attachment is sent to a user and they opened that attachment in Firefox, due to that app\u0026#039;s predictable pattern for locally-saved file names, it is possible to read attachments the victim received from other correspondents. This vulnerability affects Firefox ESR \u0026lt; 60.8, Firefox \u0026lt; 68, and Thunderbird \u0026lt; 60.8.\n1728438: \nCVE-2019-11730 Mozilla: Same-origin policy treats all files in a directory as having the same-origin\n\nCVE-2019-11717:\n\tA vulnerability exists where the caret (\u0026quot;^\u0026quot;) character is improperly escaped constructing some URIs due to it being used as a separator, allowing for possible spoofing of origin attributes. This vulnerability affects Firefox ESR \u0026lt; 60.8, Firefox \u0026lt; 68, and Thunderbird \u0026lt; 60.8.\n1728435: \nCVE-2019-11717 Mozilla: Caret character improperly escaped in origins\n\nCVE-2019-11715:\n\tDue to an error while parsing page content, it is possible for properly sanitized user input to be misinterpreted and lead to XSS hazards on web sites in certain circumstances. This vulnerability affects Firefox ESR \u0026lt; 60.8, Firefox \u0026lt; 68, and Thunderbird \u0026lt; 60.8.\n1728434: \nCVE-2019-11715 Mozilla: HTML parsing error can contribute to content XSS\n\nCVE-2019-11713:\n\tA use-after-free vulnerability can occur in HTTP/2 when a cached HTTP/2 stream is closed while still in use, resulting in a potentially exploitable crash. This vulnerability affects Firefox ESR \u0026lt; 60.8, Firefox \u0026lt; 68, and Thunderbird \u0026lt; 60.8.\n1728433: \nCVE-2019-11713 Mozilla: Use-after-free with HTTP/2 cached stream\n\nCVE-2019-11711:\n\tWhen an inner window is reused, it does not consider the use of document.domain for cross-origin protections. If pages on different subdomains ever cooperatively use document.domain, then either page can abuse this to inject script into arbitrary pages on the other subdomain, even those that did not use document.domain to relax their origin security. This vulnerability affects Firefox ESR \u0026lt; 60.8, Firefox \u0026lt; 68, and Thunderbird \u0026lt; 60.8.\n1728431: \nCVE-2019-11711 Mozilla: Script injection within domain through inner window reuse\n\nCVE-2019-11709:\n\tMozilla developers and community members reported memory safety bugs present in Firefox 67 and Firefox ESR 60.7. Some of these bugs showed evidence of memory corruption and we presume that with enough effort that some of these could be exploited to run arbitrary code. This vulnerability affects Firefox ESR \u0026lt; 60.8, Firefox \u0026lt; 68, and Thunderbird \u0026lt; 60.8.\n1728430: \nCVE-2019-11709 Mozilla: Memory safety bugs fixed in Firefox 68 and Firefox ESR 60.8\n",
  "packages": [
    {
      "name": "thunderbird",
      "epoch": "0",
      "version": "60.8.0",
      "release": "1.amzn2.0.1",
      "arch": "x86_64",
      "filename": "Packages/thunderbird-60.8.0-1.amzn2.0.1.x86_64.rpm"
    },
    {
      "name": "thunderbird-debuginfo",
      "epoch": "0",
      "version": "60.8.0",
      "release": "1.amzn2.0.1",
      "arch": "x86_64",
      "filename": "Packages/thunderbird-debuginfo-60.8.0-1.amzn2.0.1.x86_64.rpm"
    }
  ],
  "references": [
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2019-11709",
      "id": "CVE-2019-11709",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2019-11711",
      "id": "CVE-2019-11711",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2019-11713",
      "id": "CVE-2019-11713",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2019-11715",
      "id": "CVE-2019-11715",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2019-11717",
      "id": "CVE-2019-11717",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2019-11730",
      "id": "CVE-2019-11730",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2019-9811",
      "id": "CVE-2019-9811",
      "type": "cve"
    }
  ],
  "cveids": [
    "CVE-2019-11709",
    "CVE-2019-11711",
    "CVE-2019-11713",
    "CVE-2019-11715",
    "CVE-2019-11717",
    "CVE-2019-11730",
    "CVE-2019-9811"
  ]
}