{
  "id": "ALAS2-2021-1576",
  "title": "Amazon Linux 2 2017.12 - ALAS2-2021-1576: medium priority package update for cloud-init",
  "issued": {
    "date": "2021-01-05 23:34"
  },
  "updated": {
    "date": "2021-01-06 20:23"
  },
  "severity": "medium",
  "description": "Package updates are available for Amazon Linux 2 that fix the following vulnerabilities:\nCVE-2020-8632:\n\tA flaw was found in cloud-init, where it uses short passwords when generating a random password in new instances. Depending on the instance configuration, a remote or local attacker may abuse this vulnerability to guess the password of the victim user.\n1798728: CVE-2020-8632 cloud-init: Too short random password length in cc_set_password in config/cc_set_passwords.py\n\nCVE-2020-8631:\n\tA flaw was found in cloud-init, where it uses the random.choice function when creating sensitive random strings used for generating a random password in new instances. Depending on the instance configuration, a remote or local attacker may abuse this vulnerability to guess the password of the victim user.\n1798731: CVE-2020-8631 cloud-init: Use of random.choice when generating random password\n\nCVE-2018-10896:\n\tThe default cloud-init configuration included \"ssh_deletekeys: 0\", disabling cloud-init's deletion of ssh host keys. In some environments, this could lead to instances created by cloning a golden master or template system, sharing ssh host keys, and being able to impersonate one another or conduct man-in-the-middle attacks.\n1598831: CVE-2018-10896 cloud-init: default configuration disabled deletion of SSH host keys\n",
  "packages": [
    {
      "name": "cloud-init",
      "epoch": "0",
      "version": "19.3",
      "release": "4.amzn2",
      "arch": "noarch",
      "filename": "Packages/cloud-init-19.3-4.amzn2.noarch.rpm"
    }
  ],
  "references": [
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2018-10896",
      "id": "CVE-2018-10896",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-8631",
      "id": "CVE-2020-8631",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-8632",
      "id": "CVE-2020-8632",
      "type": "cve"
    }
  ],
  "cveids": [
    "CVE-2018-10896",
    "CVE-2020-8631",
    "CVE-2020-8632"
  ]
}