{
  "id": "ALAS2-2021-1618",
  "title": "Amazon Linux 2 2017.12 - ALAS2-2021-1618: important priority package update for thunderbird",
  "issued": {
    "date": "2021-03-18 01:13"
  },
  "updated": {
    "date": "2021-03-19 22:46"
  },
  "severity": "important",
  "description": "Package updates are available for Amazon Linux 2 that fix the following vulnerabilities:\nCVE-2021-23978:\n\tMozilla developers reported memory safety bugs present in Firefox 85 and Firefox ESR 78.7. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code. This vulnerability affects Firefox \u003c 86, Thunderbird \u003c 78.8, and Firefox ESR \u003c 78.8.\n1932112: CVE-2021-23978 Mozilla: Memory safety bugs fixed in Firefox 86 and Firefox ESR 78.8\n\nCVE-2021-23973:\n\tWhen trying to load a cross-origin resource in an audio/video context a decoding error may have resulted, and the content of that error may have revealed information about the resource. This vulnerability affects Firefox \u003c 86, Thunderbird \u003c 78.8, and Firefox ESR \u003c 78.8.\n1932111: CVE-2021-23973 Mozilla: MediaError message property could have leaked information about cross-origin resources\n\nCVE-2021-23969:\n\tAs specified in the W3C Content Security Policy draft, when creating a violation report, \"User agents need to ensure that the source file is the URL requested by the page, pre-redirects. If that's not possible, user agents need to strip the URL down to an origin to avoid unintentional leakage.\" Under certain types of redirects, Firefox incorrectly set the source file to be the destination of the redirects. This was fixed to be the redirect destination's origin. This vulnerability affects Firefox \u003c 86, Thunderbird \u003c 78.8, and Firefox ESR \u003c 78.8.\n1932109: CVE-2021-23969 Mozilla: Content Security Policy violation report could have contained the destination of a redirect\n\nCVE-2021-23968:\n\tIf Content Security Policy blocked frame navigation, the full destination of a redirect served in the frame was reported in the violation report; as opposed to the original frame URI. This could be used to leak sensitive information contained in such URIs. This vulnerability affects Firefox \u003c 86, Thunderbird \u003c 78.8, and Firefox ESR \u003c 78.8.\n1932110: CVE-2021-23968 Mozilla: Content Security Policy violation report could have contained the destination of a redirect\n",
  "packages": [
    {
      "name": "thunderbird",
      "epoch": "0",
      "version": "78.8.0",
      "release": "1.amzn2",
      "arch": "aarch64",
      "filename": "Packages/thunderbird-78.8.0-1.amzn2.aarch64.rpm"
    },
    {
      "name": "thunderbird-debuginfo",
      "epoch": "0",
      "version": "78.8.0",
      "release": "1.amzn2",
      "arch": "aarch64",
      "filename": "Packages/thunderbird-debuginfo-78.8.0-1.amzn2.aarch64.rpm"
    },
    {
      "name": "thunderbird",
      "epoch": "0",
      "version": "78.8.0",
      "release": "1.amzn2",
      "arch": "x86_64",
      "filename": "Packages/thunderbird-78.8.0-1.amzn2.x86_64.rpm"
    },
    {
      "name": "thunderbird-debuginfo",
      "epoch": "0",
      "version": "78.8.0",
      "release": "1.amzn2",
      "arch": "x86_64",
      "filename": "Packages/thunderbird-debuginfo-78.8.0-1.amzn2.x86_64.rpm"
    }
  ],
  "references": [
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-23968",
      "id": "CVE-2021-23968",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-23969",
      "id": "CVE-2021-23969",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-23973",
      "id": "CVE-2021-23973",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-23978",
      "id": "CVE-2021-23978",
      "type": "cve"
    }
  ],
  "cveids": [
    "CVE-2021-23968",
    "CVE-2021-23969",
    "CVE-2021-23973",
    "CVE-2021-23978"
  ]
}