{
  "id": "ALAS2-2019-1162",
  "title": "Amazon Linux 2 2017.12 - ALAS2-2019-1162: medium priority package update for curl",
  "issued": {
    "date": "2019-02-16 00:34"
  },
  "updated": {
    "date": "2019-02-18 17:59"
  },
  "severity": "medium",
  "description": "Package updates are available for Amazon Linux 2 that fix the following vulnerabilities:\nCVE-2019-3823:\n\tlibcurl versions from 7.34.0 to before 7.64.0 are vulnerable to a heap out-of-bounds read in the code handling the end-of-response for SMTP. If the buffer passed to `smtp_endofresp()` isn\u0026#039;t NUL terminated and contains no character ending the parsed number, and `len` is set to 5, then the `strtol()` call reads beyond the allocated buffer. The read contents will not be returned to the caller.\n1670256: \nCVE-2019-3823 curl: SMTP end-of-response out-of-bounds read\n\nCVE-2019-3822:\n\tlibcurl versions from 7.36.0 to before 7.64.0 are vulnerable to a stack-based buffer overflow. The function creating an outgoing NTLM type-3 header (`lib/vauth/ntlm.c:Curl_auth_create_ntlm_type3_message()`), generates the request HTTP header contents based on previously received data. The check that exists to prevent the local buffer from getting overflowed is implemented wrongly (using unsigned math) and as such it does not prevent the overflow from happening. This output data can grow larger than the local buffer if very large \u0026#039;nt response\u0026#039; data is extracted from a previous NTLMv2 header provided by the malicious or broken HTTP server. Such a \u0026#039;large value\u0026#039; needs to be around 1000 bytes or more. The actual payload data copied to the target buffer comes from the NTLMv2 type-2 response header.\n1670254: \nCVE-2019-3822 curl: NTLMv2 type-3 header stack buffer overflow\n\nCVE-2018-20483:\n\tset_file_metadata in xattr.c in GNU Wget before 1.20.1 stores a file\u0026#039;s origin URL in the user.xdg.origin.url metadata attribute of the extended attributes of the downloaded file, which allows local users to obtain sensitive information (e.g., credentials contained in the URL) by reading this attribute, as demonstrated by getfattr. This also applies to Referer information in the user.xdg.referrer.url metadata attribute. According to 2016-07-22 in the Wget ChangeLog, user.xdg.origin.url was partially based on the behavior of fwrite_xattr in tool_xattr.c in curl.\n1662705: \nCVE-2018-20483 wget: Information exposure in set_file_metadata function in xattr.c\n\nCVE-2018-16890:\n\tlibcurl versions from 7.36.0 to before 7.64.0 is vulnerable to a heap buffer out-of-bounds read. The function handling incoming NTLM type-2 messages (`lib/vauth/ntlm.c:ntlm_decode_type2_target`) does not validate incoming data correctly and is subject to an integer overflow vulnerability. Using that overflow, a malicious or broken NTLM server could trick libcurl to accept a bad length + offset combination that would lead to a buffer read out-of-bounds.\n1670252: \nCVE-2018-16890 curl: NTLM type-2 heap out-of-bounds buffer read\n\nCVE-2018-16842:\n\tCurl versions 7.14.1 through 7.61.1 are vulnerable to a heap-based buffer over-read in the tool_msgs.c:voutf() function that may result in information exposure and denial of service.\n1644124: \nCVE-2018-16842 curl: Heap-based buffer over-read in the curl tool warning formatting\n\nCVE-2018-16840:\n\tA heap use-after-free flaw was found in curl versions from 7.59.0 through 7.61.1 in the code related to closing an easy handle. When closing and cleaning up an \u0026#039;easy\u0026#039; handle in the `Curl_close()` function, the library code first frees a struct (without nulling the pointer) and might then subsequently erroneously write to a struct field within that already freed struct.\n1642203: \nCVE-2018-16840 curl: Use-after-free when closing \"easy\" handle in Curl_close()\n\nCVE-2018-16839:\n\tCurl versions 7.33.0 through 7.61.1 are vulnerable to a buffer overrun in the SASL authentication code that may lead to denial of service.\n1642201: \nCVE-2018-16839 curl: Integer overflow leading to heap-based buffer overflow in Curl_sasl_create_plain_message()\n\nCVE-2017-8818:\n\tcurl and libcurl before 7.57.0 on 32-bit platforms allow attackers to cause a denial of service (out-of-bounds access and application crash) or possibly have unspecified other impact because too little memory is allocated for interfacing to an SSL library.\n1517691: \nCVE-2017-8818 curl: Out-of-bound access in SSL related cleanup code\n\nCVE-2017-8817:\n\tThe FTP wildcard function in curl and libcurl before 7.57.0 allows remote attackers to cause a denial of service (out-of-bounds read and application crash) or possibly have unspecified other impact via a string that ends with an \u0026#039;[\u0026#039; character.\n1515760: \nCVE-2017-8817 curl: FTP wildcard out of bounds read\n\nCVE-2017-8816:\n\tThe NTLM authentication feature in curl and libcurl before 7.57.0 on 32-bit platforms allows attackers to cause a denial of service (integer overflow and resultant buffer overflow, and application crash) or possibly have unspecified other impact via vectors involving long user and password fields.\n1515757: \nCVE-2017-8816 curl: NTLM buffer overflow via integer overflow\n\nCVE-2017-1000257:\n\tA buffer overrun flaw was found in the IMAP handler of libcurl. By tricking an unsuspecting user into connecting to a malicious IMAP server, an attacker could exploit this flaw to potentially cause information disclosure or crash the application.\n1503705: \nCVE-2017-1000257 curl: IMAP FETCH response out of bounds read\n\nCVE-2017-1000254:\n\tlibcurl may read outside of a heap allocated buffer when doing FTP. When libcurl connects to an FTP server and successfully logs in (anonymous or not), it asks the server for the current directory with the `PWD` command. The server then responds with a 257 response containing the path, inside double quotes. The returned path name is then kept by libcurl for subsequent uses. Due to a flaw in the string parser for this directory name, a directory name passed like this but without a closing double quote would lead to libcurl not adding a trailing NUL byte to the buffer holding the name. When libcurl would then later access the string, it could read beyond the allocated heap buffer and crash or wrongly access data beyond the buffer, thinking it was part of the path. A malicious server could abuse this fact and effectively prevent libcurl-based clients to work with it - the PWD command is always issued on new FTP connections and the mistake has a high chance of causing a segfault. The simple fact that this has issue remained undiscovered for this long could suggest that malformed PWD responses are rare in benign servers. We are not aware of any exploit of this flaw. This bug was introduced in commit [415d2e7cb7](https://github.com/curl/curl/commit/415d2e7cb7), March 2005. In libcurl version 7.56.0, the parser always zero terminates the string but also rejects it if not terminated properly with a final double quote.\n1495541: \nCVE-2017-1000254 curl: FTP PWD response parser out of bounds read\n",
  "packages": [
    {
      "name": "curl",
      "epoch": "0",
      "version": "7.61.1",
      "release": "9.amzn2.0.1",
      "arch": "aarch64",
      "filename": "Packages/curl-7.61.1-9.amzn2.0.1.aarch64.rpm"
    },
    {
      "name": "libcurl",
      "epoch": "0",
      "version": "7.61.1",
      "release": "9.amzn2.0.1",
      "arch": "aarch64",
      "filename": "Packages/libcurl-7.61.1-9.amzn2.0.1.aarch64.rpm"
    },
    {
      "name": "libcurl-devel",
      "epoch": "0",
      "version": "7.61.1",
      "release": "9.amzn2.0.1",
      "arch": "aarch64",
      "filename": "Packages/libcurl-devel-7.61.1-9.amzn2.0.1.aarch64.rpm"
    },
    {
      "name": "curl-debuginfo",
      "epoch": "0",
      "version": "7.61.1",
      "release": "9.amzn2.0.1",
      "arch": "aarch64",
      "filename": "Packages/curl-debuginfo-7.61.1-9.amzn2.0.1.aarch64.rpm"
    },
    {
      "name": "curl",
      "epoch": "0",
      "version": "7.61.1",
      "release": "9.amzn2.0.1",
      "arch": "x86_64",
      "filename": "Packages/curl-7.61.1-9.amzn2.0.1.x86_64.rpm"
    },
    {
      "name": "libcurl",
      "epoch": "0",
      "version": "7.61.1",
      "release": "9.amzn2.0.1",
      "arch": "x86_64",
      "filename": "Packages/libcurl-7.61.1-9.amzn2.0.1.x86_64.rpm"
    },
    {
      "name": "libcurl-devel",
      "epoch": "0",
      "version": "7.61.1",
      "release": "9.amzn2.0.1",
      "arch": "x86_64",
      "filename": "Packages/libcurl-devel-7.61.1-9.amzn2.0.1.x86_64.rpm"
    },
    {
      "name": "curl-debuginfo",
      "epoch": "0",
      "version": "7.61.1",
      "release": "9.amzn2.0.1",
      "arch": "x86_64",
      "filename": "Packages/curl-debuginfo-7.61.1-9.amzn2.0.1.x86_64.rpm"
    },
    {
      "name": "curl",
      "epoch": "0",
      "version": "7.61.1",
      "release": "9.amzn2.0.1",
      "arch": "i686",
      "filename": "Packages/curl-7.61.1-9.amzn2.0.1.i686.rpm"
    },
    {
      "name": "libcurl",
      "epoch": "0",
      "version": "7.61.1",
      "release": "9.amzn2.0.1",
      "arch": "i686",
      "filename": "Packages/libcurl-7.61.1-9.amzn2.0.1.i686.rpm"
    },
    {
      "name": "libcurl-devel",
      "epoch": "0",
      "version": "7.61.1",
      "release": "9.amzn2.0.1",
      "arch": "i686",
      "filename": "Packages/libcurl-devel-7.61.1-9.amzn2.0.1.i686.rpm"
    },
    {
      "name": "curl-debuginfo",
      "epoch": "0",
      "version": "7.61.1",
      "release": "9.amzn2.0.1",
      "arch": "i686",
      "filename": "Packages/curl-debuginfo-7.61.1-9.amzn2.0.1.i686.rpm"
    }
  ],
  "references": [
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2017-1000254",
      "id": "CVE-2017-1000254",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2017-1000257",
      "id": "CVE-2017-1000257",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2017-8816",
      "id": "CVE-2017-8816",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2017-8817",
      "id": "CVE-2017-8817",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2017-8818",
      "id": "CVE-2017-8818",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2018-16839",
      "id": "CVE-2018-16839",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2018-16840",
      "id": "CVE-2018-16840",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2018-16842",
      "id": "CVE-2018-16842",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2018-16890",
      "id": "CVE-2018-16890",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2018-20483",
      "id": "CVE-2018-20483",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2019-3822",
      "id": "CVE-2019-3822",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2019-3823",
      "id": "CVE-2019-3823",
      "type": "cve"
    }
  ],
  "cveids": [
    "CVE-2017-1000254",
    "CVE-2017-1000257",
    "CVE-2017-8816",
    "CVE-2017-8817",
    "CVE-2017-8818",
    "CVE-2018-16839",
    "CVE-2018-16840",
    "CVE-2018-16842",
    "CVE-2018-16890",
    "CVE-2018-20483",
    "CVE-2019-3822",
    "CVE-2019-3823"
  ]
}