{
  "id": "ALAS2-2021-1586",
  "title": "Amazon Linux 2 2017.12 - ALAS2-2021-1586: important priority package update for thunderbird",
  "issued": {
    "date": "2021-01-05 23:35"
  },
  "updated": {
    "date": "2021-01-06 21:04"
  },
  "severity": "important",
  "description": "Package updates are available for Amazon Linux 2 that fix the following vulnerabilities:\nCVE-2020-35113:\n\tThe Mozilla Foundation Security Advisory describes this flaw as:\nMozilla developer reported memory safety bugs present in Firefox 83 and Firefox ESR 78.5. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code.\n1908029: CVE-2020-35113 Mozilla: Memory safety bugs fixed in Firefox 84 and Firefox ESR 78.6\n\nCVE-2020-35111:\n\tThe Mozilla Foundation Security Advisory describes this flaw as:\nWhen an extension with the proxy permission registered to receive `\u003call_urls\u003e`, the proxy.onRequest callback was not triggered for view-source URLs. While web content cannot navigate to such URLs, a user opening View Source could have inadvertently leaked their IP address.\n1908027: CVE-2020-35111 Mozilla: The proxy.onRequest API did not catch view-source URLs\n\nCVE-2020-26978:\n\tThe Mozilla Foundation Security Advisory describes this flaw as:\nUsing techniques that built on the slipstream research, a malicious webpage could have exposed both an internal network's hosts as well as services running on the user's local machine.\n1908025: CVE-2020-26978 Mozilla: Internal network hosts could have been probed by a malicious webpage\n\nCVE-2020-26974:\n\tThe Mozilla Foundation Security Advisory describes this flaw as:\nWhen `flex-basis` was used on a table wrapper, a `StyleGenericFlexBasis` object could have been incorrectly cast to the wrong type. This resulted in a heap user-after-free, memory corruption, and a potentially exploitable crash.\n1908024: CVE-2020-26974 Mozilla: Incorrect cast of StyleGenericFlexBasis resulted in a heap use-after-free\n\nCVE-2020-26973:\n\tThe Mozilla Foundation Security Advisory describes this flaw as:\nCertain input to the CSS Sanitizer confused it, resulting in incorrect components being removed. This could have been used as a sanitizer bypass.\n1908023: CVE-2020-26973 Mozilla: CSS Sanitizer performed incorrect sanitization\n\nCVE-2020-26971:\n\tThe Mozilla Foundation Security Advisory describes this flaw as:\nCertain blit values provided by the user were not properly constrained leading to a heap buffer overflow on some video drivers.\n1908022: CVE-2020-26971 Mozilla: Heap buffer overflow in WebGL\n\nCVE-2020-26968:\n\tMozilla developers reported memory safety bugs present in Firefox 82 and Firefox ESR 78.4. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code. This vulnerability affects Firefox \u003c 83, Firefox ESR \u003c 78.5, and Thunderbird \u003c 78.5.\n1898741: CVE-2020-26968 Mozilla: Memory safety bugs fixed in Firefox 83 and Firefox ESR 78.5\n\nCVE-2020-26965:\n\tSome websites have a feature \"Show Password\" where clicking a button will change a password field into a textbook field, revealing the typed password. If, when using a software keyboard that remembers user input, a user typed their password and used that feature, the type of the password field was changed, resulting in a keyboard layout change and the possibility for the software keyboard to remember the typed password. This vulnerability affects Firefox \u003c 83, Firefox ESR \u003c 78.5, and Thunderbird \u003c 78.5.\n1898739: CVE-2020-26965 Mozilla: Software keyboards may have remembered typed passwords\n\nCVE-2020-26961:\n\tWhen DNS over HTTPS is in use, it intentionally filters RFC1918 and related IP ranges from the responses as these do not make sense coming from a DoH resolver. However when an IPv4 address was mapped through IPv6, these addresses were erroneously let through, leading to a potential DNS Rebinding attack. This vulnerability affects Firefox \u003c 83, Firefox ESR \u003c 78.5, and Thunderbird \u003c 78.5.\n1898738: CVE-2020-26961 Mozilla: DoH did not filter IPv4 mapped IP Addresses\n\nCVE-2020-26960:\n\tIf the Compact() method was called on an nsTArray, the array could have been reallocated without updating other pointers, leading to a potential use-after-free and exploitable crash. This vulnerability affects Firefox \u003c 83, Firefox ESR \u003c 78.5, and Thunderbird \u003c 78.5.\n1898737: CVE-2020-26960 Mozilla: Potential use-after-free in uses of nsTArray\n\nCVE-2020-26959:\n\tDuring browser shutdown, reference decrementing could have occured on a previously freed object, resulting in a use-after-free, memory corruption, and a potentially exploitable crash. This vulnerability affects Firefox \u003c 83, Firefox ESR \u003c 78.5, and Thunderbird \u003c 78.5.\n1898736: CVE-2020-26959 Mozilla: Use-after-free in WebRequestService\n\nCVE-2020-26958:\n\tFirefox did not block execution of scripts with incorrect MIME types when the response was intercepted and cached through a ServiceWorker. This could lead to a cross-site script inclusion vulnerability, or a Content Security Policy bypass. This vulnerability affects Firefox \u003c 83, Firefox ESR \u003c 78.5, and Thunderbird \u003c 78.5.\n1898735: CVE-2020-26958 Mozilla: Requests intercepted through ServiceWorkers lacked MIME type restrictions\n\nCVE-2020-26956:\n\tIn some cases, removing HTML elements during sanitization would keep existing SVG event handlers and therefore lead to XSS. This vulnerability affects Firefox \u003c 83, Firefox ESR \u003c 78.5, and Thunderbird \u003c 78.5.\n1898734: CVE-2020-26956 Mozilla: XSS through paste (manual and clipboard API)\n\nCVE-2020-26953:\n\tIt was possible to cause the browser to enter fullscreen mode without displaying the security UI; thus making it possible to attempt a phishing attack or otherwise confuse the user. This vulnerability affects Firefox \u003c 83, Firefox ESR \u003c 78.5, and Thunderbird \u003c 78.5.\n1898733: CVE-2020-26953 Mozilla: Fullscreen could be enabled without displaying the security UI\n\nCVE-2020-26951:\n\tA parsing and event loading mismatch in Firefox's SVG code could have allowed load events to fire, even after sanitization. An attacker already capable of exploiting an XSS vulnerability in privileged internal pages could have used this attack to bypass our built-in sanitizer. This vulnerability affects Firefox \u003c 83, Firefox ESR \u003c 78.5, and Thunderbird \u003c 78.5.\n1898731: CVE-2020-26951 Mozilla: Parsing mismatches could confuse and bypass security sanitizer for chrome privileged code\n\nCVE-2020-16042:\n\tThe Mozilla Foundation Security Advisory describes this flaw as:\nWhen a BigInt was right-shifted the backing store was not properly cleared, allowing uninitialized memory to be read.\n1904515: CVE-2020-16042 chromium-browser: Uninitialized Use in V8\n\nCVE-2020-16012:\n\tNo description is available for this CVE.\n1898732: CVE-2020-16012 Mozilla: Variable time processing of cross-origin images during drawImage calls\n",
  "packages": [
    {
      "name": "thunderbird",
      "epoch": "0",
      "version": "78.6.0",
      "release": "1.amzn2",
      "arch": "aarch64",
      "filename": "Packages/thunderbird-78.6.0-1.amzn2.aarch64.rpm"
    },
    {
      "name": "thunderbird-debuginfo",
      "epoch": "0",
      "version": "78.6.0",
      "release": "1.amzn2",
      "arch": "aarch64",
      "filename": "Packages/thunderbird-debuginfo-78.6.0-1.amzn2.aarch64.rpm"
    },
    {
      "name": "thunderbird",
      "epoch": "0",
      "version": "78.6.0",
      "release": "1.amzn2",
      "arch": "x86_64",
      "filename": "Packages/thunderbird-78.6.0-1.amzn2.x86_64.rpm"
    },
    {
      "name": "thunderbird-debuginfo",
      "epoch": "0",
      "version": "78.6.0",
      "release": "1.amzn2",
      "arch": "x86_64",
      "filename": "Packages/thunderbird-debuginfo-78.6.0-1.amzn2.x86_64.rpm"
    }
  ],
  "references": [
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-16012",
      "id": "CVE-2020-16012",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-16042",
      "id": "CVE-2020-16042",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-26951",
      "id": "CVE-2020-26951",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-26953",
      "id": "CVE-2020-26953",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-26956",
      "id": "CVE-2020-26956",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-26958",
      "id": "CVE-2020-26958",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-26959",
      "id": "CVE-2020-26959",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-26960",
      "id": "CVE-2020-26960",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-26961",
      "id": "CVE-2020-26961",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-26965",
      "id": "CVE-2020-26965",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-26968",
      "id": "CVE-2020-26968",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-26971",
      "id": "CVE-2020-26971",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-26973",
      "id": "CVE-2020-26973",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-26974",
      "id": "CVE-2020-26974",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-26978",
      "id": "CVE-2020-26978",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-35111",
      "id": "CVE-2020-35111",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-35113",
      "id": "CVE-2020-35113",
      "type": "cve"
    }
  ],
  "cveids": [
    "CVE-2020-16012",
    "CVE-2020-16042",
    "CVE-2020-26951",
    "CVE-2020-26953",
    "CVE-2020-26956",
    "CVE-2020-26958",
    "CVE-2020-26959",
    "CVE-2020-26960",
    "CVE-2020-26961",
    "CVE-2020-26965",
    "CVE-2020-26968",
    "CVE-2020-26971",
    "CVE-2020-26973",
    "CVE-2020-26974",
    "CVE-2020-26978",
    "CVE-2020-35111",
    "CVE-2020-35113"
  ]
}