{
  "id": "ALAS2-2025-3104",
  "title": "Amazon Linux 2 2017.12 - ALAS2-2025-3104: medium priority package update for aws-cfn-bootstrap",
  "issued": {
    "date": "2025-12-13 00:11:00"
  },
  "updated": {
    "date": "2025-12-13 00:11:00"
  },
  "severity": "medium",
  "description": "Package updates are available for Amazon Linux 2 that fix the following vulnerabilities:\nCVE-2025-9230:\n\tIssue summary: An application trying to decrypt CMS messages encrypted using\npassword based encryption can trigger an out-of-bounds read and write.\n\nImpact summary: This out-of-bounds read may trigger a crash which leads to\nDenial of Service for an application. The out-of-bounds write can cause\na memory corruption which can have various consequences including\na Denial of Service or Execution of attacker-supplied code.\n\nAlthough the consequences of a successful exploit of this vulnerability\ncould be severe, the probability that the attacker would be able to\nperform it is low. Besides, password based (PWRI) encryption support in CMS\nmessages is very rarely used. For that reason the issue was assessed as\nModerate severity according to our Security Policy.\n\nThe FIPS modules in 3.5, 3.4, 3.3, 3.2, 3.1 and 3.0 are not affected by this\nissue, as the CMS implementation is outside the OpenSSL FIPS module\nboundary.\n\nCVE-2024-47081:\n\tRequests is a HTTP library. Due to a URL parsing issue, Requests releases prior to 2.32.4 may leak .netrc credentials to third parties for specific maliciously-crafted URLs. Users should upgrade to version 2.32.4 to receive a fix. For older versions of Requests, use of the .netrc file can be disabled with `trust_env=False` on one's Requests Session.\n\nCVE-2024-13176:\n\tIssue summary: A timing side-channel which could potentially allow recovering\nthe private key exists in the ECDSA signature computation.\n\nImpact summary: A timing side-channel in ECDSA signature computations\ncould allow recovering the private key by an attacker. However, measuring\nthe timing would require either local access to the signing application or\na very fast network connection with low latency.\n\nThere is a timing signal of around 300 nanoseconds when the top word of\nthe inverted ECDSA nonce value is zero. This can happen with significant\nprobability only for some of the supported elliptic curves. In particular\nthe NIST P-521 curve is affected. To be able to measure this leak, the attacker\nprocess must either be located in the same physical computer or must\nhave a very fast network connection with low latency. For that reason\nthe severity of this vulnerability is Low.\n",
  "packages": [
    {
      "name": "aws-cfn-bootstrap",
      "epoch": "0",
      "version": "2.0",
      "release": "38.amzn2",
      "arch": "noarch",
      "filename": "Packages/aws-cfn-bootstrap-2.0-38.amzn2.noarch.rpm"
    }
  ],
  "references": [
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-13176",
      "id": "CVE-2024-13176",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-47081",
      "id": "CVE-2024-47081",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2025-9230",
      "id": "CVE-2025-9230",
      "type": "cve"
    }
  ],
  "cveids": [
    "CVE-2024-13176",
    "CVE-2024-47081",
    "CVE-2025-9230"
  ]
}