{
  "id": "ALAS2-2025-3085",
  "title": "Amazon Linux 2 2017.12 - ALAS2-2025-3085: important priority package update for python-kdcproxy",
  "issued": {
    "date": "2025-11-26 23:19:00"
  },
  "updated": {
    "date": "2025-11-26 23:19:00"
  },
  "severity": "important",
  "description": "Package updates are available for Amazon Linux 2 that fix the following vulnerabilities:\nCVE-2025-59089:\n\tIf an attacker causes kdcproxy to connect to an attacker-controlled KDC server (e.g. through server-side request forgery), they can exploit the fact that kdcproxy does not enforce bounds on TCP response length to conduct a denial-of-service attack. While receiving the KDC's response, kdcproxy copies the entire buffered stream into a new\nbuffer on each recv() call, even when the transfer is incomplete, causing excessive memory allocation and CPU usage. Additionally, kdcproxy accepts incoming response chunks as long as the received data length is not exactly equal to the length indicated in the response\nheader, even when individual chunks or the total buffer exceed the maximum length of a Kerberos message. This allows an attacker to send unbounded data until the connection timeout is reached (approximately 12 seconds), exhausting server memory or CPU resources. Multiple concurrent requests can cause accept queue overflow, denying service to legitimate clients.\n\nCVE-2025-59088:\n\tIf kdcproxy receives a request for a realm which does not have server addresses defined in its configuration, by default, it will query SRV records in the DNS zone matching the requested realm name. This creates a server-side request forgery vulnerability, since an attacker could send a request for a realm matching a DNS zone where they created SRV records pointing to arbitrary ports and hostnames (which may resolve to loopback or internal IP addresses). This vulnerability can be exploited to probe internal network topology and firewall rules, perform port scanning, and exfiltrate data. Deployments where the \"use_dns\" setting is explicitly set to false are not affected.\n",
  "packages": [
    {
      "name": "python-kdcproxy",
      "epoch": "0",
      "version": "0.3.3",
      "release": "1.amzn2.0.1",
      "arch": "noarch",
      "filename": "Packages/python-kdcproxy-0.3.3-1.amzn2.0.1.noarch.rpm"
    }
  ],
  "references": [
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2025-59088",
      "id": "CVE-2025-59088",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2025-59089",
      "id": "CVE-2025-59089",
      "type": "cve"
    }
  ],
  "cveids": [
    "CVE-2025-59088",
    "CVE-2025-59089"
  ]
}