{
  "id": "ALAS2-2021-1587",
  "title": "Amazon Linux 2 2017.12 - ALAS2-2021-1587: medium priority package update for dnsmasq",
  "issued": {
    "date": "2021-01-25 23:09"
  },
  "updated": {
    "date": "2021-01-26 18:43"
  },
  "severity": "medium",
  "description": "Package updates are available for Amazon Linux 2 that fix the following vulnerabilities:\nCVE-2020-25686:\n\tA flaw was found in dnsmasq. When receiving a query, dnsmasq does not check for an existing pending request for the same name and forwards a new request. By default, a maximum of 150 pending queries can be sent to upstream servers, so there can be at most 150 queries for the same name. This flaw allows an off-path attacker on the network to substantially reduce the number of attempts that it would have to perform to forge a reply and have it accepted by dnsmasq. This issue is mentioned in the \"Birthday Attacks\" section of RFC5452. If chained with CVE-2020-25684, the attack complexity of a successful attack is reduced. The highest threat from this vulnerability is to data integrity.\n1890125: CVE-2020-25686 dnsmasq: multiple queries forwarded for the same name makes forging replies easier for an off-path attacker\n\nCVE-2020-25685:\n\tA flaw was found in dnsmasq. When getting a reply from a forwarded query, dnsmasq checks in forward.c:reply_query(), which is the forwarded query that matches the reply, by only using a weak hash of the query name. Due to the weak hash (CRC32 when dnsmasq is compiled without DNSSEC, SHA-1 when it is) this flaw allows an off-path attacker to find several different domains all having the same hash, substantially reducing the number of attempts they would have to perform to forge a reply and get it accepted by dnsmasq. This is in contrast with RFC5452, which specifies that the query name is one of the attributes of a query that must be used to match a reply. This flaw could be abused to perform a DNS Cache Poisoning attack. If chained with CVE-2020-25684 the attack complexity of a successful attack is reduced. The highest threat from this vulnerability is to data integrity.\n1889688: CVE-2020-25685 dnsmasq: loose query name check in reply_query() makes forging replies easier for an off-path attacker\n\nCVE-2020-25684:\n\tA flaw was found in dnsmasq. When getting a reply from a forwarded query, dnsmasq checks in the forward.c:reply_query() if the reply destination address/port is used by the pending forwarded queries. However, it does not use the address/port to retrieve the exact forwarded query, substantially reducing the number of attempts an attacker on the network would have to perform to forge a reply and get it accepted by dnsmasq. This issue contrasts with RFC5452, which specifies a query's attributes that all must be used to match a reply. This flaw allows an attacker to perform a DNS Cache Poisoning attack. If chained with CVE-2020-25685 or CVE-2020-25686, the attack complexity of a successful attack is reduced. The highest threat from this vulnerability is to data integrity.\n1889686: CVE-2020-25684 dnsmasq: loose address/port check in reply_query() makes forging replies easier for an off-path attacker\n",
  "packages": [
    {
      "name": "dnsmasq",
      "epoch": "0",
      "version": "2.76",
      "release": "16.amzn2.1.1",
      "arch": "aarch64",
      "filename": "Packages/dnsmasq-2.76-16.amzn2.1.1.aarch64.rpm"
    },
    {
      "name": "dnsmasq-utils",
      "epoch": "0",
      "version": "2.76",
      "release": "16.amzn2.1.1",
      "arch": "aarch64",
      "filename": "Packages/dnsmasq-utils-2.76-16.amzn2.1.1.aarch64.rpm"
    },
    {
      "name": "dnsmasq-debuginfo",
      "epoch": "0",
      "version": "2.76",
      "release": "16.amzn2.1.1",
      "arch": "aarch64",
      "filename": "Packages/dnsmasq-debuginfo-2.76-16.amzn2.1.1.aarch64.rpm"
    },
    {
      "name": "dnsmasq",
      "epoch": "0",
      "version": "2.76",
      "release": "16.amzn2.1.1",
      "arch": "x86_64",
      "filename": "Packages/dnsmasq-2.76-16.amzn2.1.1.x86_64.rpm"
    },
    {
      "name": "dnsmasq-utils",
      "epoch": "0",
      "version": "2.76",
      "release": "16.amzn2.1.1",
      "arch": "x86_64",
      "filename": "Packages/dnsmasq-utils-2.76-16.amzn2.1.1.x86_64.rpm"
    },
    {
      "name": "dnsmasq-debuginfo",
      "epoch": "0",
      "version": "2.76",
      "release": "16.amzn2.1.1",
      "arch": "x86_64",
      "filename": "Packages/dnsmasq-debuginfo-2.76-16.amzn2.1.1.x86_64.rpm"
    },
    {
      "name": "dnsmasq",
      "epoch": "0",
      "version": "2.76",
      "release": "16.amzn2.1.1",
      "arch": "i686",
      "filename": "Packages/dnsmasq-2.76-16.amzn2.1.1.i686.rpm"
    },
    {
      "name": "dnsmasq-utils",
      "epoch": "0",
      "version": "2.76",
      "release": "16.amzn2.1.1",
      "arch": "i686",
      "filename": "Packages/dnsmasq-utils-2.76-16.amzn2.1.1.i686.rpm"
    },
    {
      "name": "dnsmasq-debuginfo",
      "epoch": "0",
      "version": "2.76",
      "release": "16.amzn2.1.1",
      "arch": "i686",
      "filename": "Packages/dnsmasq-debuginfo-2.76-16.amzn2.1.1.i686.rpm"
    }
  ],
  "references": [
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-25684",
      "id": "CVE-2020-25684",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-25685",
      "id": "CVE-2020-25685",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-25686",
      "id": "CVE-2020-25686",
      "type": "cve"
    }
  ],
  "cveids": [
    "CVE-2020-25684",
    "CVE-2020-25685",
    "CVE-2020-25686"
  ]
}