{
  "id": "ALAS2-2023-1951",
  "title": "Amazon Linux 2 2017.12 - ALAS2-2023-1951: important priority package update for thunderbird",
  "issued": {
    "date": "2023-02-17 00:11"
  },
  "updated": {
    "date": "2023-02-22 01:52"
  },
  "severity": "important",
  "description": "Package updates are available for Amazon Linux 2 that fix the following vulnerabilities:\nCVE-2023-23605:\n\tThe Mozilla Foundation Security Advisory describes this flaw as:\n\nMozilla developers and the Mozilla Fuzzing Team reported memory safety bugs present in Firefox 108 and Firefox ESR 102.6. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code.\n\nCVE-2023-23603:\n\tRegular expressions used to filter out forbidden properties and values from style directives in calls to console.log weren't accounting for external URLs. Data could then be potentially exfiltrated from the browser.\n\nCVE-2023-23602:\n\tThe Mozilla Foundation Security Advisory describes this flaw as:\n\nA mishandled security check when creating a WebSocket in a WebWorker caused the Content Security Policy connect-src header to be ignored. This could lead to connections to restricted origins from inside WebWorkers.\n\nCVE-2023-23601:\n\tThe Mozilla Foundation Security Advisory describes this flaw as:\n\nNavigations were being allowed when dragging a URL from a cross-origin iframe into the same tab which could lead to website spoofing attacks\n\nCVE-2023-23599:\n\tThe Mozilla Foundation Security Advisory describes this flaw as:\n\nWhen copying a network request from the developer tools panel as a curl command the output was not being properly sanitized and could allow arbitrary commands to be hidden within.\n\nCVE-2023-23598:\n\tThe Mozilla Foundation Security Advisory describes this flaw as:\n\nDue to the Firefox GTK wrapper code's use of text/plain for drag data and GTK treating all text/plain MIMEs containing file URLs as being dragged a website could arbitrarily read a file via a call to DataTransfer.setData.\n\nCVE-2022-46882:\n\tThe Mozilla Foundation Security Advisory describes this flaw as: A use-after-free in WebGL extensions could have led to a potentially exploitable crash.\n\nCVE-2022-46881:\n\tThe Mozilla Foundation Security Advisory describes this flaw as: An optimization in WebGL was incorrect in some cases, and could have led to memory corruption and a potentially exploitable crash.\n\nCVE-2022-46880:\n\tThe Mozilla Foundation Security Advisory describes this flaw as: A missing check related to tex units could have led to a use-after-free and potentially exploitable crash.\n\nCVE-2022-46878:\n\tThe Mozilla Foundation Security Advisory describes this flaw as: Mozilla developers Randell Jesup, Valentin Gosu, Olli Pettay, and the Mozilla Fuzzing Team reported memory safety bugs present in Firefox 107 and Firefox ESR 102.5. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code.\n\nCVE-2022-46877:\n\tBy confusing the browser, the fullscreen notification could have been delayed or suppressed, resulting in potential user confusion or spoofing attacks. This vulnerability affects Firefox \u003c 108.\n\nCVE-2022-46874:\n\tA file with a long filename could have had its filename truncated to remove the valid extension, leaving a malicious extension in its place. This could potentially led to user confusion and the execution of malicious code.\u003cbr/\u003e*Note*: This issue was originally included in the advisories for Thunderbird 102.6, but a patch (specific to Thunderbird) was omitted, resulting in it actually being fixed in Thunderbird 102.6.1. This vulnerability affects Firefox \u003c 108, Thunderbird \u003c 102.6.1, Thunderbird \u003c 102.6, and Firefox ESR \u003c 102.6.\n\nCVE-2022-46872:\n\tThe Mozilla Foundation Security Advisory describes this flaw as: An attacker who compromised a content process could have partially escaped the sandbox to read arbitrary files via clipboard-related IPC messages.\n\n*This bug only affects Firefox for Linux. Other operating systems are unaffected.*\n\nCVE-2022-46871:\n\tRESERVED\nNOTE: https://www.mozilla.org/en-US/security/advisories/mfsa2022-51/#CVE-2022-46871\n\nCVE-2022-45414:\n\tA flaw was found in Mozilla. If a Thunderbird user quoted from an HTML email and the email contained either a video tag with the poster attribute or an object tag with a data attribute, a network request to the referenced remote URL was performed regardless of a configuration to block remote content, and an image loaded from the poster attribute was shown in the composer window. These issues could have given an attacker additional capabilities when targeting releases that did not yet have a fix for CVE-2022-3033.\n\nCVE-2022-40961:\n\tA stack based buffer overflow vulnerability was identified in Mozilla Firefox and Firefox ESR. This vulnerability occurs when the buffer being overwritten is allocated on the stack (i.e., is a local variable or, rarely, a parameter to a function). An attacker could cause of denial-of-service style crash by exploiting this vulnerability. To exploit this vulnerability, a remote, unauthenticated attacker would need to convince a user to visit a specially crafted website or open a malicious document.\n\nCVE-2022-34484:\n\tA flaw was found in Mozilla. The Mozilla Foundation Security Advisory describes the issue of the Mozilla Fuzzing Team reporting potential vulnerabilities present in Firefox 101 and Firefox ESR 91.10. Some of these bugs showed evidence of memory corruption, and we presume that with enough effort, some of these could have been exploited to run arbitrary code.\n\nCVE-2022-34481:\n\tA flaw was found in Mozilla. The Mozilla Foundation Security Advisory describes the issue within the `nsTArray_Impl::ReplaceElementsAt()` function, where an integer overflow could occur when the number of elements to replace was too large for the container.\n\nCVE-2022-34479:\n\tA flaw was found in Mozilla. The Mozilla Foundation Security Advisory describes the issue of a malicious website that creates a popup that could have resized the popup to overlay the address bar with its own content, resulting in potential user confusion or spoofing attacks.\n\nCVE-2022-34472:\n\tA flaw was found in Mozilla. The Mozilla Foundation Security Advisory describes the issue that if a PAC URL was set and the server that hosts the PAC was not reachable, OCSP requests are blocked, resulting in incorrect error pages being shown.\n\nCVE-2022-34470:\n\tA flaw was found in Mozilla. The Mozilla Foundation Security Advisory describes the issue of navigations between XML documents that may have led to a use-after-free problem and a potentially exploitable crash.\n\nCVE-2022-34468:\n\tA flaw was found in Mozilla. The Mozilla Foundation Security Advisory describes the issue of an iframe that was not permitted to run scripts could do so if the user clicked on a `javascript:` link.\n\nCVE-2022-3266:\n\tAn out-of-bounds read can occur when decoding H264 video. This results in a potentially exploitable crash. This vulnerability affects Firefox ESR \u003c 102.3, Thunderbird \u003c 102.3, and Firefox \u003c 105.\n\nCVE-2022-2200:\n\tA flaw was found in Mozilla. The Mozilla Foundation Security Advisory describes the issue of if an attacker corrupted an object prototype, they could set undesired attributes on a JavaScript object, leading to privileged code execution.\n\nCVE-2021-4129:\n\tMozilla developers and community members Julian Hector, Randell Jesup, Gabriele Svelto, Tyson Smith, Christian Holler, and Masayuki Nakano reported memory safety bugs present in Firefox 94. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code. This vulnerability affects Firefox \u003c 95, Firefox ESR \u003c 91.4.0, and Thunderbird \u003c 91.4.0.\n\nCVE-2021-4127:\n\tAn out of date graphics library (Angle) likely contained vulnerabilities that could potentially be exploited. This vulnerability affects Thunderbird \u003c 78.9 and Firefox ESR \u003c 78.9.\n",
  "packages": [
    {
      "name": "thunderbird",
      "epoch": "0",
      "version": "102.7.1",
      "release": "1.amzn2.0.1",
      "arch": "x86_64",
      "filename": "Packages/thunderbird-102.7.1-1.amzn2.0.1.x86_64.rpm"
    },
    {
      "name": "thunderbird-debuginfo",
      "epoch": "0",
      "version": "102.7.1",
      "release": "1.amzn2.0.1",
      "arch": "x86_64",
      "filename": "Packages/thunderbird-debuginfo-102.7.1-1.amzn2.0.1.x86_64.rpm"
    },
    {
      "name": "thunderbird",
      "epoch": "0",
      "version": "102.7.1",
      "release": "1.amzn2.0.1",
      "arch": "aarch64",
      "filename": "Packages/thunderbird-102.7.1-1.amzn2.0.1.aarch64.rpm"
    },
    {
      "name": "thunderbird-debuginfo",
      "epoch": "0",
      "version": "102.7.1",
      "release": "1.amzn2.0.1",
      "arch": "aarch64",
      "filename": "Packages/thunderbird-debuginfo-102.7.1-1.amzn2.0.1.aarch64.rpm"
    }
  ],
  "references": [
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-4127",
      "id": "CVE-2021-4127",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-4129",
      "id": "CVE-2021-4129",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-2200",
      "id": "CVE-2022-2200",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-3266",
      "id": "CVE-2022-3266",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-34468",
      "id": "CVE-2022-34468",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-34470",
      "id": "CVE-2022-34470",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-34472",
      "id": "CVE-2022-34472",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-34479",
      "id": "CVE-2022-34479",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-34481",
      "id": "CVE-2022-34481",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-34484",
      "id": "CVE-2022-34484",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-40961",
      "id": "CVE-2022-40961",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-45414",
      "id": "CVE-2022-45414",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-46871",
      "id": "CVE-2022-46871",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-46872",
      "id": "CVE-2022-46872",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-46874",
      "id": "CVE-2022-46874",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-46877",
      "id": "CVE-2022-46877",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-46878",
      "id": "CVE-2022-46878",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-46880",
      "id": "CVE-2022-46880",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-46881",
      "id": "CVE-2022-46881",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-46882",
      "id": "CVE-2022-46882",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-23598",
      "id": "CVE-2023-23598",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-23599",
      "id": "CVE-2023-23599",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-23601",
      "id": "CVE-2023-23601",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-23602",
      "id": "CVE-2023-23602",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-23603",
      "id": "CVE-2023-23603",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-23605",
      "id": "CVE-2023-23605",
      "type": "cve"
    }
  ],
  "cveids": [
    "CVE-2021-4127",
    "CVE-2021-4129",
    "CVE-2022-2200",
    "CVE-2022-3266",
    "CVE-2022-34468",
    "CVE-2022-34470",
    "CVE-2022-34472",
    "CVE-2022-34479",
    "CVE-2022-34481",
    "CVE-2022-34484",
    "CVE-2022-40961",
    "CVE-2022-45414",
    "CVE-2022-46871",
    "CVE-2022-46872",
    "CVE-2022-46874",
    "CVE-2022-46877",
    "CVE-2022-46878",
    "CVE-2022-46880",
    "CVE-2022-46881",
    "CVE-2022-46882",
    "CVE-2023-23598",
    "CVE-2023-23599",
    "CVE-2023-23601",
    "CVE-2023-23602",
    "CVE-2023-23603",
    "CVE-2023-23605"
  ]
}