{
  "id": "ALAS2-2025-2869",
  "title": "Amazon Linux 2 2017.12 - ALAS2-2025-2869: important priority package update for webkitgtk4",
  "issued": {
    "date": "2025-05-21 19:40:00"
  },
  "updated": {
    "date": "2025-05-29 09:17:00"
  },
  "severity": "important",
  "description": "Package updates are available for Amazon Linux 2 that fix the following vulnerabilities:\nCVE-2025-30427:\n\tA use-after-free issue was addressed with improved memory management. This issue is fixed in visionOS 2.4, tvOS 18.4, iPadOS 17.7.6, iOS 18.4 and iPadOS 18.4, macOS Sequoia 15.4, Safari 18.4. Processing maliciously crafted web content may lead to an unexpected Safari crash.\n\nCVE-2025-24264:\n\tThe issue was addressed with improved memory handling. This issue is fixed in visionOS 2.4, tvOS 18.4, iPadOS 17.7.6, iOS 18.4 and iPadOS 18.4, macOS Sequoia 15.4, Safari 18.4. Processing maliciously crafted web content may lead to an unexpected Safari crash.\n\nCVE-2025-24216:\n\tThe issue was addressed with improved memory handling. This issue is fixed in visionOS 2.4, tvOS 18.4, iPadOS 17.7.6, iOS 18.4 and iPadOS 18.4, macOS Sequoia 15.4, Safari 18.4. Processing maliciously crafted web content may lead to an unexpected Safari crash.\n\nCVE-2025-24209:\n\tA buffer overflow issue was addressed with improved memory handling. This issue is fixed in tvOS 18.4, Safari 18.4, iPadOS 17.7.6, iOS 18.4 and iPadOS 18.4, macOS Sequoia 15.4. Processing maliciously crafted web content may lead to an unexpected process crash.\n\nCVE-2025-24208:\n\tA permissions issue was addressed with additional restrictions. This issue is fixed in Safari 18.4, iOS 18.4 and iPadOS 18.4. Loading a malicious iframe may lead to a cross-site scripting attack.\n\nCVE-2025-24201:\n\tAn out-of-bounds write issue was addressed with improved checks to prevent unauthorized actions. This issue is fixed in visionOS 2.3.2, iOS 18.3.2 and iPadOS 18.3.2, macOS Sequoia 15.3.2, Safari 18.3.1. Maliciously crafted web content may be able to break out of Web Content sandbox. This is a supplementary fix for an attack that was blocked in iOS 17.2. (Apple is aware of a report that this issue may have been exploited in an extremely sophisticated attack against specific targeted individuals on versions of iOS before iOS 17.2.).\n\nCVE-2025-24162:\n\tThis issue was addressed through improved state management. This issue is fixed in visionOS 2.3, Safari 18.3, iOS 18.3 and iPadOS 18.3, macOS Sequoia 15.3, watchOS 11.3, tvOS 18.3. Processing maliciously crafted web content may lead to an unexpected process crash.\n\nCVE-2025-24158:\n\tThe issue was addressed with improved memory handling. This issue is fixed in visionOS 2.3, Safari 18.3, iOS 18.3 and iPadOS 18.3, macOS Sequoia 15.3, watchOS 11.3, tvOS 18.3. Processing web content may lead to a denial-of-service.\n\nCVE-2025-24150:\n\tA privacy issue was addressed with improved handling of files. This issue is fixed in macOS Sequoia 15.3, Safari 18.3, iOS 18.3 and iPadOS 18.3. Copying a URL from Web Inspector may lead to command injection.\n\nCVE-2025-24143:\n\tThe issue was addressed with improved access restrictions to the file system. This issue is fixed in macOS Sequoia 15.3, Safari 18.3, iOS 18.3 and iPadOS 18.3, visionOS 2.3. A maliciously crafted webpage may be able to fingerprint the user.\n\nCVE-2024-54658:\n\tThe issue was addressed with improved memory handling. This issue is fixed in iOS 17.4 and iPadOS 17.4, Safari 17.4, tvOS 17.4, watchOS 10.4, visionOS 1.1, macOS Sonoma 14.4. Processing web content may lead to a denial-of-service.\n\nCVE-2024-54551:\n\tThe issue was addressed with improved memory handling. This issue is fixed in watchOS 10.6, tvOS 17.6, Safari 17.6, macOS Sonoma 14.6, visionOS 1.3, iOS 17.6 and iPadOS 17.6. Processing web content may lead to a denial-of-service.\n\nCVE-2024-54543:\n\tThe issue was addressed with improved memory handling. This issue is fixed in visionOS 2.2, tvOS 18.2, Safari 18.2, watchOS 11.2, iOS 18.2 and iPadOS 18.2, macOS Sequoia 15.2. Processing maliciously crafted web content may lead to memory corruption.\n\nCVE-2024-54534:\n\tThe issue was addressed with improved memory handling. This issue is fixed in watchOS 11.2, visionOS 2.2, tvOS 18.2, macOS Sequoia 15.2, Safari 18.2, iOS 18.2 and iPadOS 18.2. Processing maliciously crafted web content may lead to memory corruption.\n\nCVE-2024-54508:\n\tThe issue was addressed with improved memory handling. This issue is fixed in watchOS 11.2, visionOS 2.2, tvOS 18.2, macOS Sequoia 15.2, Safari 18.2, iOS 18.2 and iPadOS 18.2. Processing maliciously crafted web content may lead to an unexpected process crash.\n\nCVE-2024-54505:\n\tA type confusion issue was addressed with improved memory handling. This issue is fixed in iPadOS 17.7.3, watchOS 11.2, visionOS 2.2, tvOS 18.2, macOS Sequoia 15.2, Safari 18.2, iOS 18.2 and iPadOS 18.2. Processing maliciously crafted web content may lead to memory corruption.\n\nCVE-2024-54502:\n\tThe issue was addressed with improved checks. This issue is fixed in watchOS 11.2, visionOS 2.2, tvOS 18.2, macOS Sequoia 15.2, Safari 18.2, iOS 18.2 and iPadOS 18.2. Processing maliciously crafted web content may lead to an unexpected process crash.\n\nCVE-2024-54479:\n\tThe issue was addressed with improved checks. This issue is fixed in iPadOS 17.7.3, watchOS 11.2, visionOS 2.2, tvOS 18.2, macOS Sequoia 15.2, Safari 18.2, iOS 18.2 and iPadOS 18.2. Processing maliciously crafted web content may lead to an unexpected process crash.\n\nCVE-2024-44309:\n\tA cookie management issue was addressed with improved state management. This issue is fixed in Safari 18.1.1, iOS 17.7.2 and iPadOS 17.7.2, macOS Sequoia 15.1.1, iOS 18.1.1 and iPadOS 18.1.1, visionOS 2.1.1. Processing maliciously crafted web content may lead to a cross site scripting attack. Apple is aware of a report that this issue may have been actively exploited on Intel-based Mac systems.\n\nCVE-2024-44296:\n\tThe issue was addressed with improved checks. This issue is fixed in tvOS 18.1, iOS 18.1 and iPadOS 18.1, iOS 17.7.1 and iPadOS 17.7.1, watchOS 11.1, visionOS 2.1, macOS Sequoia 15.1, Safari 18.1. Processing maliciously crafted web content may prevent Content Security Policy from being enforced.\n\nCVE-2024-44244:\n\tA memory corruption issue was addressed with improved input validation. This issue is fixed in iOS 18.1 and iPadOS 18.1, watchOS 11.1, visionOS 2.1, tvOS 18.1, macOS Sequoia 15.1, Safari 18.1. Processing maliciously crafted web content may lead to an unexpected process crash.\n\nCVE-2024-44192:\n\tThe issue was addressed with improved checks. This issue is fixed in watchOS 11, macOS Sequoia 15, Safari 18, visionOS 2, iOS 18 and iPadOS 18, tvOS 18. Processing maliciously crafted web content may lead to an unexpected process crash.\n\nCVE-2024-44187:\n\tA cross-origin issue existed with \"iframe\" elements. This was addressed with improved tracking of security origins. This issue is fixed in Safari 18, visionOS 2, watchOS 11, macOS Sequoia 15, iOS 18 and iPadOS 18, tvOS 18. A malicious website may exfiltrate data cross-origin.\n\nCVE-2024-44185:\n\tThe issue was addressed with improved checks. This issue is fixed in tvOS 17.6, visionOS 1.3, Safari 17.6, watchOS 10.6, iOS 17.6 and iPadOS 17.6, macOS Sonoma 14.6. Processing maliciously crafted web content may lead to an unexpected process crash.\n\nCVE-2024-40866:\n\tThe issue was addressed with improved UI. This issue is fixed in Safari 18, macOS Sequoia 15. Visiting a malicious website may lead to address bar spoofing.\n\nCVE-2024-40857:\n\tThis issue was addressed through improved state management. This issue is fixed in Safari 18, visionOS 2, watchOS 11, macOS Sequoia 15, iOS 18 and iPadOS 18, tvOS 18. Processing maliciously crafted web content may lead to universal cross site scripting.\n\nCVE-2024-40782:\n\tA use-after-free issue was addressed with improved memory management. This issue is fixed in iOS 16.7.9 and iPadOS 16.7.9, Safari 17.6, iOS 17.6 and iPadOS 17.6, watchOS 10.6, tvOS 17.6, visionOS 1.3, macOS Sonoma 14.6. Processing maliciously crafted web content may lead to an unexpected process crash.\n\nCVE-2024-27856:\n\tThe issue was addressed with improved checks. This issue is fixed in macOS Sonoma 14.5, iOS 16.7.8 and iPadOS 16.7.8, Safari 17.5, iOS 17.5 and iPadOS 17.5, watchOS 10.5, tvOS 17.5, visionOS 1.2. Processing a file may lead to unexpected app termination or arbitrary code execution.\n\nCVE-2024-27851:\n\tThe issue was addressed with improved bounds checks. This issue is fixed in tvOS 17.5, visionOS 1.2, Safari 17.5, iOS 17.5 and iPadOS 17.5, watchOS 10.5, macOS Sonoma 14.5. Processing maliciously crafted web content may lead to arbitrary code execution.\n\nCVE-2024-27850:\n\tThis issue was addressed with improvements to the noise injection algorithm. This issue is fixed in visionOS 1.2, macOS Sonoma 14.5, Safari 17.5, iOS 17.5 and iPadOS 17.5. A maliciously crafted webpage may be able to fingerprint the user.\n\nCVE-2024-27838:\n\tThe issue was addressed by adding additional logic. This issue is fixed in tvOS 17.5, iOS 16.7.8 and iPadOS 16.7.8, visionOS 1.2, Safari 17.5, iOS 17.5 and iPadOS 17.5, watchOS 10.5, macOS Sonoma 14.5. A maliciously crafted webpage may be able to fingerprint the user.\n\nCVE-2024-27833:\n\tAn integer overflow was addressed with improved input validation. This issue is fixed in tvOS 17.5, iOS 16.7.8 and iPadOS 16.7.8, visionOS 1.2, Safari 17.5, iOS 17.5 and iPadOS 17.5. Processing maliciously crafted web content may lead to arbitrary code execution.\n\nCVE-2024-27830:\n\tThis issue was addressed through improved state management. This issue is fixed in tvOS 17.5, visionOS 1.2, Safari 17.5, iOS 17.5 and iPadOS 17.5, watchOS 10.5, macOS Sonoma 14.5. A maliciously crafted webpage may be able to fingerprint the user.\n\nCVE-2024-27820:\n\tThe issue was addressed with improved memory handling. This issue is fixed in tvOS 17.5, iOS 16.7.8 and iPadOS 16.7.8, visionOS 1.2, Safari 17.5, iOS 17.5 and iPadOS 17.5, watchOS 10.5, macOS Sonoma 14.5. Processing web content may lead to arbitrary code execution.\n\nCVE-2024-27808:\n\tThe issue was addressed with improved memory handling. This issue is fixed in tvOS 17.5, visionOS 1.2, Safari 17.5, iOS 17.5 and iPadOS 17.5, watchOS 10.5, macOS Sonoma 14.5. Processing web content may lead to arbitrary code execution.\n\nCVE-2024-23271:\n\tA logic issue was addressed with improved checks. This issue is fixed in iOS 17.3 and iPadOS 17.3, Safari 17.3, tvOS 17.3, macOS Sonoma 14.3, watchOS 10.3. A malicious website may cause unexpected cross-origin behavior.\n\nCVE-2024-23254:\n\tThe issue was addressed with improved UI handling. This issue is fixed in tvOS 17.4, macOS Sonoma 14.4, visionOS 1.1, iOS 17.4 and iPadOS 17.4, watchOS 10.4, Safari 17.4. A malicious website may exfiltrate audio data cross-origin.\n",
  "packages": [
    {
      "name": "webkitgtk4",
      "epoch": "0",
      "version": "2.46.6",
      "release": "1.amzn2.0.2",
      "arch": "x86_64",
      "filename": "Packages/webkitgtk4-2.46.6-1.amzn2.0.2.x86_64.rpm"
    },
    {
      "name": "webkitgtk4-devel",
      "epoch": "0",
      "version": "2.46.6",
      "release": "1.amzn2.0.2",
      "arch": "x86_64",
      "filename": "Packages/webkitgtk4-devel-2.46.6-1.amzn2.0.2.x86_64.rpm"
    },
    {
      "name": "webkitgtk4-jsc",
      "epoch": "0",
      "version": "2.46.6",
      "release": "1.amzn2.0.2",
      "arch": "x86_64",
      "filename": "Packages/webkitgtk4-jsc-2.46.6-1.amzn2.0.2.x86_64.rpm"
    },
    {
      "name": "webkitgtk4-jsc-devel",
      "epoch": "0",
      "version": "2.46.6",
      "release": "1.amzn2.0.2",
      "arch": "x86_64",
      "filename": "Packages/webkitgtk4-jsc-devel-2.46.6-1.amzn2.0.2.x86_64.rpm"
    },
    {
      "name": "webkitgtk4-debuginfo",
      "epoch": "0",
      "version": "2.46.6",
      "release": "1.amzn2.0.2",
      "arch": "x86_64",
      "filename": "Packages/webkitgtk4-debuginfo-2.46.6-1.amzn2.0.2.x86_64.rpm"
    },
    {
      "name": "webkitgtk4",
      "epoch": "0",
      "version": "2.46.6",
      "release": "1.amzn2.0.2",
      "arch": "aarch64",
      "filename": "Packages/webkitgtk4-2.46.6-1.amzn2.0.2.aarch64.rpm"
    },
    {
      "name": "webkitgtk4-devel",
      "epoch": "0",
      "version": "2.46.6",
      "release": "1.amzn2.0.2",
      "arch": "aarch64",
      "filename": "Packages/webkitgtk4-devel-2.46.6-1.amzn2.0.2.aarch64.rpm"
    },
    {
      "name": "webkitgtk4-jsc",
      "epoch": "0",
      "version": "2.46.6",
      "release": "1.amzn2.0.2",
      "arch": "aarch64",
      "filename": "Packages/webkitgtk4-jsc-2.46.6-1.amzn2.0.2.aarch64.rpm"
    },
    {
      "name": "webkitgtk4-jsc-devel",
      "epoch": "0",
      "version": "2.46.6",
      "release": "1.amzn2.0.2",
      "arch": "aarch64",
      "filename": "Packages/webkitgtk4-jsc-devel-2.46.6-1.amzn2.0.2.aarch64.rpm"
    },
    {
      "name": "webkitgtk4-debuginfo",
      "epoch": "0",
      "version": "2.46.6",
      "release": "1.amzn2.0.2",
      "arch": "aarch64",
      "filename": "Packages/webkitgtk4-debuginfo-2.46.6-1.amzn2.0.2.aarch64.rpm"
    },
    {
      "name": "webkitgtk4",
      "epoch": "0",
      "version": "2.46.6",
      "release": "1.amzn2.0.2",
      "arch": "i686",
      "filename": "Packages/webkitgtk4-2.46.6-1.amzn2.0.2.i686.rpm"
    },
    {
      "name": "webkitgtk4-devel",
      "epoch": "0",
      "version": "2.46.6",
      "release": "1.amzn2.0.2",
      "arch": "i686",
      "filename": "Packages/webkitgtk4-devel-2.46.6-1.amzn2.0.2.i686.rpm"
    },
    {
      "name": "webkitgtk4-jsc",
      "epoch": "0",
      "version": "2.46.6",
      "release": "1.amzn2.0.2",
      "arch": "i686",
      "filename": "Packages/webkitgtk4-jsc-2.46.6-1.amzn2.0.2.i686.rpm"
    },
    {
      "name": "webkitgtk4-jsc-devel",
      "epoch": "0",
      "version": "2.46.6",
      "release": "1.amzn2.0.2",
      "arch": "i686",
      "filename": "Packages/webkitgtk4-jsc-devel-2.46.6-1.amzn2.0.2.i686.rpm"
    },
    {
      "name": "webkitgtk4-debuginfo",
      "epoch": "0",
      "version": "2.46.6",
      "release": "1.amzn2.0.2",
      "arch": "i686",
      "filename": "Packages/webkitgtk4-debuginfo-2.46.6-1.amzn2.0.2.i686.rpm"
    }
  ],
  "references": [
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-23254",
      "id": "CVE-2024-23254",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-23271",
      "id": "CVE-2024-23271",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-27808",
      "id": "CVE-2024-27808",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-27820",
      "id": "CVE-2024-27820",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-27830",
      "id": "CVE-2024-27830",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-27833",
      "id": "CVE-2024-27833",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-27838",
      "id": "CVE-2024-27838",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-27850",
      "id": "CVE-2024-27850",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-27851",
      "id": "CVE-2024-27851",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-27856",
      "id": "CVE-2024-27856",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-40782",
      "id": "CVE-2024-40782",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-40857",
      "id": "CVE-2024-40857",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-40866",
      "id": "CVE-2024-40866",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-44185",
      "id": "CVE-2024-44185",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-44187",
      "id": "CVE-2024-44187",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-44192",
      "id": "CVE-2024-44192",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-44244",
      "id": "CVE-2024-44244",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-44296",
      "id": "CVE-2024-44296",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-44309",
      "id": "CVE-2024-44309",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-54479",
      "id": "CVE-2024-54479",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-54502",
      "id": "CVE-2024-54502",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-54505",
      "id": "CVE-2024-54505",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-54508",
      "id": "CVE-2024-54508",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-54534",
      "id": "CVE-2024-54534",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-54543",
      "id": "CVE-2024-54543",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-54551",
      "id": "CVE-2024-54551",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-54658",
      "id": "CVE-2024-54658",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2025-24143",
      "id": "CVE-2025-24143",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2025-24150",
      "id": "CVE-2025-24150",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2025-24158",
      "id": "CVE-2025-24158",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2025-24162",
      "id": "CVE-2025-24162",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2025-24201",
      "id": "CVE-2025-24201",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2025-24208",
      "id": "CVE-2025-24208",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2025-24209",
      "id": "CVE-2025-24209",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2025-24216",
      "id": "CVE-2025-24216",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2025-24264",
      "id": "CVE-2025-24264",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2025-30427",
      "id": "CVE-2025-30427",
      "type": "cve"
    }
  ],
  "cveids": [
    "CVE-2024-23254",
    "CVE-2024-23271",
    "CVE-2024-27808",
    "CVE-2024-27820",
    "CVE-2024-27830",
    "CVE-2024-27833",
    "CVE-2024-27838",
    "CVE-2024-27850",
    "CVE-2024-27851",
    "CVE-2024-27856",
    "CVE-2024-40782",
    "CVE-2024-40857",
    "CVE-2024-40866",
    "CVE-2024-44185",
    "CVE-2024-44187",
    "CVE-2024-44192",
    "CVE-2024-44244",
    "CVE-2024-44296",
    "CVE-2024-44309",
    "CVE-2024-54479",
    "CVE-2024-54502",
    "CVE-2024-54505",
    "CVE-2024-54508",
    "CVE-2024-54534",
    "CVE-2024-54543",
    "CVE-2024-54551",
    "CVE-2024-54658",
    "CVE-2025-24143",
    "CVE-2025-24150",
    "CVE-2025-24158",
    "CVE-2025-24162",
    "CVE-2025-24201",
    "CVE-2025-24208",
    "CVE-2025-24209",
    "CVE-2025-24216",
    "CVE-2025-24264",
    "CVE-2025-30427"
  ]
}