{
  "id": "ALAS2-2022-1828",
  "title": "Amazon Linux 2 2017.12 - ALAS2-2022-1828: important priority package update for thunderbird",
  "issued": {
    "date": "2022-07-19 01:23"
  },
  "updated": {
    "date": "2023-02-17 00:13"
  },
  "severity": "important",
  "description": "Package updates are available for Amazon Linux 2 that fix the following vulnerabilities:\nCVE-2022-31747:\n\tA flaw was found in Mozilla. The Mozilla Foundation Security Advisory describes the issue of Mozilla developers and community members reporting memory safety bugs present in Firefox 100 and Firefox ESR 91.0. Some of these bugs showed evidence of memory corruption, and we presume that with enough effort some of these could have been exploited to run arbitrary code.\n\nCVE-2022-31742:\n\tA flaw was found in Mozilla. The Mozilla Foundation Security Advisory describes the issue as an attacker could have exploited a timing attack by sending a large number of allowCredential entries and detecting the difference between invalid key handles and cross-origin key handles. This could have led to cross-origin account linking in violation of WebAuthn goals.\n\nCVE-2022-31741:\n\tA flaw was found in Mozilla. The Mozilla Foundation Security Advisory describes the issue as having a crafted CMS message that could have been processed incorrectly, leading to an invalid memory read and potential memory corruption.\n\nCVE-2022-31740:\n\tA flaw was found in Mozilla. The Mozilla Foundation Security Advisory describes the issue on arm64; WASM code could have resulted in incorrect assembly generation, leading to a register allocation problem and a potentially exploitable crash.\n\nCVE-2022-31738:\n\tA flaw was found in Mozilla. The Mozilla Foundation Security Advisory describes the issue of when exiting fullscreen mode, an iframe could have confused the browser about the current state of the fullscreen, resulting in potential user confusion or spoofing attacks.\n\nCVE-2022-31737:\n\tA flaw was found in Mozilla. The Mozilla Foundation Security Advisory describes the issue as a malicious webpage that could have caused an out-of-bounds write in WebGL, leading to memory corruption and a potentially exploitable crash.\n\nCVE-2022-31736:\n\tA flaw was found in Mozilla. The Mozilla Foundation Security Advisory describes the issue as a malicious website that could have learned the size of a cross-origin resource that supported Range requests.\n\nCVE-2022-2226:\n\tA flaw was found in Mozilla. The Mozilla Foundation Security Advisory describes this issue of when an OpenPGP digital signature includes information about the date when the signature was created. When displaying an email that contains a digital signature, it will show the email's date. If the dates were different, Thunderbird didn't report the email as having an invalid signature. If an attacker performs a replay attack, in which an old email with old contents is present at a later time, it could lead the victim to believe that the statements in the email are current. Fixed versions of Thunderbird will require that the signature's date roughly matches the displayed date of the email.\n\nCVE-2022-1834:\n\tA flaw was found in Mozilla. The Mozilla Foundation Security Advisory describes the issue of when displaying the sender of an email, and the sender name contained the Braille Pattern Blank space character multiple times, Thunderbird displays all spaces. This flaw allows an attacker to send an email message with the attacker's digital signature that shows an arbitrary sender email address chosen by the attacker. If the sender's name started with a false email address, followed by many Braille space characters, the attacker's email address was not visible. Because Thunderbird compared the invisible sender address with the signature's email address, if Thunderbird accepted the signing key or certificate, the email was shown as having a valid digital signature.\n",
  "packages": [
    {
      "name": "thunderbird",
      "epoch": "0",
      "version": "91.11.0",
      "release": "2.amzn2.0.1",
      "arch": "x86_64",
      "filename": "Packages/thunderbird-91.11.0-2.amzn2.0.1.x86_64.rpm"
    },
    {
      "name": "thunderbird-debuginfo",
      "epoch": "0",
      "version": "91.11.0",
      "release": "2.amzn2.0.1",
      "arch": "x86_64",
      "filename": "Packages/thunderbird-debuginfo-91.11.0-2.amzn2.0.1.x86_64.rpm"
    },
    {
      "name": "thunderbird",
      "epoch": "0",
      "version": "91.11.0",
      "release": "2.amzn2.0.1",
      "arch": "aarch64",
      "filename": "Packages/thunderbird-91.11.0-2.amzn2.0.1.aarch64.rpm"
    },
    {
      "name": "thunderbird-debuginfo",
      "epoch": "0",
      "version": "91.11.0",
      "release": "2.amzn2.0.1",
      "arch": "aarch64",
      "filename": "Packages/thunderbird-debuginfo-91.11.0-2.amzn2.0.1.aarch64.rpm"
    }
  ],
  "references": [
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-1834",
      "id": "CVE-2022-1834",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-2226",
      "id": "CVE-2022-2226",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-31736",
      "id": "CVE-2022-31736",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-31737",
      "id": "CVE-2022-31737",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-31738",
      "id": "CVE-2022-31738",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-31740",
      "id": "CVE-2022-31740",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-31741",
      "id": "CVE-2022-31741",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-31742",
      "id": "CVE-2022-31742",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-31747",
      "id": "CVE-2022-31747",
      "type": "cve"
    }
  ],
  "cveids": [
    "CVE-2022-1834",
    "CVE-2022-2226",
    "CVE-2022-31736",
    "CVE-2022-31737",
    "CVE-2022-31738",
    "CVE-2022-31740",
    "CVE-2022-31741",
    "CVE-2022-31742",
    "CVE-2022-31747"
  ]
}