{
  "id": "ALAS2-2020-1408",
  "title": "Amazon Linux 2 2017.12 - ALAS2-2020-1408: important priority package update for thunderbird",
  "issued": {
    "date": "2020-03-23 16:28"
  },
  "updated": {
    "date": "2020-03-25 21:51"
  },
  "severity": "important",
  "description": "Package updates are available for Amazon Linux 2 that fix the following vulnerabilities:\nCVE-2020-6800:\n\tMozilla developers and community members reported memory safety bugs present in Firefox 72 and Firefox ESR 68.4. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code. In general, these flaws cannot be exploited through email in the Thunderbird product because scripting is disabled when reading mail, but are potentially risks in browser or browser-like contexts. This vulnerability affects Thunderbird \u003c 68.5, Firefox \u003c 73, and Firefox \u003c ESR68.5.\n1801920: CVE-2020-6800 Mozilla: Memory safety bugs fixed in Firefox 73 and Firefox ESR 68.5\n\nCVE-2020-6798:\n\tIf a template tag was used in a select tag, the parser could be confused and allow JavaScript parsing and execution when it should not be allowed. A site that relied on the browser behaving correctly could suffer a cross-site scripting vulnerability as a result. In general, this flaw cannot be exploited through email in the Thunderbird product because scripting is disabled when reading mail, but is potentially a risk in browser or browser-like contexts. This vulnerability affects Thunderbird \u003c 68.5, Firefox \u003c 73, and Firefox \u003c ESR68.5.\n1801918: CVE-2020-6798 Mozilla: Incorrect parsing of template tag could result in JavaScript injection\n\nCVE-2020-6795:\n\tWhen processing a message that contains multiple S/MIME signatures, a bug in the MIME processing code caused a null pointer dereference, leading to an unexploitable crash. This vulnerability affects Thunderbird \u003c 68.5.\n1801957: CVE-2020-6795 Mozilla: Crash processing S/MIME messages with multiple signatures\n\nCVE-2020-6794:\n\tIf a user saved passwords before Thunderbird 60 and then later set a master password, an unencrypted copy of these passwords is still accessible. This is because the older stored password file was not deleted when the data was copied to a new format starting in Thunderbird 60. The new master password is added only on the new file. This could allow the exposure of stored password data outside of user expectations. This vulnerability affects Thunderbird \u003c 68.5.\n1801956: CVE-2020-6794 Mozilla: Setting a master password post-Thunderbird 52 does not delete unencrypted previously stored passwords\n\nCVE-2020-6793:\n\tWhen processing an email message with an ill-formed envelope, Thunderbird could read data from a random memory location. This vulnerability affects Thunderbird \u003c 68.5.\n1801955: CVE-2020-6793 Mozilla: Out-of-bounds read when processing certain email messages\n\nCVE-2020-6792:\n\tWhen deriving an identifier for an email message, uninitialized memory was used in addition to the message contents. This vulnerability affects Thunderbird \u003c 68.5.\n1801958: CVE-2020-6792 Mozilla: Message ID calculation was based on uninitialized data\n",
  "packages": [
    {
      "name": "thunderbird",
      "epoch": "0",
      "version": "68.5.0",
      "release": "1.amzn2.0.1",
      "arch": "aarch64",
      "filename": "Packages/thunderbird-68.5.0-1.amzn2.0.1.aarch64.rpm"
    },
    {
      "name": "thunderbird-debuginfo",
      "epoch": "0",
      "version": "68.5.0",
      "release": "1.amzn2.0.1",
      "arch": "aarch64",
      "filename": "Packages/thunderbird-debuginfo-68.5.0-1.amzn2.0.1.aarch64.rpm"
    },
    {
      "name": "thunderbird",
      "epoch": "0",
      "version": "68.5.0",
      "release": "1.amzn2.0.1",
      "arch": "x86_64",
      "filename": "Packages/thunderbird-68.5.0-1.amzn2.0.1.x86_64.rpm"
    },
    {
      "name": "thunderbird-debuginfo",
      "epoch": "0",
      "version": "68.5.0",
      "release": "1.amzn2.0.1",
      "arch": "x86_64",
      "filename": "Packages/thunderbird-debuginfo-68.5.0-1.amzn2.0.1.x86_64.rpm"
    }
  ],
  "references": [
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-6792",
      "id": "CVE-2020-6792",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-6793",
      "id": "CVE-2020-6793",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-6794",
      "id": "CVE-2020-6794",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-6795",
      "id": "CVE-2020-6795",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-6798",
      "id": "CVE-2020-6798",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-6800",
      "id": "CVE-2020-6800",
      "type": "cve"
    }
  ],
  "cveids": [
    "CVE-2020-6792",
    "CVE-2020-6793",
    "CVE-2020-6794",
    "CVE-2020-6795",
    "CVE-2020-6798",
    "CVE-2020-6800"
  ]
}