{
  "Title": "Security update for dropbear",
  "Tracking": {
    "ID": "openSUSE-SU-2016:0882-1",
    "Status": "Final",
    "Version": "1",
    "InitialReleaseDate": "2016-03-24T10:24:18Z",
    "CurrentReleaseDate": "2016-03-24T10:24:18Z",
    "RevisionHistory": [
      {
        "Number": "1",
        "Date": "2016-03-24T10:24:18Z",
        "Description": "current"
      }
    ]
  },
  "Notes": [
    {
      "Text": "Security update for dropbear",
      "Title": "Topic",
      "Type": "Summary"
    },
    {
      "Text": "\ndropbear was updated to 2016.72 to fix the following issue:\n\nChanges in dropbear:\n- updated to upstream version 2016.72\n  * Validate X11 forwarding input. Could allow bypass of authorized_keys command= restrictions,\n    found by github.com/tintinweb. Thanks for Damien Miller for a patch.\n- used as bug fix release for boo#970633 - CVE-2016-3116\n\n- updated to upstream version 2015.71\n  * Fix 'bad buf_incrpos' when data is transferred, broke in 2015.69\n  * Fix crash on exit when -p address:port is used, broke in 2015.68\n  * Fix building with only ENABLE_CLI_REMOTETCPFWD given, patch from Konstantin Tokarev\n  * Fix bad configure script test which didn't work with dash shell, patch from Juergen Daubert,\n    broke in 2015.70\n  * Fix server race condition that could cause sessions to hang on exit,\n    https://github.com/robotframework/SSHLibrary/issue/128\n\n- updated to upstream version 2015.70\n  * Fix server password authentication on Linux, broke in 2015.69\n  * Fix crash when forwarded TCP connections fail to connect (bug introduced in 2015.68)\n  * Avoid hang on session close when multiple sessions are started, affects Qt Creator\n    Patch from Andrzej Szombierski\n  * Reduce per-channel memory consumption in common case, increase default\n    channel limit from 100 to 1000 which should improve SOCKS forwarding for modern\n    webpages\n  * Handle multiple command line arguments in a single flag, thanks to Guilhem Moulin\n  * Manpage improvements from Guilhem Moulin\n  * Build fixes for Android from Mike Frysinger\n  * Don't display the MOTD when an explicit command is run from Guilhem Moulin\n  * Check curve25519 shared secret isn't zero\n\n- updated to upstream version 2015.68\n  * Reduce local data copying for improved efficiency. Measured 30%\n    increase in throughput for connections to localhost\n  * Forwarded TCP ports connect asynchronously and try all available addresses\n    (IPv4, IPv6, round robin DNS)\n  * Fix all compile warnings, many patches from Gael Portay\n    Note that configure with -Werror may not be successful on some platforms (OS X)\n    and some configuration options may still result in unused variable\n    warnings.\n  * Use TCP Fast Open on Linux if available. Saves a round trip at connection\n    to hosts that have previously been connected.\n    Needs a recent Linux kernel and possibly 'sysctl -w net.ipv4.tcp_fastopen=3'\n    Client side is disabled by default pending further compatibility testing\n    with networks and systems.\n  * Increase maximum command length to 9000 bytes\n  * Free memory before exiting, patch from Thorsten Horstmann. Useful for\n    Dropbear ports to embedded systems and for checking memory leaks\n    with valgrind. Only partially implemented for dbclient.\n    This is disabled by default, enable with DROPBEAR_CLEANUP in sysoptions.h\n  * DROPBEAR_DEFAULT_CLI_AUTHKEY setting now always prepends home directory unless\n    there is a leading slash (~ isn't treated specially)\n  * Fix small ECC memory leaks\n  * Tighten validation of Diffie-Hellman parameters, from Florent Daigniere of\n    Matta Consulting. Odds of bad values are around 2**-512 -- improbable.\n  * Twofish-ctr cipher is supported though disabled by default\n  * Fix pre-authentication timeout when waiting for client SSH-2.0 banner, thanks\n    to CL Ouyang\n  * Fix null pointer crash with restrictions in authorized_keys without a command, patch from\n    Guilhem Moulin\n  * Ensure authentication timeout is handled while reading the initial banner,\n    thanks to CL Ouyang for finding it.\n  * Fix null pointer crash when handling bad ECC keys. Found by afl-fuzz\n\n- fixed checksum URL\n\n- updated to upstream version 2015.67\n  * Call fsync() after generating private keys to ensure they aren't lost if a\n    reboot occurs. Thanks to Peter Korsgaard\n  * Disable non-delayed zlib compression by default on the server. Can be\n    enabled if required for old clients with DROPBEAR_SERVER_DELAY_ZLIB\n  * Default client key path ~/.ssh/id_dropbear\n  * Prefer stronger algorithms by default, from Fedor Brunner. \n    AES256 over 3DES\n    Diffie-hellman group14 over group1\n  * Add option to disable CBC ciphers.\n  * Disable twofish in default options.h\n  * Enable sha2 HMAC algorithms by default, the code was already required\n    for ECC key exchange. sha1 is the first preference still for performance. \n  * Fix installing dropbear.8 in a separate build directory, from Like Ma\n  * Allow configure to succeed if libtomcrypt/libtommath are missing, from Elan Ruusame\n  * Don't crash if ssh-agent provides an unknown type of key. From Catalin Patulea\n  * Minor bug fixes, a few issue found by Coverity scan \n\n- replaced deprecated gpg-offline check by obs-service-source_validator\n\n- updated to upstream version 2014.66\n  * Use the same keepalive handling behaviour as OpenSSH. This will work better\n    with some SSH implementations that have different behaviour with unknown\n    message types.\n  * Don't reply with SSH_MSG_UNIMPLEMENTED when we receive a reply to our own\n    keepalive message\n  * Set $SSH_CLIENT to keep bash happy, patch from Ryan Cleere\n  * Fix wtmp which broke since 2013.62, patch from Whoopie\n",
      "Title": "Details",
      "Type": "General"
    },
    {
      "Text": "The CVRF data is provided by SUSE under the Creative Commons License 4.0 with Attribution (CC-BY-4.0).",
      "Title": "Terms of Use",
      "Type": "Legal Disclaimer"
    }
  ],
  "ProductTree": {
    "Relationships": [
      {
        "ProductReference": "dropbear-2016.72-8.1",
        "RelatesToProductReference": "openSUSE Leap 42.1",
        "RelationType": "Default Component Of"
      }
    ]
  },
  "References": [
    {
      "URL": "http://lists.opensuse.org/opensuse-updates/2016-03/msg00113.html",
      "Description": "E-Mail link for openSUSE-SU-2016:0882-1"
    },
    {
      "URL": "https://www.suse.com/support/security/rating/",
      "Description": "SUSE Security Ratings"
    }
  ],
  "Vulnerabilities": [
    {
      "CVE": "CVE-2016-3116",
      "Description": "CRLF injection vulnerability in Dropbear SSH before 2016.72 allows remote authenticated users to bypass intended shell-command restrictions via crafted X11 forwarding data.",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "moderate"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2016-3116.html",
          "Description": "CVE-2016-3116"
        },
        {
          "URL": "https://bugzilla.suse.com/970633",
          "Description": "SUSE Bug 970633"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": [
            "openSUSE Leap 42.1:dropbear-2016.72-8.1"
          ]
        }
      ],
      "CVSSScoreSets": {}
    }
  ]
}