{
  "Severity": "HIGH",
  "UpdatedAt": "2025-03-17T21:26:25Z",
  "Package": {
    "Ecosystem": "GO",
    "Name": "github.com/expr-lang/expr"
  },
  "Advisory": {
    "DatabaseId": 284924,
    "Id": "GSA_kwCzR0hTQS05M21xLTlmZngtODNtMs4ABFj8",
    "GhsaId": "GHSA-93mq-9ffx-83m2",
    "References": [
      {
        "Url": "https://github.com/expr-lang/expr/security/advisories/GHSA-93mq-9ffx-83m2"
      },
      {
        "Url": "https://nvd.nist.gov/vuln/detail/CVE-2025-29786"
      },
      {
        "Url": "https://github.com/expr-lang/expr/pull/762"
      },
      {
        "Url": "https://github.com/expr-lang/expr/commit/0d19441454426d2f58edb22c31f3ba5f99c7a26e"
      },
      {
        "Url": "https://github.com/advisories/GHSA-93mq-9ffx-83m2"
      }
    ],
    "Identifiers": [
      {
        "Type": "GHSA",
        "Value": "GHSA-93mq-9ffx-83m2"
      },
      {
        "Type": "CVE",
        "Value": "CVE-2025-29786"
      }
    ],
    "Description": "### Impact\nIf the Expr expression parser is given an **unbounded input string**, it will attempt to compile the *entire* string and generate an Abstract Syntax Tree (AST) node for each part of the expression. In scenarios where input size isn’t limited, a malicious or inadvertent extremely large expression can consume excessive memory as the parser builds a huge AST. This can ultimately lead to **excessive memory usage** and an **Out-Of-Memory (OOM) crash** of the process. This issue is relatively uncommon and will only manifest when there are **no restrictions on the input size**, i.e. the expression length is allowed to grow arbitrarily large. In typical use cases where inputs are bounded or validated, this problem would not occur.\n\n### Patches\n\nThe problem has been **patched** in the latest versions of the Expr library. The fix introduces compile-time limits on the number of AST nodes and memory usage during parsing, preventing any single expression from exhausting resources. Users should upgrade to **Expr version 1.17.0 or later**, as this release includes the new node budget and memory limit safeguards. Upgrading to v1.17.0 ensures that extremely deep or large expressions are detected and safely aborted during compilation, avoiding the OOM condition.\n\n### Workarounds\n\nFor users who cannot immediately upgrade, the recommended workaround is to **impose an input size restriction before parsing**. In practice, this means validating or limiting the length of expression strings that your application will accept. For example, set a maximum allowable number of characters (or nodes) for any expression and reject or truncate inputs that exceed this limit. By ensuring no unbounded-length expression is ever fed into the parser, you can prevent the parser from constructing a pathologically large AST and avoid potential memory exhaustion. In short, **pre-validate and cap input size** as a safeguard in the absence of the patch.\n\n### References\n\n- #762",
    "Origin": "UNSPECIFIED",
    "PublishedAt": "2025-03-17T21:26:22Z",
    "Severity": "HIGH",
    "Summary": "Memory Exhaustion in Expr Parser with Unrestricted Input",
    "UpdatedAt": "2025-03-17T21:26:25Z",
    "WithdrawnAt": "",
    "CVSS": {
      "Score": 7.5,
      "VectorString": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H"
    }
  },
  "Versions": [
    {
      "FirstPatchedVersion": {
        "Identifier": "1.17.0"
      },
      "VulnerableVersionRange": "\u003c 1.17.0"
    }
  ]
}