{
  "Severity": "MODERATE",
  "UpdatedAt": "2025-07-15T18:04:56Z",
  "Package": {
    "Ecosystem": "MAVEN",
    "Name": "org.dspace:dspace-api"
  },
  "Advisory": {
    "DatabaseId": 303785,
    "Id": "GSA_kwCzR0hTQS1qandyLTVjZmgtN3h3aM4ABKKp",
    "GhsaId": "GHSA-jjwr-5cfh-7xwh",
    "References": [
      {
        "Url": "https://github.com/DSpace/DSpace/security/advisories/GHSA-jjwr-5cfh-7xwh"
      },
      {
        "Url": "https://nvd.nist.gov/vuln/detail/CVE-2025-53621"
      },
      {
        "Url": "https://github.com/DSpace/DSpace/pull/11032"
      },
      {
        "Url": "https://github.com/DSpace/DSpace/pull/11032.patch"
      },
      {
        "Url": "https://github.com/DSpace/DSpace/pull/11034"
      },
      {
        "Url": "https://github.com/DSpace/DSpace/pull/11034.patch"
      },
      {
        "Url": "https://github.com/DSpace/DSpace/pull/11035"
      },
      {
        "Url": "https://github.com/DSpace/DSpace/pull/11035.patch"
      },
      {
        "Url": "https://github.com/advisories/GHSA-jjwr-5cfh-7xwh"
      }
    ],
    "Identifiers": [
      {
        "Type": "GHSA",
        "Value": "GHSA-jjwr-5cfh-7xwh"
      },
      {
        "Type": "CVE",
        "Value": "CVE-2025-53621"
      }
    ],
    "Description": "### Impact\n\nTwo related XXE injection possibilities have been discovered, **impacting all versions of DSpace prior to 7.6.4, 8.2 and 9.1**.\n\n1. External entities are not disabled when parsing XML files during import of an archive (in [Simple Archive Format](https://wiki.lyrasis.org/pages/viewpage.action?pageId=104566653)), either from command-line (`./dspace import` command) or from the \"Batch Import (Zip)\" user interface feature.  _(Likely impacts all versions of DSpace 1.x \u003c= 7.6.3, 8.0 \u003c= 8.1, and 9.0)_\n2. External entities are also not explicitly disabled when parsing XML responses from some upstream services (ArXiv, Crossref, OpenAIRE, Creative Commons) used in [import from external sources](https://wiki.lyrasis.org/pages/viewpage.action?pageId=104566672) via the user interface or REST API. _(Impacts all versions of DSpace 7.0 \u003c= 7.6.3, 8.0 \u003c= 8.1 and 9.0)_\n\nAn XXE injection in these files may result in a connection being made to an attacker's site or a local path readable by the Tomcat user, with content potentially being injected into a metadata field. In the latter case, this may result in sensitive content disclosure, including retrieving arbitrary files or configurations from the server where DSpace is running or content from remote URLs. The ability to include content from a remote URL could result in a request forgery attack, and disclosure of sensitive information in the  response.\n\n**The Simple Archive Format (SAF) importer / Batch Import (Zip) is only usable by site administrators** (from user interface / REST API) or system administrators (from command-line).  Therefore, to exploit this vulnerability, the malicious payload would have to be provided by an attacker and trusted by an administrator (who would trigger the import).\n* **The most severe practical impact** is a case where an attacker obtains DSpace administrator credentials and uses the Batch Import feature with a malicious SAF archive to expose sensitive local files readable by the Tomcat user, or secrets and access tokens from an authenticated service via request forgery.\n* An attacker without administrative credentials might use some other tactic to convince an administrator to import a malicious SAF archive they have supplied.\n\n**The Import from External Sources feature has a narrower attack vector**.  While this feature is usable by any DSpace Submitter, the malicious payload must be provided *by the external source* (e.g. arXiv, Crossref, OpenAIRE, or Creative Commons).  No known method exists for an attacker to inject XXE via content uploads. Instead, the service itself would need to be compromised in such a way that it would inject a malicious payload into its API response.\n\n### Patches\n\nThe fix is included in DSpace 7.6.4, 8.2 and 9.1. Please upgrade to one of these versions.\n\nIf you cannot upgrade immediately, it is possible to manually patch your DSpace backend. (No changes are necessary to the frontend.)  A pull request exists which can be used to patch systems running DSpace 7.6.x, 8.x or 9.0. This pull request provides central methods to retrieve Java XML, SAX, JAXB XML document builders with safe default settings, including XXE protection.\n* Pull request for 7.x: https://github.com/DSpace/DSpace/pull/11032 ([Downloadable patch file](https://github.com/DSpace/DSpace/pull/11032.patch))\n* Pull request for 8.x: https://github.com/DSpace/DSpace/pull/11034 ([Downloadable patch file](https://github.com/DSpace/DSpace/pull/11034.patch))\n* Pull request for 9.0: https://github.com/DSpace/DSpace/pull/11035 ([Downloadable patch file](https://github.com/DSpace/DSpace/pull/11035.patch))\n\n#### Apply the patch to your DSpace\nIf at all possible, we recommend upgrading your DSpace site based on the upgrade instructions. However, if you are unable to do so, you can manually apply the above patches to your DSpace backend as follows:\n1. Download the appropriate patch file to the machine where DSpace backend is running\n2. From the `[dspace-src]` folder, apply the patch, e.g. `git apply [name-of-file].patch`\n3. Now, update your DSpace site (based loosely on the Upgrade instructions). This generally involves three steps:\n    1. Rebuild DSpace, e.g. `mvn -U clean package`  (This will recompile all DSpace backend code)\n    2. Redeploy DSpace, e.g. `ant update`  (This will copy all newly built code to your installation directory). Depending on your setup you also may need to copy the updated \"server\" webapp over to your Tomcat webapps folder.\n    3. Restart Tomcat (or runnable JAR)\n\n### Workarounds\n**Patching the system is the recommended fix.** It is not possible to fully protect your system via workarounds.\n\nThat said, until you are able to patch your system or upgrade, you can apply these best practices:\n* Administrators must carefully inspect any SAF archives (they did not construct themselves) before importing.  If SAF archives are too large to manually inspect, you should avoid importing them until your site is patched.\n* As necessary, affected external services can be disabled (see [documentation](https://wiki.lyrasis.org/pages/viewpage.action?pageId=104566672)) to mitigate the ability for a malicious payload to be delivered via external service APIs.\n\n\n### Credits\nDiscovered \u0026 reported by Pablo Picurelli Ortiz (@superpegaso2703)\nCode fix developed by Kim Shepherd (@kshepherd) of The Library Code\n\n### For more information\n* [XXE Cheat Sheet / Explanations](https://cheatsheetseries.owasp.org/cheatsheets/XML_External_Entity_Prevention_Cheat_Sheet.html)\n* If you have any questions or comments about this advisory, please contact us at [security@dspace.org](mailto:security@dspace.org)",
    "Origin": "UNSPECIFIED",
    "PublishedAt": "2025-07-15T18:04:53Z",
    "Severity": "MODERATE",
    "Summary": "DSpace is vulnerable to XML External Entity injection during archive imports ",
    "UpdatedAt": "2025-07-15T18:04:56Z",
    "WithdrawnAt": "",
    "CVSS": {
      "Score": 6.9,
      "VectorString": "CVSS:3.1/AV:N/AC:L/PR:H/UI:R/S:C/C:H/I:N/A:L"
    }
  },
  "Versions": [
    {
      "FirstPatchedVersion": {
        "Identifier": "9.1"
      },
      "VulnerableVersionRange": "\u003e= 9.0, \u003c 9.1"
    },
    {
      "FirstPatchedVersion": {
        "Identifier": "8.2"
      },
      "VulnerableVersionRange": "\u003e= 8.0, \u003c 8.2"
    },
    {
      "FirstPatchedVersion": {
        "Identifier": "7.6.4"
      },
      "VulnerableVersionRange": "\u003c 7.6.4"
    }
  ]
}