{
  "Identifier": "GHSA-3c5g-73f7-grvm",
  "PackageSlug": "packagist/neos/neos",
  "Title": "Neos Information Disclosure Security Note",
  "Description": "Due to reports it has been validated that internal workspaces in Neos are accessible without authentication. Some users assumed this is a planned feature but it is not. A workspace preview should be an additional feature with respective security measures in place.\n\nNote that this only allows reading of internal workspaces not writing. And for clarification, an internal workspace is a workspace that is non public and doesn't have an owner.\n\nGiven that an internal workspace exists in your installation, it is possible to view a page in context of that workspace by opening a link in this format:\n\nhttps://domain/path/to/page.html@workspace-name\n\nThe issue is quite problematic when exploited but at the same time slightly less impactful than it sounds. First of all there is no default internal workspace, so the issue affects only workspaces created by users. That also means the workspace-name, which will also always include a hash is individual to a project and an exploiter must get hold of the workspace-name including the hash. This is non trivial as there is no indication of the existence of it, but obviously brute force and educated guessed can be made.",
  "Date": "2024-05-17",
  "Pubdate": "2024-05-17",
  "AffectedRange": "\u003e=2.3.0 \u003c3.0.20||\u003e=3.1.0 \u003c3.1.18||\u003e=3.2.0 \u003c3.2.14||\u003e=3.3.0 \u003c3.3.23||\u003e=4.0.0 \u003c4.0.17||\u003e=4.1.0 \u003c4.1.16||\u003e=4.2.0 \u003c4.2.12||\u003e=4.3.0 \u003c4.3.3",
  "FixedVersions": [
    "3.0.20",
    "3.1.18",
    "3.2.14",
    "3.3.23",
    "4.0.17",
    "4.1.16",
    "4.2.12",
    "4.3.3"
  ],
  "AffectedVersions": "All versions starting from 2.3.0 before 3.0.20, all versions starting from 3.1.0 before 3.1.18, all versions starting from 3.2.0 before 3.2.14, all versions starting from 3.3.0 before 3.3.23, all versions starting from 4.0.0 before 4.0.17, all versions starting from 4.1.0 before 4.1.16, all versions starting from 4.2.0 before 4.2.12, all versions starting from 4.3.0 before 4.3.3",
  "NotImpacted": "All versions before 2.3.0, all versions starting from 3.0.20 before 3.1.0, all versions starting from 3.1.18 before 3.2.0, all versions starting from 3.2.14 before 3.3.0, all versions starting from 3.3.23 before 4.0.0, all versions starting from 4.0.17 before 4.1.0, all versions starting from 4.1.16 before 4.2.0, all versions starting from 4.2.12 before 4.3.0, all versions starting from 4.3.3",
  "Solution": "Upgrade to versions 3.0.20, 3.1.18, 3.2.14, 3.3.23, 4.0.17, 4.1.16, 4.2.12, 4.3.3 or above.",
  "Urls": [
    "https://github.com/advisories/GHSA-3c5g-73f7-grvm",
    "https://github.com/FriendsOfPHP/security-advisories/blob/master/neos/neos/2019-06-17.yaml",
    "https://github.com/neos/neos",
    "https://www.neos.io/blog/neos-workspace-disclosure-security.html"
  ],
  "CvssV2": "",
  "CvssV3": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N",
  "UUID": "5ddbfd03-4a45-4c28-8e4d-5a56bd212d68"
}