{
  "Severity": "CRITICAL",
  "UpdatedAt": "2023-10-10T21:23:42Z",
  "Package": {
    "Ecosystem": "PIP",
    "Name": "mlflow"
  },
  "Advisory": {
    "DatabaseId": 206087,
    "Id": "GSA_kwCzR0hTQS14ZzczLTk0ZnAtZzQ0Oc4AAyUH",
    "GhsaId": "GHSA-xg73-94fp-g449",
    "References": [
      {
        "Url": "https://github.com/mlflow/mlflow/security/advisories/GHSA-xg73-94fp-g449"
      },
      {
        "Url": "https://nvd.nist.gov/vuln/detail/CVE-2023-1177"
      },
      {
        "Url": "https://github.com/mlflow/mlflow/commit/7162a50c654792c21f3e4a160eb1a0e6a34f6e6e"
      },
      {
        "Url": "https://huntr.dev/bounties/1fe8f21a-c438-4cba-9add-e8a5dab94e28"
      },
      {
        "Url": "https://github.com/mlflow/mlflow/pull/7891/commits/7162a50c654792c21f3e4a160eb1a0e6a34f6e6e"
      },
      {
        "Url": "https://github.com/advisories/GHSA-xg73-94fp-g449"
      }
    ],
    "Identifiers": [
      {
        "Type": "GHSA",
        "Value": "GHSA-xg73-94fp-g449"
      },
      {
        "Type": "CVE",
        "Value": "CVE-2023-1177"
      }
    ],
    "Description": "### Impact\n\nUsers of the MLflow Open Source Project who are hosting the MLflow Model Registry using the `mlflow server` or `mlflow ui` commands using an MLflow version older than MLflow 2.2.1 may be vulnerable to a remote file access exploit if they are not limiting who can query their server (for example, by using a cloud VPC, an IP allowlist for inbound requests, or authentication / authorization middleware).\n\nThis issue only affects users and integrations that run the `mlflow server` and `mlflow ui` commands. Integrations that do not make use of `mlflow server` or `mlflow ui` are unaffected; for example, the Databricks Managed MLflow product and MLflow on Azure Machine Learning do not make use of these commands and are not impacted by these vulnerabilities in any way.\n\nThe vulnerability detailed in https://nvd.nist.gov/vuln/detail/CVE-2023-1177 enables an actor to download arbitrary files unrelated to MLflow from the host server, including any files stored in remote locations to which the host server has access.\n\n### Patches\nThis vulnerability has been patched in MLflow 2.2.1, which was released to PyPI on March 2nd, 2023. If you are using `mlflow server` or `mlflow ui` with the MLflow Model Registry, we recommend upgrading to MLflow 2.2.1 as soon as possible.\n\n### Workarounds\nIf you are using the MLflow open source `mlflow server` or `mlflow ui` commands, we strongly recommend limiting who can access your MLflow Model Registry and MLflow Tracking servers using a cloud VPC, an IP allowlist for inbound requests, authentication / authorization middleware, or another access restriction mechanism of your choosing.\n\nIf you are using the MLflow open source `mlflow server` or `mlflow ui` commands, we also strongly recommend limiting the remote files to which your MLflow Model Registry and MLflow Tracking servers have access. For example, if your MLflow Model Registry or MLflow Tracking server uses cloud-hosted blob storage for MLflow artifacts, make sure to restrict the scope of your server's cloud credentials such that it can only access files and directories related to MLflow.\n\n### References\nMore information about the vulnerability is available at https://nvd.nist.gov/vuln/detail/CVE-2023-1177.",
    "Origin": "UNSPECIFIED",
    "PublishedAt": "2023-03-24T22:01:09Z",
    "Severity": "CRITICAL",
    "Summary": "mlflow is vulnerable to remote file access in `mlflow server` and `mlflow ui` CLIs",
    "UpdatedAt": "2023-10-31T21:22:06Z",
    "WithdrawnAt": "",
    "CVSS": {
      "Score": 9.8,
      "VectorString": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H"
    }
  },
  "Versions": [
    {
      "FirstPatchedVersion": {
        "Identifier": "2.2.1"
      },
      "VulnerableVersionRange": "\u003c= 2.2.0"
    }
  ]
}