{
  "Title": "Security update for netdata",
  "Tracking": {
    "ID": "openSUSE-SU-2021:0647-1",
    "Status": "Final",
    "Version": "1",
    "InitialReleaseDate": "2021-05-01T16:05:36Z",
    "CurrentReleaseDate": "2021-05-01T16:05:36Z",
    "RevisionHistory": [
      {
        "Number": "1",
        "Date": "2021-05-01T16:05:36Z",
        "Description": "current"
      }
    ]
  },
  "Notes": [
    {
      "Text": "Security update for netdata",
      "Title": "Topic",
      "Type": "Summary"
    },
    {
      "Text": "This update for netdata fixes the following issues:\n\n- Update to 1.29.3\nRelease v1.29.3 is a patch release to improve the stability of the\nNetdata Agent.\nWe discovered a bug that when proc.plugin attempts to collect the\noperstate parameter for a virtual network interface. If the chart\nis obsoleted, the Netdata Agent crashes.\nThis release also contains additional bug fixes and improvements.\nBug fixes\n  * Fix proc.plugin to invalidate RRDSETVAR pointers on obsoletion.\n\n- Update to 1.29.2\nRelease v1.29.2 is a patch release to improve the stability of the\nNetdata Agent.\nWe discovered that an improvement introduced in v1.29.0 could\ninadvertently set all os_* host labels to unknown, which could\naffect users who leverage these host labels to organize their\nnodes, deploy health entities, or export metrics to external\ntime-series databases. This bug has been fixed.\nThis release also contains additional bug fixes and improvements.\nImprovements\n  * Make the Opsgenie API URL configurable.\n  * Add k8s_cluster_id host label.\n  * Enable apps.plugin aggregation debug messages.\n  * Add configuration parameter to disable stock alarms.\n  * Add ACLK proxy setting as host label.\n  * Add freeswitch to apps_groups.conf.\n  * Simplify thread creation and remove unnecessary variables in\n    the eBPF plugin.\nBug fixes\n  * Fix the context filtering on the data query endpoint.\n  * Fix container/host detection in the system-info.sh script.\n  * Add a small delay to the ipv4_tcp_resets alarms.\n  * Fix collecting operstate for virtual network interfaces.\n  * Fix sendmail unrecognized option F error.\n  * Fix so that raw binary data should never be printed.\n  * Change KSM memory chart type to stacked.\n  * Allow the REMOVED alarm status via ACLK if the previous status\n    was WARN/CRIT.\n  * Reduce excessive logging in the ACLK.\n- Changes in 1.29.1\nRelease v1.29.1 is a hotfix release to address a crash in the\nNetdata Agent.\nA locking bug in one of the internal collectors in Netdata could\ncause it to crash during shutdown in a way that would result in the\nNetdata Agent taking an excessively long time to exit.\nBug fixes\n  * Fix crash during shutdown of cgroups internal plugin.\n\n- Update to 1.29.0 (go.d.plugin 0.27.0)\nThe v1.29.0 release of the Netdata Agent is a maintenance release\nthat brings incremental but necessary improvements that make your\nmonitoring experience more robust. We've pushed improvements and\nbug fixes to the installation and update scripts, enriched our\nlibrary of collectors, and focused on fixing bugs reported by the\ncommunity.\nAt a glance\nNetdata now collects and meaningfully organizes metrics from both\nthe Couchbase JSON document database and the nginx-module-vts\nmodule for exposing metrics about NGINX virtual hosts.\nWe've also migrated more collectors from Python to Go in our\ncontinued efforts to make data collection faster and more robust.\nThe newest effort includes our Redis, Pika, and Energi Core Wallet\ncollectors.\nOn the dashboard, we improved the responsiveness of panning forward\nand backward through historical metrics data by preventing\nunnecessary updates and reducing the number of calls. The charts\nshould also now immediately update when you stop panning.\nImprovements\n  * Reduce the number of alarm updates on ACLK.\n  * Remove unused entries from structures.\n  * Improve the retry/backoff during claiming.\n  * Support multiple chart label keys in data queries.\n  * Truncate excessive information from titles for apps and\n    cgroups collectors.\n  * Use mguid instead of hostname in the ACLK collector list.\n  * Cleanup and minor fixes to eBPF collector.\n  * Add _is_k8s_node label to the host labels.\n  * Move ACLK into a legacy subfolder.\n  * Exclude autofs by default in the diskspace plugin.\n  * Mark internal functions as static in health code.\n  * Remove unused struct in health code.\n  * Add support for per series styling for dygraphs.\nDashboard\n  * Fix minor vulnerability alert by updating socket-io dependency.\n  * Fix dygraph panning responsiveness, chart heights and\n    performance improvements.\n  * Make legend position configurable.\nCollectors\n  * Add Go version of the redis collector.\n  * Add Go version of the pika collector.\n  * Add Go version of the energis collector.\n  * Add a new nginxvts collector.\n  * Add a new couchbase collector.\n  * Add Traefik v2 to the prometheus collector default\n    configuration.\n  * Add an expected_prefix configuration option to the prometheus\n    collector.\n  * Add patterns support to the filecheck collector.\nBug fixes\n  * Fix container detection from systemd-detect-virt.\n  * Fix handling of TLS config so that cURL works in all cases.\n  * Fix disconnect message sent via ACLK on agent shutdown\n  * Fix prometheus remote write header\n  * Fix values in Prometheus export for metrics, collected by the\n    Prometheus collector\n  * Fix handling spaces in labels values in the Prometheus\n    collector\n  * Fix mysql.slave_status alarm for go mysql collector\n  * Make mdstat_mismatch_cnt alarm less strict\n  * Dispatch cgroup discovery into another thread\n  * Fix data source option for Prometheus web API in exporting\n    configuration\n  * Fix anomalies collector custom model bug\n  * Fix broken dbengine stress tests.\n  * Fix segmentation fault in the agent\n  * Fix memory allocation when computing standard deviation\n  * Fix temperature parsing in the hddtemp collector\n  * Fix postgres password bug and change default config\n  * Add handling 'yes' and 'no' and flexible space match in the\n    python.d/fail2ban plugin\n  * Fix spelling mistakes in the Python plugin and documentation.\n\n- Update to v1.28\nRelease v1.28.0 is a hotfix release to address a deadlock in the\nNetdata Agent. If the Agent-Cloud link (ACLK) connection drops and\nthe Agent fails to queue an on_connect message, it also fails to\nproperly release a lock in the web server thread.\n\n- Enable additional dependencies (gprc, json, libcurl, libelf,\n  libwebsockets, protobuf, snappy, xenstat, yajl)\n- Update to v1.27.0 (go.d.plugin 0.26.2)\nThe v1.27.0 release of the Netdata Agent brings dramatic\nimprovements to long-term metrics storage via the database engine,\nand new dashboard features like a time \u0026 date picker for\nvisualizing precise timeframes. Two new collectors bring incredible\nnew value to existing features, including a bit of machine learning\nmagic.\nThis release contains 8 new collectors, 1 new notification method\n(2 others enhanced), 54 improvements, 41 documentation updates, and\n58 bug fixes.\nImprovements\n  * Add labels for Kubernetes pods and containers.\n  * Add plugin and module health entities.\n  * Migrate the metadata log to SQLite.\n  * Add an extent cache to the database engine.\n  * Added new data query option allow_past.\nNetdata Cloud\n  * Add the ability to query child nodes by their GUID.\n  * Add child availability messages to the ACLK.\n  * Add a metric showing how long a query spent in the queue.\n  * Completely hide the SSO iframe.\nCollectors\n  * Add alarms obsoletion and disable alarms collector by default.\n  * Add calls for tcp_sendmsg, tcp_retransmit_skb, tcp_cleanup_rcv,\n    udp_sendmsg, udp_recvmsg functions charts to the eBPF\n    collector.\n  * Add two more insignificant warnings to suppress in anomalies\n    collector.\n  * Add the number of allocated/stored objects within each storage\n    to the varnish collector.\n  * Add a wireless statistics collector.\n  * Add support for MSE (Massive Storage Engine) to the varnish\n    collector.\n  * Remove remove crit from unmatched alarms in the web_log\n    collector.\n  * Add GPU key metrics (nvidia_smi collector) to\n    dashboard_info.js.\n  * Add allocated space metrics to the oracledb collector.\n  * Restructure the eBPF collector to improve usability.\n  * Add an anomaly detection collector.\n  * Add a Netdata alarms collector.\n  * Add a configuration option to exclude users with zero memory\n    allocated to the nvidia_smi collector.\n  * Add per queue charts to the rabbitmq collector.\n  * Add support for HBA drives to the hpssa collector.\n  * Update the cgroups collector default filtering by adding pod\n    level cgroups.\n  * Add a Go version of the CouchDB collector (couchdb).\n  * Add collecting HTTP method per URL pattern (url_pattern option)\n    to the web_log collector.\n  * Add custom time fields feature to the web_log collector.\n  * Add a Go version of the PowerDNS Authoritative Nameserver\n    collector (powerdns).\n  * Add a Go version of the PowerDNS Recursor collector\n    (powerdns_recursor).\n  * Add a Go version of the PowerDNS DNSdist collector (dnsdist).\n  * Add a Dnsmasq DNS Forwarder collector (dnsmasq).\n  * Add collecting directories size to the filecheck collector.\n  * Add old systemd versions support to the systemdunits collector.\n  * Add unmatched lines logging to the web_log collector.\nNotifications\n  * Add API V2 support to the PagerDuty health integration.\n  * Add threads support to the Google Hangouts health integration.\n  * Add a Opsgenie health integration.\nExporting\n  * Add HTTP and HTTPS support to the simple exporting connector.\nPackaging/installation\n  * Update React dashboard v2.11.\n  * Update go.d.plugin version to v0.26.2.\n  * Update eBPF collector to 0.4.9.\n  * Add ability to use system libwebsockets instead of bundled\n    version.\n  * Update the version of libJudy that we bundle to 1.0.5-netdata2.\nBug fixes\n  * Fix crash in the eBPF plugin by initializing variables.\n  * Fix sending chart definition on every data collection in alarms\n    collector.\n  * Fix a lock check.\n  * Fix issue with chart metadata sent multiple times over ACLK.\n  * Fix a buffer overflow when extracting information from a\n    streaming connection.\n  * Fix hostname configuration in the exporting engine.\n  * Fix units and data source exporting options.\n  * Fix exporting config.\n  * Fix health by disabling used_file_descriptors alarm.\n  * Fix GPU data filtering in the nvidia_smi collector.\n  * Fix username resolution in the nvidia_smi collector.\n  * Fix compilation with HTTPS disabled.\n  * Fix hostname when syslog is used in syslog health integration.\n  * Fix streaming buffer size.\n  * Fix database endless loop when cleaning obsolete charts.\n  * Disable chart obsoletion code for archived chart creation.\n  * Fix Prometheus remote write exporter so that it doesn't stop\n    when data is not available for dimension formatting.\n  * Fix memory calculation by moving shared from cached to used\n    dimension.\n  * Fix parsing in the libreswan collector.\n  * Fix an infinite loop in the statsd plugin\n  * Disregard host tags configuration pointer.\n  * Fix platform dependent printf format.\n  * Fix cgroups collector resolving container names in k8s.\n  * Fix python.d plugin runtime chart creation.\n  * Fix race condition in rrdset_first_entry_t() and\n    rrdset_last_entry_t().\n  * Fix the data endpoint so that the context param is correctly\n    applied to children.\n  * Fix Coverity errors (CID 364045,364046).\n  * Fix the elasticsearch_last_collected alarm.\n  * Fix spelling error in xenstat.plugin.\n  * Fix chart filtering.\n  * Fix libnetdata headers to be compatible with C++.\n  * Fix registry responses to remove caching.\n  * Fix eBPF memory management.\n  * Fix overlapping memory issue.\n  * Fix response and upstream response time histogram charts in the\n    web_log collector.\n  * Fix logs timestamps always in UTC issue in the go.d.plugin\n  * Fix collecting slave status for MariaDB v10.2.0- in the mysql\n    collector\n  * Fix cumulative_stats configuration option in the unbound\n    collector\n  * Fix parsing configuration file (respect 'include-toplevel'\n    directive) in unbound collector\n  * Fix handling charts with type.id \u003e= 200 (netdata limit) in\n    go.d.plugin\n  * Fix parsing version query response in the mysql collector\n  * Fix Netsplits chart dimensions algorithm in the the vernemq\n    collector.\n  * Fix a typo in dashboard_info.js for VerneMQ.\n\n- Allow go plugin to build for Tumbleweed\n\n- Fix RPM file list\n- Update to v1.26.0 (go.d.plugin 0.23.0):\nImprovements\n  * Add the ability to send Agent alarm notifications to StackPulse\n  * Add a way to get build configuration info from the Agent\n  * Add chart for churn rates to python.d/rabbitmq\n  * Add failed dim to the connection_fails alarm in the Portcheck\n    alarm\n  * Improve the data query when using the context parameter\n  * Add a context parameter to the data endpoint\n(Netdata Cloud)\n  * Change default ACLK query thread count\n  * Remove leading whitespace before JSON in ACLK\n  * Allow using libwebsockets without SOCKS5\n  * Add information about Cloud disabled status to -W buildinfo\n(Collectors)\n  * Update go.d.plugin version to v0.23.0\n    + Add new filecheck collector\n    + Add new systemd unit state collector\n    + Add new ISC DHCP collector\n(Dashboard)\n  * Add missing period in Netdata dashboard\nBug Fixes\n  * Fix systemd comment syntax\n  * Fix file descriptor leak in Infiniband collector (proc.plugin)\n  * Fix the data endpoint to prioritize chart over context if both\n    are present\n  * Fix cleanup of obsolete charts\n  * Fix build for the AWS Kinesis exporting connector\n  * Fix gauges for go.d.plugin/web_log collector\n  * Fix locking order to address CID_362348\n  * Fix chart's last accessed time during context queries\n  * Fix resource leak in case of malformed request to Netdata Cloud\n\n- Move edit-config to libexeddir\n- Fix conf.d path in edit-config\n\n- Fix building with go support on openSUSE 15.2\n\n- Build with python3\n- Protect /etc/netdata as it contains sensitive data (passwords, secrets)\n\n- update to 1.25.0:\nImprovements\n  * Add code to release memory used by the global GUID map (#9729, @stelfrag)\n  * Add check for spurious wakeups\nNetdata Cloud\n  * Add v2 HTTP message with compression to ACLK (#9895, @underhood)\n  * Add version negotiation to ACLK (#9819, @underhood)\n  * Add claimed_id for child nodes streamed to their parents (#9804, @underhood)\n  * Update netdata-installer.sh to enable Netdata Cloud support in macOS (#9360, @mrbrutti)\nCollectors\n  * Update go.d.plugin version to v0.22.0 (#9898, @ilyam8)\n  * Add support for IP ranges to Python-based isc_dhcpd collector (#9755, @vsc55)\n  * Add Network viewer charts to ebpf.plugin (#9591, @thiagoftsm)\n  * Add collecting active processes limit on Linux systems (#9843, @Ancairon)\n  * Improve eBPF plugin by removing unnecessary debug messages (#9754, @thiagoftsm)\n  * Add CAP_SYS_CHROOT for netdata service to read LXD network interfaces (#9726, @vlvkobal)\n  * Add collecting maxmemory to python.d/redis (#9767, @ilyam8)\n  * Add option for multiple storage backends in python.d/varnish (#9668, @florianmagnin)\n* Dashboard\n  * Update dashboard v1.4.2 (#9837, @jacekkolasa)\n* Lots of documentation improvements and bug fixes\n\n- update to 1.24.0:\n * The v1.24.0 release of the Netdata Agent brings enhancements to the breadth of metrics we collect with a new generic Prometheus/OpenMetrics collector and enhanced storage and querying with a new multi-host database mode.\n* Add generic Prometheus/OpenMetrics collector (#9644, @ilyam8)\n* Add locking between different collectors for the same application, implemented in different technologies (#9584, @vlvkobal), (#9564, @ilyam8)\n* Implement multihost database (#9556, @stelfrag)\n* Add alarms for FreeBSD interface errors (#8340, @lassebm)\n* Many bugfixes, see https://github.com/netdata/netdata/releases/tag/v1.24.0\n\n- Update to v1.23.2:\n  * Fixed a buffer overrun vulnerability in Netdata's JSON parsing\n    code. This vulnerability could be used to crash Agents\n    remotely, and in some circumstances, could be used in an\n    arbitrary code execution (ACE) exploit.\nImprovements:\n  * Add support for multiple ACLK query processing threads\n  * Add Infiniband monitoring to collector proc.plugin\n  * Change the HTTP method to make the IPFS collector compatible\n    with 0.5.0+\n  * Add support for returning headers using python.d's UrlService\nBug fixes:\n  * Fix vulnerability in JSON parsing\n  * Fixed stored number accuracy\n  * Fix transition from archived to active charts not generating\n    alarms\n  * Fix PyMySQL library to respect my.cnf parameter\n  * Remove health from archived metrics\n  * Update exporting engine to read the prefix option from instance\n    config sections\n  * Fix display error in Swagger API documentation\n  * Wrap exporting engine header definitions in compilation\n    conditions\n  * Improve cgroups collector to autodetect unified cgroups\n  * Fix CMake build failing if ACLK is disabled\n  * Fix now_ms in charts.d collector to prevent tc-qos-helper\n    crashes\n  * Fix python.d crashes by adding a lock to stdout write function\n  * Fix an issue with random crashes when updating a chart's\n    metadata on the fly\n  * Fix ACLK protocol version always parsed as 0\n  * Fix the check condition for chart name change\n  * Fix the exporting engine unit tests\n  * Fix a Coverity defect for resource leaks\n\n- update to v1.23.1:\n  - Lots of fixes and improvements, please see CHANGELOG.md\n  - update go.d plugin to v0.19.2\n\n- Update to v1.22.1:\nBug fixes:\n  - Fixed the latency issue on the ACLK and suppress the diagnostics.\n  - Restored old semantics of 'netdata -W set' command.\n  - Removed check for old alarm status.\n- Changes for v1.22.0:\nBreaking Changes:\n  * The previous iteration of Netdata Cloud, accessible through\n    various Sign in and Nodes view (beta) buttons on the Agent\n    dashboard, is deprecated in favor of the new Cloud experience.\n  * Our old documentation site (docs.netdata.cloud) was replaced\n    with Netdata Learn. All existing backlinks redirect to the new\n    site.\n  * Our localization project is no longer actively maintained.\n    We're grateful for the hard work of its contributors.\nImprovements:\n  * Netdata Cloud:\n    - Enabled support for Netdata Cloud.\n    - Added TTL headers to ACLK responses.\n    - Improved the thread exit fixes in #8750.\n    - Improved ACLK reconnection sequence.\n    - Improved ACLK memory management and shutdown sequence.\n    - Added session-id to ACLK using connect timestamp.\n  * Collectors:\n    - Improved the index size for the eBPF collector.\n    - Added health alarm templates for the whoisquery collector.\n    - Added a whoisquery collector.\n    - Removed an automatic restart of apps.plugin.\n  * Exporting:\n    - Enabled internal statistics for the exporting engine in the\n      Agent dashboard.\n    - Implemented a Prometheus exporter web API endpoint.\n  * Notifications:\n    - Added a certificate revocation alarm for the x509check\n      collector.\n    - Added the ability to send Agent alarm notifications to\n      Dynatrace.\n  * Other:\n    - Updated main copyright and links for the year 2020 in daemon\n      help output.\n    - Moved bind to to [web] section and update\n      netdata.service.v235.in to sync it with recent changes.\n    - Put old dashboard behind a prefix instead of using a script\n      to switch.\n    - Enabled the truthy rule in yamllint.\n    - Added Borg backup, Squeezebox servers, Hiawatha web server,\n      and Microsoft SQL to apps.plugin so that it can appropriately\n      group them by type of service.\n  * Bug fixes:\n    - Fixed mdstat failed devices alarm.\n    - Fixed rare race condition in old Cloud iframe.\n    - Removed no-clear-notification options from portcheck health\n      templates.\n    - Fixed old URLs to silence Netlify's mixed content warnings.\n    - Fixed master streaming fatal exits.\n    - Fixed email authentiation to Cloud/Nodes View.\n    - Fixed non-escaped characters in private registry URLs.\n    - Fixed crash when shutting down an Agent with the ACLK\n      disabled.\n    - Fixed status checks for UPS devices using the apcupsd\n      collector.\n    - Fixed alarm notification script by adding a check to the\n      Dynatrace notification method.\n    - Fixed threads_creation_rate chart context in the\n      python.d MySQL collector.\n    - Fixed sudo check in charts.d libreswan collector to prevent\n      daily security notices.\n\n- Update to v1.21.1:\nRelease v1.21.1 is a hotfix release to improve the performance of\nthe new React dashboard, which was merged and enabled by default in\nv1.21.0.\nThe React dashboard shipped in v1.21.0 did not properly freeze\ncharts that were outside of the browser's viewport. If a user who\nloaded many charts by scrolling through the dashboard, charts\noutside of their browser's viewport continued updating. This excess\nof chart updates caused all charts to update more slowly than every\nsecond.\nv1.21.1 includes improvements to the way the Netdata dashboard\nfreezes, maintains state, and restores charts as users scroll.\n\n- Update to v1.21.0 (go.d.plugin v0.18.0):\nImprovements:\n  * Extended TLS support for 1.3.\n  * Switched to the React dashboard code as the default dashboard.\n  * Collectors:\n    - Added a new Pulsar collector.\n    - Added a new VerneMQ collector.\n    - Added high precision timer support for plugins such as\n      idlejitter.\n    - Added an alarm to the dns_query collector that detects DNS\n      query failure.\n    - Added the ability to get the pod name from cgroup with\n      kubectl in bare-metal deployments.\n    - Added the ability to connect to non-admin user IDs for a Ceph\n      storage cluster.\n    - Added connections (backend) usage to Postgres monitoring.\n  * Exporting:\n    - Added a MongoDB connector to the exporting engine.\n    - Added a Prometheus Remote Write connector to the exporting\n      engine.\n    - Added an AWS Kinesis connector to the exporting engine.\nBug fixes:\n  * Removed notifications from the dashboard and fixed the\n    /default.html route.\n  * Fixed help-tooltips styling, private registry node deletion,\n    and the right-hand sidebar 'jumping' on document clicks.\n  * Fixed errors reported by Coverity.\n  * Fixed broken pipe ignoring in apps.plugin.\n  * Fixed the bytespersec chart context in the Python Apache\n    collector.\n  * Fixed charts.d.plugin to exit properly during Netdata\n    service restart\n  * Fixed minimist dependency vulnerability.\n  * Fixed how SimpleService truncates Python module names.\n  * Added proper prefix to Python module names during loading.\n  * Fixed the flushing error threshold with the database engine.\n  * Fixed memory leak for host labels streaming from slaves to\n    master.\n  * Fixed streaming scaling.\n  * Fixed missing characters in kernel version field by encoding\n    slave fields.\n  * Fixed Ceph collector to get osd_perf_infos in versions 14.2\n    and higher.\n  * Removed extraneous commas from chart information in dashboard.\n  * Removed tmem collection from xenstat_plugin to allow Netdata\n    on Xen 4.13 to compile successfully.\n  * Restricted messages to Google Analytics.\n  * Fixed Python 3 dict access in OpenLDAP collector module.\n\n- Update to v1.20.0 (go.d.plugin v0.15.0)\nBreaking Changes:\n  * Removed deprecated bash collectors apache, cpu_apps, cpufreq,\n    exim, hddtemp, load_average, mem_apps, mysql, nginx, phpfpm,\n    postfix, squid, tomcat. If you were still using one of these\n    collectors with custom configurations, you can find the new\n    collector that replaces it in the supported collectors list.\nImprovements:\n  * Host labels:\n    + Added support for host labels\n    + Improved the monitored system information detection.\n      Added CPU freq \u0026 cores, RAM and disk space.\n    + Started distinguishing the monitored system's (host)\n      OS/Kernel etc. from those of the docker container's\n    + Started creating host labels from collected system info\n    + Started passing labels and container environment variables\n      via the streaming protocol\n    + Started sending host labels via exporting connectors\n    + Added label support to alarm definitions and started\n      recording them in alarm logs\n    + Added support for host labels to the API responses\n    + Added configurable host labels to netdata.conf\n    + Added kubernetes labels\n  * New collectors:\n    + eBPF kernel collector\n    + CockroachDB\n    + squidlog: squid access log parser\n  * Collector improvements:\n    + apps.plugin: Created dns group, improved database group,\n      improved ceph \u0026 samba groups\n    + varnish: Added SMF metrics (cache on disk)\n    + phpfpm: Fixed per process chart titles and readme\n    + python.d: Formatted the code in all modules\n    + node.d/snmp: - Added snmpv3 support, formatted the code in\n      snmp.node.js\n    + cgroups: Improved LXC monitoring by filtering out irrelevant\n      LXC cgroups\n    + litespeed: Added support for different .rtreport format\n    + proc.plugin: Added pressure stall information\n    + sensors: Improved collection logic\n    + proc: Started monitoring network interface speed, duplex,\n      operstate\n    + smartd_log: Fixed the setting in the reallocated sectors\n      count, by setting ATTR5 chart algorithm to absolute\n    + nvidia-smi: Allow executing nvidia-smi in normal instead of\n      loop mode\n    + wmi: collect logon metrics, collect logical_disk disk\n      latency metrics\n    + weblog: handle MKCOL, PROPFIND, MOVE, SEARCH http request\n      methods\n    + scaleio: storage pools and sdcs metrics\n  * Exporting engine:\n    + Implemented the main flow for the Exporting Engine\n  * Streaming:\n    + Add versioning to the streaming protocol\n  * Installation/Packages:\n    + Improved the systemd service files, by removing unecessary\n      ExecStartPre lines and moving global options to netdata.conf\n  * Privacy:\n    + Added support for opting out of telemetry via the\n      DO_NOT_TRACK environment variable (telemetry is disabled by\n      default on openSUSE)\n  * Other:\n    + Preparations for the next netdata cloud release. Added custom\n      libmosquitto, netdata-cli and other prerequisites.\n    + Applied linter fixes in shell scripts\n    + Started supporting -fno-common in CFLAGS\n    + Completely removed the unbound python collector (dead code)\n    + Added possibility to change badges' text font color\n    + Small updates to sample multi-host dashboard, dash.html\n    + Added missing quoting in shell scripts\n    + Bump handlebars from 4.2.0 to 4.5.3\n    + Reduce log level for uv_thread_set_name_np from error to info\n    + Set standard name to non-libnetdata threads (libuv, pthread)\n  * Bug fixes:\n    + Fixed problems reported by Coverity for eBPF collector plugin\n    + Fixed invalid literal for float\\(\\): NN.NNt error in the\n      elasticsearch python plugin, by adding terabyte unit parsing\n    + Fixed timeout failing in docker containers which broke some\n      python.d collectors\n    + Fixed problem with the httpcheck python collector not being\n      able to check URLs with the POST method, by adding body to\n      the URLService. Also record the new options in httpcheck.conf\n    + Fixed dbengine repeated global flushing errors and collectors\n      being blocked, by dropping dirty dbengine pages if the disk\n      cannot keep up\n    + Fixed issue with alarm notifications occasionally ignoring\n      the configured severity filter when the ROLE was set to root\n    + Fixed Netlink Connection Tracker charts in the nfacct plugin\n    + Fixed metric values sent via remote write to Prometheus\n      backends, when using average/sum\n    + Fixed unclosed brackets in softnet alarm\n    + Fixed SEGFAULT when localhost initialization failed\n    + Reduced the number of broken pipe error log entries,\n      after a SIGKILL\n    + Fixed Coverity errors by restoring support for protobuf 3.0\n    + Fixed inability to disable Prometheus remote API\n    + Fixed SEGFAULT from the cpuidle plugin\n    + Fixed samba collector not working, due to inability to run\n      sudo\n    + Fixed invalid css/js resource errors when URL for slave node\n      has no final / on streaming master\n    + Fixed keys_redis chart in the redis collector, by populating\n      keys at runtime\n    + Fixed UrlService bytes decoding and logger unicode encoding\n      in the python.d plugin\n    + Fixed a warning in the prometheus remote write backend\n    + Fixed not detecting more than one adapter in the hpssa\n      collector\n    + Fixed race conditions in dbengine\n    + Fixed race condition with the dbenging page cache descriptors\n    + Fixed dbengine dirty page flushing warning\n    + Fixed missing parenthesis on alarm softnet.conf\n    + Fixed 'Master thread EXPORTING takes too long to exit.\n      Giving up' error, by cleaning up the main exporting engine\n      thread on exit\n    + Fixed rabbitmq error 'update() unhandled exception: invalid\n      literal for int() with base 10'\n    + Fixed some LGTM alerts\n    + Fixed valgrind errors\n    + Fixed monit collector LGTM warnings\n    + Fixed the following go.d.plugin collector issues:\n      . mysql: panic in Cleanup (#326)\n      . unbound: gather metrics via unix socket (#319)\n      . logstash: pipelines chart (#317)\n      . unbound: configuration file parsing.\n      . Support include mechanism. (#298)\n      . logstash: pipelines metrics parsing (#293)\n      . phpfpm: processes metrics parsing (#297)\n\n- Also package go.d.plugin (v0.14.1)\n- Update to v1.19.0\nImprovements:\n  * New collectors:\n    + AM2320 sensor collector plugin\n    + Added parsing of /proc/pagetypeinfo to provide metrics on\n      fragmentation of free memory pages\n    + The unbound collector module was completely rewritten, in Go\n  * Collector improvements:\n    + We rewrote our web log parser in Go, drastically improving\n      its flexibility and performance\n    + The Kubernetes kubelet collector now reads the service\n      account token and uses it for authorization. We also added a\n      new default job to collect metrics from\n      https://localhost:10250/metrics\n    + Added a new default job to the Kubernetes coredns collector\n      to collect metrics from\n      http://kube-dns.kube-system.svc.cluster.local:9153/metrics\n    + apps.plugin: Synced FRRouting daemons configuration with the\n      frr 7.2 release\n    + apps.plugin: Added process group for git-related processes\n    + apps.plugin: Added balena to the container-engines\n      application group\n    + web_log: Treat 401 Unauthorized requests as successful\n    + xenstat.plugin: Prepare for xen 4.13 by checking for check\n      xenstat_vbd_error presence\n    + mysql: Added galera cluster_status alarm\n  * Metrics database:\n    + Netdata generates alarms if the disk cannot keep up with\n      data collection\n  * Health:\n    + Fine tune various default alarm configurations\n    + Update SYN cookie alarm to be less aggressive\n    + Added support for IRC alarm notifications\nBug fixes:\n  * Prevented freezes due to isolated CPUs\n  * Fixed missing streaming when slave has SSL activated\n  * Fixed error 421 in IRC notifications, by removing a line break\n    from the message\n  * proc/pagetypeinfo collection could under particular\n    circumstances cause high CPU load. As a workaround,\n    we disabled pagetypeinfo by default\n  * Fixed incorrect memory allocation in proc plugin’s\n    pagetypeinfo collector\n  * Eliminated cached responses from the postgres collector\n  * rabbitmq: Fixed 'disk_free': 'disk_free_monitoring_disabled'\n    error\n  * Fixed Apache module not working with letsencrypt certificate\n    by allowing the python UrlService to skip tls_verify for http\n    scheme\n  * Fixed invalid spikes appearing in certain charts, by improving\n    the incremental counter reset/wraparound detection algorithm\n  * Fixed issue with unknown variables in alarm configuration\n    expressions always being evaluated to zero\n  * Fixed issue of automatically picking up Pi-hole stats from a\n    Pi-hole instance installed on another device by disabling the\n    default job that collects metrics from http://pi.hole\n\n- Update to v1.18.1\nImprovements:\n  * Disable slabinfo plugin by default to reduce the total number\n    of metrics collected\n  * Add dbengine RAM usage statistics\n  * Support Google Hangouts chat notifications\n  * Add CMocka unit tests\n  * Add prerequisites to enable automatic updates for installations\n    via the static binary (kickstart-static64.sh)\nBug fixes:\n  * Fix unbound collector timings: Convert recursion timings to\n    milliseconds.\n  * Fix unbound collector unhandled exceptions\n  * Fix megacli collector binary search and sudo check\n  * Fix Clang warnings\n  * Fix python.d error logging: change chart suppress msg level\n    from ERROR to INFO\n  * Fix freeipmi update frequency check: was warning that 5 was too\n    frequent and it was setting it to 5.\n  * Fix alarm configurations not getting loaded, via better\n    handling of chart names with special characters\n  * Don't write HTTP response 204 messages to the logs\n  * Fix build when CMocka isn't installed\n  * Prevent zombie processes when a child is re-parented to netdata\n    when its running in a container, by adding child process reaper\n- Update to v1.18.0\nImprovements:\n  * Database engine:\n    + Make dbengine the default memory mode\n    + Increase dbengine default cache size\n    + Reduce overhead during write IO\n    + Detect deadlock in dbengine page cache\n    + Remove hard cap from page cache size to eliminate deadlocks.\n  * New collectors:\n    + SLAB cache mechanism\n    + Gearman worker statistics\n    + vCenter Server Appliance\n    + Zookeeper servers\n    + Hadoop Distributed File System (HDFS) nodes\n  * Collector improvements:\n    + rabbitmq: Add vhosts message metrics from /api/vhosts\n    + elasticsearch: collect metrics from _cat/indices\n    + mysql: collect galera cluster metrics\n    + Allow configuration of the python.d launch command from\n      netdata.conf\n    + x509check: smtp cert check support\n    + dnsmasq_dhcp: respect conf-dir,conf-file,dhcp-host options\n    + plugin: respect previously running jobs after plugin restart\n    + httpcheck: add current state duration chart\n    + springboot2: fix context\n  * Health:\n    + Enable alarm templates for chart dimensions\n    + Center the chart on the proper chart and time whenever an\n      alarm link is clicked\n  * Other:\n    + API: Include family into the allmetrics JSON response\n    + API: Add fixed width option to badges\n    + Allow hostnames in Access Control Lists\nBug fixes:\n  * Fix issue error in alarm notification script, when executed\n    without any arguments\n  * Fix Coverity warnings\n  * Fix dbengine consistency when a writer modifies a page\n    concurrently with a reader querying its metrics\n  * Fix memory leak on netdata exit\n  * Fix for missing boundary data points in certain cases\n  * Fix unhandled exception log warnings in the python.d collector\n    orchestrator start\\_job\n  * Fix CORS errors when accessing the health management API,\n    by permitingt x-auth-token in Access-Control-Allow-Headers\n  * Fix misleading error log entries RRDSET: chart name 'XXX' on\n    host 'YYY' already exists, by changing the log level for\n    chart updates\n  * Properly resolve all Kubernetes container names\n  * Fix LGTM warnings\n  * Fix agent UI redirect loop during cloud sign-in\n  * Fix python.d.plugin bug in parsing configuration files with no\n    explicitly defined jobs\n  * Fix potential buffer overflow in the web server\n  * Fix netdata group deletion on linux for uninstall script\n  * Various cppcheck fixes\n  * Fix handling of illegal metric timestamps in database engine\n  * Fix a resource leak\n  * Fix rabbitmq collector error when no vhosts are available.\n\n- Update to v1.17.0\nImprovements:\n  * Database engine:\n    + Variable granularity support for data collection\n    + Added tips on the UI to encourage users to try the new DB\n      Engine, when they reach the end of their metrics history\n  * Health:\n    + Added support for plain text only email notifications\n    + Started showing “hidden” alarm variables in the responses of\n      the chart and data API calls\n    + Added a new API call for alarm status counters, as a first\n      step towards badges that will show the total number of alarms\n  * Security:\n    + Added configurable default locations for trusted CA\n      certificates\n    + Added safer way to get container names\n    + Added SSL connection support to the python mongodb collector\n  * New collectors:\n    + VSphere collector\n  * Archiving:\n    + Added a new MongoDB backend\n  * Other:\n    + Added apps grouping debug messages\n    + GCC warning and linting improvements\n    + Added global configuration option to show charts with zero\n      metrics\n    + Improved the way we parse HTTP requests, so we can avoid\n      issues from edge cases\n  * Bug fixes:\n    + Fixed sensor chips filtering in python sensors collector\n    + Fixed user and group names in apps.plugin when running in a\n      container, by mounting and reading /etc/passwd\n    + Fixed possible buffer overflow in the JSON parser used for\n      health notification silencers\n    + Fixed handling of corrupted DB files in dbengine, that could\n      cause netdata to not start properly\n      (CRC and I/O error handling)\n    + Fixed an issue with Netdata snapshots that could sometimes\n      cause a problem during import\n    + Fixed bug that would cause netdata to attempt to kill already\n      terminated threads again, on shutdown\n    + Fixed out of memory (12) errors by reimplementing the\n      myopen() function family\n    + Fixed wrong redirection of users signing in after clicking\n      Nodes\n    + Fixed python.d smartd collector increasing CPU usage\n    + Fixed mongodb python collector stock configuration mistake,\n      by changing password to pass\n    + Fixed handling of UTF8 characters in badges and added\n      International Support to the URL parser\n    + Fixed nodes menu sizing (responsive)\n    + Fixed issues with http redirection to https and streaming\n      encryption\n    + Fixed broken links to arcstat.py and arc_summary.py in\n      dashboard_info.js\n    + Fixed bug with the nfacct plugin that resulted in missing\n      dimensions from the charts\n    + Stopped anonymous stats from trying to write a log under /tmp\n    + Properly delete obsolete dimensions for inactive disks in\n      smartd_log\n    + Fixed handling of disconnected sockets in unbound python.d\n      collector\n    + Fixed crash in malloc\n    + Fixed issue with mysql collector that resulted in showing\n      only a single slave_status chart, regardless of the number\n      of replication channels\n    + Fixed a segmentation fault in backends\n    + Fixed spigotmc plugin bugs\n    + Fixed dbengine 100% CPU usage due to corrupted transaction\n      payload handling\n\n- Update to v1.16.0\n  Improvements:\n  * Health:\n    + Easily disable alarms, by persisting the silencers\n      configuration\n    + Repeating alarm notifications\n    + Simplified the health cmdapi tester - no setup/cleanup needed\n    + Αdd last_collected alarm to the x509check collector\n    + New alarm for abnormally high number of active processes.\n  * Security:\n    + SSL support in the web server and streaming/replication\n    + Support encrypted connections to OpenTSDB backends\n  * New collectors:\n    + Go.d collector modules for WMI, Dnsmasq DHCP leases\n      and Pihole\n    + Riak KV instances collector\n    + CPU performance statistics using Performance Monitoring Units\n      via the perf_event_open() system call. (perf plugin)\n  * Collector improvements:\n    + Handle different sensor IDs for the same element in the\n      freeipmi plugin\n    + Increase the cpu_limit chart precision in cgroup plugin\n    + Added userstats and deadlocks charts to the python mysql\n      collector\n    + Add perforce server process monitoring to the apps plugin\n  * Backends:\n    + Prometheus remote write backend\n  * DB engine improvements:\n    + Reduced memory requirements by 40-50%\n    + Reduced the number of pages needed to be stored and indexed\n      when using memory mode = dbengine, by adding empty page\n      detection\n  * Rebranding:\n    + Updated the netdata logo and changed links to point to the\n      new website\n  * Other:\n    + Pass the the cloud base url parameter to the notifications\n      mechanism, so that modifications to the configuration are\n      respected when creating the link to the alarm\n    + Improved logging, to be able to trace the\n      CRITICAL: main[main] SIGPIPE received. error\n  Bug fixes:\n  * Fixed ram_available alarm\n  * Stop monitoring /dev and /run in the disk space and inode\n    usage charts\n  * Fixed the monitoring of the “time” group of processes\n  * Fixed compilation error PERF_COUNT_HW_REF_CPU_CYCLES'\n    undeclared here in old Linux kernels (perf plugin)\n  * Fixed invalid XML page error (tomcat plugin)\n  * Remove obsolete monit metrics\n  * Fixed Failed to parse error in adaptec_raid\n  * Fixed cluster_health_nodes and cluster_stats_nodes charts in\n    the elasticsearch collector\n  * A modified slave chart's 'name' was not properly transferred\n    to the master\n  * Netdata could run out of file descriptors when using the\n    new DB engine\n  * Fixed UI behavior when pressing the End key\n  * Fixed UI link to check the configuration file,\n    to open in a new tab\n  * Prevented Error: 'module' object has no attribute 'Retry'\n    messages from python collectors, by enforcing minimum version\n    check for the UrlService library\n  * Fixed typo that causes nfacct.plugin log messages to\n    incorrectly show freeipmi\n  * The daemon could get stuck during collection or during\n    shutdown, when using the new dbengine. Reduced new dbengine IO\n    utilization by forcing page alignment per dimension of chart.\n  * Properly handle timeouts/no response in dns_query_time\n    python collector\n  * When a collector restarted after having stopped for a long\n    time, the new dbengine would consume a lot of CPU resources.\n  * Fixed error Assertion old_state \u0026 PG_CACHE_DESCR_ALLOCATED'\n    failed` of the new dbengine. Eliminated a page cache descriptor\n    race condition\n  * tv.html failed to load the three left charts when accessed via\n    https. Turn tv.html links to https\n  * Change print level from error to info for messages about\n    clearing old files from the database\n  * Fixed warning regarding the x509check_last_collected_secs\n    alarms. Changed the template update frequency to 60s, to match\n    the chart’s update frequency\n  * Email notification header lines were not terminated with \\r\\n\n    as per the RFC\n  * Some log entries would not be caught by the python web_log\n    plugin. Fixed the regular expressions\n  * Corrected the date used in pushbullet notifications\n  * Fixed FATAL error when using the new dbengine with no direct\n    I/O support, by falling back to buffered I/O\n  * Fixed compatibility issues with varnish v4 (varnish collector)\n  * The total number of disks in mdstat.XX_disks chart was\n    displayed incorrectly.\n    Fixed the 'inuse' and 'down' disks stacking.\n  * The config option --disable-telemetry was being checked after\n    restarting netdata, which means that we would still send\n    anonymous statistics the first time netdata was started.\n    (NOTE: Telemetry is disabled by default on openSUSE.)\n  * Fixed apcupsd collector errors, by passing correct info to the\n    run function.\n  * apcupsd and libreswan were not enabled by default\n  * Fixed incorrect module name: energi to energid\n  * The nodes view did not work properly when a reverse proxy was\n    configured to access netdata via paths containing subpaths\n    (e.g. myserver/netdata)\n  * Fix error message PLUGINSD : cannot open plugins directory\n  * Corrected invalid links to web_log.conf that appear on the\n    agent UI\n  * Fixed ScaleIO collector endpoint paths\n  * Fixed web client timeout handling in the go.d plugin httpcheck\n    collector\n\n- Update to v1.15.0\n  Bug Fixes:\n  * Prowl notifications were not being sent, unless another\n    notification method was also active\n  * Fix exception handling in the python.d plugin\n  * The node applications group did not include all node processes.\n  * The nvidia_smi collector displayed incorrect power usage\n  * The python.d plugin would sometimes hang, because it lacked\n    a connect timeout\n  * The mongodb collector raised errors due to various KeyErrors\n  * The smartd_log collector would show incorrect temperature\n    values\n  Improvements:\n  * Support for aggregate node view\n  * Database engine\n  * New collector modules:\n    + Go.d collectors for OpenVPN, the Tengine web server and\n      ScaleIO (VxFlex OS) instances\n    + Monitor disk access latency like ioping does\n  * Energi Core daemon monitoring, suits other Bitcoin forks\n  * Collector improvements:\n    + Add docker swarm manager metrics to the go.d docker_engine\n      collector\n    + Implement unified cgroup cpu limit\n    + python.d.plugin: Allow monitoring of HTTP(S) endpoints which\n      require POST data and make the UrlService more flexible\n  * Support the AWS Kinesis backend for long-term storage\n  * Add a new 'text-only' chart renderer\n  * API Improvements:\n    + Smarter caching of API calls. Do not cache alarms and info\n      api calls and extend no-cache headers.\n    + Extend the api/v1/info call response with system and\n      collector information\n    + k6 script for API load testing\n  * Kubernetes helmchart improvements:\n    + Added the init container, where sysctl params could be\n      managed, to bypass the Cannot allocate memory issue\n    + Better startup/shutdown of slaves and reduced memory usage\n      with liveness/readiness probes and default memory mode none\n    + Added the option of overriding the default settings for\n      kubelet, kubeproxy and coredns collectors via values.yaml\n    + Make the use of persistent volumes optional, add apiVersion\n      to fix linting errors and correct the location of the env\n      field\n\n- Update to v1.14.0\nThe release introduces major additions to Kubernetes monitoring,\nwith tens of new charts for Kubelet, kube-proxy and coredns\nmetrics, as well as significant improvements to the netdata\nhelm chart.\nTwo new collectors were added, to monitor Docker hub and Docker\nengine metrics.\nFinally, v1.14 adds support for version 2 cgroups, OpenLDAP\nover TLS, NVIDIA SMI free and per process memory and configurable\nsyslog facilities.\n  Bug Fixes:\n  * Fixed problem autodetecting failed jobs in python.d plugin.\n    It now properly restarts jobs that are being rechecked,\n    as soon as they are able to run.\n  * CouchdDB monitoring would stop sometimes with an exception.\n    Fixed the unhandled exception causing the issue.\n  * The netdata api deliberately returned http error 400 when\n    netdata ran in memory mode none. Modified the behavior to\n    return responses, regardless of the memory mode\n  * The python.d plugin sometimes does not receive SIGTERM when\n    netdata exits, resulting in zombie processes. Added a heartbeat\n    so that the process can exit on SIGPIPE.\n  * The new SMS Server Tools notifications did not handle errors\n    well, resulting in cryptic error messages.\n    Improved error handling.\n  * Fix segmentation fault in streaming, when two dimensions had\n    similar names.\n  * Kubernetes Helm Chart: Fixed incorrect use of namespaces in\n    ServiceAccount and ClusterRoleBinding RBAC fixes.\n  * Elastic search: The option to enable HTTPS was not included in\n    the config file, giving the erroneous impression that HTTPS was\n    not supported. The option was added.\n  * RocketChat notifications were not being sent properly.\n    Added default recipients for roles in the health alarm\n    notification configuration.\n  Improvements:\n  * go.d.plugin v0.4.0 : Docker Hub and k8s coredns collectors,\n    springboot2 URI filters support.\n  * go.d.plugin v0.3.1 : Add default job to run k8s_kubelet.conf,\n    k8s_kubeproxy, activemq modules\n  * go.d.plugin v0.3.0 : Docker engine, kubelet and kub-proxy\n    collectors. x509check module reading certs from file support\n  * Added unified cgroup support that includes v2 cgroups\n  * Disk stats: Added preferred disk id pattern, so that users can\n    see the id they prefer, when multiple ids appear for the same\n    device\n  * NVIDIA SMI: Added memory free and per process memory usage\n    charts to the collector\n  * OpenLDAP: Added TLS support, to allow monitoring of LDAPS.\n  * PHP-FPM: Add health check to raise alarms when the phpfm server\n    is unreachable\n  * PostgreSQL: Our configuration options to connect to a DB did\n    not support all possible option. Added option to connect to a\n    PostreSQL instance by defining a connection string (URI).\n  * python.d.plugin: There was no way to delete obsolete dimensions\n    in charts created by the python.d plugin. The plugin can now\n    delete dimension at runtime.\n  * netdata supports sending its logs to Syslog, but the facility\n    was hard-coded. We now support configurable Syslog facilities\n    in netdata.conf.\n  * Kubernetes Helm Chart improvements:\n    + Added serviceName in statefulset spec to align with the k8s\n      documentation\n    + Added preStart command to persist slave machine GUIDs,\n      so that pod deletion/addition during upgrades doesn't lose\n      the slave history.\n    + Disabled non-essential master netdata collector plugins to\n      avoid duplicate data\n    + Added preStop command to wait for netdata to exit gracefully\n      before removing the container\n    + Extended configuration file support to provide more control\n      from the helm command line\n    + Added option to disable Role-based access control\n    + Added liveness and readiness probes.\n\n- Update to v1.13.0\n  netdata has taken the first step into the world of Kubernetes,\n  with a beta version of a Helm chart for deployment to a k8s\n  cluster and proper naming of the cgroup containers.\n  We have big plans for Kubernetes, so stay tuned!\n  A major refactoring of the python.d plugin has resulted in a\n  dramatic decrease of the required memory, making netdata even\n  more resource efficient.\n  We also added charts for IPC shared memory segments and total\n  memory used.\n  Improvements:\n  * Kubernetes: Helm chart and proper cgroup naming\n  * python.d.plugin: Reduce memory usage with separate process\n    for initial module checking and loaders cleanup\n  * IPC shared memory charts\n  * mysql module add ssl connection support\n  * FreeIPMI: Have the debug option apply the internal freeipmi\n    debug flags\n  * Prometheus backend: Support legacy metric names for source=avg\n  * Registry: Allow deleting the host we are looking at\n  * SpigotMC: Use regexes for parsing.\n  Bug Fixes:\n  * Postgres: fix connection issues\n  * Proxmox container: Fix cgroup naming and use total_* memory\n    counters for cgroups\n  * proc.plugin and plugins.d: Fix memory leaks\n  * SpigotMC: Fix UnicodeDecodeError and py2 compatibility fix\n  * Fix non-obsolete dimension deletion\n  * UI: Fix incorrect icon for the streaming master\n  * Docker container names: Retry renaming when a name is not found\n  * apps.plugin: Don't send zeroes for empty process groups\n  * go.d.plugin: Correct sha256sum check\n  * Unbound module: Documentation corrected with troubleshooting\n    section.\n  * Streaming: Prevent UI issues upon GUID duplication between\n    master and slave netdata instances\n  * Linux power supply module: Fix missing zero dimensions\n  * Minor fixes around plugin_directories initialization\n- Update to v1.12.2\n  Bug Fixes:\n  * Zombie processes exist after restart netdata - add heartbeat\n    to python.d plugin\n  * RocketChat notifications not working\n  * SIGSEGV crash during shutdown of tc plugin\n  * CMake warning for nfacct plugin\n  Improvements:\n  * Oracledb python module\n  * Show streamed servers even for users that are not signed in\n\n- Drop GPG signature (no longer used)\n- Drop spec compatibility with old distro versions\n- Drop netdata-automake-no-dist-xz.patch\n- Refresh netdata-smartd-log-path.patch\n- Update to v1.12.1\n  Fixes:\n  * Fix SIGSEGV at startup: Don't free vars of charts that do not\n    exist #5455\n  * Prevent invalid Linux power supply alarms during startup #5447\n  * Correct duplicate flag enum in health.h #5441\n  * Remove extra 'v' for netdata version from Server response\n    header #5440 and spec URL #5427\n  * apcupsd - Treat ONBATT status the same as ONLINE #5435\n  * Fix #5430 - LogService._get_raw_data under python3 fails on\n    undecodable data #5431\n  * Correct version check in UI #5429\n  * Fix ERROR 405: Cannot download charts index from server -\n    cpuidle handle newlines in names #5425\n  * Fix clock_gettime() failures with the CLOCK_BOOTTIME argument\n    #5415\n  * Use netnsid for detecting cgroup networks; #5413\n  * Python module sensors fix #5406\n  * Fix ceph.chart.py for Python3 #5396 (GaetanF)\n  * Fix warning condition for mem.available #5353\n  * cups.plugin: Support older versions #5350\n  Improvements:\n  * Add driver-type option to the freeipmi plugin #5384\n  * Add support of tera-byte size for Linux bcache. #5373\n  * Split nfacct plugin into separate process #5361\n  * Add cgroup cpu and memory limits and alarms #5172\n  * Add message queue statistics #5115\n- Update to v1.12.0\n  Key improvements:\n  * Introducing netdata.cloud, the free netdata service for all\n    netdata users\n  * High performance plugins with go.d.plugin (data collection\n    orchestrator written in Go)\n  * 7 new data collectors and 11 rewrites of existing data\n    collectors for improved performance\n  * A new management API for all netdata servers\n  * Bind different functions of the netdata APIs to different ports\n  Management API:\n  Netdata now has a management API. We plan to provide a full set\n  of configuration commands using this API.\n  In this release, the management API supports disabling or\n  silencing alarms during maintenance periods.\n  For more information about the management API, check\n  https://docs.netdata.cloud/web/api/health/#health-management-api\n  Anonymous statistics:\n  Anonymous usage information can be collected and sent to Google\n  Analytics. This functionality is disabled by default in openSUSE.\n  Remove /etc/netdata/.opt-out-from-anonymous-statistics to enable.\n  The statistics calculated from this information will be used for:\n  1. Quality assurance, to help us understand if netdata behaves as\n     expected and help us identify repeating issues for certain\n     distributions or environment.\n  2. Usage statistics, to help us focus on the parts of netdata\n     that are used the most, or help us identify the extend our\n     development decisions influence the community.\n  Information is sent to Netdata via two different channels:\n  * Google Tag Manager is used when an agent's dashboard is\n    accessed.\n  * The script anonymous-statistics.sh is executed by the Netdata\n    daemon, when Netdata starts, stops cleanly, or fails.\n  Both methods are controlled via the same opt-out mechanism.\n  For more information, check\n  https://docs.netdata.cloud/docs/anonymous-statistics/\n  Data collection:\n  This release introduces a new Go plugin orchestrator.\n  This plugin has its own github repo\n  (https://github.com/netdata/go-orchestrator). It is open-source,\n  using the same license and we welcome contributions.\n  The orchestrator can also be used to build custom data collection\n  plugins written in Go. We have used the orchestrator to write\n  many new Go plugins in our go.d plugin github repo.\n  For more information, check\n  https://github.com/netdata/go-orchestrator#go-orchestrator-wip\n  New data collectors:\n  * Activemq (Go)\n  * Consul (Go)\n  * Lighttpd2 (Go)\n  * Solr (Go)\n  * Springboot2 (Go)\n  * mdstat - nonredundant arrays (C)\n  * CUPS printing system (C)\n  High performance versions of older data collectors:\n  * apache (Go)\n  * dns_query (Go)\n  * Freeradius (Go)\n  * Httpcheck (Go)\n  * Lighttpd (Go)\n  * Portcheck (Go)\n  * Nginx (Go)\n  * cpufreq (C)\n  * cpuidle (C)\n  * mdstat (C)\n  * power supply (C)\n  Other improved data collectors:\n  * Fix the python plugin clock (collectors falling behind).\n  * adaptec_raid: add to python.d.conf.\n  * apcupsd: Detect if UPS is online.\n  * apps: Fix process statistics collection for FreeBSD.\n  * apps: Properly lookup docker container name when running in ECS\n  * fail2ban: Add 'Restore Ban' action.\n  * go_expavar: Don't check for duplicate expvars.\n  * hddtemp: Don't use disk model as dim name.\n  * megacli: add to python.d.conf.\n  * nvidia_smi: handle N/A values.\n  * postgres: Fix integer out of range error on Postgres 11,\n    fix locks count.\n  * proc: Don't show zero charts for ZFS filesystem.\n  * proc; Fix cached memory calculation.\n  * sensors: Don't ignore 0 RPM fans on start.\n  * smartd_log: check() unhandled exception: list index out of\n    range.\n  * SNMP: Gracefully ignore the offset if the value is not a number\n  Health Monitoring:\n  * Add Prowl notifications for iOS users.\n  * Show count of active alarms per state in email notifications.\n  * Show evaluated expression and expression variable values in\n    email notifications.\n  * Improve support for slack recipients (channels/users).\n  * Custom notifications: Fix bug with alarm role recipients.\n  Dashboards:\n  * Server filtering in my-netdata menu when signed in to\n    netdata.cloud\n  * All units are now IEC-compliant abbreviations (KiB, MiB etc.).\n  * GUI: Make entire row clickable in the registry menu showing\n    the list of servers.\n  Backends:\n  * Do not report stale metrics to prometheus.\n  Other:\n  * Treat DT_UNKNOWN files as regular files.\n  * API: Stricter rules for URL separators.\n- Update to v1.11.1\n  Improved internal database:\n  Overflown incremental values (counters) do not show a zero point\n  at the charts. Netdata detects the width (8bit, 16bit, 32bit,\n  64bit) of each counter and properly calculates the delta when\n  the counter overflows.\n  The internal database format has been extended to support values\n  above 64bit.\n  New data collection plugins:\n  * openldap, to collect performance statistics from OpenLDAP\n    servers.\n  * tor, to collect traffic statistics from Tor.\n  * nvidia_smi to monitor NVIDIA GPUs.\n  Improved data collection plugins:\n  * BUG FIX: network interface names with colon (:) in them were\n    incorrectly parsed and resulted in faulty data collection\n    values.\n  * BUG FIX: smartd_log has been refactored, has better python v2\n    compatibility, and now supports SCSI smart attributes\n  * cpufreq has been re-written in C - since this module if common,\n    we decided to convert to an internal plugin to lower the\n    pressure on the python ones. There are a few more that will be\n    transitioned to C in the next release.\n  * BUG FIX: sensors got some compatibility fixes and improved\n    handling for lm-sensors errors.\n  Health monitoring:\n  * BUG FIX: max network interface speed data collection was\n    faulty, which resulted in false-positive alarms on systems with\n    multiple interfaces using different speeds (the speed of the\n    first network interface was used for all network interfaces).\n    Now the interface speed is shown as a badge.\n  * alerta.io notifications got a few improvements\n  * BUG FIX: conntrack_max alarm has been restored (was not working\n    due to an invalid variable name referenced)\n  Registry (my-netdata menu):\n  * It has been refactored a bit to reveal the URLs known for each\n    node and now it supports deleting individual URLs.\n- Update to 1.11.0\n  * Stock config files are now in /usr/lib/netdata; use the\n    /etc/netdata/edit-config script to copy and edit them.\n  * The query engine of netdata has been re-written to support\n    query plugins. We have already added the following algorithms\n    that are available for alarm, charts and badges:\n    + stddev, for calculating the standard deviation on any\n      time-frame.\n    + ses or ema or ewma, for calculating the exponential weighted\n      moving average, or single/simple exponential smoothing on\n      any time-frame.\n    + des, for calculating the double exponential smoothing on any\n      time-frame.\n    + cv or rsd, for calculating the coefficient of variation for\n      any time-frame.\n  Fixed security issues:\n  * CVE-2018-18836 Fixed JSON Header Injection (an attacker could\n    send \\n encoded in the request to inject a JSON fragment into\n    the response). boo#1139094\n  * CVE-2018-18837 Fixed HTTP Header Injection (an attacker could\n    send \\n encoded in the request to inject an HTTP header into\n    the response). boo#1139095\n  * CVE-2018-18838 Fixed LOG Injection (an attacker could send \\n\n    encoded in the request to inject a log line at access.log).\n    boo#1139098\n  * CVE-2018-18839 Not fixed Full Path Disclosure, since these are\n    intended (netdata reports the absolute filename of web files,\n    alarm config files and alarm handlers).\n  * Fixed Privilege Escalation by manipulating apps.plugin or\n    cgroup-network error handling.\n  * Fixed LOG injection (by sending URLs with \\n in them).\n  New data collection modules:\n  * rethinkdbs for monitoring RethinkDB performance\n  * proxysql for monitoring ProxySQL performance\n  * litespeed for monitoring LiteSpeed web server performance.\n  * uwsgi for monitoring uWSGI performance\n  * unbound for monitoring the performance of Unbound DNS servers.\n  * powerdns for monitoring the performance of PowerDNS servers.\n  * dockerd for monitoring the health of dockerd\n  * puppet for monitoring Puppet Server and Puppet DB.\n  * logind for monitoring the number of active users.\n  * adaptec_raid and megacli for monitoring the relevant raid\n    controller\n  * spigotmc for monitoring minecraft server statistics\n  * boinc for monitoring Berkeley Open Infrastructure Network\n    Computing clients.\n  * w1sensor for monitoring multiple 1-Wire temperature sensors.\n  * monit for collecting process, host, filesystem, etc checks\n    from monit.\n  * linux_power_supplies for monitoring Linux Power Supplies\n    attributes\n  Data collection orchestrators changes:\n  * node.d.plugin does not use the js command any more.\n  * python.d.plugin now uses monotonic clocks. There was a\n    discrepancy in clocks used in netdata that resulted in a shift\n    in time of python module after some time (it was missing 1 sec\n    per day).\n  * added MySQLService for quickly adding plugins using mysql\n    queries.\n  * URLService now supports self-signed certificates and supports\n    custom client certificates.\n  * all python.d.plugin modules that require sudo to collect\n    metrics, are now disabled by default, to avoid security alarms\n    on installations that do not need them.\n  Improved data collection modules:\n  * apps.plugin now detects changes in process file descriptors,\n    also fixed a couple of memory leaks. Its default configuration\n    has been enriched significantly, especially for IoT.\n  * freeipmi.plugin now supports option ignore-status to ignore\n    the status reported by given sensors.\n  * statsd.plugin (for collecting custom APM metrics)\n    + The charting thread has been optimized for lowering its CPU\n      consumption when several millions of metrics are collected.\n    + sets now report zeros instead of gaps when no data are\n      collected\n    + histograms and timers have been optimized for lowering their\n      CPU consumption to support several thousands of such metrics\n      are collected.\n    + histograms had wrong sampling rate calculations.\n    + gauges now ignore sampling rate when no sign is included in\n      the value.\n    + the minimum sampling rate supported is now 0.001.\n    + netdata statsd is now drop-in replacement for datadog statsd\n      (although statsd tags are currently ignored by netdata).\n  * proc.plugin (Linux, system monitoring)\n    + Unused interrupts and softirqs are not used in charts\n      (this saves quite some processing power and memory on systems\n      with dozens of CPU cores).\n    + fixed /proc/net/snmp parsing of IcmpMsg lines that failed on\n      a few systems.\n    + Veritas Volume Manager disks are now recognized and named\n      accordingly.\n    + Now netdata collects TcpExtTCPReqQFullDrop and re-organizes\n      metrics in charts to properly monitor the TCP SYN queue and\n      the TCP Accept queue of the kernel.\n    + Many charts that were previously reported as IPv4, were\n      actually reflecting metrics for both IPv4 and IPv6.\n      They have been renamed to ip.*.\n    + netdata now monitors SCTP.\n    + Fixed BTRFS over BCACHE sector size detection.\n    + BCACHE data collection is now faster.\n    + /proc/interrupts and /proc/softirqs parsing fixes.\n  * diskspace.plugin (Linux, disk space usage monitoring)\n    + It does not stat() excluded mount points any more (it was\n      interfering with kerberos authenticated mount points).\n    + several filesystems are now by default excluded from\n      disk-space monitoring, to avoid breaking suspend on\n      workstations.\n  * python.d.plugin PYTHON modules (applications monitoring)\n    + web_log module now supports virtual hosts, reports http/https\n      metrics, support squid logs\n    + nginx_plus module now handles non-continuous peer IDs\n    + ipfs module is optimized, the use of its Pin API is now\n      disabled by default and can enabled with a netdata module\n      option (using the IPFS Pin API increases the load on the\n      IPFS server).\n    + fail2ban module now supports IPv6 too.\n    + ceph module now checks permissions and properly reports\n      issues\n    + elasticsearch module got better error handling\n    + nginx_plus module now uses upstream ip:port instead of\n      transient id to identify dimensions.\n    + redis, now it supports Pika, collects evited keys, fixes\n      authentication issues reported and improves exception\n      handling.\n    + beanstalk, bug fix for yaml config loading.\n    + mysql, the % of active connections is now monitored,\n      query types are also charted.\n    + varnish, now it supports versions above 5.0.0\n    + couchdb\n    + phpfpm, now supports IPv6 too.\n    + apache, now supports IPv6 too.\n    + icecast\n    + mongodb, added support for connect URIs\n    + postgress\n    + elasticsearch, now it supports versions above 6.3.0,\n      fixed JSON parse errors\n    + mdstat , now collects mismatch_cnt\n    + openvpn_log\n  * node.d.plugin NODE.JS modules\n    + snmp was incorrectly parsing a new OID names as float.\n  * charts.d.plugin BASH modules\n    + nut now supports naming UPSes.\n  Health monitoring:\n  * Added variable $system.cpu.processors.\n  * Added alarms for detecting abnormally high load average.\n  * TCP SYN and TCP accept queue alarms, replacing the old softnet\n    dropped alarm that was too generic and reported many false\n    positives.\n  * system alarms are now enabled on FreeBSD.\n  * netdata now reads NIC speed and sets alarms on each interface\n    to detect congestion.\n  * Network alarms are now relaxed to avoid false positives.\n  * New bcache alarms.\n  * New mdstat alarms.\n  * New apcupsd alarms.\n  * New mysql alarms.\n  * New notification methods:\n    + rocket.chat\n    + Microsoft Teams\n    + syslog\n    + fleep.io\n    + Amazon SNS\n  Backends:\n  * Host tags are now sent to Graphite\n  * Host variables are now sent to Prometheus\n  Streaming:\n  * Each netdata slave and proxy now filter the charts that are\n    streamed. This allows exposing netdata masters to third parties\n    by limiting the number of charts available at the master.\n  * Fixed a bug in streaming slaves that randomly prevented them\n    to resume streaming after network errors.\n  * Fixed a bug that on slaves that sent duplicated chart names\n    under certain conditions.\n  * Fixed a bug that caused slaves to consume 100% CPU (due to a\n    misplaced lock) when multiple threads were adding dimensions\n    on the same chart.\n  * The receiving nodes of streaming (netdata masters and proxies)\n    can now rate-limit the rate of inbound streaming requests\n    received.\n  * Re-worked time synchronization between netdata slaves and\n    masters.\n  API:\n  * Badges that report time, now show 'undefined' instead of\n    'never'.\n  Dashboard:\n  * Added UTC timezone to the list of available time-zones.\n  * The dashboard was sending some non-HTTP compliant characters\n    at the URLs that made netdata dashboards break when used under\n    certain proxies.\n",
      "Title": "Details",
      "Type": "General"
    },
    {
      "Text": "The CVRF data is provided by SUSE under the Creative Commons License 4.0 with Attribution (CC-BY-4.0).",
      "Title": "Terms of Use",
      "Type": "Legal Disclaimer"
    },
    {
      "Text": "openSUSE-2021-647",
      "Title": "Patchnames",
      "Type": "Details"
    }
  ],
  "ProductTree": {
    "Relationships": [
      {
        "ProductReference": "netdata-1.29.3-lp152.4.3.1",
        "RelatesToProductReference": "openSUSE Leap 15.2",
        "RelationType": "Default Component Of"
      }
    ]
  },
  "References": [
    {
      "URL": "https://lists.opensuse.org/archives/list/security-announce@lists.opensuse.org/thread/7QJRCOF3ZVZ6YHKSI4ITV4ND423PKJLT/",
      "Description": "E-Mail link for openSUSE-SU-2021:0647-1"
    },
    {
      "URL": "https://www.suse.com/support/security/rating/",
      "Description": "SUSE Security Ratings"
    },
    {
      "URL": "https://bugzilla.suse.com/1139094",
      "Description": "SUSE Bug 1139094"
    },
    {
      "URL": "https://bugzilla.suse.com/1139095",
      "Description": "SUSE Bug 1139095"
    },
    {
      "URL": "https://bugzilla.suse.com/1139098",
      "Description": "SUSE Bug 1139098"
    },
    {
      "URL": "https://www.suse.com/security/cve/CVE-2018-18836/",
      "Description": "SUSE CVE CVE-2018-18836 page"
    },
    {
      "URL": "https://www.suse.com/security/cve/CVE-2018-18837/",
      "Description": "SUSE CVE CVE-2018-18837 page"
    },
    {
      "URL": "https://www.suse.com/security/cve/CVE-2018-18838/",
      "Description": "SUSE CVE CVE-2018-18838 page"
    },
    {
      "URL": "https://www.suse.com/security/cve/CVE-2018-18839/",
      "Description": "SUSE CVE CVE-2018-18839 page"
    }
  ],
  "Vulnerabilities": [
    {
      "CVE": "CVE-2018-18836",
      "Description": "An issue was discovered in Netdata 1.10.0. JSON injection exists via the api/v1/data tqx parameter because of web_client_api_request_v1_data in web/api/web_api_v1.c.",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "moderate"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2018-18836.html",
          "Description": "CVE-2018-18836"
        },
        {
          "URL": "https://bugzilla.suse.com/1139094",
          "Description": "SUSE Bug 1139094"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": [
            "openSUSE Leap 15.2:netdata-1.29.3-lp152.4.3.1"
          ]
        }
      ],
      "CVSSScoreSets": {}
    },
    {
      "CVE": "CVE-2018-18837",
      "Description": "An issue was discovered in Netdata 1.10.0. HTTP Header Injection exists via the api/v1/data filename parameter because of web_client_api_request_v1_data in web/api/web_api_v1.c.",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "moderate"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2018-18837.html",
          "Description": "CVE-2018-18837"
        },
        {
          "URL": "https://bugzilla.suse.com/1139095",
          "Description": "SUSE Bug 1139095"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": [
            "openSUSE Leap 15.2:netdata-1.29.3-lp152.4.3.1"
          ]
        }
      ],
      "CVSSScoreSets": {}
    },
    {
      "CVE": "CVE-2018-18838",
      "Description": "An issue was discovered in Netdata 1.10.0. Log Injection (or Log Forgery) exists via a %0a sequence in the url parameter to api/v1/registry.",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "moderate"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2018-18838.html",
          "Description": "CVE-2018-18838"
        },
        {
          "URL": "https://bugzilla.suse.com/1139098",
          "Description": "SUSE Bug 1139098"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": [
            "openSUSE Leap 15.2:netdata-1.29.3-lp152.4.3.1"
          ]
        }
      ],
      "CVSSScoreSets": {}
    },
    {
      "CVE": "CVE-2018-18839",
      "Description": "** DISPUTED ** An issue was discovered in Netdata 1.10.0. Full Path Disclosure (FPD) exists via api/v1/alarms. NOTE: the vendor says \"is intentional.\"",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "moderate"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2018-18839.html",
          "Description": "CVE-2018-18839"
        },
        {
          "URL": "https://bugzilla.suse.com/1144517",
          "Description": "SUSE Bug 1144517"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": [
            "openSUSE Leap 15.2:netdata-1.29.3-lp152.4.3.1"
          ]
        }
      ],
      "CVSSScoreSets": {}
    }
  ]
}