{
  "Title": "Security update for dovecot23",
  "Tracking": {
    "ID": "openSUSE-SU-2021:2892-1",
    "Status": "Final",
    "Version": "1",
    "InitialReleaseDate": "2021-08-31T14:38:32Z",
    "CurrentReleaseDate": "2021-08-31T14:38:32Z",
    "RevisionHistory": [
      {
        "Number": "1",
        "Date": "2021-08-31T14:38:32Z",
        "Description": "current"
      }
    ]
  },
  "Notes": [
    {
      "Text": "Security update for dovecot23",
      "Title": "Topic",
      "Type": "Summary"
    },
    {
      "Text": "This update for dovecot23 fixes the following issues:\n\nUpdate dovecot to version 2.3.15 (jsc#SLE-19970):\n\nSecurity issues fixed:\n\n- CVE-2021-29157: Dovecot does not correctly escape kid and azp fields in\n  JWT tokens. This may be used to supply attacker controlled keys to\n  validate tokens, if attacker has local access. (bsc#1187418)\n  Local attacker can login as any user and access their emails\n- CVE-2021-33515:  On-path attacker could have injected plaintext commands\n  before STARTTLS negotiation that would be executed after STARTTLS\n  finished with the client. (bsc#1187419)\n  Attacker can potentially steal user credentials and mails\n\n* Disconnection log messages are now more standardized across services.\n  They also always now start with 'Disconnected' prefix.\n* Dovecot now depends on libsystemd for systemd integration.\n* Removed support for Lua 5.2. Use version 5.1 or 5.3 instead.\n* config: Some settings are now marked as 'hidden'. It's discouraged to\n  change these settings. They will no longer be visible in doveconf\n  output, except if they have been changed or if doveconf -s parameter\n  is used. See https://doc.dovecot.org/settings/advanced/ for details.\n* imap-compress: Compression level is now algorithm specific.\n  See https://doc.dovecot.org/settings/plugin/compress-plugin/\n* indexer-worker: Convert 'Indexed' info logs to an event named\n  'indexer_worker_indexing_finished'. See\n  https://doc.dovecot.org/admin_manual/list_of_events/#indexer-worker-indexing-finished\n+ Add TSLv1.3 support to min_protocols.\n+ Allow configuring ssl_cipher_suites. (for TLSv1.3+)\n+ acl: Add acl_ignore_namespace setting which allows to entirely ignore\n  ACLs for the listed namespaces.\n+ imap: Support official RFC8970 preview/snippet syntax. Old methods of\n  retrieving preview information via IMAP commands ('SNIPPET and PREVIEW\n  with explicit algorithm selection') have been deprecated.\n+ imapc: Support INDEXPVT for imapc storage to enable private\n  message flags for cluster wide shared mailboxes.\n+ lib-storage: Add new events: mail_opened, mail_expunge_requested,\n  mail_expunged, mail_cache_lookup_finished. See\n  https://doc.dovecot.org/admin_manual/list_of_events/#mail\n+ zlib, imap-compression, fs-compress: Support compression levels that\n  the algorithm supports. Before, we would allow hardcoded value between\n  1 to 9 and would default to 6. Now we allow using per-algorithm value\n  range and default to whatever default the algorithm specifies.\n- *-login: Commands pipelined together with and just after the authenticate\n  command cause these commands to be executed twice. This applies to all\n  protocols that involve user login, which currently comprises of imap,\n  pop3, submisision and managesieve.\n- *-login: Processes are supposed to disconnect the oldest non-logged in\n  connection when process_limit was reached. This didn't actually happen\n  with the default 'high-security mode' (with service_count=1) where each\n  connection is handled by a separate process.\n- *-login: When login process reaches client/process limits, oldest\n  client connections are disconnected. If one of these was still doing\n  anvil lookup, this caused a crash. This could happen only if the login\n  process limits were very low or if the server was overloaded.\n- Fixed building with link time optimizations (-flto).\n- auth: Userdb iteration with passwd driver does not always return all\n  users with some nss drivers.\n- dsync: Shared INBOX not synced when 'mail_shared_explicit_inbox' was\n  disabled. If a user has a shared mailbox which is another user's INBOX,\n  dsync didn't include the mailbox in syncing unless explicit naming is\n  enabled with 'mail_shared_explicit_inbox' set to 'yes'.\n- dsync: Shared namespaces were not synced with '-n' flag.\n- dsync: Syncing shared INBOX failed if mail_attribute_dict was not set.\n  If a user has a shared mailbox that is another user's INBOX, dsync\n  failed to export the mailbox if mail attributes are disabled.\n- fts-solr, fts-tika: Using both Solr FTS and Tika may have caused HTTP\n  requests to assert-crash: Panic: file http-client-request.c: line 1232\n  (http_client_request_send_more): assertion failed: (req-\u003epayload_input != NULL)\n- fts-tika: 5xx errors returned by Tika server as indexing failures.\n  However, Tika can return 5xx for some attachments every time.\n  So the 5xx error should be retried once, but treated as success if it\n  happens on the retry as well. v2.3 regression.\n- fts-tika: v2.3.11 regression: Indexing messages with fts-tika may have\n  resulted in Panic: file message-parser.c: line 802 (message_parser_deinit_from_parts):\n  assertion failed: (ctx-\u003enested_parts_count == 0 || i_stream_have_bytes_left(ctx-\u003einput))\n- imap: SETMETADATA could not be used to unset metadata values.\n  Instead NIL was handled as a 'NIL' string. v2.3.14 regression.\n- imap: IMAP BINARY FETCH crashes at least on empty base64 body:\n  Panic: file index-mail-binary.c: line 358 (blocks_count_lines):\n  assertion failed: (block_count == 0 || block_idx+1 == block_count)\n- imap: If IMAP client using the NOTIFY command was disconnected while\n  sending FETCH notifications to the client, imap could crash with\n  Panic: Trying to close mailbox INBOX with open transactions.\n- imap: Using IMAP COMPRESS extension can cause IMAP connection to hang\n  when IMAP commands are \u003e8 kB long.\n- imapc: If remote server sent BYE but didn't immediately disconnect, it\n  could cause infinite busy-loop.\n- lib-index: Corrupted cache record size in dovecot.index.cache file\n  could have caused a crash (segfault) when accessing it.\n- lib-oauth2: JWT token time validation now works correctly with\n  32-bit systems.\n- lib-ssl-iostream: Checking hostnames against an SSL certificate was\n  case-sensitive.\n- lib-storage: Corrupted mime.parts in dovecot.index.cache may have\n  resulted in Panic: file imap-bodystructure.c: line 206 (part_write_body):\n  assertion failed: (text == ((part-\u003eflags \u0026 MESSAGE_PART_FLAG_TEXT) != 0))\n- lib-storage: Index rebuilding (e.g. via doveadm force-resync) didn't\n  preserve the 'hdr-pop3-uidl' header. Because of this, the next pop3\n  session could have accessed all of the emails' metadata to read their\n  POP3 UIDL (opening dbox files).\n- listescape: When using the listescape plugin and a shared namespace\n  the plugin didn't work properly anymore resulting in errors like:\n  'Invalid mailbox name: Name must not have '/' character.'\n- lmtp: Connection crashes if connection gets disconnected due to\n  multiple bad commands and the last bad command is BDAT.\n- lmtp: The Dovecot-specific LMTP parameter XRCPTFORWARD was blindly\n  forwarded by LMTP proxy without checking that the backend has support.\n  This caused a command parameter error from the backend if it was\n  running an older Dovecot release. This could only occur in more complex\n  setups where the message was proxied twice; when the proxy generated\n  the XRCPTFORWARD parameter itself the problem did not occur, so this\n  only happened when it was forwarded.\n- lmtp: The LMTP proxy crashes with a panic when the remote server\n  replies with an error while the mail is still being forwarded through\n  a DATA/BDAT command.\n- lmtp: Username may have been missing from lmtp log line prefixes when\n  it was performing autoexpunging.\n- master: Dovecot would incorrectly fail with haproxy 2.0.14 service\n  checks.\n- master: Systemd service: Dovecot announces readiness for accepting\n  connections earlier than it should. The following environment variables\n  are now imported automatically and can be omitted from\n  import_environment setting: NOTIFY_SOCKET LISTEN_FDS LISTEN_PID.\n- master: service { process_min_avail } was launching processes too\n  slowly when master was forking a lot of processes.\n- util: Make the health-check.sh example script POSIX shell compatible.\n* Added new aliases for some variables. Usage of the old ones is possible,\n  but discouraged. (These were partially added already to v2.3.13.)\n  See https://doc.dovecot.org/configuration_manual/config_file/config_variables/\n  for more information.\n* Optimize imap/pop3/submission/managesieve proxies to use less CPU at\n  the cost of extra memory usage.\n* Remove autocreate, expire, snarf and mail-filter plugins.\n* Remove cydir storage driver.\n* Remove XZ/LZMA write support. Read support will be removed in future release.\n* doveadm -D: Add timestamps to debug output even when LOG_STDERR_TIMESTAMP\n  environment variable is not set. Timestamp format is taken from\n  log_timestamp setting.\n* If BROKENCHAR or listescape plugin is used, the escaped folder names\n  may be slightly different from before in some situations. This is\n  unlikely to cause issues, although caching clients may redownload the\n  folders.\n* imapc: It now enables BROKENCHAR=~ by default to escape remote folder\n  names if necessary. This also means that if there are any '~'\n  characters in the remote folder names, they will be visible as '~7e'.\n* imapc: When using local index files folder names were escaped on\n  filesystem a bit differently. This affects only if there are folder\n  names that actually require escaping, which isn't so common. The old\n  style folders will be automatically deleted from filesystem.\n* stats: Update exported metrics to be compliant with OpenMetrics standard.\n+ doveadm: Add an optional '-p' parameter to metadata list command. If\n  enabled, '/private', and '/shared' metadata prefixes will be prepended\n  to the keys in the list output.\n+ doveconf: Support environment variables in config files. See\n  https://doc.dovecot.org/configuration_manual/config_file/config_file_syntax/#environment-variables\n  for more details.\n+ indexer-worker: Change indexer to disconnect from indexer-worker\n  after each request. This allows service indexer-worker's service_count \u0026\n  idle_kill settings to work. These can be used to restart indexer-worker\n  processes once in a while to reduce their memory usage.\n- auth: 'nodelay' with various authentication mechanisms such as apop\n  and digest-md5 crashed AUTH process if authentication failed.\n- auth: Auth lua script generating an error triggered an assertion\n  failure: Panic: file db-lua.c: line 630 (auth_lua_call_password_verify):\n  assertion failed: (lua_gettop(script-\u003eL) == 0).\n- configure: Fix libunwind detection to work on other than x86_64 systems.\n- doveadm-server: Process could crash if logging was done outside command\n  handling. For example http-client could have done debug logging\n  afterwards, resulting in either segfault or Panic:\n  file http-client.c: line 642 (http_client_context_close):\n  assertion failed: (cctx-\u003eclients_list == NULL).\n- dsync: Folder name escaping with BROKENCHAR didn't work completely\n  correctly. This especially caused problems with dsync-migrations using\n  imapc where some of the remote folder names may not have been accessible.\n- dsync: doveadm sync + imapc doesn't always sync all mails when doing\n  an incremental sync (-1), which could lead to mail loss when it's used\n  for migration. This happens only when GUIDs aren't used (i.e.\n  imapc without imapc_features=guid-forced).\n- fts-tika: When tika server returns error, some mails cause Panic:\n  file message-parser.c: line 802 (message_parser_deinit_from_parts):\n  assertion failed: (ctx-\u003enested_parts_count == 0 || i_stream_have_bytes_left(ctx-\u003einput))\n- lib-imap: imapc parsing illegal BODYSTRUCTUREs with NILs could have\n  resulted in crashes. This exposed that Dovecot was wrongly accepting\n  atoms in 'nstring' handling. Changed the IMAP parsing to be more\n  strict about this now.\n- lib-index: If dovecot.index.cache has corrupted message size, fetching\n  BODY/BODYSTRUCTURE may cause assert-crash:\n  Panic: file index-mail.c: line 1140 (index_mail_parse_body_finish):\n  assertion failed: (mail-\u003edata.parts != NULL).\n- lib-index: Minor error handling and race condition fixes related to\n  rotating dovecot.index.log. These didn't usually cause problems,\n  unless the log files were rotated rapidly.\n- lib-lua: Lua scripts using coroutines or lua libraries using coroutines\n  (e.g., cqueues) panicked.\n- Message PREVIEW handled whitespace wrong so first space would get\n  eaten from between words.\n- FTS and message PREVIEW (snippet) parsed HTML \u0026entities case-sensitively.\n- lib-mail: When max nested MIME parts were reached, IMAP BODYSTRUCTURE\n  was written in a way that may have caused confusion for IMAP clients\n  and also Dovecot itself when parsing it. The truncated part is now\n  written out using application/octet-stream MIME type.\n- lib-oauth2: HS512 and HS384 JWT token algorithms crash when you try to\n  use them: Panic: file hmac.c: line 26 (hmac_init): assertion failed:\n  (meth-\u003econtext_size \u003c= MAC_MAX_CONTEXT_SIZE).\n- event filters: NOT keyword did not have the correct associativity.\n- Ignore ECONNRESET when closing socket. This avoids logging useless\n  errors on systems like FreeBSD.\n- event filters: event filter syntax error may lead to Panic:\n  file event-filter.c: line 137 (event_filter_parse): assertion failed:\n  (state.output == NULL)\n- lib: timeval_cmp_margin() was broken on 32-bit systems. This could\n  potentially have caused HTTP timeouts to be handled incorrectly.\n- log: instance_name wasn't used as syslog ident by the log process.\n- master: After a service reached process_limit and client_limit, it\n  could have taken up to 1 second to realize that more client connections\n  became available. During this time client connections could have been\n  unnecessarily rejected and a warning logged:\n  Warning: service(...): process_limit (...) reached, client connections are being dropped\n- stats: Crash would occur when generating openmetrics data for metrics\n  using aggregating functions.\n- stats: Event filters comparing against empty strings crash the stats\n  process.\n* CVE-2020-24386: Specially crafted command can cause IMAP hibernate to\n  allow logged in user to access other people's emails and filesystem\n  information.\n* Metric filter and global event filter variable syntax changed to a\n  SQL-like format. See https://doc.dovecot.org/configuration_manual/event_filter/\n* auth: Added new aliases for %{variables}. Usage of the old ones is\n  possible, but discouraged.\n* auth: Removed RPA auth mechanism, SKEY auth mechanism, NTLM auth\n  mechanism and related password schemes.\n* auth: Removed passdb-sia, passdb-vpopmail and userdb-vpopmail.\n* auth: Removed postfix postmap socket\n+ auth: Added new fields for auth server events. These fields are now\n  also available for all auth events. See\n  https://doc.dovecot.org/admin_manual/list_of_events/#authentication-server\n  for details.\n+ imap-hibernate: Added imap_client_hibernated, imap_client_unhibernated\n  and imap_client_unhibernate_retried events. See\n  https://doc.dovecot.org/admin_manual/list_of_events/ for details.\n+ lib-index: Added new mail_index_recreated event. See\n  https://doc.dovecot.org/admin_manual/list_of_events/#mail-index-recreated\n+ lib-sql: Support TLS options for cassandra driver. This requires\n  cpp-driver v2.15 (or later) to work reliably.\n+ lib-storage: Missing $HasAttachment / $HasNoAttachment flags are now\n  added to existing mails if mail_attachment_detection_option=add-flags\n  and it can be done inexpensively.\n+ login proxy: Added login_proxy_max_reconnects setting (default 3) to\n  control how many reconnections are attempted.\n+ login proxy: imap/pop3/submission/managesieve proxying now supports\n  reconnection retrying on more than just connect() failure. Any error\n  except a non-temporary authentication failure will result in reconnect\n  attempts.\n- auth: Lua passdb/userdb leaks stack elements per call, eventually\n  causing the stack to become too deep and crashing the auth or\n  auth-worker process.\n- auth: SASL authentication PLAIN mechanism could be used to trigger\n  read buffer overflow. However, this doesn't seem to be exploitable in\n  any way.\n- auth: v2.3.11 regression: GSSAPI authentication fails because dovecot\n  disallows NUL bytes for it.\n- dict: Process used too much CPU when iterating keys, because each key\n  used a separate write() syscall.\n- doveadm-server: Crash could occur if logging was done outside command\n  handling. For example http-client could have done debug logging\n  afterwards, resulting in either segfault or\n  Panic: file http-client.c: line 642 (http_client_context_close):\n  assertion failed: (cctx-\u003eclients_list == NULL).\n- doveadm-server: v2.3.11 regression: Trying to connect to doveadm server\n  process via starttls assert-crashed if there were no ssl=yes listeners:\n  Panic: file master-service-ssl.c: line 22 (master_service_ssl_init):\n  assertion failed: (service-\u003essl_ctx_initialized).\n- fts-solr: HTTP requests may have assert-crashed:\n  Panic: file http-client-request.c: line 1232 (http_client_request_send_more):\n  assertion failed: (req-\u003epayload_input != NULL)\n- imap: IMAP NOTIFY could crash with a segmentation fault due to a bad\n  configuration that causes errors. Sending the error responses to the\n  client can cause the segmentation fault. This can for example happen\n  when several namespaces use the same mail storage location.\n- imap: IMAP NOTIFY used on a shared namespace that doesn't actually\n  exist (e.g. public namespace for a nonexistent user) can crash with a panic:\n  Panic: Leaked view for index /tmp/home/asdf/mdbox/dovecot.list.index: Opened in (null):0\n- imap: IMAP session can crash with QRESYNC extension if many changes\n  are done before asking for expunged mails since last sync.\n- imap: Process might hang indefinitely if client disconnects after\n  sending some long-running commands pipelined, for example FETCH+LOGOUT.\n- lib-compress: Mitigate crashes when configuring a not compiled in\n  compression. Errors with compression configuration now distinguish\n  between not supported and unknown.\n- lib-compression: Using xz/lzma compression in v2.3.11 could have\n  written truncated output in some situations. This would result in\n  'Broken pipe' read errors when trying to read it back.\n- lib-compression: zstd compression could have crashed in some situations:\n  Panic: file ostream.c: line 287 (o_stream_sendv_int): assertion failed: (!stream-\u003eblocking)\n- lib-dict: dict client could have crashed in some rare situations when\n  iterating keys.\n- lib-http: Fix several assert-crashes in HTTP client.\n- lib-index: v2.3.11 regression: When mails were expunged at the same\n  time as lots of new content was being saved to the cache (e.g. cache\n  file was lost and is being re-filled) a deadlock could occur with\n  dovecot.index.cache / dovecot.index.log.\n- lib-index: v2.3.11 regression: dovecot.index.cache file was being\n  purged (rewritten) too often when it had a field that hadn't been\n  accessed for over 1 month, but less than 2 months. Every cache file\n  change caused a purging in this situation.\n- lib-mail: MIME parts were not returned correctly by Dovecot MIME parser.\n  Regression caused by fixing CVE-2020-12100.\n- lib-mail: When max nested MIME parts were reached, IMAP BODYSTRUCTURE\n  was written in a way that may have caused confusion for both IMAP\n  clients and Dovecot itself when parsing it. The truncated part is now\n  written out using application/octet-stream MIME type.\n- lib-mail: v2.3.11 regression: Mail delivery / parsing crashed when the\n  10000th MIME part was message/rfc822 (or if parent was multipart/digest):\n  Panic: file message-parser.c: line 167 (message_part_append):\n  assertion failed: (ctx-\u003etotal_parts_count \u003c= ctx-\u003emax_total_mime_parts).\n- lib-oauth2: Dovecot incorrectly required oauth2 server introspection\n  reply to contain username with invalid token.\n- lib-ssl-iostream, lib-dcrypt: Fix building with OpenSSL that has\n  deprecated APIs disabled.\n- lib-storage: When mail's size is different from the cached one (in\n  dovecot.index.cache or Maildir S=size in the filename), this is\n  handled by logging 'Cached message size smaller/larger than expected'\n  error. However, in some situations this also ended up crashing with:\n  Panic: file istream.c: line 315 (i_stream_read_memarea):\n  assertion failed: (old_size \u003c= _stream-\u003epos - _stream-\u003eskip).\n- lib-storage: v2.3 regression: Copying/moving mails was taking much more\n  memory than before. This was mainly visible when copying/moving\n  thousands of mails in a single transaction.\n- lib-storage: v2.3.11 regression: Searching messages assert-crashed\n  (without FTS): Panic: file message-parser.c: line 174 (message_part_finish):\n  assertion failed: (ctx-\u003enested_parts_count \u003e 0).\n- lib: Dovecot v2.3 moved signal handlers around in ioloops,\n  causing more CPU usage than in v2.2.\n- lib: Fixed JSON parsing: '\\' escape sequence may have wrongly resulted\n  in error if it happened to be at read boundary. Any NUL characters and\n  '\\u0000' will now result in parsing error instead of silently\n  truncating the data.\n- lmtp, submission: Server may hang if SSL client connection disconnects\n  during the delivery. If this happened repeated, it could have ended\n  up reaching process_limit and preventing any further lmtp/submission\n  deliveries.\n- lmtp: Proxy does not always properly log TLS connection problems as\n  errors; in some cases, only a debug message is logged if enabled.\n- lmtp: The LMTP service can hang when commands are pipelined. This can\n  particularly occur when one command in the middle of the pipeline fails.\n  One example of this occurs for proxied LMTP transactions in which the\n  final DATA or BDAT command is pipelined after a failing RCPT command.\n- login-proxy: The login_source_ips setting has no effect, and therefore\n  the proxy source IPs are not cycled through as they should be.\n- master: Process was using 100% CPU in some situations when a broken\n  service was being throttled.\n- pop3-login: POP3 login would fail with 'Input buffer full' if the\n  initial response for SASL was too long.\n- stats: Crash would occur when generating openmetrics data for metrics\n  using aggregating functions.\n\nUpdate pigeonhole to version 0.5.15\n\n* CVE-2020-28200: Sieve interpreter is not protected against abusive\n  scripts that claim excessive resource usage. Fixed by limiting the\n  user CPU time per single script execution and cumulatively over\n  several script runs within a configurable timeout period. Sufficiently\n  large CPU time usage is summed in the Sieve script binary and execution\n  is blocked when the sum exceeds the limit within that time. The block\n  is lifted when the script is updated after the resource usage times out.\n  (bsc#1187420) Attacker can DoS the mail delivery system\n  (jsc#PM-2746) ECO: Dovecot 2.3.15 version upgrade\n* Disconnection log messages are now more standardized across services.\n  They also always now start with 'Disconnected' prefix.\n* managesieve: Commands pipelined together with and just after the\n  authenticate command cause these commands to be executed twice.\n* duplicate: The test was handled badly in a multiscript (sieve_before,\n  sieve_after) scenario in which an earlier script in the sequence with\n  a duplicate test succeeded, while a later script caused a runtime\n  failure. In that case, the message is recorded for duplicate tracking,\n  while the message may not actually have been delivered in the end.\n* editheader: Sieve interpreter entered infinite loop at startup when\n  the 'editheader' configuration listed an invalid header name. This\n  problem can only be triggered by the administrator.\n* relational: The Sieve relational extension can cause a segfault at\n  compile time. This is triggered by invalid script syntax. The segfault\n  happens when this match type is the last argument of the test command.\n  This situation is not possible in a valid script; positional arguments\n  are normally present after that, which would prevent the segfault.\n* sieve: For some Sieve commands the provided mailbox name is not\n  properly checked for UTF-8 validity, which can cause assert crashes at\n  runtime when an invalid mailbox name is encountered. This can be\n  caused by the user by writing a bad Sieve script involving the\n  affected commands ('mailboxexists', 'specialuse_exists').\n  This can be triggered by the remote sender only when the user has\n  written a Sieve script that passes message content to one of the\n  affected commands.\n* sieve: Large sequences of 8-bit octets passed to certain Sieve\n  commands that create or modify message headers that allow UTF-8 text\n  (vacation, notify and addheader) can cause the delivery or IMAP\n  process (when IMAPSieve is used) to enter a memory-consuming\n  semi-infinite loop that ends when the process exceeds its memory\n  limits. Logged in users can cause these hangs only for their own\n  processes.\n\n",
      "Title": "Details",
      "Type": "General"
    },
    {
      "Text": "The CVRF data is provided by SUSE under the Creative Commons License 4.0 with Attribution (CC-BY-4.0).",
      "Title": "Terms of Use",
      "Type": "Legal Disclaimer"
    },
    {
      "Text": "openSUSE-SLE-15.3-2021-2892",
      "Title": "Patchnames",
      "Type": "Details"
    }
  ],
  "ProductTree": {
    "Relationships": [
      {
        "ProductReference": "dovecot23-2.3.15-58.3",
        "RelatesToProductReference": "openSUSE Leap 15.3",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "dovecot23-backend-mysql-2.3.15-58.3",
        "RelatesToProductReference": "openSUSE Leap 15.3",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "dovecot23-backend-pgsql-2.3.15-58.3",
        "RelatesToProductReference": "openSUSE Leap 15.3",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "dovecot23-backend-sqlite-2.3.15-58.3",
        "RelatesToProductReference": "openSUSE Leap 15.3",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "dovecot23-devel-2.3.15-58.3",
        "RelatesToProductReference": "openSUSE Leap 15.3",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "dovecot23-fts-2.3.15-58.3",
        "RelatesToProductReference": "openSUSE Leap 15.3",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "dovecot23-fts-lucene-2.3.15-58.3",
        "RelatesToProductReference": "openSUSE Leap 15.3",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "dovecot23-fts-solr-2.3.15-58.3",
        "RelatesToProductReference": "openSUSE Leap 15.3",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "dovecot23-fts-squat-2.3.15-58.3",
        "RelatesToProductReference": "openSUSE Leap 15.3",
        "RelationType": "Default Component Of"
      }
    ]
  },
  "References": [
    {
      "URL": "https://lists.opensuse.org/archives/list/security-announce@lists.opensuse.org/thread/YLFYZS4WAYE6TU4PO3V2JUI7DPQEK73I/",
      "Description": "E-Mail link for openSUSE-SU-2021:2892-1"
    },
    {
      "URL": "https://www.suse.com/support/security/rating/",
      "Description": "SUSE Security Ratings"
    },
    {
      "URL": "https://bugzilla.suse.com/1187418",
      "Description": "SUSE Bug 1187418"
    },
    {
      "URL": "https://bugzilla.suse.com/1187419",
      "Description": "SUSE Bug 1187419"
    },
    {
      "URL": "https://bugzilla.suse.com/1187420",
      "Description": "SUSE Bug 1187420"
    },
    {
      "URL": "https://www.suse.com/security/cve/CVE-2020-28200/",
      "Description": "SUSE CVE CVE-2020-28200 page"
    },
    {
      "URL": "https://www.suse.com/security/cve/CVE-2021-29157/",
      "Description": "SUSE CVE CVE-2021-29157 page"
    }
  ],
  "Vulnerabilities": [
    {
      "CVE": "CVE-2020-28200",
      "Description": "The Sieve engine in Dovecot before 2.3.15 allows Uncontrolled Resource Consumption, as demonstrated by a situation with a complex regular expression for the regex extension.",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "moderate"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2020-28200.html",
          "Description": "CVE-2020-28200"
        },
        {
          "URL": "https://bugzilla.suse.com/1187420",
          "Description": "SUSE Bug 1187420"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": [
            "openSUSE Leap 15.3:dovecot23-2.3.15-58.3",
            "openSUSE Leap 15.3:dovecot23-backend-mysql-2.3.15-58.3",
            "openSUSE Leap 15.3:dovecot23-backend-pgsql-2.3.15-58.3",
            "openSUSE Leap 15.3:dovecot23-backend-sqlite-2.3.15-58.3",
            "openSUSE Leap 15.3:dovecot23-devel-2.3.15-58.3",
            "openSUSE Leap 15.3:dovecot23-fts-2.3.15-58.3",
            "openSUSE Leap 15.3:dovecot23-fts-lucene-2.3.15-58.3",
            "openSUSE Leap 15.3:dovecot23-fts-solr-2.3.15-58.3",
            "openSUSE Leap 15.3:dovecot23-fts-squat-2.3.15-58.3"
          ]
        }
      ],
      "CVSSScoreSets": {}
    },
    {
      "CVE": "CVE-2021-29157",
      "Description": "Dovecot before 2.3.15 allows ../ Path Traversal. An attacker with access to the local filesystem can trick OAuth2 authentication into using an HS256 validation key from an attacker-controlled location. This occurs during use of local JWT validation with the posix fs driver.",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "moderate"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2021-29157.html",
          "Description": "CVE-2021-29157"
        },
        {
          "URL": "https://bugzilla.suse.com/1187418",
          "Description": "SUSE Bug 1187418"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": [
            "openSUSE Leap 15.3:dovecot23-2.3.15-58.3",
            "openSUSE Leap 15.3:dovecot23-backend-mysql-2.3.15-58.3",
            "openSUSE Leap 15.3:dovecot23-backend-pgsql-2.3.15-58.3",
            "openSUSE Leap 15.3:dovecot23-backend-sqlite-2.3.15-58.3",
            "openSUSE Leap 15.3:dovecot23-devel-2.3.15-58.3",
            "openSUSE Leap 15.3:dovecot23-fts-2.3.15-58.3",
            "openSUSE Leap 15.3:dovecot23-fts-lucene-2.3.15-58.3",
            "openSUSE Leap 15.3:dovecot23-fts-solr-2.3.15-58.3",
            "openSUSE Leap 15.3:dovecot23-fts-squat-2.3.15-58.3"
          ]
        }
      ],
      "CVSSScoreSets": {}
    }
  ]
}