{
  "id": "GHSA-hhfg-fwrw-87w7",
  "modified": "2024-12-11T18:57:13.425785Z",
  "published": "2024-12-11T18:42:00Z",
  "aliases": [
    "CVE-2024-55655"
  ],
  "summary": "sigstore has insufficient validation of integration timestamp during verification",
  "details": "### Summary\n\nVersions of sigstore-python newer than 2.0.0 but prior to 3.6.0 perform insufficient validation of the \"integration time\" present in \"v2\" and \"v3\" bundles during the verification flow: the \"integration time\" is verified *if* a source of signed time (such as an inclusion promise) is present, but is otherwise trusted if no source of signed time is present.\n\nThis does not affect \"v1\" bundles, as the \"v1\" bundle format always requires an inclusion promise.\n\n### Details\n\nSigstore uses signed time to support verification of signatures made against short-lived signing keys. \n\n### Impact\n\nThe impact and severity of this weakness is *low*, as Sigstore contains multiple other enforcing components that prevent an attacker who modifies the integration timestamp within a bundle from impersonating a valid signature. In particular, an attacker who modifies the integration timestamp can induce a Denial of Service, but in no different manner than already possible with bundle access (e.g. modifying the signature itself such that it fails to verify).\n\nSeparately, an attacker could upload a *new* entry to the transparency service, and substitute their new entry's time. However, this would still be rejected at validation time, as the new entry's (valid) signed time would be outside the validity window of the original signing certificate and would nonetheless render the attacker auditable.\n",
  "affected": [
    {
      "package": {
        "ecosystem": "PyPI",
        "name": "sigstore",
        "purl": "pkg:pypi/sigstore"
      },
      "ranges": [
        {
          "type": "ECOSYSTEM",
          "events": [
            {
              "introduced": "2.0.0"
            },
            {
              "fixed": "3.6.0"
            }
          ]
        }
      ],
      "versions": [
        "2.0.0",
        "2.0.1",
        "2.1.0",
        "2.1.2",
        "2.1.3",
        "2.1.5",
        "3.0.0",
        "3.0.0rc1",
        "3.0.0rc2",
        "3.1.0",
        "3.2.0",
        "3.3.0",
        "3.4.0",
        "3.5.0",
        "3.5.1",
        "3.5.3"
      ],
      "database_specific": {
        "source": "https://github.com/github/advisory-database/blob/main/advisories/github-reviewed/2024/12/GHSA-hhfg-fwrw-87w7/GHSA-hhfg-fwrw-87w7.json"
      }
    }
  ],
  "references": [
    {
      "type": "WEB",
      "url": "https://github.com/sigstore/sigstore-python/security/advisories/GHSA-hhfg-fwrw-87w7"
    },
    {
      "type": "ADVISORY",
      "url": "https://nvd.nist.gov/vuln/detail/CVE-2024-55655"
    },
    {
      "type": "WEB",
      "url": "https://github.com/sigstore/sigstore-python/commit/300b502ae99ebfaace124f1f4e422a6a669369cf"
    },
    {
      "type": "PACKAGE",
      "url": "https://github.com/sigstore/sigstore-python"
    },
    {
      "type": "WEB",
      "url": "https://github.com/sigstore/sigstore-python/releases/tag/v3.6.0"
    }
  ]
}