{
  "Title": "ELSA-2012-2022:  Unbreakable Enterprise kernel security and bugfix update (IMPORTANT)",
  "Description": "[2.6.39-200.24.1.el5uek]\n- Revert 'Add Oracle VM guest messaging driver' (Guru Anbalagane) [Orabug: 14233627}\n\n[2.6.39-200.23.1.el5uek]\n- SPEC: add block/net modules to list used by installer (Guru Anbalagane)\n  [Orabug: 14224837]\n\n[2.6.39-200.22.1.el5uek]\n- NFSv4: include bitmap in nfsv4 get acl data (Andy Adamson)  {CVE-2011-4131}\n- ocfs2:btrfs: aio-dio-loop changes broke setrlimit behavior [orabug 14207636]\n  (Dave Kleikamp)\n- Add Oracle VM guest messaging driver (Zhigang Wang)\n- thp: avoid atomic64_read in pmd_read_atomic for 32bit PAE (Andrea Arcangeli)\n  [Orabug: 14217003]\n\n[2.6.39-200.21.0.el5uek]\n- KVM: Fix buffer overflow in kvm_set_irq() (Avi Kivity) [Bugdb: 13966]\n  {CVE-2012-2137}\n- net: sock: validate data_len before allocating skb in sock_alloc_send_pskb()\n  (Jason Wang) [Bugdb: 13966] {CVE-2012-2136}\n- mm: pmd_read_atomic: fix 32bit PAE pmd walk vs pmd_populate SMP race\n  condition (Andrea Arcangeli) [Bugdb: 13966] {CVE-2012-2373}\n- KVM: lock slots_lock around device assignment (Alex Williamson) [Bugdb:\n  13966] {CVE-2012-2121}\n- KVM: unmap pages from the iommu when slots are removed (Alex Williamson)\n  [Bugdb: 13966] {CVE-2012-2121}\n- KVM: introduce kvm_for_each_memslot macro (Xiao Guangrong) [Bugdb: 13966]\n- fcaps: clear the same personality flags as suid when fcaps are used (Eric\n  Paris) [Bugdb: 13966] {CVE-2012-2123}\n\n[2.6.39-200.20.0.el5uek]\n- Update lpfc version for 8.3.5.68.6p driver release (Martin K. Petersen)\n- Fix system hang due to bad protection module parameters (CR 130769) (Martin\n  K. Petersen)\n- oracleasm: Data integrity support (Martin K. Petersen)\n- sd: Allow protection_type to be overridden (Martin K. Petersen)\n- SCSI: Fix two bugs in DIX retry handling (Martin K. Petersen)\n- sd: Avoid remapping bad reference tags (Martin K. Petersen)\n- block: Fix bad range check in bio_sector_offset (Martin K. Petersen)\n\n[2.6.39-200.19.0.el5uek]\n- xen/netback: Calculate the number of SKB slots required correctly (Simon\n  Graham)\n\n [2.6.39-200.18.0.el5uek]\n- e1000e: disable rxhash when try to enable jumbo frame also rxhash and rxcsum\n  have enabled (Joe Jin)\n\n[2.6.39-200.17.0.el5uek]\n- mm: reduce the amount of work done when updating min_free_kbytes (Mel Gorman)\n  [Orabug: 14073214]\n- ocfs2: clear unaligned io flag when dio fails (Junxiao Bi) [Orabug: 14063941]\n- aio: make kiocb-\u003eprivate NUll in init_sync_kiocb() (Junxiao Bi) [Orabug:\n  14063941]\n- vmxnet3: cap copy length at size of skb to prevent dropped frames on tx (Neil\n  Horman) [Orabug: 14159701]\n- mm/mempolicy.c: refix mbind_range() vma issue (KOSAKI Motohiro) [Orabug:\n  14149364]\n- mm/mempolicy.c: fix pgoff in mbind vma merge (Caspar Zhang) [Orabug:14149364]\n\n[2.6.39-200.16.0.el5uek]\n- xen/gntdev: Fix merge error. (Konrad Rzeszutek Wilk)\n\n[2.6.39-200.15.0.el5uek]\n- xen: expose host uuid via sysfs. (Zhigang Wang)\n\n[2.6.39-200.14.0.el5uek]\n- SPEC: upgrade preserve rhck as a boot kernel (Kevin Lyons) [Orabug: 14065209]\n- hxge: update driver to 1.3.4 (Maxim Uvarov) [Orabug: 14134149]\n- SPEC: v2.6.39-200.12.0 (Maxim Uvarov)\n- Revert 'bnx2x: correction to firmware interface' (Joe Jin)\n- cnic: fix bnx2fc_constants.h path (Maxim Uvarov)\n- bnx2x: PFC fix (Yaniv Rosner)\n- cnic: Fix parity error code conflict (Michael Chan)\n- bnx2x: Clear MDC/MDIO warning message (Yaniv Rosner)\n- bnx2x: Fix BCM578x0-SFI pre-emphasis settings (Yaniv Rosner)\n- bnx2x: Fix BCM57810-KR AN speed transition (Yaniv Rosner)\n- cnic: Re-init dev-\u003estats_addr after chip reset (Michael Chan)\n- config: turn on CONFIG_HVC_XEN_FRONTEND (Maxim Uvarov) [Orabug: 14064174]\n- ixgbe: Dont set ip checksum if did not enable tso. (Joe Jin)\n- Revert 'x86, efi: Pass a minimal map to SetVirtualAddressMap()' (Maxim\n  Uvarov) [Orabug: 14076004]\n- r8169: add firmware files (Joe Jin)\n- e1000e: fix build warning. (Joe Jin)\n- bnx2x: file build warning (Joe Jin)\n- 8139too: Add 64bit statistics (Junchang Wang)\n- net: export netdev_stats_to_stats64 (Eric Dumazet)\n- r8169: enable transmit time stamping. (Joe Jin)\n- r8169: stop using net_device.{base_addr, irq}. (Francois Romieu)\n- r8169: move the driver removal method to the end of the driver file.\n  (Francois Romieu)\n- r8169: fix unsigned int wraparound with TSO (Julien Ducourthial)\n- 8139cp: set intr mask after its handler is registered (Jason Wang)\n- r8169: enable napi on resume. (Artem Savkov)\n- r8169: runtime resume before shutdown. (francois romieu)\n- r8169: add 64bit statistics. (Junchang Wang)\n- r8169: corrupted IP fragments fix for large mtu. (francois romieu)\n- r8169: spinlock redux. (Francois Romieu)\n- r8169: avoid a useless work scheduling. (Francois Romieu)\n- r8169: move task enable boolean to bitfield. (Francois Romieu)\n- r8169: bh locking redux and task scheduling. (Francois Romieu)\n- r8169: fix early queue wake-up. (Francois Romieu)\n- r8169: remove work from irq handler. (Joe Jin)\n- r8169: missing barriers. (Francois Romieu)\n- r8169: irq mask helpers. (Francois Romieu)\n- r8169: factor out IntrMask writes. (Francois Romieu)\n- r8169: stop delaying workqueue. (Francois Romieu)\n- r8169: remove rtl8169_reinit_task. (Francois Romieu)\n- r8169: remove hardcoded PCIe registers accesses. (Francois Romieu)\n- 8139cp: fix missing napi_gro_flush. (francois romieu)\n- 8139cp/8139too: do not read into reserved registers (Jason Wang)\n- r8169: fix Config2 MSIEnable bit setting. (francois romieu)\n- r8169: fix Rx index race between FIFO overflow recovery and NAPI handler.\n  (francois romieu)\n- r8169: Rx FIFO overflow fixes. (francois romieu)\n- corral some wayward N/A fw_version dust bunnies (Rick Jones)\n- ethernet: Convert MAC_ADDR_LEN uses to ETH_ALEN (Joe Jin)\n- sweep the floors and convert some .get_drvinfo routines to strlcpy (Joe Jin)\n- r8169: check firmware content sooner. (Francois Romieu)\n- r8169: support new firmware format. (Hayes Wang)\n- r8169: explicit firmware format check. (Francois Romieu)\n- r8169: move the firmware down into the device private data. (Francois Romieu)\n- r8169: increase the delay parameter of pm_schedule_suspend (hayeswang)\n- r8169: fix wrong eee setting for rlt8111evl (hayeswang)\n- r8169: fix driver shutdown WoL regression. (francois romieu)\n- Add ethtool -g support to 8139cp (Rick Jones)\n- sc92031: use standard #defines from mii.h. (francois romieu)\n- r8169: jumbo fixes. (Francois Romieu)\n- r8169: expand received packet length indication. (Francois Romieu)\n- r8169: support new chips of RTL8111F (Hayes Wang)\n- r8169: do not enable the TBI for anything but the original 8169. (Francois\n  Romieu)\n- r8169: remove erroneous processing of always set bit. (Francois Romieu)\n- r8169: fix WOL setting for 8105 and 8111evl (Hayes Wang)\n- r8169: add MODULE_FIRMWARE for the firmware of 8111evl (Hayes Wang)\n- r8169: fix the reset setting for 8111evl (Hayes Wang)\n- r8169: define the early size for 8111evl (Hayes Wang)\n- r8169: convert to SKB paged frag API. (Ian Campbell)\n- 8139cp: convert to SKB paged frag API. (Ian Campbell)\n- net: remove use of ndo_set_multicast_list in realtek drivers (Joe Jin)\n- r8169 : MAC address change fix for the 8168e-vl. (francois romieu)\n- r8169: use pci_dev-\u003esubsystem_{vendor|device} (Sergei Shtylyov)\n- r8169: fix sticky accepts packet bits in RxConfig. (Francois Romieu)\n- r8169: adjust the RxConfig settings. (Hayes Wang)\n- r8169: dont enable rx when shutdown. (Hayes Wang)\n- r8169: fix wake on lan setting for non-8111E. (Hayes Wang)\n- r8169: support RTL8111E-VL. (Hayes Wang)\n- r8169: add ERI functions. (Hayes Wang)\n- r8169: modify the flow of the hw reset. (Hayes Wang)\n- r8169: adjust some registers. (Hayes Wang)\n- r8169: remove unnecessary read of PCI_CAP_ID_EXP (Jon Mason)\n- ixgbevf: print MAC via printk format specifier (Danny Kukawka)\n- ixgbevf: Update copyright notices (Greg Rose)\n- ixgbevf: Fix mailbox interrupt ack bug (Greg Rose)\n- ixgbevf: make operations tables const (Stephen Hemminger)\n- ixgbevf: fix sparse warnings (Stephen Hemminger)\n- ixgbevf: make ethtool ops and strings const (Stephen Hemminger)\n- ixgbevf: Prevent possible race condition by checking for message (Greg Rose)\n- ixgbevf: Fix register defines to correctly handle complex expressions\n  (Alexander Duyck)\n- ixgbevf: Update release version (Greg Rose)\n- ixgbevf: Fix broken trunk vlan (Greg Rose)\n- ixgbevf: convert to ndo_fix_features (Joe Jin)\n- ixgbevf: Check if EOP has changed before using it (Greg Rose)\n- ixgbe: Correct flag values set by ixgbe_fix_features (Joe Jin)\n- ixgbe: fix typo in enumeration name (Don Skidmore)\n- ixgbe: Add support for enabling UDP RSS via the ethtool rx-flow-hash command\n  (Joe Jin)\n- ixgbe: Whitespace cleanups (Joe Jin)\n- ixgbe: Two minor fixes for RSS and FDIR set queues functions (Alexander\n  Duyck)\n- ixgbe: drop err_eeprom tag which is at same location as err_sw_init\n  (Alexander Duyck)\n- ixgbe: Move poll routine in order to improve readability (Alexander Duyck)\n- ixgbe: cleanup logic for the service timer and VF hang detection (Alexander\n  Duyck)\n- ixgbe: Fix issues with SR-IOV loopback when flow control is disabled\n  (Alexander Duyck)\n- ixgbe: Place skb on first buffer_info structure to avoid using stack space\n  (Joe Jin)\n- ixgbe: Use packets to track Tx completions instead of a seperate value\n  (Alexander Duyck)\n- ixgbe: Modify setup of descriptor flags to avoid conditional jumps (Alexander\n  Duyck)\n- ixgbe: Make certain that all frames fit minimum size requirements (Alexander\n  Duyck)\n- ixgbe: cleanup logic in ixgbe_change_mtu (Alexander Duyck)\n- ixgbe: dcb: use DCB config values for FCoE traffic class on open (John\n  Fastabend)\n- ixgbe: Fix race condition where RX buffer could become corrupted. (Atita\n  Shirwaikar)\n- ixgbe: use typed min/max functions where possible (Jesse Brandeburg)\n- ixgbe: fix obvious return value bug. (Don Skidmore)\n- ixgbe: Replace eitr_low and eitr_high with static values in ixgbe_update_itr\n  (Alexander Duyck)\n- ixgbe: Do not disable read relaxed ordering when DCA is enabled (Alexander\n  Duyck)\n- ixgbe: Simplify logic for ethtool loopback frame creation and testing\n  (Alexander Duyck)\n- ixgbe: Add iterator for cycling through rings on a q_vector (Alexander Duyck)\n- ixgbe: Allocate rings as part of the q_vector (Alexander Duyck)\n- ixgbe: Drop unnecessary napi_schedule_prep and spare blank line from\n  ixgbe_intr (Alexander Duyck)\n- ixgbe: Default to queue pairs when number of queues is less than CPUs\n  (Alexander Duyck)\n- ixgbe: Correct Adaptive Interrupt Moderation so that it will change values\n  (Alexander Duyck)\n- ixgbe: Address issues with Tx WHTRESH value not being set correctly\n  (Alexander Duyck)\n- ixgbe: Reorder adapter contents for better cache utilization (Joe Jin)\n- ixgbe: Do no clear Tx status bits since eop_desc provides enough info\n  (Alexander Duyck)\n- ixgbe: remove tie between NAPI work limits and interrupt moderation (Jeff\n  Kirsher)\n- ixgbe: dcb: check setup_tc return codes (John Fastabend)\n- ixgbe: Fix comments that are out of date or formatted incorrectly (Alexander\n  Duyck)\n- ixgbe: fix spelling errors (Don Skidmore)\n- ixgbe: Minor formatting and comment corrections for ixgbe_xmit_frame_ring\n  (Alexander Duyck)\n- ixgbe: Combine post-DMA processing of sk_buff fields into single function\n  (Alexander Duyck)\n- ixgbe: Drop the _ADV of descriptor macros since all ixgbe descriptors are ADV\n  (Alexander Duyck)\n- ixgbe: Add function for testing status bits in Rx descriptor (Alexander\n  Duyck)\n- ixgbe: Let the Rx buffer allocation clear status bits instead of cleanup (Joe\n  Jin)\n- ixgbe: Address fact that RSC was not setting GSO size for incoming frames\n  (Alexander Duyck)\n- ixgbe: Minor refactor of RSC (Alexander Duyck)\n- ixgbe: ethtool: stats user buffer overrun (John Fastabend)\n- ixgbe: dcb: up2tc mapping lost on disable/enable CEE DCB state (John\n  Fastabend)\n- ixgbe: do not update real num queues when netdev is going away (Yi Zou)\n- ixgbe: Fix broken dependency on MAX_SKB_FRAGS being related to page size\n  (Alexander Duyck)\n- ixgbe: Fix case of Tx Hang in PF with 32 VFs (Greg Rose)\n- ixgbe: fix vf lookup (Greg Rose)\n- ixgbe: Fix typo in ixgbe_common.h (Masanari Iida)\n- ixgbe: make ethtool strings table const (Stephen Hemminger)\n- ixgbe: Add warning when no space left for more MAC filters (Joe Jin)\n- ixgbe: update copyright to 2012 (Don Skidmore)\n- ixgbe: Add module parameter to allow untested and unsafe SFP+ modules (Peter\n  P Waskiewicz Jr)\n- ixgbe: Fix register defines to correctly handle complex expressions\n  (Alexander Duyck)\n- ixgbe: add support for new 82599 device. (Don Skidmore)\n- ixgbe: add support for new 82599 device id (Emil Tantilov)\n- ixgbe: add write flush in ixgbe_clock_out_i2c_byte() (Emil Tantilov)\n- ixgbe: fix typos (Stephen Hemminger)\n- ixgbe: fix incorrect PHY register reads (Emil Tantilov)\n- ixgbe: Remove function prototype for non-existent function (Greg Rose)\n- ixgbe: DCB: IEEE transitions may fail to reprogram hardware. (John Fastabend)\n- ixgbe: DCBnl set_all, order of operations fix (Joe Jin)\n- ixgbe: fix LED blink logic to check for link (Emil Tantilov)\n- ixgbe: Fix compile for kernel without CONFIG_PCI_IOV defined (Rose, Gregory\n  V)\n- ixgbe: DCB, return max for IEEE traffic classes (John Fastabend)\n- ixgbe: fix reading of the buffer returned by the firmware (Emil Tantilov)\n- ixgbe: Fix compiler warnings (Greg Rose)\n- ixgbe: fix smatch splat due to missing NULL check (John Fastabend)\n- ixgbe: fix disabling of Tx laser at probe (Emil Tantilov)\n- ixgbe: Fix link issues caused by a reset while interface is down (Emil\n  Tantilov)\n- ixgbe: change the eeprom version reported by ethtool (Emil Tantilov)\n- ixgbe: allow eeprom writes via ethtool (Emil Tantilov)\n- ixgbe: fix endianess when writing driver version to firmware (Emil Tantilov)\n- ixgbe: fix skb truesize underestimation (Eric Dumazet)\n- ixgbe: Correct check for change in FCoE priority (Mark Rustad)\n- ixgbe: Add FCoE DDP allocation failure counters to ethtool stats. (Amir\n  Hanania)\n- ixgbe: Add protection from VF invalid target DMA (Greg Rose)\n- ixgbe: bump version number (Don Skidmore)\n- ixgbe: X540 devices RX PFC frames pause traffic even if disabled (John\n  Fastabend)\n- ixgbe: DCB X540 devices support max traffic class of 4 (John Fastabend)\n- ixgbe: fixup hard dependencies on supporting 8 traffic classes (Joe Jin)\n- ixgbe: Fix PFC mask generation (Mark Rustad)\n- ixgbe: remove instances of ixgbe_phy_aq for 82598 and 82599 (Emil Tantilov)\n- ixgbe: get pauseparam autoneg (Mika Lansirinne)\n- ixgbe: do not disable flow control in ixgbe_check_mac_link (Emil Tantilov)\n- ixgbe: send MFLCN to ethtool (Emil Tantilov)\n- ixgbe: add support for new 82599 device (Emil Tantilov)\n- ixgbe: fix driver version initialization in firmware (Jacob Keller)\n- ixgbe: remove return code for functions that always return 0 (Emil Tantilov)\n- ixgbe: clear the data field in ixgbe_read_i2c_byte_generic (Emil Tantilov)\n- ixgbe: prevent link checks while resetting (Emil Tantilov)\n- ixgbe: add ECC warning for legacy interrupts (Don Skidmore)\n- ixgbe: cleanup ixgbe_setup_gpie() for X540 (Don Skidmore)\n- ixgbe add thermal sensor support for x540 hardware (Jacob Keller)\n- ixgbe: update {P}FC thresholds to account for X540 and loopback (John\n  Fastabend)\n- ixgbe: disable LLI for FCoE (Vasu Dev)\n- ixgbe: Cleanup q_vector interrupt throttle rate logic (Emil Tantilov)\n- ixgbe: remove global reset to the MAC (Emil Tantilov)\n- ixgbe: add WOL support for X540 (Emil Tantilov)\n- ixgbe: avoid HW lockup when adapter is reset with Tx work pending (Emil\n  Tantilov)\n- ixgbe: dcb, set priority to traffic class mappings (John Fastabend)\n- ixgbe: cleanup X540 interrupt enablement (Don Skidmore)\n- ixgbe: DCB, do not call set_state() from IEEE mode (Joe Jin)\n- ixgbe: Reconfigure SR-IOV Init (Greg Rose)\n- ixgbe: remove duplicate netif_tx_start_all_queues (Emil Tantilov)\n- ixgbe: fix FCRTL/H register dump for X540 (Emil Tantilov)\n- ixgbe: cleanup some register reads (Emil Tantilov)\n- ixgbe: Make better use of memory allocations in one-buffer mode w/ RSC\n  (Alexander Duyck)\n- ixgbe: drop adapter from ixgbe_fso call documentation (Alexander Duyck)\n- ixgbe: Add SFP support for missed 82598 PHY (Alexander Duyck)\n- ixgbe: Add missing code for enabling overheat sensor interrupt (Alexander\n  Duyck)\n- ixgbe: make ixgbe_up and ixgbe_up_complete void functions (Alexander Duyck)\n- v2 ixgbe: Update packet buffer reservation to correct fdir headroom size\n  (Alexander Duyck)\n- ixgbe: remove redundant configuration of tx_sample_rate (Alexander Duyck)\n- ixgbe: Correctly name and handle MSI-X other interrupt (Alexander Duyck)\n- ixgbe: cleanup configuration of EITRSEL and VF reset path (Alexander Duyck)\n- ixgbe: cleanup reset paths (Alexander Duyck)\n- ixgbe: Update TXDCTL configuration to correctly handle WTHRESH (Alexander\n  Duyck)\n- ixgbe: combine PCI_VDEVICE and board declaration to same line (Alexander\n  Duyck)\n- ixgbe: Drop unnecessary adapter-\u003ehw dereference in loopback test setup\n  (Alexander Duyck)\n- ixgbe: commonize ixgbe_map_rings_to_vectors to work for all interrupt types\n  (Alexander Duyck)\n- ixgbe: Use ring-\u003edev instead of adapter-\u003epdev-\u003edev when updating DCA\n  (Alexander Duyck)\n- ixgbe: cleanup allocation and freeing of IRQ affinity hint (Alexander Duyck)\n- v2 ixgbe: consolidate all MSI-X ring interrupts and poll routines into one\n  (Alexander Duyck)\n- ixgbe: Change default Tx work limit size to 256 buffers (Alexander Duyck)\n- ixgbe: clear RNBC only for 82598 (Emil Tantilov)\n- ixgbe: add check for supported modes (Emil Tantilov)\n- ixgbe: fix ixgbe_fc_autoneg_fiber bug (Don Skidmore)\n- ixgbe: cleanup feature flags in ixgbe_probe (Don Skidmore)\n- ixgbe: PFC not cleared on X540 devices (John Fastabend)\n- ixgbe: consolidate, setup for multiple traffic classes (John Fastabend)\n- ixgbe: remove unneeded fdir pb alloc case (John Fastabend)\n- ixgbe: fixup remaining call sites for arbitrary TCs (John Fastabend)\n- ixgbe: Always tag VLAN tagged packets (Alexander Duyck)\n- ixgbe: Add support for setting CC bit when SR-IOV is enabled (Alexander\n  Duyck)\n- ixgbe: convert rings from q_vector bit indexed array to linked list\n  (Alexander Duyck)\n- ixgbe: Simplify transmit cleanup path (Alexander Duyck)\n- ixgbe: Cleanup FCOE and VLAN handling in xmit_frame_ring (Alexander Duyck)\n- ixgbe: replace reference to CONFIG_FCOE with IXGBE_FCOE (Alexander Duyck)\n- ixgbe - DDP last user buffer - error to warn (Amir Hanania)\n- ixgbe: remove unused fcoe.tc field and fcoe_setapp() (John Fastabend)\n- ixgbe: complete FCoE initialization from setapp() routine (John Fastabend)\n- ixgbe: DCB, remove unneeded ixgbe_dcb_txq_to_tc() routine (John Fastabend)\n- ixgb: Remove unnecessary defines, use pr_debug (Joe Perches)\n- ixgb: finish conversion to ndo_fix_features (Michal Miroslaw)\n- ixgb: eliminate checkstack warnings (Jesse Brandeburg)\n- ixgb: convert to ndo_fix_features (Michal Miroslaw)\n- igbvf: fix the bug when initializing the igbvf (Samuel Liao)\n- rename dev_hw_addr_random and remove redundant second (Joe Jin)\n(Jeff Kirsher)\n- igbvf: Use ETH_ALEN (Joe Perches)\n- igbvf: reset netdevice addr_assign_type if changed (Danny Kukawka)\n- igbvf: refactor Interrupt Throttle Rate code (Mitch A Williams)\n- igbvf: change copyright date (Mitch A Williams)\n- igbvf: Remove unnecessary irq disable/enable (Joe Jin)\n- igbvf: remove unneeded cast (Stephen Hemminger)\n(Jeff Kirsher)\n- igbvf: Bump version number (Williams, Mitch A)\n- igbvf: Update module identification strings (Williams, Mitch A)\n- igbvf: fix truesize underestimation (Eric Dumazet)\n- igbvf: Fix trunk vlan (Greg Rose)\n- igbvf: convert to ndo_fix_features (Michal Miroslaw)\n- igb: fix rtnl race in PM resume path (Benjamin Poirier)\n- igb: fix warning about unused function (Emil Tantilov)\n- igb: fix vf lookup (Greg Rose)\n- igb: Update Copyright on all Intel copyrighted files. (Carolyn Wyborny)\n- igb: make local functions static (Stephen Hemminger)\n- igb: reset PHY after recovering from PHY power down (Koki Sanagi)\n- igb: add basic runtime PM support (Yan, Zheng)\n- igb: Add flow control advertising to ethtool setting. (Carolyn Wyborny)\n- igb: Update DMA Coalescing threshold calculation. (Matthew Vick)\n- igb: Convert bare printk to pr_notice (Joe Perches)\n(Jeff Kirsher)\n- igb: Fix for I347AT4 PHY cable length unit detection (Kantecki, Tomasz)\n- igb: VFTA Table Fix for i350 devices (Carolyn Wyborny)\n- igb: Move DMA Coalescing init code to separate function. (Carolyn Wyborny)\n- igb: Fix for Alt MAC Address feature on 82580 and later devices (Carolyn\n  Wyborny)\n- igb: fix a compile warning (RongQing Li)\n- igb: Check if subordinate VFs are assigned to virtual machines (Greg Rose)\n- pci: Add flag indicating device has been assigned by KVM (Greg Rose)\n- igb: enable l4 timestamping for v2 event packets (Jacob Keller)\n- igb: fix skb truesize underestimation (Eric Dumazet)\n- igb: Version bump. (Carolyn Wyborny)\n- igb: Loopback functionality supports for i350 devices (Akeem G. Abodunrin)\n- igb: fix static function warnings reported by sparse (Emil Tantilov)\n- igb: Add workaround for byte swapped VLAN on i350 local traffic (Alexander\n  Duyck)\n- igb: Drop unnecessary write of E1000_IMS from igb_msix_other (Alexander\n  Duyck)\n- igb: Fix features that are currently 82580 only and should also be i350\n  (Alexander Duyck)\n- igb: Make certain one vector is always assigned in igb_request_irq (Alexander\n  Duyck)\n- igb: avoid unnecessarily creating a local copy of the q_vector (Alexander\n  Duyck)\n- igb: add support for NETIF_F_RXHASH (Alexander Duyck)\n- igb: move TX hang check flag into ring-\u003eflags (Alexander Duyck)\n- igb: fix recent VLAN changes that would leave VLANs disabled after reset\n  (Alexander Duyck)\n- igb: leave staterr in place and instead us a helper function to check bits\n  (Alexander Duyck)\n- igb: retire the RX_CSUM flag and use the netdev flag instead (Alexander\n  Duyck)\n- igb: cleanup IVAR configuration (Alexander Duyck)\n- igb: Move ITR related data into work container within the q_vector (Alexander\n  Duyck)\n- igb: Consolidate all of the ring feature flags into a single value (Alexander\n  Duyck)\n- igb: avoid unnecessary conversions from u16 to int (Alexander Duyck)\n- igb: Use node specific allocations for the q_vectors and rings (Alexander\n  Duyck)\n- igb: push data into first igb_tx_buffer sooner to reduce stack usage\n  (Alexander Duyck)\n- igb: consolidate creation of Tx buffer info and data descriptor (Alexander\n  Duyck)\n- igb: Combine all flag info fields into a single tx_flags structure (Alexander\n  Duyck)\n- igb: Cleanup protocol handling in transmit path (Alexander Duyck)\n- igb: Create separate functions for generating cmd_type and olinfo (Alexander\n  Duyck)\n- igb: Make first and tx_buffer_info-\u003enext_to_watch into pointers (Alexander\n  Duyck)\n- igb: Consolidate creation of Tx context descriptors into a single function\n  (Alexander Duyck)\n- intel: convert to SKB paged frag API. (Ian Campbell)\n- ixgbe: Refactor transmit map and cleanup routines (Alexander Duyck)\n- igb: split buffer_info into tx_buffer_info and rx_buffer_info (Alexander\n  Duyck)\n- igb: Make Tx budget for NAPI user adjustable (Alexander Duyck)\n- igb: Alternate MAC Address Updates for Func2\u00263 (Akeem G. Abodunrin)\n- igb: Alternate MAC Address EEPROM Updates (Akeem G. Abodunrin)\n- igb: Code to prevent overwriting SFP I2C (Akeem G. Abodunrin)\n- igb: Remove multi_tx_table and simplify igb_xmit_frame (Alexander Duyck)\n- igb: drop the 'adv' off function names relating to descriptors (Joe Jin)\n- igb: Replace E1000_XX_DESC_ADV with IGB_XX_DESC (Alexander Duyck)\n- igb: Refactor clean_rx_irq to reduce overhead and improve performance\n  (Alexander Duyck)\n- igb: update ring and adapter structure to improve performance (Alexander\n  Duyck)\n- igb: streamline Rx buffer allocation and cleanup (Alexander Duyck)\n- igb: drop support for single buffer mode (Alexander Duyck)\n- igb: Update max_frame_size to account for an optional VLAN tag if present\n  (Alexander Duyck)\n- igb: Update RXDCTL/TXDCTL configurations (Alexander Duyck)\n- igb: remove duplicated #include (Huang Weiyi)\n- igb: Fix for DH89xxCC near end loopback test (Robert Healy)\n- igb: do vlan cleanup (Jiri Pirko)\n- igb: Add support of SerDes Forced mode for certain hardware (Carolyn Wyborny)\n- igb: Update copyright on all igb driver files. (Carolyn Wyborny)\n- net: igb: Use is_multicast_ether_addr helper (Tobias Klauser)\n- igb: remove unnecessary reads of PCI_CAP_ID_EXP (Jon Mason)\n- igb: convert to ndo_fix_features (Michal Miroslaw)\n- igb: Change version to remove number after -k in kernel versions. (Carolyn\n  Wyborny)\n- e1000e: Fix default interrupt throttle rate not set in NIC HW (Jeff Kirsher)\n- e1000e: MSI interrupt test failed, using legacy interrupt (Prasanna S\n  Panchamukhi)\n- e1000e: issues in Sx on 82577/8/9 (Joe Jin)\n- e1000e: Guarantee descriptor writeback flush success. (Matthew Vick)\n- e1000e: prevent oops when adapter is being closed and reset simultaneously\n  (Bruce Allan)\n- e1000e: use msleep instead of mdelay (Joe Jin)\n- e1000e: cleanup goto statements to exit points without common work (Bruce\n  Allan)\n- e1000e: potentially incorrect return for e1000e_setup_fiber_serdes_link\n  (Bruce Allan)\n- e1000e: potentially incorrect return for e1000_init_hw_ich8lan (Bruce Allan)\n- e1000e: cleanup: minor whitespace addition (insert blank line separator)\n  (Bruce Allan)\n- e1000e: cleanup: remove unnecessary variable initializations (Bruce Allan)\n- e1000e: cleanup: remove unnecessary test and return (Bruce Allan)\n- e1000e: cleanup: remove unnecessary variable ret_val (Bruce Allan)\n- e1000e: cleanup: remove unreachable statement (Bruce Allan)\n- e1000e: potentially incorrect return for e1000_set_d3_lplu_state_ich8lan\n  (Bruce Allan)\n- e1000e: cleanup: always return 0 (Bruce Allan)\n- e1000e: cleanup: remove unnecessary assignments just before returning (Bruce\n  Allan)\n- e1000e: potential incorrect return for e1000_setup_copper_link_80003es2lan\n  (Bruce Allan)\n- e1000e: potentially incorrect return for e1000_cfg_kmrn_10_100_80003es2lan\n  (Bruce Allan)\n- e1000e: cleanup: rename goto labels to be more meaningful (Bruce Allan)\n- e1000e: cleanup: use goto for common work needed by multiple exit points\n  (Bruce Allan)\n- e1000e: replace '1' with 'true' for boolean get_link_status (Bruce Allan)\n- e1000e: pass pointer to hw struct for e1000_init_mac_params_XXX() (Bruce\n  Allan)\n- e1000e: use true/false for bool autoneg_false (Bruce Allan)\n- e1000e: remove unnecessary parentheses (Bruce Allan)\n- e1000e: remove unnecessary returns from void functions (Bruce Allan)\n- e1000e: remove test that is always false (Bruce Allan)\n- e1000e: WoL fails on device ID 0x1501 (Joe Jin)\n- e1000e: WoL can fail on 82578DM (Bruce Allan)\n- e1000e: remove redundant reverse dependency on CRC32 (Bruce Allan)\n- e1000e: minor whitespace and indentation cleanup (Bruce Allan)\n- e1000e: fix sparse warnings with -D__CHECK_ENDIAN__ (Bruce Allan)\n- e1000e: fix checkpatch warning from MINMAX test (Bruce Allan)\n- e1000e: cleanup - use braces in both branches of a conditional statement\n  (Bruce Allan)\n- e1000e: cleanup e1000_set_phys_id (Bruce Allan)\n- e1000e: cleanup e1000_init_mac_params_82571() (Bruce Allan)\n- e1000e: cleanup e1000_init_mac_params_80003es2lan() (Bruce Allan)\n- e1000e: rename es2lan.c to 80003es2lan.c (Joe Jin)\n- e1000e: cleanup - check return values consistently (Bruce Allan)\n- e1000e: add missing initializers reported when compiling with W=1 (Bruce\n  Allan)\n- e1000e: update copyright year (Bruce Allan)\n- e1000e: split lib.c into three more-appropriate files (Bruce Allan)\n- e1000e: call er16flash() instead of __er16flash() (Bruce Allan)\n- e1000e: increase version number (Joe Jin)\n- e1000e: convert final strncpy() to strlcpy() (Bruce Allan)\n- e1000e: concatenate long debug strings which span multiple lines (Bruce\n  Allan)\n- e1000e: conditionally restart autoneg on 82577/8/9 when setting LPLU state\n  (Bruce Allan)\n- e1000e: increase Rx PBA to prevent dropping received packets on 82566/82567\n  (Bruce Allan)\n- e1000e: ICHx/PCHx LOMs should use LPLU setting in NVM when going to Sx (Joe\n  Jin)\n- e1000e: update workaround for 82579 intermittently disabled during S0-\u003eSx\n  (Bruce Allan)\n- e1000e: disable Early Receive DMA on ICH LOMs (Bruce Allan)\n- e1000e: Need to include vmalloc.h (David S. Miller)\n- e1000e: 82574/82583 Tx hang workaround (Bruce Allan)\n- e1000e: use hardware default values for Transmit Control register (Bruce\n  Allan)\n- e1000e: use default settings for Tx Inter Packet Gap timer (Bruce Allan)\n- e1000e: 82579: workaround for link drop issue (Bruce Allan)\n- e1000e: always set transmit descriptor control registers the same (Bruce\n  Allan)\n- e1000e: re-factor ethtool get/set ring parameter (Bruce Allan)\n- e1000e: pass pointer to ring struct instead of adapter struct (Joe Jin)\n- e1000e: add Receive Packet Steering (RPS) support (Joe Jin)\n- e1000e: convert to netdev features/hw_features API (Joe Jin)\n- e1000e: cleanup Rx checksum offload code (Bruce Allan)\n- e1000e: convert head, tail and itr_register offsets to __iomem pointers\n  (Bruce Allan)\n- e1000e: re-enable alternate MAC address for all devices which support it\n  (Bruce Allan)\n- e1000e: default IntMode based on kernel config \u0026 available hardware support\n  (Bruce Allan)\n- e1000e: convert to real ndo_set_rx_mode (Joe Jin)\n- net: introduce IFF_UNICAST_FLT private flag (Joe Jin)\n- e1000e: remove use of ndo_set_multicast_list in drivers (Joe Jin)\n(Jeff Kirsher)\n- e1000e: demote a debugging WARN to a debug log message (Bruce Allan)\n- e1000e: fix skb truesize underestimation (Eric Dumazet)\n- e1000e: locking bug introduced by commit 67fd4fcb (Bruce Allan)\n- e1000e: bad short packets received when jumbos enabled on 82579 (Bruce Allan)\n- e1000e: convert driver to use extended descriptors (Joe Jin)\n- drivers/net: Add module.h to drivers who were implicitly using it (Joe Jin)\n- e1000e: hitting BUG_ON() from napi_enable (Bruce Allan)\n- e1000: Silence sparse warnings by correcting type (Andrei Emeltchenko)\n- v2 e1000: Neaten e1000_dump function (Tushar Dave)\n- e1000: Neaten e1000_config_dsp_after_link_change (Joe Perches)\n- e1000: fix vlan processing regression (Joe Jin)\n- e1000: Remove unnecessary k.alloc/v.alloc OOM messages (Joe Jin)\n- e1000: add dropped DMA receive enable back in for WoL (Dean Nelson)\n- e1000: Adding e1000_dump function (Tushar Dave)\n- e1000: dont enable dma receives until after dma address has been setup (Dean\n  Nelson)\n- e1000: save skb counts in TX to avoid cache misses (Dean Nelson)\n- e1000: cleanup CE4100 MDIO registers access (Florian Fainelli)\n- e1000: unmap ce4100_gbe_mdio_base_virt in e1000_remove (Florian Fainelli)\n- e1000: fix lockdep splat in shutdown handler (Jesse Brandeburg)\n- e1000e/ixgb: fix assignment of 0/1 to bool variables. (Joe Jin)\n- intel: Convert \u003cFOO\u003e_LENGTH_OF_ADDRESS to ETH_ALEN (Joe Perches)\n- e1000: fix skb truesize underestimation (Eric Dumazet)\n- e1000: convert to private mutex from rtnl (Jesse Brandeburg)\n- e1000: convert mdelay to msleep (Jesse Brandeburg)\n- e1000: convert hardware management from timers to threads (Jesse Brandeburg)\n- e100: Remove alloc_etherdev error messages (Joe Jin)\n- net: Remove Intel NICs unnecessary driver assignments of ethtool_ringparam\n  fields to zero (Joe Jin)\n- e100: Show short v/s long rx length errors in ethtool stats. (Ben Greear)\n- e100: Fix rx-over-length statistics. (Ben Greear)\n- e100: make sure vlan support isnt advertised on old adapters (Jesse\n  Brandeburg)\n- 8139cp: properly config rx mode after resuming (Jason Wang)\n- bnx2x: add bnx2x firmware 7.2.16 (Joe Jin)\n- bnx2fc: Remove bh disable in softirq context (Neil Horman)\n- bnx2fc: HSI dependent changes for 7.2.xx FW (Bhanu Prakash Gollapudi)\n- bnx2fc: Bumped version to 1.0.10 (Bhanu Prakash Gollapudi)\n- bnx2fc: NPIV ports go offline when interface is brought down \u0026 up (Bhanu\n  Prakash Gollapudi)\n- bnx2fc: Handle LOGO flooding from the target (Bhanu Prakash Gollapudi)\n- bnx2fc: fix panic in bnx2fc_post_io_req (Bhanu Prakash Gollapudi)\n- bnx2fc: Bumped version to 1.0.9 (Bhanu Prakash Gollapudi)\n- bnx2fc: Handle SRR LS_ACC drop scenario (Bhanu Prakash Gollapudi)\n- bnx2fc: Handle ABTS timeout during ulp timeout (Bhanu Prakash Gollapudi)\n- bnx2fc: Bumped version to 1.0.8 (Bhanu Prakash Gollapudi)\n- bnx2fc: Return error statistics of remote peer (Bhanu Prakash Gollapudi)\n- bnx2fc: call ctlr_link_up only when the interface is enabled (Bhanu Prakash\n  Gollapudi)\n- bnx2fc: Bumped version to 1.0.7 (Bhanu Prakash Gollapudi)\n- bnx2fc: Handle bnx2fc_map_sg failure (Bhanu Prakash Gollapudi)\n- bnx2fc: Replace scsi_dma_map() with dma_map_sg(). (Bhanu Prakash Gollapudi)\n- bnx2fc: Bumped version to 1.0.6 (Bhanu Prakash Gollapudi)\n- bnx2fc: Fix FW assert during RSCN stress tests (Bhanu Prakash Gollapudi)\n- bnx2fc: Fix panic caused because of incorrect errror handling in create().\n  (Bhanu Prakash Gollapudi)\n- bnx2fc: Avoid calling bnx2fc_if_destroy with unnecessary locks (Bhanu Prakash\n  Gollapudi)\n- bnx2fc: Validate vlan id in NETDEV_UNREGISTER handler (Nithin Nayak Sujir)\n- bnx2fc: No abort issued for REC when it times out (Bhanu Prakash Gollapudi)\n- bnx2fc: Send solicitation only after vlan discovery is complete (Bhanu\n  Prakash Gollapudi)\n- bnx2fc: Reset max receive frame size during link up (Bhanu Prakash Gollapudi)\n- bnx2fc: Need not schedule destroy_work from __bnx2fc_destroy (Bhanu Prakash\n  Gollapudi)\n- bnx2fc: Bump version to 1.0.5 (Bhanu Prakash Gollapudi)\n- bnx2fc: Prevent creating of NPIV port with duplicate WWN (Bhanu Prakash\n  Gollapudi)\n- bnx2fc: Obtain WWNN/WWPN from the shared memory (Bhanu Prakash Gollapudi)\n- [SCSI] fcoe,libfcoe: Move common code for fcoe_get_lesb to fcoe_transport\n  (Bhanu Prakash Gollapudi)\n- [SCSI] fcoe: Move common functions to fcoe_transport library (Bhanu Prakash\n  Gollapudi)\n- [SCSI] bnx2fc: Drop incoming ABTS (Bhanu Prakash Gollapudi)\n- [SCSI] bnx2fc: code cleanup in bnx2fc_offload_session (Bhanu Prakash\n  Gollapudi)\n- [SCSI] bnx2fc: Fix NULL pointer deref during arm_cq. (Bhanu Prakash\n  Gollapudi)\n- [SCSI] bnx2fc: IO errors when receiving unsolicited LOGO (Bhanu Prakash\n  Gollapudi)\n- [SCSI] bnx2fc: Do not reuse the fcoe connection id immediately (Bhanu Prakash\n  Gollapudi)\n- [SCSI] bnx2fc: Clear DESTROY_CMPL flag after firmware destroy (Bhanu Prakash\n  Gollapudi)\n- [SCSI] bnx2fc: Handle NETDEV_UNREGISTER for vlan devices (Bhanu Prakash\n  Gollapudi)\n- [SCSI] bnx2fc: Reorganize cleanup code between interface_cleanup and\n  if_destory (Bhanu Prakash Gollapudi)\n- [SCSI] bnx2fc: Change function names of\n  bnx2fc_netdev_setup/bnx2fc_netdev_cleanup (Bhanu Prakash Gollapudi)\n- [SCSI] bnx2fc: Do not attempt destroying NPIV port twice (Bhanu Prakash\n  Gollapudi)\n- [SCSI] bnx2fc: Remove erroneous kref_get on IO request (Bhanu Prakash\n  Gollapudi)\n- [SCSI] bnx2fc: Enable bsg_request support for bnx2fc (Bhanu Prakash\n  Gollapudi)\n- [SCSI] bnx2fc: Bug fixes in percpu_thread_create/destroy (Bhanu Prakash\n  Gollapudi)\n- [SCSI] bnx2fc: Reset the max receive frame size (Bhanu Prakash Gollapudi)\n- [SCSI] bnx2i: Fixed the override of the error_mask module param (Eddie Wai)\n- [SCSI] bnx2i: use kthread_create_on_node() (Eric Dumazet)\n- [SCSI] bnx2i: Fixed kernel panic caused by unprotected task-\u003esc-\u003erequest\n  deref (Eddie Wai)\n- [SCSI] bnx2i: Fixed the endian on TTT for NOP out transmission (Eddie Wai)\n- [SCSI] bnx2i: Fixed kernel panic due to illegal usage of sc-\u003erequest-\u003ecpu\n  (Eddie Wai)\n- cnic: Fix select dependencies in bnx2fc/bnx2i Kconfig. (David S. Miller)\n- bnx2x: Fix 578xx link LED (Yaniv Rosner)\n- bnx2x: Enable FEC for 57810-KR (Yaniv Rosner)\n- bnx2x: disable dcb on 578xx since not supported yet (Dmitry Kravkov)\n- bnx2x: decrease print level to debug (Dmitry Kravkov)\n- bnx2x: fix BRB thresholds for dropless_fc mode (Dmitry Kravkov)\n- bnx2x: fix cl_id allocation for non-eth clients for NPAR mode (Dmitry\n  Kravkov)\n- bnx2x: Fix for a host coalescing bug which impared latency. (Ariel Elior)\n- bnx2x: fix select_queue when FCoE is disabled (Vladislav Zolotarov)\n- bnx2x: fix WOL by enablement PME in config space (Dmitry Kravkov)\n- bnx2x: Fix XMAC loopback test (Yaniv Rosner)\n- bnx2x: init FCOE FP only once (Vladislav Zolotarov)\n- bnx2x: Remove fiber remote fault detection (Yaniv Rosner)\n- cnic: update for FW 7.2.xx (Michael Chan)\n- bnx2x: correction to firmware interface (Yuval Mintz)\n- bnx2x: fix vector traveling while looking for an empty entry (Dmitry Kravkov)\n- bnx2x: mark functions as loaded on shared memory (Yuval Mintz)\n- bnx2x: fix memory leak in bnx2x_init_firmware() (Michal Schmidt)\n- bnx2x: fix a crash on corrupt firmware file (Michal Schmidt)\n- bnx2x: make bnx2x_close() static again (Michal Schmidt)\n- bnx2x: removed code re-checking memory base after device open (Mintz Yuval)\n- bnx2x: allow BCM84833 phy to advertise 100Base-T speeds (Mintz Yuval)\n- bnx2x: notify cnic of address of info-to-the-mcp (Mintz Yuval)\n- bnx2x: allocate smaller Rx rings for 1G functions (Mintz Yuval)\n- bnx2x: allocate memory dynamically in ethtool self-test. (Merav Sicron)\n- bnx2x: force 10G on 84833 phy should be autoneg with only 10G advertised\n  (Yaniv Rosner)\n- bnx2x: added autoneg-restart after link advertisement changes (Yaniv Rosner)\n- bnx2x: ethtool publishes link partners speed and FC (Mintz Yuval)\n- bnx2x: half duplex support added for several boards (Yaniv Rosner)\n- bnx2x: remove the 'poll' module option (Michal Schmidt)\n- bnx2x: fix bnx2x_storm_stats_update() on big endian (Eric Dumazet)\n- bnx2x: Fix mem leak in bnx2x_tpa_stop() if build_skb() fails. (Jesper Juhl)\n- bnx2x: Update version to 1.72.0 and copyrights (Ariel Elior)\n- bnx2x: Recoverable and unrecoverable error statistics (Ariel Elior)\n- bnx2x: Recovery flow bug fixes (Ariel Elior)\n- bnx2x: init fw_seq after undi_unload is done (Dmitry Kravkov)\n- bnx2x: Track active PFs with bitmap (Ariel Elior)\n- bnx2x: Lock PF-common resources (Ariel Elior)\n- bnx2x: dont reset device while reading its configuration. (Dmitry Kravkov)\n- bnx2x: Loaded Firmware Version Validation (Ariel Elior)\n- bnx2x: Function Level Reset Final Cleanup (Ariel Elior)\n- bnx2x: Obtain Bus Device Function from register (Ariel Elior)\n- bnx2x: Removing indirect register access (Ariel Elior)\n- bnx2x: Support Queue Per Cos in 5771xx devices (Ariel Elior)\n- bnx2x: Remove 100Mb force speed for BCM84833 (Yaniv Rosner)\n- bnx2x: Fix ethtool advertisement (Yaniv Rosner)\n- bnx2x: unlock before returning an error (Dan Carpenter)\n- bnx2x: fix compilation error with SOE in fw_dump (Yuval Mintz)\n- bnx2x: handle CHIP_REVISION during init_one (Ariel Elior)\n- bnx2x: dont access removed registers on 57712 and above (Dmitry Kravkov)\n- bnx2x: properly clean indirect addresses (Dmitry Kravkov)\n- bnx2x: allow user to change ring size in ISCSI SD mode (Dmitry Kravkov)\n- bnx2x: fix Big-Endianess in ethtool -t (Dmitry Kravkov)\n- bnx2x: fixed ethtool statistics for MF modes (Yuval Mintz)\n- bnx2x: credit-leakage fixup on vlan_mac_del_all (Yuval Mintz)\n- bnx2x: Disable AN KR work-around for BCM57810 (Yaniv Rosner)\n- bnx2x: Remove AutoGrEEEn for BCM84833 (Yaniv Rosner)\n- bnx2x: Fix PFC setting on BCM57840 (Yaniv Rosner)\n- bnx2x: Fix Super-Isolate mode for BCM84833 (Yaniv Rosner)\n- bnx2x: handle vpd data longer than 128 bytes (Barak Witkowski)\n- bnx2x: properly update skb when mtu \u003e 1500 (Dmitry Kravkov)\n- bnx2x: properly initialize L5 features (Joe Jin)\n- bnx2x: fix typo in fcoe stats collection (Barak Witkowski)\n- bnx2x: Fix compile errors if CONFIG_CNIC is not set (Michael Chan)\n- bnx2x, cnic: support DRV_INFO upon FW request (Barak Witkowski)\n- bnx2x: support classification config query (Ariel Elior)\n- bnx2x: add fcoe statistics (Barak Witkowski)\n- bnx2x: add PFC statistics (Barak Witkowski)\n- bnx2x: Use kcalloc instead of kzalloc to allocate array (Thomas Meyer)\n- bnx2x: handle iSCSI SD mode (Dmitry Kravkov)\n- bnx2x: fix rx ring size report (Vladislav Zolotarov)\n- bnx2x: Change value comparison order (Yaniv Rosner)\n- bnx2x: Cosmetic changes (Yaniv Rosner)\n- bnx2x: Fix self test of BCM57800 (Yaniv Rosner)\n- bnx2x: Add known PHY type check (Yaniv Rosner)\n- bnx2x: Change Warpcore MDIO work around mode (Yaniv Rosner)\n- bnx2x: Fix BCM84833 link and LED behavior (Yaniv Rosner)\n- bnx2x: Warpcore HW reset following fan failure (Yaniv Rosner)\n- bnx2x: ETS changes (Yaniv Rosner)\n- bnx2x: Fix ETS bandwidth (Yaniv Rosner)\n- bnx2x: PFC changes (Yaniv Rosner)\n- bnx2x: Fix 5461x LED (Yaniv Rosner)\n- bnx2x: cache-in compressed fw image (Dmitry Kravkov)\n- bnx2x: add endline at end of message (Dmitry Kravkov)\n- bnx2x: uses build_skb() in receive path (Eric Dumazet)\n- net: introduce build_skb() (Eric Dumazet)\n- net: more accurate skb truesize (Eric Dumazet)\n- bnx2x: update driver version to 1.70.35-0 (Dmitry Kravkov)\n- bnx2x: Remove on-stack napi struct variable (Ariel Elior)\n- bnx2x: prevent race in statistics flow (Dmitry Kravkov)\n- bnx2x: add fan failure event handling (Ariel Elior)\n- bnx2x: remove unused #define (Dmitry Kravkov)\n- bnx2x: simplify definition of RX_SGE_MASK_LEN and use it. (Dmitry Kravkov)\n- bnx2x: propagate DCBX negotiation (Dmitry Kravkov)\n- bnx2x: fix MF for 4-port devices (Dmitry Kravkov)\n- bnx2x: DCBX: use #define instead of magic (Dmitry Kravkov)\n- bnx2x: separate FCoE and iSCSI license initialization. (Joe Jin)\n- bnx2x: remove unused variable (Dmitry Kravkov)\n- bnx2x: use rx_queue index for skb_record_rx_queue() (Dmitry Kravkov)\n- bnx2x: allow FCoE and DCB for 578xx (Joe Jin)\n- bnx2x: update driver version to 1.70.30-0 (Dmitry Kravkov)\n- bnx2x: use FW 7.0.29.0 (Dmitry Kravkov)\n- bnx2x: add bnx2x FW 7.0.29 (Joe Jin)\n- bnx2x: Enable changing speed when port type is PORT_DA (Yaniv Rosner)\n- bnx2x: Fix 54618se LED behavior (Yaniv Rosner)\n- bnx2x: Fix RX/TX problem caused by the MAC layer (Yaniv Rosner)\n- bnx2x: Add link retry to 578xx-KR (Yaniv Rosner)\n- bnx2x: Fix LED blink rate for 578xx (Yaniv Rosner)\n- bnx2x: fix skb truesize underestimation (Eric Dumazet)\n- bnx2x: remove some dead code (Dan Carpenter)\n- bnx2x: Fix build error (Dmitry Kravkov)\n- bnx2x: Add new PHY BCM54616 (Yaniv Rosner)\n- bnx2x: resurrect RX hashing (Joe Jin)\n- bnx2x: convert to SKB paged frag API. (Ian Campbell)\n- net: add APIs for manipulating skb page fragments. (Ian Campbell)\n- bnx2x: Use pr_fmt and message logging cleanups (Joe Jin)\n- bnx2x: Coalesce pr_cont uses and fix DP typos (Joe Perches)\n- bnx2x: Remove local defines for %pM and mac address (Joe Perches)\n- bnx2x: Clear MDIO access warning during first driver load (Yaniv Rosner)\n- bnx2x: Fix BCM578xx MAC test (Yaniv Rosner)\n- bnx2x: Fix BCM54618se invalid link indication (Yaniv Rosner)\n- bnx2x: Fix BCM84833 link (Yaniv Rosner)\n- bnx2x: Fix link issue with DAC over 578xx (Yaniv Rosner)\n- bnx2x: Fix LED behavior (Yaniv Rosner)\n- bnx2x: Fix BCM578xx-B0 MDIO access (Yaniv Rosner)\n- bnx2x: Fix remote fault handling (Yaniv Rosner)\n- bnx2x: Fix chip hanging due to TX pipe stall. (Yaniv Rosner)\n- bnx2x: Fix missing pause on for 578xx (Yaniv Rosner)\n- bnx2x: Prevent restarting Tx during bnx2x_nic_unload (Vladislav Zolotarov)\n- bnx2x: use pci_pcie_cap() (Vladislav Zolotarov)\n- bnx2x: fix bnx2x_stop_on_error flow in bnx2x_sp_rtnl_task (Vladislav\n  Zolotarov)\n- bnx2x: enable internal target-read for 57712 and up only (Shmulik Ravid)\n- bnx2x: count statistic ramrods on EQ to prevent MC assert (Vladislav\n  Zolotarov)\n- bnx2x: fix loopback for non 10G link (Yaniv Rosner)\n- bnx2x: dcb - send all unmapped priorities to same COS as L2 (Dmitry Kravkov)\n- bnx2x: Broken self-test in SF mode on 578xx (Vladislav Zolotarov)\n- bnx2x: Parity errors recovery for 578xx (Vladislav Zolotarov)\n- bnx2x: Read FIP mac from SHMEM in single function mode (Vladislav Zolotarov)\n- bnx2x: Fixed ethtool -d for 578xx (Vladislav Zolotarov)\n- bnx2x: disable FCoE for 578xx devices since not yet supported (Dmitry\n  Kravkov)\n- bnx2x: fix memory barriers (Vladislav Zolotarov)\n- bnx2x: use BNX2X_Q_FLG_TPA_IPV6 for TPA queue configuration (Vladislav\n  Zolotarov)\n- bnx2x: disable loacal BH when scheduling FCOE napi (Vladislav Zolotarov)\n- bnx2x: fix MB index for 4-port devices (Dmitry Kravkov)\n- bnx2x: DCB rework (Dmitry Kravkov)\n- bnx2x: remove unnecessary dma_sync (Vladislav Zolotarov)\n- bnx2x: stop tx before CNIC_STOP (Vladislav Zolotarov)\n- bnx2x: add missing command in error handling flow (Dmitry Kravkov)\n- bnx2x: use correct dma_sync function (Vladislav Zolotarov)\n- bnx2x: Fix compilation when CNIC is not selected in config (Dmitry Kravkov)\n- bnx2x: Multiple concurrent l2 traffic classes (Ariel Elior)\n- bnx2x: Renaming the 'reset_task' to 'sp_rtnl_task' (Ariel Elior)\n- bnx2x: Add dcbnl notification (Shmulik Ravid)\n- dcbnl: Add CEE notification (Shmulik Ravid)\n- dcbnl: Aggregated CEE GET operation (Shmulik Ravid)\n- dcb: use nlmsg_free() instead of kfree() (Dan Carpenter)\n- dcb: Add missing error check in dcb_ieee_set() (John Fastabend)\n- dcb: fix return type on dcb_setapp() (John Fastabend)\n- dcb: Add dcb_ieee_getapp_mask() for drivers to query APP settings (John\n  Fastabend)\n- dcb: Add ieee_dcb_delapp() and dcb op to delete app entry (Joe Jin)\n- dcb: Add ieee_dcb_setapp() to be used for IEEE 802.1Qaz APP data (John\n  Fastabend)\n- net: dcbnl, add multicast group for DCB (John Fastabend)\n- dcb: Add DCBX capabilities bitmask to the get_ieee response (John Fastabend)\n- bnx2x: Fix warning message during 57712/8727 initialization (Yaniv Rosner)\n- bnx2x: Add autogrEEEn support (Yaniv Rosner)\n- bnx2x: Fix BCM84833 initialization (Yaniv Rosner)\n- bnx2x: Fix false link indication at link partner when DAC is used (Yaniv\n  Rosner)\n- bnx2x: Reset PHY due to fan failure for 578xx (Yaniv Rosner)\n- bnx2x: Add CL37 BAM for Warpcore (Yaniv Rosner)\n- bnx2x: Change BCM54616S to BCM54618SE (Yaniv Rosner)\n- bnx2x: PFC fixes (Yaniv Rosner)\n- bnx2x: remove unnecessary read of PCI_CAP_ID_EXP (Jon Mason)\n- cnic: Update VLAN ID during ISCSI_UEVENT_PATH_UPDATE (Eddie Wai)\n- cnic: set error flag when iSCSI connection fails (Jeffrey Huang)\n- cnic: Add FCoE parity error recovery (Michael Chan)\n- cnic: Improve error recovery on bnx2x devices (Michael Chan)\n- cnic: Add timeout for ramrod replies. (Michael Chan)\n- cnic, bnx2fc: Increase maximum FCoE sessions. (Michael Chan)\n- bnx2: Update driver to use new mips firmware. (Joe Jin)\n- bnx2: Add missing memory barrier in bnx2_start_xmit() (Joe Jin)\n- bnx2: Add support for ethtool --show-channels|--set-channels (Michael Chan)\n- bnx2: fix skb truesize underestimation (Eric Dumazet)\n- bnx2: dont request firmware when theres no userspace. (francois romieu)\n- tg3: Avoid panic from reserved statblk field access (Matt Carlson)\n- tg3: Use mii_advertise_flowctrl (Matt Carlson)\n- tg3: Fix advertisement handling (Joe Jin)\n- tg3: Add 57766 ASIC rev support (Matt Carlson)\n- tg3: Make the TX BD DMA limit configurable (Matt Carlson)\n- tg3: Track LP advertising (Matt Carlson)\n- tg3: Integrate flowctrl check into AN adv check (Joe Jin)\n- net: Change mii to ethtool advertisement function names (Matt Carlson)\n- net: Add ethtool to mii advertisment conversion helpers (Joe Jin)\n- tg3: fix ipv6 header length computation (Eric Dumazet)\n- tg3: Break out RSS indir table init and assignment (Matt Carlson)\n- tg3: Update version to 3.122 (Matt Carlson)\n- tg3: Return flowctrl config through ethtool (Matt Carlson)\n- tg3: Save stats across chip resets (Matt Carlson)\n- tg3: Remove ethtool stats member from dev struct (Matt Carlson)\n- tg3: Scale back code that modifies MRRS (Matt Carlson)\n- tg3: Fix TSO CAP for 5704 devs w / ASF enabled (Matt Carlson)\n- tg3: Add MDI-X reporting (Matt Carlson)\n- tg3: Restrict large prod ring cap devices (Matt Carlson)\n- tg3: Adjust BD replenish thresholds (Matt Carlson)\n- tg3: Make 1000Base-X FC resolution look like 1000T (Matt Carlson)\n- tg3: Update version to 3.121 (Matt Carlson)\n- tg3: Eliminate timer race with reset_task (Matt Carlson)\n- tg3: Schedule at most one tg3_reset_task run (Joe Jin)\n- tg3: Obtain PCI function number from device (Matt Carlson)\n- tg3: Fix irq alloc error cleanup path (Matt Carlson)\n- tg3: Fix 4k skb error recovery path (Matt Carlson)\n- tg3: Fix 4k tx bd segmentation code (Joe Jin)\n- tg3: Fix APE mutex init and use (Matt Carlson)\n- tg3: add tx_dropped counter (Joe Jin)\n- tg3: fix tigon3_dma_hwbug_workaround() (Eric Dumazet)\n- tg3: Remove unnecessary driver assignments of ethtool_ringparam fields to\n  zero (Joe Jin)\n- tg3: Code movement (Matt Carlson)\n- tg3: Eliminate tg3_halt_cpu() prototype (Matt Carlson)\n- tg3: Eliminate tg3_write_sig_post_reset() prototype (Matt Carlson)\n- tg3: Eliminate tg3_stop_fw() prototype (Matt Carlson)\n- tg3: Remove tp-\u003erx_offset term when unneeded (Matt Carlson)\n- tg3: Fix missed MSI workaround (Matt Carlson)\n- tg3: Workaround tagged status update bug (Matt Carlson)\n- tg3: Add ability to turn off 1shot MSI (Matt Carlson)\n- tg3: Check all adv bits when checking config (Matt Carlson)\n- tg3: Update version to 3.120 (Matt Carlson)\n- tg3: Add external loopback support to selftest (Matt Carlson)\n- net: add external loopback test in ethtool self test (Amit Kumar Salecha)\n- tg3: Restructure tg3_test_loopback (Matt Carlson)\n- tg3: Pull phy int lpbk setup into separate func (Matt Carlson)\n- tg3: Consilidate MAC loopback code (Matt Carlson)\n- tg3: Remove dead code (Matt Carlson)\n- tg3: Remove 5719 jumbo frames and TSO blocks (Matt Carlson)\n- tg3: Break larger frags into 4k chunks for 5719 (Matt Carlson)\n- tg3: Add tx BD budgeting code (Matt Carlson)\n- tg3: Consolidate code that calls tg3_tx_set_bd() (Matt Carlson)\n- tg3: Add partial fragment unmapping code (Matt Carlson)\n- tg3: Generalize tg3_skb_error_unmap() (Matt Carlson)\n- tg3: Remove short DMA check for 1st fragment (Matt Carlson)\n- tg3: Simplify tx bd assignments (Matt Carlson)\n- tg3: Reintroduce tg3_tx_ring_info (Matt Carlson)\n- tg3: Fix NVRAM selftest failures for 5720 devs (Matt Carlson)\n- tg3: Add more selfboot formats to NVRAM selftest (Matt Carlson)\n- tg3: Return size from tg3_vpd_readblock() (Matt Carlson)\n- tg3: Fix RSS indirection table distribution (Matt Carlson)\n- tg3: Fix link down notify failure when EEE disabled (Matt Carlson)\n- tg3: Fix link flap at 100Mbps with EEE enabled (Matt Carlson)\n- tg3: Match power source to driver state (Matt Carlson)\n- tg3: Add function status reporting (Matt Carlson)\n- tg3: Create critical section around GPIO toggling (Matt Carlson)\n- tg3: Determine PCI function number in one place (Matt Carlson)\n- tg3: Check transitions to D0 power state (Matt Carlson)\n- tg3: Create funcs for power source switching (Matt Carlson)\n- tg3: Move power state transitions to init_one (Matt Carlson)\n- tg3: Detect APE enabled devs earlier (Matt Carlson)\n- tg3: remove unnecessary read of PCI_CAP_ID_EXP (Jon Mason)\n- tg3: Migrate phy preprocessor defs to system defs (Matt Carlson)\n- tg3: Show flowctrl settings through get_settings() (Matt Carlson)\n- tg3: Remove 4G_DMA_BNDRY_BUG flag (Matt Carlson)\n- tg3: Remove 40BIT_DMA_LIMIT_BUG (Matt Carlson)\n- [SCSI] hpsa: use find_first_zero_bit (Akinobu Mita)\n- [SCSI] hpsa: combine hpsa_scsi_detect and hpsa_register_scsi (Stephen M.\n  Cameron)\n- [SCSI] hpsa: removed unneeded structure member max_sg_entries and fix badly\n  named constant MAXSGENTRIES (Stephen M. Cameron)\n- [SCSI] hpsa: fix per device memory leak on driver unload (Stephen M. Cameron)\n- [SCSI] hpsa: do not sleep in atomic context in rmmod path. (Stephen M.\n  Cameron)\n- [SCSI] hpsa: fix flush cache transfer length (Stephen M. Cameron)\n- [SCSI] hpsa: set max sectors instead of taking the default (Stephen M.\n  Cameron)\n- [SCSI] hpsa: detect controller lockup (Stephen M. Cameron)\n- [SCSI] hpsa: remove unused busy_initializing and busy_scanning (Stephen M.\n  Cameron)\n- cciss: fix flush cache transfer length (Stephen M. Cameron)\n- cciss: auto engage SCSI mid layer at driver load time (Stephen M. Cameron)\n- The Windows driver .inf disables ASPM on all cciss devices. Do the same.\n  (Matthew Garrett)\n- cciss: add transport mode attribute to sys (Joe Handzik)\n- cciss: Adds simple mode functionality (Joseph Handzik)\n- [SCSI] hpsa: update device attributes when they change (Scott Teel)\n- [SCSI] hpsa: improve naming on external target device functions (Scott Teel)\n- [SCSI] hpsa: eliminate 8 external target limitation (Scott Teel)\n- [SCSI] hpsa: fix potential array overflow in hpsa_update_scsi_devices (Scott\n  Teel)\n- [SCSI] hpsa: rename HPSA_MAX_SCSI_DEVS_PER_HBA (Scott Teel)\n- [SCSI] hpsa: refactor hpsa_figure_bus_target_lun (Stephen M. Cameron)\n- [SCSI] hpsa: make target and lun match what SCSI REPORT LUNs returns (Stephen\n  M. Cameron)\n- [SCSI] hpsa: Fix problem with MSA2xxx devices (Stephen M. Cameron)\n- [scsi] hpsa: Add IRQF_SHARED back in for the non-MSI(X) interrupt handler\n  (Joe Jin)\n\n[2.6.39-200.13.0.el5uek]\n- drm/i915: fix integer overflow in i915_gem_do_execbuffer() (Xi Wang) [Orabug:\n  14107456] {CVE-2012-2384}\n- drm/i915: fix integer overflow in i915_gem_execbuffer2() (Xi Wang) [Orabug:\n  14107445] {CVE-2012-2383}\n\n[2.6.39-200.12.0.el5uek]\n- Revert 'x86, efi: Pass a minimal map to SetVirtualAddressMap()' (Maxim\n  Uvarov) [Orabug: 14076004]\n- config: turn on CONFIG_HVC_XEN_FRONTEND (Maxim Uvarov) [Orabug: 14064174]\n- xen/hvc: Check HVM_PARAM_CONSOLE_[EVTCHN|PFN] for correctness. (Konrad\n  Rzeszutek Wilk)\n- xen/hvc: Fix error cases around HVM_PARAM_CONSOLE_PFN (Konrad Rzeszutek Wilk)\n- xen/hvc: Collapse error logic. (Konrad Rzeszutek Wilk)\n\n[2.6.39-200.11.0.el5uek]\n- [dm] do not forward ioctls from logical volumes to the underlying device (Joe\n  Jin)  {CVE-2011-4127}\n- [block] fail SCSI passthrough ioctls on partition devices (Joe Jin)\n  {CVE-2011-4127}\n- [block] add and use scsi_blk_cmd_ioctl (Joe Jin) [Orabug: 14056755]\n  {CVE-2011-4127}\n\n[2.6.39-200.10.0.el5uek]\n- net: ipv4: relax AF_INET check in bind() (Eric Dumazet) [Orabug: 14054411]\n- xen-netback: fix the number of skb slots calculation. (Adnan Misherfi)\n- KVM: Ensure all vcpus are consistent with in-kernel irqchip settings (Avi\n  Kivity)  {CVE-2012-1601}\n- kabi update whitelist for OCFS (Maxim Uvarov) [Orabug: 14055758]\n\n[2.6.39-200.9.0.el5uek]\n- [SCSI] scsi_dh_rdac: Fix for unbalanced reference count (Moger, Babu)\n  [Orabug: 14059970]\n- [SCSI] scsi_dh_rdac: Adding couple more vendor product ids (Moger, Babu)\n  [Orabug: 14059970]\n- [SCSI] dh_rdac: Associate HBA and storage in rdac_controller to support\n  partitions in storage (Chandra Seetharaman) [Orabug: 14059970]\n- [SCSI] dh_rdac: Use WWID from C8 page instead of Subsystem id from C4 page to\n  identify storage (Chandra Seetharaman) [Orabug: 14059970]\n- kernel config: turn on sxge and sxgevf drivers (Maxim Uvarov)\n- sxge/sxgevf: add new driver (Maxim Uvarov) [Orabug: 13444150]\n- be2iscsi: adding functionality to change network settings using iscsiadm\n  (root)\n- be2iscsi: Adding bsg interface for be2iscsi (root)\n- be2iscsi: Get Initiator Name for the iSCSI_Host (root)\n- be2iscsi: Return async handle of unknown opcode to free list. (root)\n- be2iscsi: Check ASYNC PDU Handle corresponds to HDR/DATA Handle (root)\n- be2iscsi:Bump the driver Version (root)\n- be2iscsi: Update in Copyright information (root)\n- be2iscsi:Fix the function return values. (root)\n- be2iscsi:Code cleanup, removing the goto statement (root)\n- be2iscsi:Fix double free of MCCQ info memory. (root)\n- be2iscsi:Set num_cpu = 1 if pci_enable_msix fails (root)\n- be2iscsi:Fix typo function name mismatch (root)\n- be2iscsi:Freeing of WRB and SGL Handle in cleanup task (root)\n- be2iscsi: WRB Initialization and Failure code path change (root)\n- be2iscsi: Fix in the Asynchronous Code Path (root)\n- be2iscsi: cleanup a min_t() call (root)\n- qlge: driver update to v1.0.0.30 (Maxim Uvarov) [Orabug: 14045380]\n- netxen: driver update to v4.0.78 (Maxim Uvarov) [Orabug: 14045367]\n- qlcnic: driver update to v5.0.28.1 (Maxim Uvarov) [Orabug: 14055720]\n\n[2.6.39-200.8.0.el5uek]\n- Revert 'xen-blkfront: set pages are FOREIGN_FRAME when sharing them' (Konrad\n  Rzeszutek Wilk)\n\n[2.6.39-200.7.0.el5uek]\n- Revert 'x86/ioapic: Add register level checks to detect bogus io-apic\n  entries' (Maxim Uvarov)\n- qla2xxx: Updated the driver version to 8.04.00.03.39.0-k. (Giridhar Malavali)\n- qla2xxx: Dont attach driver with function. (Giridhar Malavali)\n- qla2xxx: Proper detection of firmware abort error code for ISP82xx. (Giridhar\n  Malavali)\n- qla2xxx: Fix typo in bus-reset handler. (Andrew Vasquez)\n- qla2xxx: Correct link-reset regressions introduced during 83xx porting.\n  (Andrew Vasquez)\n- qla2xxx: Handle device mapping changes due to device logout. (Arun Easi)\n- qla2xxx: Avoid invalid request queue dereference for bad response packets.\n  (Arun Easi)\n- qla2xxx: Stop iteration after first failure in *_id functions. (Arun Easi)\n- qla2xxx: Fix incorrect register access in qla2x00_start_iocbs(). (Arun Easi)\n- qla2xxx: Fix to update proper command completion upon command retries.\n  (Andrew Vasquez)\n- qla2xxx: Hard code the number of loop entries at 128. (Chad Dupuis)\n- Revert 'qla2xxx: Return N-port id to firmware on logout.' (Giridhar Malavali)\n- qla2xxx: Reference proper scsi_qla_host structure for processing non-scsi SRB\n  commands. (Giridhar Malavali)\n- qla2xxx: Fix wrong decrement, null sp access. (Arun Easi)\n- qla2xxx: Further consolidation of SRB related code changes. (Giridhar\n  Malavali)\n- qla2xxx: Complete mailbox command timedout to avoid initialization failures\n  during next reset cycle. (Giridhar Malavali)\n- qla2xxx: Add ha-\u003emax_fibre_devices to keep track of the maximum number of\n  targets. (Chad Dupuis)\n- qla2xxx: Cache swl during fabric discovery. (Andrew Vasquez)\n- qla2xxx: Remove EDC sysfs interface. (Joe Carnuccio)\n- qla2xxx: Perform firmware dump procedure on mailbox command timeout. (Chad\n  Dupuis)\n- qla2xxx: Change the log message when previous dump is available to retrieve\n  for ISP82xx. (Giridhar Malavali)\n- qla2xxx: Log messages to use correct vha. (Arun Easi)\n- qla2xxx: Add new message when a new loopid is assigned. (Chad Dupuis)\n- qla2xxx: Fix ql_dbg arguments. (Arun Easi)\n- qla2xxx: Use ql_log* #defines in ql_log() and ql_log_pci(). (Chad Dupuis)\n- qla2xxx: Convert remaining printks to ql_log format. (Chad Dupuis)\n- qla2xxx: Print mailbox command opcode and return code when a command times\n  out. (Chad Dupuis)\n- qla2xxx: Remove check for null fcport from host reset handler. (Michael\n  Christie)\n- qla2xxx: Correct out of bounds read of ISP2200 mailbox registers. (Andrew\n  Vasquez)\n- qla2xxx: Remove errant clearing of MBX_INTERRUPT flag during CT-IOCB\n  processing. (Andrew Vasquez)\n- qla2xxx: Reduce mbx-command timeout for Login/Logout requests. (Andrew\n  Vasquez)\n- qla2xxx: Clear options-flags while issuing stop-firmware mbx command. (Andrew\n  Vasquez)\n- qla2xxx: Prep zero-length BSG data-transfer requests. (Andrew Vasquez)\n- qla2xxx: Perform implicit logout during rport tear-down. (Andrew Vasquez)\n- qla2xxx: Return N-port id to firmware on logout. (Joe Carnuccio)\n- qla2xxx: Handle failure cases during fabric_login (Chad Dupuis)\n- qla2xxx: Increase speed of flash access in ISP82xx adapters to improve\n  firmware load speed. (Chad Dupuis)\n- qla2xxx: Handle change notifications based on switch scan results. (Arun\n  Easi)\n- qla2xxx: Correct print format for edc ql_log() calls. (Joe Carnuccio)\n- qla2xxx: Use consistent DL mask for ELS/CT passthru requests. (Andrew\n  Vasquez)\n- qla2xxx: Consolidation of SRB processing. (Giridhar Malavali)\n- qla2xxx: Use proper VPD/NVRAM regions with ISP8031 parts. (Andrew Vasquez)\n- qla2xxx: Remove ql2xfwloadbin assignment to 0. (Chad Dupuis)\n- qla2xxx: Call MPI reset for 81xx adapters only. (Andrew Vasquez)\n- qla2xxx: Driver need to do HotReset instead of FundamentalReset for ISP83XX\n  (Andrew Vasquez)\n- qla2xxx: Use default semantic for firmware load. (Saurav Kashyap)\n- qla2xxx: Enhancements to support ISP83xx. (Giridhar Malavali)\n- qla2xxx: Enhanced the dump routines to capture multiple request and response\n  queues. (Giridhar Malavali)\n- qla2xxx: Update the driver version to 8.03.07.13.39.0-k. (Saurav Kashyap)\n- qla2xxx: Fixed typos and misc issues. (Saurav Kashyap)\n- qla2xxx: Fix byte swapping in IPE print statement. (Chad Dupuis)\n- qla2xxx: Add an 'is reset active' helper. (Andrew Vasquez)\n- qla2xxx: Disable generating pause frames when firmware hang detected for\n  ISP82xx. (Giridhar Malavali)\n- qla2xxx: Use a valid enode-mac if none defined. (Andrew Vasquez)\n- qla2xxx: Remove resetting memory during device initialization for ISP82xx.\n  (Shyam Sundar)\n- qla2xxx: Propagate up abort failures. (Arun Easi)\n- qla2xxx: Add check for null fcport references in qla2xxx_queuecommand. (Chad\n  Dupuis)\n- [mpt2sas] Bump driver vesion to 13.100.00.00 (Nagalakshmi Nandigama) [Orabug:\n  14040678]\n- [mpt2sas] fix NULL pointer at ioc-\u003epfacts (Nagalakshmi Nandigama) [Orabug:\n  14040678]\n- [mpt2sas] A hard drive is going OFFLINE when there is a hard reset issued and\n  simultaneously another hard drive is hot unplugged (Nagalakshmi Nandigama)\n  [Orabug: 14040678]\n- [mpt2sas] Set the phy identifier of the end device to to the phy number of\n  the parent device it is linked to (Nagalakshmi Nandigama) [Orabug: 14040678]\n- [mpt2sas] While enabling phy, read the current port number from sas iounit\n  page 0 instead of page 1 (Nagalakshmi Nandigama) [Orabug: 14040678]\n- [mpt2sas] Fix several endian issues found by runing sparse (Nagalakshmi\n  Nandigama) [Orabug: 14040678]\n- [mpt2sas] Modify the source code as per the findings reported by the source\n  code analysis tool (Nagalakshmi Nandigama) [Orabug: 14040678]\n- [mpt2sas] Improvement were made to better protect the sas_device,\n  raid_device, and expander_device lists (Nagalakshmi Nandigama)\n- [mpt2sas] Perform Target Reset instead of HBA reset when a SATA_PASSTHROUGH\n  cmd timeout happens (Nagalakshmi Nandigama) [Orabug: 14040678]\n- [mpt2sas] Added multisegment mode support for Linux BSG Driver (Nagalakshmi\n  Nandigama) [Orabug: 14040678]\n- [mpt2sas] remove the global mutex (Nagalakshmi Nandigama) [Orabug: 14040678]\n- [mpt2sas] MPI next revision header update (Nagalakshmi Nandigama) [Orabug:\n  14040678]\n- Update lpfc version for 8.3.5.68.4p driver release (Vaios Papadimitriou)\n- Fix bug with mailbox handling of REG_VFI and cable pull (CR 127762) (Vaios\n  Papadimitriou)\n- Use PCI configure space read to flush PCI function reset register write to\n  avoid MMIO issues (CR 128101) (Vaios Papadimitriou)\n- Fixed system panic when extents enabled with large number of small blocks (CR\n  128010) (Vaios Papadimitriou)\n- Fixed the system panic during EEH recovery (CR 127062) (Vaios Papadimitriou)\n- Fix resource leak when acc fails for received plogi (CR 127847) (Vaios\n  Papadimitriou)\n- Fixed SLI4 driver module load and unload test in a loop crashes the system\n  (CR 126397) (Vaios Papadimitriou)\n- Fixed missing CVL event causing round-robin FCF failover process to stop (CR\n  123367) (Vaios Papadimitriou)\n- Fix deadlock during adapter offline request (CR 127217) (Vaios Papadimitriou)\n- Fix same RPI registered multiple times after HBA reset (CR 127176) (Vaios\n  Papadimitriou)\n- Fix driver handling of XRI Aborted CQE response (CR 127345) (Vaios\n  Papadimitriou)\n- Fixed port and system failure in handling SLI4 FC port function reset (CR\n  126551) (Vaios Papadimitriou)\n- Fix bug with driver not sending a LOGO with vport delete (CR 126625) (Vaios\n  Papadimitriou)\n- Fix for SLI4 Port delivery for BLS ABORT ACC (CR 126289) (Vaios\n  Papadimitriou)\n- Fix ndlp nodelist not empty wait timeout during driver unloading (CR 127052)\n  (Vaios Papadimitriou)\n- Fix mailbox and vpi memory leaks (CR 126818) (Vaios Papadimitriou)\n- Fix management communication issues by creating character device to take a\n  reference on the driver (CR 126082) (Vaios Papadimitriou)\n- Fix for FDISC failures after firmware reset or link bounce (CR 126779) (Vaios\n  Papadimitriou)\n- Fix for driver using duplicate RPIs after LPe16000 port reset (CR 126723)\n  (Vaios Papadimitriou)\n- Fix discovery problem when in pt2pt (CR 126887) (Vaios Papadimitriou)\n- Fixed failure in handling large CQ/EQ identifiers in an IOV environment (CR\n  126856) (Vaios Papadimitriou)\n- Fix Locking code raising IRQ twice (Vaios Papadimitriou)\n- Fix driver not returning when bad ndlp found in abts error event handling (CR\n  126209) (Vaios Papadimitriou)\n- Fix bug with driver returning the wrong ndlp (CR 125743) (Vaios\n  Papadimitriou)\n- Fix driver behavior when receiving an ADISC (CR 126654) (Vaios Papadimitriou)\n- Fix bug with driver processing dump command type 4 using 16Gb FC Adapter (CR\n  126406) (Vaios Papadimitriou)\n- Fix driver does not reset port when reset is needed during fw_dump (CR\n  125807) (Vaios Papadimitriou)\n- Fix ELS FDISC failing with local reject / invalid RPI (CR 126350) (Vaios\n  Papadimitriou)\n- Fix SLI4 FC port internal loopback (CR 126409) (Vaios Papadimitriou)\n- Fix REG_RPI fails on SLI4 HBA putting NPort into NPR state (CR 126230) (Vaios\n  Papadimitriou)\n- Fix bug with driver processing an els command using 16Gb FC Adapter (CR\n  126345) (Vaios Papadimitriou)\n- Fix NMI seen due to CQE starvation (CR 126149) (Vaios Papadimitriou)\n- Fixed SLI4 FC port obtained link type and number dependent on link connection\n  (CR 126264) (Vaios Papadimitriou)\n- Fixed SLI4 FC port internal loopback without SFP and external link/loopback\n  plug (CR 125843) (Vaios Papadimitriou)\n- Fix driver incorrectly building fcpCdb during scsi command prep (CR 126209)\n  (Vaios Papadimitriou)\n- be2net: make be_vlan_add_vid() void (Maxim Uvarov)\n- be2net: Record receive queue index in skb to aid RPS. (Somnath Kotur)\n- be2net: Fix FW download for BE (Padmanabh Ratnakar)\n- be2net: Fix traffic stall INTx mode (Padmanabh Ratnakar)\n- be2net: fix ethtool get settings (Ajit Khaparde)\n- be2net: fix programming of VLAN tags for VF (Ajit Khaparde)\n- be2net: reset queue address after freeing (Sathya Perla)\n- be2net: fix tx completion cleanup (Sathya Perla)\n- be2net: refactor/cleanup vf configuration code (Maxim Uvarov)\n- be2net: event queue re-design (Maxim Uvarov)\n- be2net: update the driver version (Sarveshwar Bandi)\n- be2net: Fix EEH error reset before a flash dump completes (Somnath Kotur)\n- be2net: Ignore status of some ioctls during driver load (Ajit Khaparde)\n- be2net: Fix wrong status getting returned for MCC commands (Padmanabh\n  Ratnakar)\n- be2net: Fix Lancer statistics (Padmanabh Ratnakar)\n- be2net: Fix ethtool self test for Lancer (Padmanabh Ratnakar)\n- be2net: Fix FW download in Lancer (Padmanabh Ratnakar)\n- be2net: Fix VLAN/multicast packet reception (Padmanabh Ratnakar)\n- be2net: Fix number of vlan slots in flex mode (Ajit Khaparde)\n- be2net: enable WOL by default if h/w supports it (Ajit Khaparde)\n- be2net: Remove unused OFFSET_IN_PAGE() macro (Roland Dreier)\n- be2net: enable RSS for ipv6 pkts (Sathya Perla)\n- be2net: Use new implementation of get mac list command (Padmanabh Ratnakar)\n- be2net: Fix link status query command (Padmanabh Ratnakar)\n- ethtool: Null-terminate filename passed to ethtool_ops::flash_device (Ben\n  Hutchings)\n- be2net: add descriptions for stat counters reported via ethtool (Sathya\n  Perla)\n- be2net: allocate more headroom in incoming skbs (Eric Dumazet)\n- netdev: make net_device_ops const (stephen hemminger)\n- be2net: fix be_vlan_add/rem_vid (Ajit Khaparde)\n- be2net: Fix INTx processing for Lancer (Padmanabh Ratnakar)\n- be2net: Add support for Skyhawk cards (Ajit Khaparde)\n- be2net: fix ethtool ringparam reporting (Sathya Perla)\n- be2net: workaround to fix a bug in BE (Ajit Khaparde)\n- be2net: update some counters to display via ethtool (Ajit Khaparde)\n- net: make vlan ndo_vlan_rx_[add/kill]_vid return error value (Jiri Pirko)\n- be2net: netpoll support (Ivan Vecera)\n- xen/pci: dont use PCI BIOS service for configuration space accesses (David\n  Vrabel)\n- xen/Kconfig: fix Kconfig layout (Andrew Morton)\n- xen/pte: Fix crashes when trying to see non-existent PGD/PMD/PUD/PTEs (Konrad\n  Rzeszutek Wilk)\n- xen/apic: Return the APIC ID (and version) for CPU 0. (Konrad Rzeszutek Wilk)\n- drivers/video/xen-fbfront.c: add missing cleanup code (Julia Lawall)\n- xen/x86: Workaround 'x86/ioapic: Add register level checks to detect bogus\n  io-apic entries' (Konrad Rzeszutek Wilk)\n- xen/acpi: Workaround broken BIOSes exporting non-existing C-states. (Konrad\n  Rzeszutek Wilk)\n- xen/enlighten: Disable MWAIT_LEAF so that acpi-pad wont be loaded. (Konrad\n  Rzeszutek Wilk)\n- drivers/video/xen-fbfront.c: add missing cleanup code (Julia Lawall)\n- xen: correctly check for pending events when restoring irq flags (David\n  Vrabel)\n- xen/smp: Fix crash when booting with ACPI hotplug CPUs. (Konrad Rzeszutek\n  Wilk)\n- xen: use the pirq number to check the pirq_eoi_map (Stefano Stabellini)\n\n [2.6.39-200.6.0.el5uek]\n- [USB] cdc-acm: Increase number of devices to 64 (Joe Jin) [Orabug: 13693812]\n- git-changelog: generate date entry (Maxim Uvarov)\n- [scsi] hpsa: Remove some PCI IDs if for OL5. (Joe Jin)\n- [block] cciss: fix incorrect PCI IDs and add two new ones (Joe Jin)\n- [scsi] hpsa: add some older controllers to the kdump blacklist (Joe Jin)\n- [block] cciss: Add IRQF_SHARED back in for the non-MSI(X) interrupt handler\n  (Joe Jin)\n- [block] cciss: add some older controllers to the kdump blacklist (Joe Jin)\n\n[2.6.39-200.5.0.el5uek]\n- be2net: query link status in be_open() (Sarveshwar Bandi) [Orabug: 13231]\n\n[2.6.39-200.4.0.el5uek]\n- Revert 'xen/p2m: m2p_find_override: use list_for_each_entry_safe' (Konrad\n  Rzeszutek Wilk)\n- xen/blkback: Fix warning error. (Konrad Rzeszutek Wilk)\n- xen/blkback: Make optional features be really optional. (Konrad Rzeszutek\n  Wilk)\n- xen-blkfront: module exit handling adjustments (Jan Beulich)\n- xen-blkfront: properly name all devices (Jan Beulich)\n- xen-blkfront: set pages are FOREIGN_FRAME when sharing them (Stefano\n  Stabellini)\n- xen: EXPORT_SYMBOL set_phys_to_machine (Stefano Stabellini)\n- xen-blkfront: make blkif_io_lock spinlock per-device (Steven Noonan)\n- xen/blkfront: dont put bdev right after getting it (Andrew Jones)\n- xen-blkfront: use bitmap_set() and bitmap_clear() (Akinobu Mita)\n- xen/blkback: Enable blkback on HVM guests (Daniel De Graaf)\n- xen/blkback: use grant-table.c hypercall wrappers (Daniel De Graaf)\n- xen/p2m: m2p_find_override: use list_for_each_entry_safe (Stefano Stabellini)\n- xen/gntdev: do not set VM_PFNMAP (Stefano Stabellini)\n- xen/grant-table: add error-handling code on failure of gnttab_resume (Julia\n  Lawall)\n- xen: only check xen_platform_pci_unplug if hvm (Igor Mammedov)\n- xen: initialize platform-pci even if xen_emul_unplug=never (Igor Mammedov)\n- xen kconfig: relax INPUT_XEN_KBDDEV_FRONTEND deps (Andrew Jones)\n- xen: support pirq_eoi_map (Stefano Stabellini)\n- xen/smp: Remove unnecessary call to smp_processor_id() (Srivatsa S. Bhat)\n- xen/smp: Fix bringup bug in AP code. (Konrad Rzeszutek Wilk)\n- xen/tmem: cleanup (Jan Beulich)\n- xen: constify all instances of 'struct attribute_group' (Jan Beulich)\n- xen/xenbus: ignore console/0 (Stefano Stabellini)\n- hvc_xen: introduce HVC_XEN_FRONTEND (Stefano Stabellini)\n- hvc_xen: implement multiconsole support (Stefano Stabellini)\n- hvc_xen: support PV on HVM consoles (Stefano Stabellini)\n- xen: use this_cpu_xxx replace percpu_xxx funcs (Alex Shi)\n- xenbus: dont free other end details too early (Jan Beulich)\n- xen/resume: Fix compile warnings. (Konrad Rzeszutek Wilk)\n- xen/xenbus: Add quirk to deal with misconfigured backends. (Konrad Rzeszutek\n  Wilk)\n- xenbus: address compiler warnings (Jan Beulich)\n- xen/pcifront: avoid pci_frontend_enable_msix() falsely returning success (Jan\n  Beulich)\n- xen/pciback: fix XEN_PCI_OP_enable_msix result (Jan Beulich)\n- xen/pciback: Support pci_reset_function, aka FLR or D3 support. (Konrad\n  Rzeszutek Wilk)\n- PCI: Introduce __pci_reset_function_locked to be used when holding\n  device_lock. (Konrad Rzeszutek Wilk)\n- xen/acpi: Fix Kconfig dependency on CPU_FREQ (Konrad Rzeszutek Wilk)\n- xen/acpi-processor: Do not depend on CPU frequency scaling drivers. (Konrad\n  Rzeszutek Wilk)\n- xen/cpufreq: Disable the cpu frequency scaling drivers from loading. (Konrad\n  Rzeszutek Wilk)\n- provide disable_cpufreq() function to disable the API. (Konrad Rzeszutek\n  Wilk)\n- xen-netback: make ops structs const (stephen hemminger)\n- netback: fix typo in comment (Wei Liu)\n- netback: remove redundant assignment (Wei Liu)\n- netback: Fix alert message. (Wei Liu)\n- xen-netback: use correct index for invalidation in xen_netbk_tx_check_gop()\n  (Jan Beulich)\n- net: xen-netback: correctly restart Tx after a VM restore/migrate (David\n  Vrabel)\n- xen/netback: Add module alias for autoloading (Bastian Blank)\n\n[2.6.39-200.3.0.el5uek]\n- loop: loop_thread needs to set the PF_LESS_THROTTLE flag (Dave Kleikamp)\n- iov_iter: missing assignment of ii_bvec_ops.ii_shorten (Dave Kleikamp)\n\n[2.6.39-200.2.0.el5uek]\n- regset: Return -EFAULT, not -EIO, on host-side memory fault (H. Peter Anvin)\n  {CVE-2012-1097}\n- regset: Prevent null pointer reference on readonly regsets (H. Peter Anvin)\n  {CVE-2012-1097}\n- cifs: fix dentry refcount leak when opening a FIFO on lookup (Jeff Layton)\n  {CVE-2012-1090}\n- git-changelog: add brackets around cve (Maxim Uvarov)\n- git-changelog: parse Oracle bug (Maxim Uvarov)\n- NFSv4: Save the owner/group name string when doing open (Trond Myklebust)\n  [Oracle bug: 13842440 (from 13459986)]\n- ext4: flush any pending end_io requests before DIO reads w/dioread_nolock\n  (Jiaying Zhang)\n- NFSv4: Return the delegation if the server returns NFS4ERR_OPENMODE (Trond\n  Myklebust)\n- NFS: Properly handle the case where the delegation is revoked (Trond\n  Myklebust)\n- nfsd: dont allow zero length strings in cache_parse() (Dan Carpenter)\n- x86, tls: Off by one limit check (Dan Carpenter)\n- x86, tsc: Skip refined tsc calibration on systems with reliable TSC (Alok\n  Kataria)\n- lockd: fix arg parsing for grace_period and timeout. (NeilBrown)\n- xfrm: Access the replay notify functions via the registered callbacks\n  (Steffen Klassert)\n- Remove printk from rds_sendmsg (Dave Jones)\n- net: fix napi_reuse_skb() skb reserve (Eric Dumazet)\n- net: fix a potential rcu_read_lock() imbalance in rt6_fill_node() (Eric\n  Dumazet)\n- Fix pppol2tp getsockname() (Benjamin LaHaise)\n- slub: Do not hold slub_lock when calling sysfs_slab_add() (Christoph Lameter)\n- xfs: Fix oops on IO error during xlog_recover_process_iunlinks() (Jan Kara)\n- dm exception store: fix init error path (Andrei Warkentin)\n- dm crypt: add missing error handling (Mikulas Patocka)\n- dm crypt: fix mempool deadlock (Mikulas Patocka)\n- vfs: fix d_ancestor() case in d_materialize_unique (Michel Lespinasse)\n- udf: Fix deadlock in udf_release_file() (Jan Kara)\n- ext4: check for zero length extent (Theodore Tso)\n- ext4: ignore EXT4_INODE_JOURNAL_DATA flag with delalloc (Lukas Czerner)\n- jbd2: clear BH_Delay \u0026 BH_Unwritten in journal_unmap_buffer (Eric Sandeen)\n- e1000e: Avoid wrong check on TX hang (Jeff Kirsher)\n- hwmon: (fam15h_power) Correct sign extension of running_avg_capture (Andreas\n  Herrmann)\n- proc-ns: use d_set_d_op() API to set dentry ops in proc_ns_instantiate().\n  (Pravin B Shelar)\n- x86-32: Fix endless loop when processing signals for kernel tasks (Dmitry\n  Adamushko)\n- usbnet: dont clear urb-\u003edev in tx_complete (tom.leiming)\n- SUNRPC: We must not use list_for_each_entry_safe() in rpc_wake_up() (Trond\n  Myklebust)\n- cifs: fix issue mounting of DFS ROOT when redirecting from one domain\n  controller to the next (Jeff Layton)\n- xfs: fix inode lookup race (Dave Chinner)\n- firewire: ohci: fix too-early completion of IR multichannel buffers (Clemens\n  Ladisch)\n- pata_legacy: correctly mask recovery field for HT6560B (Sergei Shtylyov)\n- target: Fix 16-bit target ports for SET TARGET PORT GROUPS emulation (Roland\n  Dreier)\n- target: Dont set WBUS16 or SYNC bits in INQUIRY response (Roland Dreier)\n- md/raid1,raid10: avoid deadlock during resync/recovery. (NeilBrown)\n- md/bitmap: ensure to load bitmap when creating via sysfs. (NeilBrown)\n- tcm_fc: Fix fc_exch memory leak in ft_send_resp_status (Nicholas Bellinger)\n- hugetlbfs: avoid taking i_mutex from hugetlbfs_read() (Aneesh Kumar K.V)\n- bootmem/sparsemem: remove limit constraint in alloc_bootmem_section (Nishanth\n  Aravamudan)\n- mm: thp: fix pmd_bad() triggering in code paths holding mmap_sem read mode\n  (Andrea Arcangeli)  {CVE-2012-1179}\n- x86/ioapic: Add register level checks to detect bogus io-apic entries (Suresh\n  Siddha)\n- rtc: Disable the alarm in the hardware (v2) (Rabin Vincent)\n- genirq: Fix incorrect check for forced IRQ thread handler (Alexander Gordeev)\n- genirq: Fix long-term regression in genirq irq_set_irq_type() handling\n  (Russell King)\n- uevent: send events in correct order according to seqnum (v3) (Andrew Vagin)\n- ntp: Fix integer overflow when setting time (Sasha Levin)\n- math: Introduce div64_long (Sasha Levin)\n- sysfs: Fix memory leak in sysfs_sd_setsecdata(). (Masami Ichikawa)\n- futex: Cover all PI opcodes with cmpxchg enabled check (Thomas Gleixner)\n- usb: musb: Reselect index reg in interrupt context (Supriya Karanth)\n- USB: ftdi_sio: fix problem when the manufacture is a NULL string (Greg Kroah-\n  Hartman)\n\n[2.6.39-200.0.15.el5uek]\n- directio: account for extra page IOs for unaligned request (Dave Kleikamp) \n  [Orabug: 13916031]\n\n[2.6.39-200.0.14.el5uek]\n- update kabi (Maxim Uvarov)\n- adjust kernel configs (Maxim Uvarov)\n- usb: fix number of mapped SG DMA entries (Clemens Ladisch)\n- svcrpc: destroy server sockets all at once (J. Bruce Fields)\n- PCI: Rework ASPM disable code (Matthew Garrett)\n- net: fix NULL dereferences in check_peer_redir() (Eric Dumazet)\n- lib: proportion: lower PROP_MAX_SHIFT to 32 on 64-bit kernel (Wu Fengguang)\n- writeback: fix dereferencing NULL bdi-\u003edev on trace_writeback_queue (Wu\n  Fengguang)\n- net: Make qdisc_skb_cb upper size bound explicit. (David S. Miller)\n- ipv4: Save nexthop address of LSRR/SSRR option to IPCB. (Maxim Uvarov)\n- compat: use sys_sendfile64() implementation for sendfile syscall (Chris\n  Metcalf)\n- ext4: implement ext4_file_write_iter (Dave Kleikamp)\n\n[2.6.39-200.0.13.el5uek]\n- fix git merge: vlan: allow nested vlan_do_receive() (Maxim Uvarov)\n- SPEC: update and turn on kabi (Maxim Uvarov)\n\n[2.6.39-200.0.12.el5uek]\n- remove unused mutex hpidebuglock (Maxim Uvarov)\n- add hxge-1.3.3 driver (Maxim Uvarov)\n\n[2.6.39-200.0.11.el5uek]\n- vlan: allow nested vlan_do_receive() (Maxim Uvarov)\n- net: allow vlan traffic to be received under bond (John Fastabend)\n- net: vlan: goto another_round instead of calling __netif_receive_skb (Jiri\n  Pirko)\n\n[2.6.39-200.0.10.el5uek]\n- ocfs2/cluster: Fix output in file elapsed_time_in_ms (Sunil Mushran)\n\n[2.6.39-200.0.9.el5uek]\n- Revert 'loop: increase default number of loop devices to 512' (Maxim Uvarov)\n- Revert 'loop: set default number of loop devices to 200' (Maxim Uvarov)\n- ocfs2/dlm: dlmlock_remote() needs to account for remastery (Sunil Mushran)\n- ocfs2/dlm: Take inflight reference count for remotely mastered resources too\n  (Maxim Uvarov)\n- ocfs2/dlm: Clean up refmap helpers (Maxim Uvarov)\n- ocfs2/dlm: Cleanup dlm_wait_for_node_death() and dlm_wait_for_node_recovery()\n  (Sunil Mushran)\n- ocfs2/dlm: Cleanup up dlm_finish_local_lockres_recovery() (Sunil Mushran)\n- ocfs2/dlm: Trace insert/remove of resource to/from hash (Sunil Mushran)\n- ocfs2/dlm: Clean up messages in o2dlm (Sunil Mushran)\n- ocfs2/cluster: Cluster up now includes network connections too (Sunil\n  Mushran)\n- ocfs2/cluster: Clean up messages in o2net (Sunil Mushran)\n- ocfs2/cluster: Abort heartbeat start on hard-ro devices (Sunil Mushran)\n\n[2.6.39-200.0.8.el5uek]\n- loop: set default number of loop devices to 200 (Maxim Uvarov)\n- SPEC OL5: fix xen support (Maxim Uvarov)\n\n[2.6.39-200.0.6.el5uek]\n- ocfs2: Rollback commit ea455f8ab68338ba69f5d3362b342c115bea8e13 (Sunil\n  Mushran) [orabug: 13555276]\n- ocfs2: Rollback commit f7b1aa69be138ad9d7d3f31fa56f4c9407f56b6a (Sunil\n  Mushran) [orabug: 13555276]\n- ocfs2: Rollback commit 5fd131893793567c361ae64cbeb28a2a753bbe35 (Sunil\n  Mushran) [orabug: 13555276]\n- ocfs2/cluster: Fix o2net_fill_node_map() (Sunil Mushran)\n- ocfs2/cluster: Add new function o2net_fill_node_map() (Sunil Mushran)\n- ocfs2: Tighten free bit calculation in the global bitmap (Sunil Mushran)\n- ocfs2/trivial: Limit unaligned aio+dio write messages to once per day (Sunil\n  Mushran)\n- btrfs: btrfs_direct_IO_bvec() needs to check for sector alignment (Dave\n  Kleikamp)\n- loop: increase default number of loop devices to 512 (Dave Kleikamp)\n- xen/merge error: Re-introduce xen-platform-pci driver. (Konrad Rzeszutek\n  Wilk)\n- x86/PCI: reduce severity of host bridge window conflict warnings (Bjorn\n  Helgaas)\n- xen/acpi: Remove the WARNs as they just create noise. (Konrad Rzeszutek\n  Wilk)\n\n[2.6.39-200.0.5.el5uek]\n- btrfs: create btrfs_file_write_iter() (Dave Kleikamp)\n\n[2.6.39-200.0.4.el5uek]\n- ocfs2/trivial: Print message indicating unaligned aio+dio write (Sunil\n  Mushran)\n- ocfs2: Avoid livelock in ocfs2_readpage() (Jan Kara)\n- ocfs2: serialize unaligned aio (Mark Fasheh)\n- ocfs2: null deref on allocation error (Dan Carpenter)\n- ocfs2: Bugfix for hard readonly mount (Tiger Yang)\n\n[2.6.39-200.0.3.el5uek]\n- xen/blkback: Disable DISCARD support for loopback device (but leave for phy).\n  (Konrad Rzeszutek Wilk)\n- block: fix patch import error in max_discard_sectors check (Jens Axboe)\n- block: eliminate potential for infinite loop in blkdev_issue_discard (Mike\n  Snitzer)\n- config: Use the xen-acpi-processor instead of the cpufreq-xen driver. (Konrad\n  Rzeszutek Wilk)\n- xen/acpi-processor: C and P-state driver that uploads said data to\n  hypervisor. (Konrad Rzeszutek Wilk)\n- Revert 'Merge branch 'stable/cpufreq-xen.v6.rebased' into uek2-merge' (Konrad\n  Rzeszutek Wilk)\n\n[2.6.39-200.0.2.el5uek]\n- xen: make page table walk hugepages aware (Dave McCracken) [Orabug: 13719997]\n- x86/PCI: Preserve existing pci=bfsort whitelist for Dell systems (Narendra_K)\n\n[2.6.39-200.0.1.el5uek]\n- disable kabicheck for uek2 update 1 beta\n- nfs: only dirty user pages in direct read code (Dave Kleikamp)\n- config: Enable Xens PV USB, SCSI, MCE and Xen CPU freq driver (Konrad\n  Rzeszutek Wilk)\n- [CPUFREQ] xen: governor for Xen hypervisor frequency scaling. (Konrad\n  Rzeszutek Wilk)\n- xen/enlighten: Expose MWAIT and MWAIT_LEAF if hypervisor OKs it. (Konrad\n  Rzeszutek Wilk)\n- Revert 'Merge branch 'stable/processor-passthru.v5.rebased' into uek2-merge'\n  (Konrad Rzeszutek Wilk)\n- xen/processor-passthru: threads arent suppose to leave on their own. (Konrad\n  Rzeszutek Wilk)\n- config: Enable Xens PV USB, SCSI, MCE and Processor-Passthru (Konrad\n  Rzeszutek Wilk)\n- Xen: Export host physical CPU information to dom0 (Liu Jinsong)\n- xen/mce: Change the machine check point (Liu Jinsong)\n- Add mcelog support from xen platform (Liu Jinsong)\n- usb: xen pvusb driver (Nathanael Rensen)\n- xen/processor-passthru: Provide an driver that passes struct acpi_processor\n  data to the hypervisor. (Konrad Rzeszutek Wilk)\n- xen/enlighten: Expose MWAIT and MWAIT_LEAF if hypervisor OKs it. (Konrad\n  Rzeszutek Wilk)\n- xen/setup/pm/acpi: Remove the call to boot_option_idle_override. (Konrad\n  Rzeszutek Wilk)\n- xen/acpi: Domain0 acpi parser related platform hypercall (Yu Ke)\n- xen/pm_idle: Make pm_idle be default_idle under Xen. (Konrad Rzeszutek Wilk)\n- cpuidle: stop depending on pm_idle (Len Brown)\n- cpuidle: replace xen access to x86 pm_idle and default_idle (Len Brown)\n- cpuidle: create bootparam 'cpuidle.off=1' (Len Brown)\n- Revert 'Merge branch 'stable/acpi-cpufreq.v3.rebased' into uek2-merge'\n  (Konrad Rzeszutek Wilk)\n- x86/microcode: check proper return code. (Ben Guthro)\n- xen: add CPU microcode update driver (Jeremy Fitzhardinge)\n- xen: add dom0_op hypercall (Jeremy Fitzhardinge)\n- xen/acpi: Domain0 acpi parser related platform hypercall (Yu Ke)\n- nfs: add support for read_iter, write_iter (Dave Kleikamp)\n- xenbus_dev: add missing error check to watch handling (Jan Beulich)\n- xen/pci[front|back]: Use %d instead of %1x for displaying PCI devfn. (Konrad\n  Rzeszutek Wilk)\n- xen pvhvm: do not remap pirqs onto evtchns if !xen_have_vector_callback\n  (Stefano Stabellini)\n- xen/smp: Fix CPU online/offline bug triggering a BUG: scheduling while\n  atomic. (Konrad Rzeszutek Wilk)\n- xen/bootup: During bootup suppress XENBUS: Unable to read cpu state (Konrad\n  Rzeszutek Wilk)\n- Merge conflict resolved. Somehow the letter 's' slipped in the Makefile. This\n  fixes the compile issues. (Konrad Rzeszutek Wilk)\n- xen/events: BUG() when we cant allocate our event-\u003eirq array. (Konrad\n  Rzeszutek Wilk)\n- xen/granttable: Disable grant v2 for HVM domains. (Konrad Rzeszutek Wilk)\n- xen-blkfront: Use kcalloc instead of kzalloc to allocate array (Thomas Meyer)\n- xen/pciback: Expand the warning message to include domain id. (Konrad\n  Rzeszutek Wilk)\n- xen/pciback: Fix 'device has been assigned to X domain!' warning (Konrad\n  Rzeszutek Wilk)\n- xen/xenbus: dont reimplement kvasprintf via a fixed size buffer (Ian\n  Campbell)\n- xenbus: maximum buffer size is XENSTORE_PAYLOAD_MAX (Ian Campbell)\n- xen/xenbus: Reject replies with payload \u003e XENSTORE_PAYLOAD_MAX. (Ian\n  Campbell)\n- Xen: consolidate and simplify struct xenbus_driver instantiation (Jan\n  Beulich)\n- xen-gntalloc: introduce missing kfree (Julia Lawall)\n- xen/xenbus: Fix compile error - missing header for xen_initial_domain()\n  (Konrad Rzeszutek Wilk)\n- xen/netback: Enable netback on HVM guests (Daniel De Graaf)\n- xen/grant-table: Support mappings required by blkback (Daniel De Graaf)\n- xenbus: Use grant-table wrapper functions (Daniel De Graaf)\n- xenbus: Support HVM backends (Daniel De Graaf)\n- xen/xenbus-frontend: Fix compile error with randconfig (Konrad Rzeszutek\n  Wilk)\n- xen/xenbus-frontend: Make error message more clear (Bastian Blank)\n- xen/privcmd: Remove unused support for arch specific privcmp mmap (Bastian\n  Blank)\n- xen: Add xenbus_backend device (Bastian Blank)\n- xen: Add xenbus device driver (Bastian Blank)\n- xen: Add privcmd device driver (Bastian Blank)\n- xen/gntalloc: fix reference counts on multi-page mappings (Daniel De Graaf)\n- xen/gntalloc: release grant references on page free (Daniel De Graaf)\n- xen/events: prevent calling evtchn_get on invalid channels (Daniel De Graaf)\n- xen/granttable: Support transitive grants (Annie Li)\n- xen/granttable: Support sub-page grants (Annie Li)\n- xen/granttable: Improve comments for function pointers (Annie Li)\n- xen/ia64: fix build breakage because of conflicting u64 guest handles (Tony\n  Luck)\n- xen/granttable: Keep code format clean (Annie Li)\n- xen/granttable: Grant tables V2 implementation (Annie Li)\n- xen/granttable: Refactor some code (Annie Li)\n- xen/granttable: Introducing grant table V2 stucture (Annie Li)\n- Xen: update MAINTAINER info (Jeremy Fitzhardinge)\n- xen/event: Add reference counting to event channels (Daniel De Graaf)\n- xen/gnt{dev,alloc}: reserve event channels for notify (Daniel De Graaf)\n- xen/gntalloc: Change gref_lock to a mutex (Daniel De Graaf)\n- xen: document backend sysfs files (David Vrabel)\n- xen: document balloon driver sysfs files (David Vrabel)\n- btrfs: add support for read_iter, write_iter, and direct_IO_bvec (Dave\n  Kleikamp)\n- ext4: add support for read_iter, write_iter, and direct_IO_bvec (Dave\n  Kleikamp)\n- ocfs2: add support for read_iter, write_iter, and direct_IO_bvec (Dave\n  Kleikamp)\n- ext3: add support for .read_iter and .write_iter (Dave Kleikamp)\n- bio: add bvec_length(), like iov_length() (Dave Kleikamp)\n- aio: add aio support for iov_iter arguments (Zach Brown)\n- aio: add aio_kernel_() interface (Dave Kleikamp)\n- fs: pull iov_iter use higher up the stack (Dave Kleikamp)\n- dio: add __blockdev_direct_IO_bdev() (Dave Kleikamp)\n- dio: add dio_post_submission() helper function (Dave Kleikamp)\n- dio: add dio_lock_and_flush() helper (Dave Kleikamp)\n- dio: add sdio_init() helper function (Dave Kleikamp)\n- dio: add dio_alloc_init() helper function (Dave Kleikamp)\n- dio: create a dio_aligned() helper function (Zach Brown)\n- iov_iter: let callers extract iovecs and bio_vecs (Zach Brown)\n- iov_iter: add a shorten call (Zach Brown)\n- iov_iter: add bvec support (Zach Brown)\n- iov_iter: hide iovec details behind ops function pointers (Zach Brown)\n- fuse: convert fuse to use iov_iter_copy_[to|from]_user (Dave Kleikamp)\n- iov_iter: add copy_to_user support (Zach Brown)\n- iov_iter: move into its own file (Zach Brown)\n- xen/scsi[front|back]: consolidate and simplify struct xenbus_driver\n  instantiation (Konrad Rzeszutek Wilk)\n- xen/scsiback: allow RESERVE/RELEASE commands (James Harper)\n- xen/scsiback: vscsi \u003e2TB patch (Samuel Kvasnica)\n- xen-scsi[front|back]: Fix warnings and bugs. (Konrad Rzeszutek Wilk)\n- xen/scsi[front|back]: Forgot .owner attribute. (Konrad Rzeszutek Wilk)\n- xen/scsi[front|back]: Initial commit from Novell SLES11SP1 2.6.32 tree.\n  (Konrad Rzeszutek Wilk)\n- xen/pci:use hypercall PHYSDEVOP_restore_msi_ext to restore MSI/MSI-X vectors\n  (Liang Tang)\n- xen/acpi/sleep: Register to the acpi_suspend_lowlevel a callback. (Konrad\n  Rzeszutek Wilk)\n- xen/acpi/sleep: Enable ACPI sleep via the __acpi_override_sleep (Konrad\n  Rzeszutek Wilk)\n- xen/acpi: Domain0 acpi parser related platform hypercall (Yu Ke)\n- xen: Utilize the restore_msi_irqs hook. (Konrad Rzeszutek Wilk)\n- x86/acpi/sleep: Provide registration for acpi_suspend_lowlevel. (Liang Tang)\n- x86, acpi, tboot: Have a ACPI sleep override instead of calling tboot_sleep.\n  (Konrad Rzeszutek Wilk)\n- x86: Expand the x86_msi_ops to have a restore MSIs. (Konrad Rzeszutek Wilk)",
  "Platform": [
    "Oracle Linux 5",
    "Oracle Linux 6"
  ],
  "References": [
    {
      "Source": "elsa",
      "URI": "https://linux.oracle.com/errata/ELSA-2012-2022.html",
      "ID": "ELSA-2012-2022"
    }
  ],
  "Criteria": {
    "Operator": "OR",
    "Criterias": [
      {
        "Operator": "AND",
        "Criterias": [
          {
            "Operator": "OR",
            "Criterias": [
              {
                "Operator": "AND",
                "Criterias": [
                  {
                    "Operator": "OR",
                    "Criterias": [
                      {
                        "Operator": "AND",
                        "Criterias": null,
                        "Criterions": [
                          {
                            "Comment": "kernel-uek is earlier than 0:2.6.39-200.24.1.el5uek"
                          },
                          {
                            "Comment": "kernel-uek is signed with the Oracle Linux 5 key"
                          }
                        ]
                      },
                      {
                        "Operator": "AND",
                        "Criterias": null,
                        "Criterions": [
                          {
                            "Comment": "kernel-uek-debug is earlier than 0:2.6.39-200.24.1.el5uek"
                          },
                          {
                            "Comment": "kernel-uek-debug is signed with the Oracle Linux 5 key"
                          }
                        ]
                      },
                      {
                        "Operator": "AND",
                        "Criterias": null,
                        "Criterions": [
                          {
                            "Comment": "kernel-uek-debug-devel is earlier than 0:2.6.39-200.24.1.el5uek"
                          },
                          {
                            "Comment": "kernel-uek-debug-devel is signed with the Oracle Linux 5 key"
                          }
                        ]
                      },
                      {
                        "Operator": "AND",
                        "Criterias": null,
                        "Criterions": [
                          {
                            "Comment": "kernel-uek-devel is earlier than 0:2.6.39-200.24.1.el5uek"
                          },
                          {
                            "Comment": "kernel-uek-devel is signed with the Oracle Linux 5 key"
                          }
                        ]
                      },
                      {
                        "Operator": "AND",
                        "Criterias": null,
                        "Criterions": [
                          {
                            "Comment": "kernel-uek-doc is earlier than 0:2.6.39-200.24.1.el5uek"
                          },
                          {
                            "Comment": "kernel-uek-doc is signed with the Oracle Linux 5 key"
                          }
                        ]
                      },
                      {
                        "Operator": "AND",
                        "Criterias": null,
                        "Criterions": [
                          {
                            "Comment": "kernel-uek-firmware is earlier than 0:2.6.39-200.24.1.el5uek"
                          },
                          {
                            "Comment": "kernel-uek-firmware is signed with the Oracle Linux 5 key"
                          }
                        ]
                      }
                    ],
                    "Criterions": null
                  }
                ],
                "Criterions": [
                  {
                    "Comment": "Oracle Linux arch is x86_64"
                  }
                ]
              },
              {
                "Operator": "AND",
                "Criterias": [
                  {
                    "Operator": "OR",
                    "Criterias": [
                      {
                        "Operator": "AND",
                        "Criterias": null,
                        "Criterions": [
                          {
                            "Comment": "kernel-uek is earlier than 0:2.6.39-200.24.1.el5uek"
                          },
                          {
                            "Comment": "kernel-uek is signed with the Oracle Linux 5 key"
                          }
                        ]
                      },
                      {
                        "Operator": "AND",
                        "Criterias": null,
                        "Criterions": [
                          {
                            "Comment": "kernel-uek-debug is earlier than 0:2.6.39-200.24.1.el5uek"
                          },
                          {
                            "Comment": "kernel-uek-debug is signed with the Oracle Linux 5 key"
                          }
                        ]
                      },
                      {
                        "Operator": "AND",
                        "Criterias": null,
                        "Criterions": [
                          {
                            "Comment": "kernel-uek-debug-devel is earlier than 0:2.6.39-200.24.1.el5uek"
                          },
                          {
                            "Comment": "kernel-uek-debug-devel is signed with the Oracle Linux 5 key"
                          }
                        ]
                      },
                      {
                        "Operator": "AND",
                        "Criterias": null,
                        "Criterions": [
                          {
                            "Comment": "kernel-uek-devel is earlier than 0:2.6.39-200.24.1.el5uek"
                          },
                          {
                            "Comment": "kernel-uek-devel is signed with the Oracle Linux 5 key"
                          }
                        ]
                      },
                      {
                        "Operator": "AND",
                        "Criterias": null,
                        "Criterions": [
                          {
                            "Comment": "kernel-uek-doc is earlier than 0:2.6.39-200.24.1.el5uek"
                          },
                          {
                            "Comment": "kernel-uek-doc is signed with the Oracle Linux 5 key"
                          }
                        ]
                      },
                      {
                        "Operator": "AND",
                        "Criterias": null,
                        "Criterions": [
                          {
                            "Comment": "kernel-uek-firmware is earlier than 0:2.6.39-200.24.1.el5uek"
                          },
                          {
                            "Comment": "kernel-uek-firmware is signed with the Oracle Linux 5 key"
                          }
                        ]
                      }
                    ],
                    "Criterions": null
                  }
                ],
                "Criterions": [
                  {
                    "Comment": "Oracle Linux arch is i386"
                  }
                ]
              }
            ],
            "Criterions": null
          }
        ],
        "Criterions": [
          {
            "Comment": "Oracle Linux 5 is installed"
          }
        ]
      },
      {
        "Operator": "AND",
        "Criterias": [
          {
            "Operator": "OR",
            "Criterias": [
              {
                "Operator": "AND",
                "Criterias": [
                  {
                    "Operator": "OR",
                    "Criterias": [
                      {
                        "Operator": "AND",
                        "Criterias": null,
                        "Criterions": [
                          {
                            "Comment": "kernel-uek is earlier than 0:2.6.39-200.24.1.el6uek"
                          },
                          {
                            "Comment": "kernel-uek is signed with the Oracle Linux 6 key"
                          }
                        ]
                      },
                      {
                        "Operator": "AND",
                        "Criterias": null,
                        "Criterions": [
                          {
                            "Comment": "kernel-uek-debug is earlier than 0:2.6.39-200.24.1.el6uek"
                          },
                          {
                            "Comment": "kernel-uek-debug is signed with the Oracle Linux 6 key"
                          }
                        ]
                      },
                      {
                        "Operator": "AND",
                        "Criterias": null,
                        "Criterions": [
                          {
                            "Comment": "kernel-uek-debug-devel is earlier than 0:2.6.39-200.24.1.el6uek"
                          },
                          {
                            "Comment": "kernel-uek-debug-devel is signed with the Oracle Linux 6 key"
                          }
                        ]
                      },
                      {
                        "Operator": "AND",
                        "Criterias": null,
                        "Criterions": [
                          {
                            "Comment": "kernel-uek-devel is earlier than 0:2.6.39-200.24.1.el6uek"
                          },
                          {
                            "Comment": "kernel-uek-devel is signed with the Oracle Linux 6 key"
                          }
                        ]
                      },
                      {
                        "Operator": "AND",
                        "Criterias": null,
                        "Criterions": [
                          {
                            "Comment": "kernel-uek-doc is earlier than 0:2.6.39-200.24.1.el6uek"
                          },
                          {
                            "Comment": "kernel-uek-doc is signed with the Oracle Linux 6 key"
                          }
                        ]
                      },
                      {
                        "Operator": "AND",
                        "Criterias": null,
                        "Criterions": [
                          {
                            "Comment": "kernel-uek-firmware is earlier than 0:2.6.39-200.24.1.el6uek"
                          },
                          {
                            "Comment": "kernel-uek-firmware is signed with the Oracle Linux 6 key"
                          }
                        ]
                      }
                    ],
                    "Criterions": null
                  }
                ],
                "Criterions": [
                  {
                    "Comment": "Oracle Linux arch is x86_64"
                  }
                ]
              },
              {
                "Operator": "AND",
                "Criterias": [
                  {
                    "Operator": "OR",
                    "Criterias": [
                      {
                        "Operator": "AND",
                        "Criterias": null,
                        "Criterions": [
                          {
                            "Comment": "kernel-uek is earlier than 0:2.6.39-200.24.1.el6uek"
                          },
                          {
                            "Comment": "kernel-uek is signed with the Oracle Linux 6 key"
                          }
                        ]
                      },
                      {
                        "Operator": "AND",
                        "Criterias": null,
                        "Criterions": [
                          {
                            "Comment": "kernel-uek-debug is earlier than 0:2.6.39-200.24.1.el6uek"
                          },
                          {
                            "Comment": "kernel-uek-debug is signed with the Oracle Linux 6 key"
                          }
                        ]
                      },
                      {
                        "Operator": "AND",
                        "Criterias": null,
                        "Criterions": [
                          {
                            "Comment": "kernel-uek-debug-devel is earlier than 0:2.6.39-200.24.1.el6uek"
                          },
                          {
                            "Comment": "kernel-uek-debug-devel is signed with the Oracle Linux 6 key"
                          }
                        ]
                      },
                      {
                        "Operator": "AND",
                        "Criterias": null,
                        "Criterions": [
                          {
                            "Comment": "kernel-uek-devel is earlier than 0:2.6.39-200.24.1.el6uek"
                          },
                          {
                            "Comment": "kernel-uek-devel is signed with the Oracle Linux 6 key"
                          }
                        ]
                      },
                      {
                        "Operator": "AND",
                        "Criterias": null,
                        "Criterions": [
                          {
                            "Comment": "kernel-uek-doc is earlier than 0:2.6.39-200.24.1.el6uek"
                          },
                          {
                            "Comment": "kernel-uek-doc is signed with the Oracle Linux 6 key"
                          }
                        ]
                      },
                      {
                        "Operator": "AND",
                        "Criterias": null,
                        "Criterions": [
                          {
                            "Comment": "kernel-uek-firmware is earlier than 0:2.6.39-200.24.1.el6uek"
                          },
                          {
                            "Comment": "kernel-uek-firmware is signed with the Oracle Linux 6 key"
                          }
                        ]
                      }
                    ],
                    "Criterions": null
                  }
                ],
                "Criterions": [
                  {
                    "Comment": "Oracle Linux arch is i686"
                  }
                ]
              }
            ],
            "Criterions": null
          }
        ],
        "Criterions": [
          {
            "Comment": "Oracle Linux 6 is installed"
          }
        ]
      }
    ],
    "Criterions": null
  },
  "Severity": "IMPORTANT",
  "Cves": null,
  "Issued": {
    "Date": "2012-06-28"
  }
}