{
  "Severity": "CRITICAL",
  "UpdatedAt": "2025-10-16T21:05:01Z",
  "Package": {
    "Ecosystem": "NUGET",
    "Name": "Apache.NMS.AMQP"
  },
  "Advisory": {
    "DatabaseId": 317371,
    "Id": "GSA_kwCzR0hTQS00bWp3LXhyNXgtcHJwY84ABNe7",
    "GhsaId": "GHSA-4mjw-xr5x-prpc",
    "References": [
      {
        "Url": "https://nvd.nist.gov/vuln/detail/CVE-2025-54539"
      },
      {
        "Url": "https://lists.apache.org/thread/9k684j07ljrshy3hxwhj5m0xjmkz1g2n"
      },
      {
        "Url": "https://github.com/advisories/GHSA-4mjw-xr5x-prpc"
      }
    ],
    "Identifiers": [
      {
        "Type": "GHSA",
        "Value": "GHSA-4mjw-xr5x-prpc"
      },
      {
        "Type": "CVE",
        "Value": "CVE-2025-54539"
      }
    ],
    "Description": "A Deserialization of Untrusted Data vulnerability exists in the Apache ActiveMQ NMS AMQP Client.\n\nThis issue affects all versions of Apache ActiveMQ NMS AMQP up to and including 2.3.0, when establishing connections to untrusted AMQP servers. Malicious servers could exploit unbounded deserialization logic present in the client to craft responses that may lead to arbitrary code execution on the client side.\n\nAlthough version 2.1.0 introduced a mechanism to restrict deserialization via allow/deny lists, the protection was found to be bypassable under certain conditions.\n\nIn line with Microsoft’s deprecation of binary serialization in .NET 9, the project is evaluating the removal of .NET binary serialization support from the NMS API entirely in future releases.\n\nMitigation and Recommendations:\nUsers are strongly encouraged to upgrade to version 2.4.0 or later, which resolves the issue. Additionally, projects depending on NMS-AMQP should migrate away from .NET binary serialization as part of a long-term hardening strategy.",
    "Origin": "UNSPECIFIED",
    "PublishedAt": "2025-10-16T09:30:24Z",
    "Severity": "CRITICAL",
    "Summary": "Apache ActiveMQ NMS AMQP Client has a Deserialization of Untrusted Data vulnerability",
    "UpdatedAt": "2025-10-16T21:05:01Z",
    "WithdrawnAt": "",
    "CVSS": {
      "Score": 9.8,
      "VectorString": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H"
    }
  },
  "Versions": [
    {
      "FirstPatchedVersion": {
        "Identifier": "2.4.0"
      },
      "VulnerableVersionRange": "\u003c 2.4.0"
    }
  ]
}