{
  "id": "ALAS2022-2022-225",
  "title": "Amazon Linux 2022 - ALAS2022-2022-225: Critical priority package update for log4j",
  "issued": {
    "date": "2022-12-06 16:42"
  },
  "updated": {
    "date": "2022-12-06 16:42"
  },
  "severity": "Critical",
  "description": "Package updates are available for Amazon Linux 2022 that fix the following vulnerabilities:\nCVE-2021-45105:\n\tA flaw was found in the Apache Log4j logging library 2.x. when the logging configuration uses a non-default Pattern Layout with a Context Lookup. Attackers with control over Thread Context Map (MDC) input data can craft malicious input data that contains a recursive lookup and can cause Denial of Service.\n\nCVE-2021-45046:\n\tIt was found that the fix to address CVE-2021-44228 in Apache Log4j 2.15.0 was incomplete in certain non-default configurations. This could allows attackers with control over Thread Context Map (MDC) input data when the logging configuration uses a non-default Pattern Layout with either a Context Lookup (for example, $${ctx:loginId}) or a Thread Context Map pattern (%X, %mdc, or %MDC) to craft malicious input data using a JNDI Lookup pattern resulting in a denial of service (DOS) attack. Log4j 2.15.0 makes a best-effort attempt to restrict JNDI LDAP lookups to localhost by default. Log4j 2.16.0 fixes this issue by removing support for message lookup patterns and disabling JNDI functionality by default.\n\nCVE-2021-44832:\n\tApache Log4j2 versions 2.0-beta7 through 2.17.0 (excluding security fix releases 2.3.2 and 2.12.4) are vulnerable to a remote code execution (RCE) attack where an attacker with permission to modify the logging configuration file can construct a malicious configuration using a JDBC Appender with a data source referencing a JNDI URI which can execute remote code. This issue is fixed by limiting JNDI data source names to the java protocol in Log4j2 versions 2.17.1, 2.12.4, and 2.3.2.\n\nCVE-2021-44228:\n\tA flaw was found in the Java logging library Apache Log4j 2 in versions from 2.0-beta9 and before and including 2.14.1. This could allow a remote attacker to execute code on the server if the system logs an attacker-controlled string value with the attacker's JNDI LDAP server lookup.\n",
  "packages": [
    {
      "name": "log4j-jcl",
      "epoch": "0",
      "version": "2.17.2",
      "release": "1.amzn2022.0.3",
      "arch": "noarch",
      "filename": "Packages/log4j-jcl-2.17.2-1.amzn2022.0.3.noarch.rpm"
    },
    {
      "name": "log4j-slf4j",
      "epoch": "0",
      "version": "2.17.2",
      "release": "1.amzn2022.0.3",
      "arch": "noarch",
      "filename": "Packages/log4j-slf4j-2.17.2-1.amzn2022.0.3.noarch.rpm"
    },
    {
      "name": "log4j",
      "epoch": "0",
      "version": "2.17.2",
      "release": "1.amzn2022.0.3",
      "arch": "noarch",
      "filename": "Packages/log4j-2.17.2-1.amzn2022.0.3.noarch.rpm"
    }
  ],
  "references": [
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-44228",
      "id": "CVE-2021-44228",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-44832",
      "id": "CVE-2021-44832",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-45046",
      "id": "CVE-2021-45046",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-45105",
      "id": "CVE-2021-45105",
      "type": "cve"
    }
  ],
  "cveids": [
    "CVE-2021-44228",
    "CVE-2021-44832",
    "CVE-2021-45046",
    "CVE-2021-45105"
  ]
}