{
  "Identifier": "GHSA-gwj5-3vfq-q992",
  "PackageSlug": "go/github.com/nats-io/nats-server",
  "Title": "Import loops in account imports, nats-server DoS",
  "Description": "(This advisory is canonically \u003chttps://advisories.nats.io/CVE/CVE-2020-28466.txt\u003e)\n\n## Problem Description\n\nAn export/import cycle between accounts could crash the nats-server, after consuming CPU and memory.\n\nThis issue was fixed publicly in \u003chttps://github.com/nats-io/nats-server/pull/1731\u003e in November 2020.\n\nThe need to call this out as a security issue was highlighted by `snyk.io` and we are grateful for their assistance in doing so.\n\nOrganizations which run a NATS service providing access to accounts run by untrusted third parties are affected.\nSee below for an important caveat if running such a service.\n\n\n## Affected versions\n\n#### NATS Server\n\n * Version 2 prior to 2.2.0\n   + 2.0.0 through and including 2.1.9 are vulnerable.\n * fixed with nats-io/nats-server PR 1731, commit 2e3c226729\n\n\n## Impact\n\nThe nats-server could be killed, after consuming resources.\n\n\n## Workaround\n\nThe import cycle requires at least two accounts to work; if you have open account sign-up, then restricting new account sign-up might hinder an attacker.\n\n\n## Solution\n\nUpgrade the nats-server.\n\n\n## Caveat on NATS with untrusted users\n\nRunning a NATS service which is exposed to untrusted users presents a heightened risk.\n\nAny remote execution flaw or equivalent seriousness, or denial-of-service by unauthenticated users, will lead to prompt releases by the NATS maintainers.\n\nFixes for denial of service issues with no threat of remote execution, when limited to account holders, are likely to just be committed to the main development branch with no special attention.\n\nThose who are running such services are encouraged to build regularly from git.",
  "Date": "2021-05-21",
  "Pubdate": "2021-05-21",
  "AffectedRange": "\u003c2.2.0",
  "FixedVersions": [
    "2.2.0"
  ],
  "AffectedVersions": "All versions before 2.2.0",
  "NotImpacted": "All versions starting from 2.2.0",
  "Solution": "Upgrade to version 2.2.0 or above.",
  "Urls": [
    "https://github.com/nats-io/nats-server/security/advisories/GHSA-gwj5-3vfq-q992",
    "https://github.com/advisories/GHSA-gwj5-3vfq-q992"
  ],
  "CvssV2": "",
  "CvssV3": "",
  "UUID": "06b2b496-dfd2-4874-a01f-9a6958948b5d"
}