{
  "Severity": "HIGH",
  "UpdatedAt": "2024-12-11T21:47:38Z",
  "Package": {
    "Ecosystem": "RUST",
    "Name": "pqcrypto-hqc"
  },
  "Advisory": {
    "DatabaseId": 271516,
    "Id": "GSA_kwCzR0hTQS03NTNwLXdyajUtZzhmas4ABCSc",
    "GhsaId": "GHSA-753p-wrj5-g8fj",
    "References": [
      {
        "Url": "https://github.com/PQClean/PQClean/security/advisories/GHSA-753p-wrj5-g8fj"
      },
      {
        "Url": "https://github.com/open-quantum-safe/liboqs/security/advisories/GHSA-gpf4-vrrw-r8v7"
      },
      {
        "Url": "https://github.com/PQClean/PQClean/pull/578"
      },
      {
        "Url": "https://github.com/rustpq/pqcrypto/commit/0c07fa8badbf44f67d3ff1571df31ca54e5228c0"
      },
      {
        "Url": "https://github.com/advisories/GHSA-753p-wrj5-g8fj"
      }
    ],
    "Identifiers": [
      {
        "Type": "GHSA",
        "Value": "GHSA-753p-wrj5-g8fj"
      }
    ],
    "Description": "### Impact\n\nA correctness error has been identified in the reference implementation of the HQC key encapsulation mechanism. Due to an indexing error, part of the secret key is incorrectly treated as non-secret data. This results in an incorrect shared secret value being returned when the decapsulation function is called with a malformed ciphertext.\n\nNo concrete attack exploiting the error has been identified at this point. However, the error involves mishandling of the secret key, and in principle this presents a security vulnerability.\n\n### Patches\n\nPQClean does not have a release process, as it is a collection of implementations. If you obtained a HQC implementation from PQClean, please update to a version that includes the fixes proposed in https://github.com/PQClean/PQClean/pull/578. \n\nPlease also [refer to our security policy](https://github.com/PQClean/PQClean/blob/master/SECURITY.md).\n\n### Workarounds\n\nManually patching is always possible\n\n### Further details\n\nIn the 2023/04/30 version of the HQC specification and reference implementation, an extra field (sigma) was added to the secret key structure to enable implicit rejection of malformed ciphertexts. The logic to retrieve the public key from the secret key in the decapsulation function was not updated accordingly. As a result, sigma is treated as part of the public key. Later in the decapsulation call, a incorrectly constructed comparison check allows this error to go through undetected. Due to how these two bugs interfere with each other, the decapsulation function never uses sigma to perform implicit rejection; instead, it accepts malformed ciphertexts and returns shared secrets based on their decryptions.\n\n### References\n\nThis issue was first reported in OQS https://github.com/open-quantum-safe/liboqs/security/advisories/GHSA-gpf4-vrrw-r8v7. The vulnerability was identified by Célian Glénaz and Dahmun Goudarzi (Quarkslab).\n",
    "Origin": "UNSPECIFIED",
    "PublishedAt": "2024-12-11T21:47:37Z",
    "Severity": "HIGH",
    "Summary": "PQClean has a correctness error in HQC decapsulation",
    "UpdatedAt": "2024-12-11T21:48:34Z",
    "WithdrawnAt": "",
    "CVSS": {
      "Score": 0,
      "VectorString": ""
    }
  },
  "Versions": [
    {
      "FirstPatchedVersion": {
        "Identifier": "0.2.1"
      },
      "VulnerableVersionRange": "\u003c 0.2.1"
    }
  ]
}