{
  "Severity": "HIGH",
  "UpdatedAt": "2020-05-13T23:39:29Z",
  "Package": {
    "Ecosystem": "COMPOSER",
    "Name": "typo3/cms-core"
  },
  "Advisory": {
    "DatabaseId": 2102,
    "Id": "MDE2OlNlY3VyaXR5QWR2aXNvcnlHSFNBLXBxZzgtY3J4OS1nOG00",
    "GhsaId": "GHSA-pqg8-crx9-g8m4",
    "References": [
      {
        "Url": "https://github.com/TYPO3/TYPO3.CMS/security/advisories/GHSA-pqg8-crx9-g8m4"
      },
      {
        "Url": "https://nvd.nist.gov/vuln/detail/CVE-2020-11069"
      },
      {
        "Url": "https://github.com/advisories/GHSA-pqg8-crx9-g8m4"
      }
    ],
    "Identifiers": [
      {
        "Type": "GHSA",
        "Value": "GHSA-pqg8-crx9-g8m4"
      },
      {
        "Type": "CVE",
        "Value": "CVE-2020-11069"
      }
    ],
    "Description": "\u003e ### Meta\n\u003e * CVSS v3.1: AV:N/AC:L/PR:L/UI:R/S:U/C:H/I:H/A:H/E:F/RL:O/RC:C\n\u003e * CWE-352\n\u003e * CWE-346\n\n### Problem\nIt has been discovered that backend user interface and install tool are vulnerable to same-origin request forgery. A backend user can be tricked into interacting with a malicious resource an attacker previously managed to upload to the web server - scripts are then executed with the privileges of the victims' user session.\n\nIn a worst case scenario new admin users can be created which can directly be used by an attacker. The vulnerability is basically a cross-site request forgery (CSRF) triggered by a cross-site scripting vulnerability (XSS) - but happens on the same target host - thus, it’s actually a same-origin request forgery.\n\nMalicious payload such as HTML containing JavaScript might be provided by either an authenticated backend user or by a non-authenticated user using a 3rd party extension - e.g. file upload in a contact form with knowing the target location.\n\nThe attacked victim requires an active and valid backend or install tool user sessions at the time of the attack to be successful.\n\n### Solution\nUpdate to TYPO3 versions 9.5.17 or 10.4.2 that mitigates the problem described.\n\n### Additional Considerations\n\nThe deployment of additional mitigation techniques is suggested as described below.\n\n#### Sudo Mode Extension\n\nThis TYPO3 extension intercepts modifications to security relevant database tables, e.g. those storing user accounts or storages of the file abstraction layer. Modifications need to confirmed by again by the acting user with providing their password again - this technique is known as \"sudo mode\". This way unintended actions happening in the background can be mitigated.\n\n* https://github.com/FriendsOfTYPO3/sudo-mode\n* https://extensions.typo3.org/extension/sudo_mode\n\n#### Content Security Policy\n\n[Content Security Policies](https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Content-Security-Policy) tell (modern) browsers how resources served a particular site are handled - it also it possible to disallow script executions for specific locations. In a TYPO3 context it is suggested to disallow direct script execution at least for locations `/fileadmin/` and `/uploads/`.\n\n```\n# in fileadmin/.htaccess\n\u003cIfModule mod_headers.c\u003e\n\tHeader add Content-Security-Policy \"default-src 'self'; script-src 'none';\"\n\u003c/IfModule\u003e\n```\n\n### Credits\nThanks to Matteo Bonaker who reported this issue and to TYPO3 security team member Oliver Hader who fixed the issue.\n\n### References\n* https://typo3.org/security/advisory/typo3-core-sa-2020-006",
    "Origin": "UNSPECIFIED",
    "PublishedAt": "2020-05-13T23:40:09Z",
    "Severity": "HIGH",
    "Summary": "Backend Same-Site Request Forgery in TYPO3 CMS",
    "UpdatedAt": "2023-02-01T05:03:00Z",
    "WithdrawnAt": "",
    "CVSS": {
      "Score": 8,
      "VectorString": "CVSS:3.1/AV:N/AC:L/PR:L/UI:R/S:U/C:H/I:H/A:H"
    }
  },
  "Versions": [
    {
      "FirstPatchedVersion": {
        "Identifier": "10.4.2"
      },
      "VulnerableVersionRange": "\u003e= 10.0.0, \u003c 10.4.2"
    },
    {
      "FirstPatchedVersion": {
        "Identifier": "9.5.17"
      },
      "VulnerableVersionRange": "\u003e= 9.0.0, \u003c 9.5.17"
    }
  ]
}