{
  "Severity": "MODERATE",
  "UpdatedAt": "2025-05-20T19:35:22Z",
  "Package": {
    "Ecosystem": "COMPOSER",
    "Name": "typo3/cms-core"
  },
  "Advisory": {
    "DatabaseId": 295559,
    "Id": "GSA_kwCzR0hTQS05aHE5LWNyMzYtNHdwas4ABIKH",
    "GhsaId": "GHSA-9hq9-cr36-4wpj",
    "References": [
      {
        "Url": "https://github.com/TYPO3/typo3/security/advisories/GHSA-9hq9-cr36-4wpj"
      },
      {
        "Url": "https://nvd.nist.gov/vuln/detail/CVE-2025-47939"
      },
      {
        "Url": "https://github.com/TYPO3-CMS/core/commit/c265beed6e2c01817c534a226e80e593400f8255"
      },
      {
        "Url": "https://typo3.org/security/advisory/typo3-core-sa-2025-014"
      },
      {
        "Url": "https://github.com/advisories/GHSA-9hq9-cr36-4wpj"
      }
    ],
    "Identifiers": [
      {
        "Type": "GHSA",
        "Value": "GHSA-9hq9-cr36-4wpj"
      },
      {
        "Type": "CVE",
        "Value": "CVE-2025-47939"
      }
    ],
    "Description": "### Problem\nBy design, the file management module in TYPO3’s backend user interface has historically allowed the upload of any file type, with the exception of those that are directly executable in a web server context. This lack of restriction means it is possible to upload files that may be considered potentially harmful, such as executable binaries (e.g., `.exe` files), or files with inconsistent file extensions and MIME types (for example, a file incorrectly named with a `.png` extension but actually carrying the MIME type `application/zip`).\n\nAlthough such files are not directly executable through the web server, their presence can introduce indirect risks. For example, third-party services such as antivirus scanners or malware detection systems might flag or block access to the website for end users if suspicious files are found. This could negatively affect the availability or reputation of the site.\n\n### Solution\nUpdate to TYPO3 versions 9.5.51 ELTS, 10.4.50 ELTS, 11.5.44 ELTS, 12.4.31 LTS, 13.4.12 LTS that fix the problem described.\n\n\u003e [!NOTE]\n\u003e The mitigation strategies outlined below apply broadly to all file uploads handled through TYPO3's File Abstraction Layer (FAL), not just those performed via the backend interface. This means that any extension or custom integration leveraging FAL will also be subject to the new validation rules and configuration options. Developers are advised to review the implications for their code and refer to the [documentation of that change](https://docs.typo3.org/c/typo3/cms-core/main/en-us/Changelog/12.4.x/Important-106240-EnforceFile-extensionsAndMime-typeConsistencyInFileAbstractionLayer.html) for guidance.\n\n\u003e [!IMPORTANT]\n\u003e\n\u003e **Strong security defaults - Manual actions required**\n\u003e \n\u003e These versions introduce new configuration options to better control which files are permitted for upload and to improve consistency checks.\n\u003e \n\u003e A new configuration option, `$GLOBALS['TYPO3_CONF_VARS']['SYS']['miscfile_ext']`, has been added. This option allows administrators to explicitly define which file extensions should be permitted that are not already part of the built-in text or media file groups - examples include archive formats such as `zip` or `xz`.\n\u003e \n\u003e In addition, two new feature flags have been introduced to enhance security:\n\u003e * `security.system.enforceAllowedFileExtensions`, enforces the defined list of allowed file extensions. This flag is enabled by default in new TYPO3 installations, but remains disabled in existing installations to prevent breaking changes.\n\u003e * `security.system.enforceFileExtensionMimeTypeConsistency`, ensures that the uploaded file’s extension matches its actual MIME type, providing further validation of file integrity. This flag is active by default.\n\u003e \n\u003e It is recommended to configure the allowed file extensions via `$GLOBALS['TYPO3_CONF_VARS']['SYS']['miscfile_ext']` and to enable the feature flag `security.system.enforceAllowedFileExtensions` to enforce the restriction.\n\n### Credits\nThanks to Hamed Kohi for reporting this issue, and to TYPO3 core \u0026 security team member Oliver Hader for fixing it.",
    "Origin": "UNSPECIFIED",
    "PublishedAt": "2025-05-20T19:35:21Z",
    "Severity": "MODERATE",
    "Summary": "TYPO3 Allows Unrestricted File Upload in File Abstraction Layer",
    "UpdatedAt": "2025-05-21T04:39:45Z",
    "WithdrawnAt": "",
    "CVSS": {
      "Score": 5.4,
      "VectorString": "CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:N/I:L/A:L"
    }
  },
  "Versions": [
    {
      "FirstPatchedVersion": {
        "Identifier": "13.4.12"
      },
      "VulnerableVersionRange": "\u003e= 13.0.0, \u003c= 13.4.11"
    },
    {
      "FirstPatchedVersion": {
        "Identifier": "12.4.31"
      },
      "VulnerableVersionRange": "\u003e= 12.0.0, \u003c= 12.4.30"
    },
    {
      "FirstPatchedVersion": {
        "Identifier": "11.5.44"
      },
      "VulnerableVersionRange": "\u003e= 11.0.0, \u003c= 11.5.43"
    },
    {
      "FirstPatchedVersion": {
        "Identifier": "10.4.50"
      },
      "VulnerableVersionRange": "\u003e= 10.0.0, \u003c= 10.4.49"
    },
    {
      "FirstPatchedVersion": {
        "Identifier": "9.5.51"
      },
      "VulnerableVersionRange": "\u003e= 9.0.0, \u003c= 9.5.50"
    }
  ]
}