{
  "Identifier": "GHSA-hw4x-mcx5-9q36",
  "PackageSlug": "go/github.com/gravitational/teleport",
  "Title": "Teleport Proxy and Teleport Agents: SSRF to arbitrary hosts is possible from low privileged users",
  "Description": "### Impact\nAn authenticated attacker with valid credentials (user or host) can make non-blind Server-Side Request Forgery (SSRF) through the proxy and/or agents to arbitrary hosts.\n\nDuring investigation of this functionality, it was discovered that there are several permutations where this SSRF is possible. This release addresses all but one: a root proxy administrator with access to the root proxy credentials can make requests through leaf proxies in Trusted Clusters. This behavior will be restricted in future releases. For customers using Teleport in a Trusted Cluster configuration, we encourage leaf clusters to have network restrictions in place to mitigate SSRF. For example, we recommend restricting outbound network connections to only the Auth Service, your SSO provider, and any agents, databases or applications needed to be accessed from the proxy. If running in a cloud environment pay careful attention to what cloud resources are accessible from the proxy.\n\n### Patches\nFixed in versions 14.2.4, 13.4.13 and 12.4.31.\n\n### Workarounds\nStrict network controls from the Teleport Proxy and Teleport Agents reduce the potential exposure from this issue.\n\n### References\n* Fixed in PR: https://github.com/gravitational/teleport/pull/36127\n* https://cheatsheetseries.owasp.org/cheatsheets/Server_Side_Request_Forgery_Prevention_Cheat_Sheet.html#network-layer\n* https://www.cyber.gov.au/resources-business-and-government/maintaining-devices-and-systems/system-hardening-and-administration/network-hardening/implementing-network-segmentation-and-segregation\n",
  "Date": "2024-01-03",
  "Pubdate": "2024-01-03",
  "AffectedRange": "\u003c12.4.31||\u003e=13.0.0 \u003c13.4.13||\u003e=14.0.0 \u003c14.2.4",
  "FixedVersions": [
    "13.4.13",
    "14.2.4",
    "12.4.31"
  ],
  "AffectedVersions": "All versions before 12.4.31, all versions starting from 13.0.0 before 13.4.13, all versions starting from 14.0.0 before 14.2.4",
  "NotImpacted": "All versions starting from 12.4.31 before 13.0.0, all versions starting from 13.4.13 before 14.0.0, all versions starting from 14.2.4",
  "Solution": "Upgrade to versions 13.4.13, 14.2.4, 12.4.31 or above.",
  "Urls": [
    "https://github.com/gravitational/teleport/security/advisories/GHSA-hw4x-mcx5-9q36",
    "https://github.com/gravitational/teleport/pull/36127",
    "https://github.com/gravitational/teleport/commit/bb2d67d357e868254a21ed7cb132030d7bf9fcbc",
    "https://github.com/advisories/GHSA-hw4x-mcx5-9q36"
  ],
  "CvssV2": "",
  "CvssV3": "",
  "UUID": "ab169c4c-7944-408d-842e-9538a48c6747"
}