{
  "Severity": "MODERATE",
  "UpdatedAt": "2025-09-08T20:45:52Z",
  "Package": {
    "Ecosystem": "PIP",
    "Name": "ethyca-fides"
  },
  "Advisory": {
    "DatabaseId": 310552,
    "Id": "GSA_kwCzR0hTQS1mcTM0LXh3NmMtZnBoZs4ABL0Y",
    "GhsaId": "GHSA-fq34-xw6c-fphf",
    "References": [
      {
        "Url": "https://github.com/ethyca/fides/security/advisories/GHSA-fq34-xw6c-fphf"
      },
      {
        "Url": "https://github.com/ethyca/fides/commit/59903c195e2f9f8915a1db94950aefd557033a5c"
      },
      {
        "Url": "https://github.com/ethyca/fides/releases/tag/2.69.1"
      },
      {
        "Url": "https://nvd.nist.gov/vuln/detail/CVE-2025-57816"
      },
      {
        "Url": "https://github.com/advisories/GHSA-fq34-xw6c-fphf"
      }
    ],
    "Identifiers": [
      {
        "Type": "GHSA",
        "Value": "GHSA-fq34-xw6c-fphf"
      },
      {
        "Type": "CVE",
        "Value": "CVE-2025-57816"
      }
    ],
    "Description": "### Summary\n\nThe Fides Webserver API's built-in IP-based rate limiting is ineffective in environments with CDNs, proxies or load balancers. The system incorrectly applies rate limits based on directly connected infrastructure IPs rather than client IPs, and stores counters in-memory rather than in a shared store. This allows attackers to bypass intended rate limits and potentially cause denial of service.\n\nThis vulnerability only affects deployments relying on Fides's built-in rate limiting for protection. Deployments using external rate limiting solutions (WAFs, API gateways, etc.) are not affected.\n\n### Details\n\nThe vulnerability has two components:\n\n1. Rate limiting uses the immediate connection source IP instead of the actual client IP\n2. Rate limit counters are maintained in-memory per container rather than in a shared store\n\nIn production environments, these issues allow clients to exceed intended rate limits and enable attackers to trigger rate limits on infrastructure IPs, causing legitimate clients to receive 429 responses.\n\n### Impact\n\nThis vulnerability affects availability, allowing attackers to:\n\n- Bypass rate limits, potentially leading to resource exhaustion\n- Cause a denial of service for legitimate clients by deliberately triggering rate limits on infrastructure IPs\n\n### Patches\n\nThe vulnerability has been patched in Fides version `2.69.1`. Users are advised to upgrade to this version or later to secure their systems against this threat.\n\n### Workarounds\n\nThere are no application-level workarounds. However, rate limiting may instead be implemented externally at the infrastructure level using a WAF, API Gateway, or similar technology.\n\n### Risk Level\n\nThis vulnerability has been assigned a severity of MEDIUM.",
    "Origin": "UNSPECIFIED",
    "PublishedAt": "2025-09-08T20:45:51Z",
    "Severity": "MODERATE",
    "Summary": "Fides Webserver API Rate Limiting Vulnerability in Proxied Environments",
    "UpdatedAt": "2025-09-13T04:41:25Z",
    "WithdrawnAt": "",
    "CVSS": {
      "Score": 7.5,
      "VectorString": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H"
    }
  },
  "Versions": [
    {
      "FirstPatchedVersion": {
        "Identifier": "2.69.1"
      },
      "VulnerableVersionRange": "\u003c 2.69.1"
    }
  ]
}