{
  "Severity": "LOW",
  "UpdatedAt": "2025-09-08T20:05:21Z",
  "Package": {
    "Ecosystem": "PIP",
    "Name": "ethyca-fides"
  },
  "Advisory": {
    "DatabaseId": 310550,
    "Id": "GSA_kwCzR0hTQS1ycHc4LTgydjktM3E4N84ABL0W",
    "GhsaId": "GHSA-rpw8-82v9-3q87",
    "References": [
      {
        "Url": "https://github.com/ethyca/fides/security/advisories/GHSA-rpw8-82v9-3q87"
      },
      {
        "Url": "https://github.com/ethyca/fides/commit/8daec4f5ad3daf0f0bdab4814f6757eb0965104b"
      },
      {
        "Url": "https://github.com/ethyca/fides/releases/tag/2.69.1"
      },
      {
        "Url": "https://nvd.nist.gov/vuln/detail/CVE-2025-57766"
      },
      {
        "Url": "https://github.com/advisories/GHSA-rpw8-82v9-3q87"
      }
    ],
    "Identifiers": [
      {
        "Type": "GHSA",
        "Value": "GHSA-rpw8-82v9-3q87"
      },
      {
        "Type": "CVE",
        "Value": "CVE-2025-57766"
      }
    ],
    "Description": "### Summary\n\nAdmin UI user password changes in Fides do not invalidate active user sessions, creating a vulnerability chaining opportunity where attackers who have obtained session tokens through other attack vectors (such as XSS) can maintain access even after password reset. This issue is not directly exploitable on its own and requires a prerequisite vulnerability to obtain valid session tokens in the first place.\n\n### Details\n\nFides uses encrypted authentication tokens with extended expiration periods. When a password is changed via password reset endpoints, the system updates the password hash in the database but does not invalidate existing client sessions or tokens. The authentication system validates tokens based on their cryptographic integrity and expiration time, not against the current password state.\n\nThe frontend application stores authentication state in browser local storage, which persists across browser sessions until explicit logout or natural token expiration.\n\nThis behavior alone does not constitute a directly exploitable vulnerability. The security issue only becomes exploitable when chained with other vulnerabilities or conditions that allow attackers to obtain valid session tokens, such as:\n\n- Cross-Site Scripting (XSS) attacks that can access browser storage where tokens are stored\n- Session hijacking through network interception\n- Malware on the user's device that can read browser storage\n- Physical device access where attackers can access browser storage directly\n\n### Impact\n\nThis vulnerability serves as a persistence mechanism in attack chains rather than a primary attack vector. When chained with token theft vulnerabilities, it allows attackers to:\n\n- Maintain access beyond the remediation window when users change passwords in response to suspected compromise\n- Extend the impact timeframe of client-side attacks from minutes/hours to potentially an extended period\n- Defeat common incident response procedures that rely on password changes to secure compromised accounts\n\nStored tokens persist across browser sessions until explicit logout or natural expiration.\n\n### Patches\n\nThe vulnerability has been patched in Fides version `2.69.1`. Users are advised to upgrade to this version or later to secure their systems against this threat.\n\n### Workarounds\n\nThere are no workarounds.\n\n### Severity\n\nThis vulnerability has been assigned a severity of **LOW** because:\n\n- No direct exploitability - requires chaining with other vulnerabilities\n- High attack complexity - multiple successful exploits needed\n- Limited standalone impact - only extends existing compromises\n- Aligns with industry standard classifications of LOW severity for session invalidation failures\n\nThis is fundamentally a defense-in-depth issue rather than a primary security vulnerability.",
    "Origin": "UNSPECIFIED",
    "PublishedAt": "2025-09-08T20:05:19Z",
    "Severity": "LOW",
    "Summary": "Fides' Admin UI User Password Change Does Not Invalidate Current Session",
    "UpdatedAt": "2025-09-13T04:41:03Z",
    "WithdrawnAt": "",
    "CVSS": {
      "Score": 4.8,
      "VectorString": "CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:U/C:L/I:L/A:N"
    }
  },
  "Versions": [
    {
      "FirstPatchedVersion": {
        "Identifier": "2.69.1"
      },
      "VulnerableVersionRange": "\u003c 2.69.1"
    }
  ]
}