{
  "Severity": "LOW",
  "UpdatedAt": "2025-09-08T20:45:25Z",
  "Package": {
    "Ecosystem": "PIP",
    "Name": "ethyca-fides"
  },
  "Advisory": {
    "DatabaseId": 310551,
    "Id": "GSA_kwCzR0hTQS03cTYyLXI4OHItajVnd84ABL0X",
    "GhsaId": "GHSA-7q62-r88r-j5gw",
    "References": [
      {
        "Url": "https://github.com/ethyca/fides/security/advisories/GHSA-7q62-r88r-j5gw"
      },
      {
        "Url": "https://github.com/ethyca/fides/commit/59903c195e2f9f8915a1db94950aefd557033a5c"
      },
      {
        "Url": "https://github.com/ethyca/fides/releases/tag/2.69.1"
      },
      {
        "Url": "https://nvd.nist.gov/vuln/detail/CVE-2025-57815"
      },
      {
        "Url": "https://github.com/advisories/GHSA-7q62-r88r-j5gw"
      }
    ],
    "Identifiers": [
      {
        "Type": "GHSA",
        "Value": "GHSA-7q62-r88r-j5gw"
      },
      {
        "Type": "CVE",
        "Value": "CVE-2025-57815"
      }
    ],
    "Description": "### Summary\n\nThe Fides Admin UI login endpoint relies on a general IP-based rate limit for all API traffic and lacks specific anti-automation controls designed to protect against brute-force attacks. This could allow attackers to conduct credential testing attacks, such as credential stuffing or password spraying, which poses a risk to accounts with weak or previously compromised passwords.\n\n### Details\n\nFides uses a configurable, system-wide rate limit to control traffic from any single IP address. Because this single limit must be set high enough to accommodate endpoints that receive a large volume of legitimate traffic, it offers only weak protection for the login endpoint. The system is not equipped with more advanced protections tailored specifically for authentication\n\n### Impact\n\nAlthough password complexity requirements and the global rate limit make a traditional brute-force attack against a single account  difficult, the lack of authentication-specific protections exposes Fides to more targeted attacks. An attacker could use automated tools to test credentials obtained from data breaches or guess common passwords across multiple user accounts. If an attacker successfully compromises an account, they would gain full access to that user's privileges within the Fides Admin UI.\n\n### Patches\n\nThe vulnerability has been patched in Fides version `2.69.1`. Users are advised to upgrade to this version or later to secure their systems against this threat.\n\n### Workarounds\n\nFor organizations with commercial Fides Enterprise licenses, configuring Single Sign-On (SSO) through an OIDC provider (like Azure, Google, or Okta) is an effective workaround. When OIDC SSO is enabled, username/password authentication can be disabled entirely, which eliminates this attack vector. This functionality is not available for Fides Open Source users.\n\n### Risk Level\n\nThis vulnerability has been assigned a severity of **LOW**.\n\nThis is fundamentally a security hardening issue. While the lack of authentication-specific rate limiting could enable credential stuffing attacks, several factors limit the risk: existing global rate limits provide baseline protection, password complexity requirements prevent trivial brute-force attacks, and successful exploitation requires attackers to already possess valid credentials from external breaches.",
    "Origin": "UNSPECIFIED",
    "PublishedAt": "2025-09-08T20:45:24Z",
    "Severity": "LOW",
    "Summary": "Fides has a Lack of Brute-Force Protections on Authentication Endpoints",
    "UpdatedAt": "2025-09-13T04:41:13Z",
    "WithdrawnAt": "",
    "CVSS": {
      "Score": 6.5,
      "VectorString": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:N"
    }
  },
  "Versions": [
    {
      "FirstPatchedVersion": {
        "Identifier": "2.69.1"
      },
      "VulnerableVersionRange": "\u003c 2.69.1"
    }
  ]
}