{
  "Severity": "MODERATE",
  "UpdatedAt": "2023-11-08T17:52:30Z",
  "Package": {
    "Ecosystem": "PIP",
    "Name": "ethyca-fides"
  },
  "Advisory": {
    "DatabaseId": 225236,
    "Id": "GSA_kwCzR0hTQS0zdnBmLW1jajctNWgzOM4AA2_U",
    "GhsaId": "GHSA-3vpf-mcj7-5h38",
    "References": [
      {
        "Url": "https://github.com/ethyca/fides/security/advisories/GHSA-3vpf-mcj7-5h38"
      },
      {
        "Url": "https://github.com/ethyca/fides/commit/50360a0e24aac858459806bb140bb1c4b71e67a1"
      },
      {
        "Url": "https://github.com/ethyca/fides/releases/tag/2.23.3"
      },
      {
        "Url": "https://nvd.nist.gov/vuln/detail/CVE-2023-47114"
      },
      {
        "Url": "https://github.com/advisories/GHSA-3vpf-mcj7-5h38"
      }
    ],
    "Identifiers": [
      {
        "Type": "GHSA",
        "Value": "GHSA-3vpf-mcj7-5h38"
      },
      {
        "Type": "CVE",
        "Value": "CVE-2023-47114"
      }
    ],
    "Description": "### Impact\n\nThe Fides web application allows data subject users to request access to their personal data. If the request is approved by the data controller user operating the Fides web application, the data subject's personal data can then retrieved from connected systems and data stores before being bundled together as a data subject access request package for the data subject to download. Supported data formats for the package include json and csv, but the most commonly used format is a series of HTML files compressed in a ZIP file. Once downloaded and unzipped, the data subject user can browse the HTML files on their local machine.\n\nIt was identified that there was no validation of input coming from e.g. the connected systems and data stores which is later reflected in the downloaded data. This can result in an HTML injection that can be abused e.g. for phishing attacks or malicious JavaScript code execution, but only in the context of the data subject's browser accessing a HTML page using the `file://` protocol.\n\nExploitation is limited to rogue Admin UI users, malicious connected system / data store users, and the data subject user if tricked via social engineering into submitting malicious data themselves.\n\n### Patches\nThe vulnerability has been patched in Fides version `TBC`. Users are advised to upgrade to this version or later to secure their systems against this threat.\n\n### Workarounds\nOnly Fides deployments which have been configured to use `html` as the package format in the [storage destination](https://docs.ethyca.com/dev-docs/configuration/privacy-requests/storage-destinations) are vulnerable. Using `json` or `csv` instead eliminates this vulnerability. \n",
    "Origin": "UNSPECIFIED",
    "PublishedAt": "2023-11-08T17:52:28Z",
    "Severity": "MODERATE",
    "Summary": "Ethyca Fides HTML Injection Vulnerability in HTML-Formatted DSR Packages",
    "UpdatedAt": "2023-11-09T16:14:12Z",
    "WithdrawnAt": "",
    "CVSS": {
      "Score": 4.3,
      "VectorString": "CVSS:3.1/AV:N/AC:L/PR:H/UI:R/S:U/C:L/I:L/A:L"
    }
  },
  "Versions": [
    {
      "FirstPatchedVersion": {
        "Identifier": "2.23.3"
      },
      "VulnerableVersionRange": "\u003e= 2.15.1, \u003c 2.23.3"
    }
  ]
}