{
  "Severity": "LOW",
  "UpdatedAt": "2024-11-26T16:36:53Z",
  "Package": {
    "Ecosystem": "PIP",
    "Name": "ethyca-fides"
  },
  "Advisory": {
    "DatabaseId": 269476,
    "Id": "GSA_kwCzR0hTQS12N3ZtLXJobWctOGoycs4ABByk",
    "GhsaId": "GHSA-v7vm-rhmg-8j2r",
    "References": [
      {
        "Url": "https://github.com/ethyca/fides/security/advisories/GHSA-v7vm-rhmg-8j2r"
      },
      {
        "Url": "https://github.com/ethyca/fides/commit/ce664da46ab7f86d29583ebc34f2ff776f0aa6c2"
      },
      {
        "Url": "https://nvd.nist.gov/vuln/detail/CVE-2024-52008"
      },
      {
        "Url": "https://github.com/advisories/GHSA-v7vm-rhmg-8j2r"
      }
    ],
    "Identifiers": [
      {
        "Type": "GHSA",
        "Value": "GHSA-v7vm-rhmg-8j2r"
      },
      {
        "Type": "CVE",
        "Value": "CVE-2024-52008"
      }
    ],
    "Description": "### Summary\n\nThe user invite acceptance API endpoint lacks server-side password policy enforcement, allowing users to set arbitrarily weak passwords by bypassing client-side validation. While the UI enforces password complexity requirements, direct API calls can circumvent these checks, enabling the creation of accounts with passwords as short as a single character.\n\n### Details\n\nWhen an email messaging provider is enabled and a new user account is created in the system, an invite email containing a special link is sent to the new user's email address. This link directs the new user to a page where they can set their initial password. While the user interface implements password complexity checks, these validations are only performed client-side. The underlying `/api/v1/user/accept-invite` API endpoint does not implement the same password policy validations.\n\n### Impact\n\nThis vulnerability allows an invited user to set an extremely weak password for their own account during the initial account setup process. Therefore that specific user's account can be compromised easily by an attacker guessing or brute forcing the password.\n\n### Patches\n\nThe vulnerability has been patched in Fides version `2.50.0`. Users are advised to upgrade to this version or later to secure their systems against this threat.\n\n### Workarounds\n\nThere are no workarounds.\n\n### Severity\n\nThis vulnerability has been assigned a severity of LOW.\n\nUsing CVSS v3.1 it could be scored as `CVSS:3.1/AV:N/AC:L/PR:L/UI:R/S:U/C:H/I:N/A:N` (5.7 Medium/Moderate), but the likelihood of a user bypassing client-side password complexity rules to set their own password is very low.  ",
    "Origin": "UNSPECIFIED",
    "PublishedAt": "2024-11-26T16:36:52Z",
    "Severity": "LOW",
    "Summary": "Password Policy Bypass Vulnerability in Fides Webserver User Accept Invite API",
    "UpdatedAt": "2024-11-26T21:43:30Z",
    "WithdrawnAt": "",
    "CVSS": {
      "Score": 5.7,
      "VectorString": "CVSS:3.1/AV:N/AC:L/PR:L/UI:R/S:U/C:H/I:N/A:N"
    }
  },
  "Versions": [
    {
      "FirstPatchedVersion": {
        "Identifier": "2.50.0"
      },
      "VulnerableVersionRange": "\u003c 2.50.0"
    }
  ]
}