{
  "id": "GHSA-7mm3-vfg8-7rg6",
  "modified": "2025-07-31T16:43:43Z",
  "published": "2025-05-15T14:05:32Z",
  "aliases": [
    "GO-2025-3686"
  ],
  "summary": "Babylon Finality Provider `MsgCommitPubRandList` replay attack",
  "details": "### Summary\n\nA high vulnerability exists in the Babylon protocol's x/finality module due to a lack of domain separation in signed messages, combined with insufficient validation in the MsgCommitPubRandList handler. Specifically, the handler does not enforce that the submitted Commitment field is 32 bytes long. This allows an attacker to replay a signature originally generated for a different message (e.g., a Proof-of-Possession in MsgCreateFinalityProvider) as a MsgCommitPubRandList. By crafting the message parameters, an attacker can use the typically 20-byte address bytes (from the PoP context) to form the StartHeight, NumPubRand, and a shorter-than-expected Commitment (e.g., 4 bytes). The replayed signature will pass verification for this crafted message, leading to the injection of an invalid PubRand commitment.\n\n### Impact\n\nSuccessful exploitation of this vulnerability, specifically via the PoP signature replay, allows an attacker to store an invalid PubRand commitment (with a non-standard length, e.g., 4 bytes) for a targeted Finality Provider (FP). Despite the commitment itself being malformed, it's the associated StartHeight and NumPubRand (derived from the replayed address bytes and typically very large) that cause severe consequences\n\n### Future recommendations\n\nTo minimize future risk of such attacks, all finality providers should:\n1.  Never re-use your finality provider EOTS across the networks (e.g., the testnet) or for any other purpose. \n2. Never use EOTS keys to sign any other data than relevant to in-protocol messages. Ideally EOTS key should only be used to:\n    - Sign initial proof of possession message\n    - Sign periodic randomness commits\n    - Sign finality votes with every block\n\n### Finder\nVulnerability discovered by:\n- Marco Hextor\n- https://x.com/marcohextor\n- @marcohextor",
  "affected": [
    {
      "package": {
        "ecosystem": "Go",
        "name": "github.com/babylonlabs-io/babylon",
        "purl": "pkg:golang/github.com/babylonlabs-io/babylon"
      },
      "ranges": [
        {
          "type": "SEMVER",
          "events": [
            {
              "introduced": "0"
            },
            {
              "fixed": "1.1.0"
            }
          ]
        }
      ],
      "database_specific": {
        "source": "https://github.com/github/advisory-database/blob/main/advisories/github-reviewed/2025/05/GHSA-7mm3-vfg8-7rg6/GHSA-7mm3-vfg8-7rg6.json"
      }
    }
  ],
  "references": [
    {
      "type": "WEB",
      "url": "https://github.com/babylonlabs-io/babylon/security/advisories/GHSA-7mm3-vfg8-7rg6"
    },
    {
      "type": "WEB",
      "url": "https://github.com/babylonlabs-io/babylon/commit/cb5d0ecae5cebc116d09296baaed25f715f904df"
    },
    {
      "type": "PACKAGE",
      "url": "https://github.com/babylonlabs-io/babylon"
    },
    {
      "type": "WEB",
      "url": "https://pkg.go.dev/vuln/GO-2025-3686"
    }
  ]
}