{
  "id": "GHSA-6jgm-j7h2-2fqg",
  "modified": "2025-05-05T21:58:29Z",
  "published": "2025-04-28T20:27:29Z",
  "aliases": [
    "CVE-2025-46327",
    "GO-2025-3650"
  ],
  "related": [
    "CGA-365m-959h-w3cq",
    "CGA-5h92-8f64-g6jr",
    "CGA-77vg-g238-4rx3",
    "CGA-7mh8-pxhc-84x3",
    "CGA-7pc8-32jr-8vgw",
    "CGA-99fw-g9fr-fhrm",
    "CGA-9vcj-rm9r-jm3f",
    "CGA-g4pp-rp7m-4jqf",
    "CGA-m9w2-q3qh-rm4x"
  ],
  "summary": "Go Snowflake Driver has race condition when checking access to Easy Logging configuration file",
  "details": "# Issue\nSnowflake discovered and remediated a vulnerability in the Go Snowflake Driver (“Driver”). When using the Easy Logging feature on Linux and macOS, the Driver didn’t correctly verify the permissions of the logging configuration file, potentially allowing an attacker with local access to overwrite the configuration and gain control over logging level and output location.\n\nThis vulnerability affects Driver versions from 1.7.0 up to, but not including, 1.13.3. Snowflake fixed the issue in version 1.13.3.\n\n# Vulnerability Details\nWhen using the Easy Logging feature on Linux and macOS, the Driver reads logging configuration from a user-provided file. On Linux and macOS the Driver verifies that the configuration file can be written to only by its owner. That check was vulnerable to a Time-of-Check to Time-of-Use (TOCTOU) race condition and failed to verify that the file owner matches the user running the Driver. This could allow a local attacker with write access to the configuration file or the directory containing it to overwrite the configuration and gain control over logging level and output location.\n\n# Solution\nSnowflake released version 1.13.3 of the Go Snowflake Driver, which fixes this issue. We recommend users upgrade to version 1.13.3.\n\n# Additional Information\nIf you discover a security vulnerability in one of our products or websites, please report the issue to Snowflake through our Vulnerability Disclosure Program hosted at HackerOne. For more information, please see our [Vulnerability Disclosure Policy](https://hackerone.com/snowflake?type=team).",
  "affected": [
    {
      "package": {
        "ecosystem": "Go",
        "name": "github.com/snowflakedb/gosnowflake",
        "purl": "pkg:golang/github.com/snowflakedb/gosnowflake"
      },
      "ranges": [
        {
          "type": "SEMVER",
          "events": [
            {
              "introduced": "1.7.0"
            },
            {
              "fixed": "1.13.3"
            }
          ]
        }
      ],
      "database_specific": {
        "source": "https://github.com/github/advisory-database/blob/main/advisories/github-reviewed/2025/04/GHSA-6jgm-j7h2-2fqg/GHSA-6jgm-j7h2-2fqg.json"
      }
    }
  ],
  "references": [
    {
      "type": "WEB",
      "url": "https://github.com/snowflakedb/gosnowflake/security/advisories/GHSA-6jgm-j7h2-2fqg"
    },
    {
      "type": "ADVISORY",
      "url": "https://nvd.nist.gov/vuln/detail/CVE-2025-46327"
    },
    {
      "type": "WEB",
      "url": "https://github.com/snowflakedb/gosnowflake/commit/ba94a4800e23621eff558ef18ce4b96ec5489ff0"
    },
    {
      "type": "PACKAGE",
      "url": "https://github.com/snowflakedb/gosnowflake"
    },
    {
      "type": "WEB",
      "url": "https://pkg.go.dev/vuln/GO-2025-3650"
    }
  ]
}