{
  "Severity": "LOW",
  "UpdatedAt": "2025-02-19T17:48:27Z",
  "Package": {
    "Ecosystem": "GO",
    "Name": "github.com/authelia/authelia/v4"
  },
  "Advisory": {
    "DatabaseId": 281124,
    "Id": "GSA_kwCzR0hTQS1tNW1mLTM5NjMtNHgyNs4ABEok",
    "GhsaId": "GHSA-m5mf-3963-4x26",
    "References": [
      {
        "Url": "https://github.com/authelia/authelia/security/advisories/GHSA-m5mf-3963-4x26"
      },
      {
        "Url": "https://github.com/authelia/authelia/commit/d4a54189aa6563912f9427b96dcb01eacafa785c"
      },
      {
        "Url": "https://nvd.nist.gov/vuln/detail/CVE-2025-24806"
      },
      {
        "Url": "https://github.com/advisories/GHSA-m5mf-3963-4x26"
      }
    ],
    "Identifiers": [
      {
        "Type": "GHSA",
        "Value": "GHSA-m5mf-3963-4x26"
      },
      {
        "Type": "CVE",
        "Value": "CVE-2025-24806"
      }
    ],
    "Description": "### Summary\n\nIf users are allowed to sign in via both username and email the regulation system treats these as separate login events. This leads to the regulation limitations being effectively doubled assuming an attacker using brute-force to find a user password. It's important to note that due to the effective operation of regulation where no user-facing sign of their regulation ban being visible either via timing or via API responses, it's effectively impossible to determine if a failure occurs due to a bad username password combination, or a effective ban blocking the attempt which heavily mitigates any form of brute-force.\n\n### Details\n\nThis occurs because the records and counting process for this system uses the method utilized for sign in rather than the effective username attribute.\n\n### Impact\n\nThis has a minimal impact on account security, this impact is increased naturally in scenarios when there is no two-factor authentication required and weak passwords are used. This makes it a bit easier to brute-force a password.\n\n### Workarounds\n\n1. Do not heavily modify the default settings in a way that ends up with shorter or less frequent regulation bans. The default settings effectively mitigate any potential for this issue to be exploited.\n2. Disable the ability for users to login via an email address.",
    "Origin": "UNSPECIFIED",
    "PublishedAt": "2025-02-19T17:47:47Z",
    "Severity": "LOW",
    "Summary": "Authelia applies regulation separately to Username-based logins to Email-based logins",
    "UpdatedAt": "2025-02-19T20:00:07Z",
    "WithdrawnAt": "",
    "CVSS": {
      "Score": 0,
      "VectorString": ""
    }
  },
  "Versions": [
    {
      "FirstPatchedVersion": {
        "Identifier": "4.38.19"
      },
      "VulnerableVersionRange": "\u003c 4.38.19"
    }
  ]
}