{
  "Severity": "MODERATE",
  "UpdatedAt": "2024-11-22T20:11:45Z",
  "Package": {
    "Ecosystem": "RUST",
    "Name": "surrealdb-core"
  },
  "Advisory": {
    "DatabaseId": 268770,
    "Id": "GSA_kwCzR0hTQS1qYzU1LTI0NmMtcjg4Zs4ABBni",
    "GhsaId": "GHSA-jc55-246c-r88f",
    "References": [
      {
        "Url": "https://github.com/surrealdb/surrealdb/security/advisories/GHSA-jc55-246c-r88f"
      },
      {
        "Url": "https://github.com/surrealdb/surrealdb/pull/5079"
      },
      {
        "Url": "https://github.com/surrealdb/surrealdb/pull/5092"
      },
      {
        "Url": "https://github.com/advisories/GHSA-jc55-246c-r88f"
      }
    ],
    "Identifiers": [
      {
        "Type": "GHSA",
        "Value": "GHSA-jc55-246c-r88f"
      }
    ],
    "Description": "Roles for system users are stored as generic `Ident` values and converted as strings and into the `Role` enum whenever IAM operations are to be performed that require processing the user roles. This conversion expects those identifiers to only contain the values `owner`, `editor` and `viewer` and will return an error otherwise. However, the `unwrap()` method would be called on this result when implementing `std::convert::From\u003c\u0026Ident\u003e for Role`, which would result in a panic where a nonexistent role was used.\n\n### Impact\n\nA privileged user with the `owner` role at any level in SurrealDB would be able to define a user with `DEFINE USER` with an nonexistent role, which would panic when being converted to a `Role` enum in order to perform certain IAM operations with that user. These operations included signing in with the user. This would crash the server, leading to denial of service.\n\n### Patches\n\nUnexistent roles are no longer accepted during parsing when defining a user. Even when successfully associated with a user, referencing unexistent roles will no longer result in a panic and will instead throw an `InvalidRole` error.\n\n- Version 2.1.0 and later are not affected by this issue.\n\n### Workarounds\n\nAffected users who are unable to update may want to limit access to users with the `owner` role at any level to trusted parties only. To limit the impact of the denial of service, SurrealDB administrators may also want to ensure that the SurrealDB process is running so that it can be automatically re-started after a crash.\n\n### References\n\n- #5079\n- #5092",
    "Origin": "UNSPECIFIED",
    "PublishedAt": "2024-11-22T20:11:44Z",
    "Severity": "MODERATE",
    "Summary": "SurrealDB has an Uncaught Exception Handling Nonexistent Role",
    "UpdatedAt": "2024-11-22T20:11:45Z",
    "WithdrawnAt": "",
    "CVSS": {
      "Score": 4.9,
      "VectorString": "CVSS:3.1/AV:N/AC:L/PR:H/UI:N/S:U/C:N/I:N/A:H"
    }
  },
  "Versions": [
    {
      "FirstPatchedVersion": {
        "Identifier": "2.1.0"
      },
      "VulnerableVersionRange": "\u003c 2.1.0"
    }
  ]
}