{
  "Severity": "HIGH",
  "UpdatedAt": "2025-09-29T17:53:33Z",
  "Package": {
    "Ecosystem": "MAVEN",
    "Name": "io.minio:minio"
  },
  "Advisory": {
    "DatabaseId": 314361,
    "Id": "GSA_kwCzR0hTQS1oN3JoLXhmcGotaHBjbc4ABMv5",
    "GhsaId": "GHSA-h7rh-xfpj-hpcm",
    "References": [
      {
        "Url": "https://github.com/minio/minio-java/security/advisories/GHSA-h7rh-xfpj-hpcm"
      },
      {
        "Url": "https://github.com/minio/minio-java/commit/f7a98d06b25e5464bdd4811b044e25ff9101d37f"
      },
      {
        "Url": "https://github.com/minio/minio-java/releases/tag/8.6.0"
      },
      {
        "Url": "https://nvd.nist.gov/vuln/detail/CVE-2025-59952"
      },
      {
        "Url": "https://github.com/advisories/GHSA-h7rh-xfpj-hpcm"
      }
    ],
    "Identifiers": [
      {
        "Type": "GHSA",
        "Value": "GHSA-h7rh-xfpj-hpcm"
      },
      {
        "Type": "CVE",
        "Value": "CVE-2025-59952"
      }
    ],
    "Description": "#### Description\nIn minio-java versions prior to 8.6.0, XML tag values containing references to system properties or environment variables were automatically substituted with their actual values during processing. This unintended behavior could lead to the exposure of sensitive information, including credentials, file paths, or system configuration details, if such references were present in XML content from untrusted sources.\n\n#### Affected Versions\n- minio-java \u003c 8.6.0\n\nAll applications utilizing affected versions of minio-java for parsing XML with potentially untrusted input are vulnerable.\n\n#### Impact\nThis vulnerability poses a high risk of information disclosure. Attackers could craft malicious XML inputs to extract sensitive data from the system's properties or environment variables, potentially compromising security in applications relying on minio-java for object storage operations.\n\n#### Patches\nThe issue is resolved in minio-java version 8.6.0 and later. In these versions, automatic substitution of XML tag values with system properties or environment variables has been disabled.\n\nUsers are strongly advised to upgrade to minio-java 8.6.0 or a newer release to mitigate the vulnerability.\n\n#### Workarounds\nNo full workarounds exist without upgrading the library. As interim measures:\n\n- Refrain from processing XML data from untrusted or external sources.\n- Implement input sanitization or validation to detect and remove references to \n  system properties or environment variables in XML content.",
    "Origin": "UNSPECIFIED",
    "PublishedAt": "2025-09-29T17:53:31Z",
    "Severity": "HIGH",
    "Summary": "MinIO Java Client XML Tag Value Substitution Vulnerability",
    "UpdatedAt": "2025-09-30T15:14:29Z",
    "WithdrawnAt": "",
    "CVSS": {
      "Score": 0,
      "VectorString": ""
    }
  },
  "Versions": [
    {
      "FirstPatchedVersion": {
        "Identifier": "8.6.0"
      },
      "VulnerableVersionRange": "\u003c 8.6.0"
    }
  ]
}