{
  "Identifier": "GHSA-g753-jx37-7xwh",
  "PackageSlug": "npm/jsrsasign",
  "Title": "ECDSA signature vulnerability of Minerva timing attack in jsrsasign",
  "Description": "### Impact\nECDSA side-channel attack named [Minerava](https://minerva.crocs.fi.muni.cz/) have been found and it was found that it affects to jsrsasign.\n\nExecution time of thousands signature generation have been observed then EC private key which is scalar value may be recovered since point and scalar multiplication time depends on bits of scalar. In jsrsasign 8.0.13 or later, execution time of EC point and scalar multiplication is almost constant and fixed for the issue.\n\n- Minerva is one of timing attack or side channel attack for EC.\n- If you don't use ECDSA class, you are not affected the vulnerability.\n- The vulnerability is that attacker may guess private key by checking processing time of EC key generation or ECDSA signing.\n- The cause issue is that point multiplication processing time in ECDSA signing is depends on private key value.\n- After 8.0.13, processing time of point multiplication in ECDSA signing have become constant for key value in theory.\n\n### Patches\nUsers using ECDSA signature generation should upgrade to 8.0.13 or later.\n\n### Workarounds\nThere is no workarounds in jsrsasign. Update jsrsasign or use other ECDSA library.\n\n### ACKNOWLEDGEMENT\nThanks to Jan Jancar @J08nY, Petr Svenda and Vladimir Sedlacek of Masaryk University in Czech Republic to find and report this vulnerability.\n\n### References\nhttps://minerva.crocs.fi.muni.cz/\nhttps://www.npmjs.com/advisories/1505\nhttps://github.com/kjur/jsrsasign/issues/411",
  "Date": "2021-09-22",
  "Pubdate": "2020-06-30",
  "AffectedRange": "\u003e=4.0.0 \u003c8.0.13",
  "FixedVersions": [
    "8.0.13"
  ],
  "AffectedVersions": "All versions starting from 4.0.0 before 8.0.13",
  "NotImpacted": "All versions before 4.0.0, all versions starting from 8.0.13",
  "Solution": "Upgrade to version 8.0.13 or above.",
  "Urls": [
    "https://github.com/kjur/jsrsasign/security/advisories/GHSA-g753-jx37-7xwh",
    "https://github.com/kjur/jsrsasign/issues/411",
    "https://github.com/kjur/jsrsasign/commit/9dcb89c57408a3d4b5b66aa9138426bd92819e73",
    "https://minerva.crocs.fi.muni.cz/",
    "https://www.npmjs.com/advisories/1505",
    "https://github.com/kjur/jsrsasign/releases/tag/8.0.13",
    "https://snyk.io/vuln/SNYK-JS-JSRSASIGN-561755",
    "https://github.com/advisories/GHSA-g753-jx37-7xwh"
  ],
  "CvssV2": "",
  "CvssV3": "",
  "UUID": "0d6f9385-fc73-420f-b100-43258d69d0c4"
}