{
  "Identifier": "GHSA-qxx8-292g-2w66",
  "PackageSlug": "nuget/Microsoft.Bot.Connector",
  "Title": "Improper Authentication",
  "Description": "### Impact\nA maliciously crafted claim may be incorrectly authenticated by the bot. Impacts bots that are not configured to be used as a Skill. This vulnerability requires an an attacker to have internal knowledge of the bot.\n\n### Patches\nThe problem has been patched in all affected versions. Please see the list of patched versions for the most appropriate one for your individual case.\n\n### Workarounds\nUsers who do not wish or are not able to upgrade can add an authentication configuration containing ClaimsValidator which throws an exception if the Claims are Skill Claims.\n\nFor detailed instructions, see the link in the References section.\n\n### For more information\nIf you have any questions or comments about this advisory:\n* Open an issue in [Microsoft Bot Builder SDK](https://github.com/microsoft/botbuilder-dotnet)\n* Email us at [bf-reports@microsoft.com](mailto:bf-reports@microsoft.com)",
  "Date": "2021-03-08",
  "Pubdate": "2021-03-08",
  "AffectedRange": "[4.6.0,4.6.4),[4.7.0,4.7.3),[4.8.0,4.8.2),[4.9.0,4.9.5),[4.10.0,4.10.3)",
  "FixedVersions": [
    "4.6.4",
    "4.7.3",
    "4.8.2",
    "4.9.5",
    "4.10.3"
  ],
  "AffectedVersions": "All versions starting from 4.6.0 before 4.6.4, all versions starting from 4.7.0 before 4.7.3, all versions starting from 4.8.0 before 4.8.2, all versions starting from 4.9.0 before 4.9.5, all versions starting from 4.10.0 before 4.10.3",
  "NotImpacted": "All versions before 4.6.0, all versions starting from 4.6.4 before 4.7.0, all versions starting from 4.7.3 before 4.8.0, all versions starting from 4.8.2 before 4.9.0, all versions starting from 4.9.5 before 4.10.0, all versions starting from 4.10.3",
  "Solution": "Upgrade to versions 4.6.4, 4.7.3, 4.8.2, 4.9.5, 4.10.3 or above.",
  "Urls": [
    "https://github.com/microsoft/botbuilder-dotnet/security/advisories/GHSA-qxx8-292g-2w66",
    "https://github.com/advisories/GHSA-qxx8-292g-2w66"
  ],
  "CvssV2": "",
  "CvssV3": "",
  "UUID": "93548f00-8361-407b-b65c-3c4e52c719a1"
}