{
  "Severity": "CRITICAL",
  "UpdatedAt": "2023-10-25T21:13:11Z",
  "Package": {
    "Ecosystem": "MAVEN",
    "Name": "org.xwiki.platform:xwiki-platform-web"
  },
  "Advisory": {
    "DatabaseId": 224010,
    "Id": "GSA_kwCzR0hTQS1naGY2LTJmNDItbWpoOc4AA2sK",
    "GhsaId": "GHSA-ghf6-2f42-mjh9",
    "References": [
      {
        "Url": "https://github.com/xwiki/xwiki-platform/security/advisories/GHSA-ghf6-2f42-mjh9"
      },
      {
        "Url": "https://github.com/xwiki/xwiki-platform/commit/199e27ce7016757e66fa7cea99e718044a1b639b"
      },
      {
        "Url": "https://jira.xwiki.org/browse/XWIKI-20869"
      },
      {
        "Url": "https://nvd.nist.gov/vuln/detail/CVE-2023-45135"
      },
      {
        "Url": "https://github.com/advisories/GHSA-ghf6-2f42-mjh9"
      }
    ],
    "Identifiers": [
      {
        "Type": "GHSA",
        "Value": "GHSA-ghf6-2f42-mjh9"
      },
      {
        "Type": "CVE",
        "Value": "CVE-2023-45135"
      }
    ],
    "Description": "### Impact\nIn XWiki, it is possible to pass a title to the page creation action that isn't displayed at first but then executed in the second step. This can be used by an attacker to trick a victim to execute code, allowing script execution if the victim has script right or remote code execution including full access to the XWiki instance if the victim has programming right.\n\nFor the attack to work, the attacker needs to convince the victim to visit a link like `\u003cxwiki-host\u003e/xwiki/bin/create/NonExistingSpace/WebHome?title=$services.logging.getLogger(%22foo%22).error(%22Script%20executed!%22)` where `\u003cxwiki-host\u003e`  is the URL of the Wiki installation and to then click on the \"Create\" button on that page. The page looks like a regular XWiki page that the victim would also see when clicking the button to create a page that doesn't exist yet, the malicious code is not displayed anywhere on that page. After clicking the \"Create\" button, the malicious title would be displayed but at this point, the code has already been executed and the attacker could use this code also to hide the attack, e.g., by redirecting the victim again to the same page with an innocent title. It thus seems plausible that this attack could work if the attacker can place a fake \"create page\" button on a page which is possible with edit right.\n\n### Patches\nThis has been patched in XWiki 14.10.2 and 15.5RC1 by displaying the title already in the first step such that the victim can notice the attack before continuing.\n\n### Workarounds\nIt is possible to manually patch the modified files from the [patch](https://github.com/xwiki/xwiki-platform/commit/199e27ce7016757e66fa7cea99e718044a1b639b) in an existing installation. For the JavaScript change, the minified JavaScript file would need to be obtained from a build of XWiki and replaced accordingly. ",
    "Origin": "UNSPECIFIED",
    "PublishedAt": "2023-10-25T21:13:10Z",
    "Severity": "CRITICAL",
    "Summary": "XWiki users can be tricked to execute scripts as the create page action doesn't display the page's title",
    "UpdatedAt": "2023-11-05T05:04:24Z",
    "WithdrawnAt": "",
    "CVSS": {
      "Score": 9.1,
      "VectorString": "CVSS:3.1/AV:N/AC:L/PR:L/UI:R/S:C/C:H/I:H/A:H"
    }
  },
  "Versions": [
    {
      "FirstPatchedVersion": {
        "Identifier": "14.10.12"
      },
      "VulnerableVersionRange": "\u003e= 7.2-milestone-2, \u003c 14.10.12"
    }
  ]
}