{
  "Title": "Security update for crun",
  "Tracking": {
    "ID": "openSUSE-SU-2025:0074-1",
    "Status": "Final",
    "Version": "1",
    "InitialReleaseDate": "2025-02-24T15:01:42Z",
    "CurrentReleaseDate": "2025-02-24T15:01:42Z",
    "RevisionHistory": [
      {
        "Number": "1",
        "Date": "2025-02-24T15:01:42Z",
        "Description": "current"
      }
    ]
  },
  "Notes": [
    {
      "Text": "Security update for crun",
      "Title": "Topic",
      "Type": "Summary"
    },
    {
      "Text": "This update for crun fixes the following issues:\n\nUpdate to 1.20:\n\n  * krun: fix CVE-2025-24965. The .krun_config.json file could be created outside of the container rootfs. (bsc#1237421)\n  * cgroup: reverted the removal of tun/tap from the default allow list, this was done in crun-1.5. The tun/tap device is now added by default again.\n  * CRIU: do not set network_lock unless explicitly specified.\n  * status: disallow container names containing slashes in their name.\n  * linux: Improved error message when failing to set the net.ipv4.ping_group_range sysctl.\n  * scheduler: Ignore ENOSYS errors when resetting the CPU affinity mask.\n  * linux: return a better error message when pidfd_open fails with EINVAL.\n  * cgroup: display the absolute path to cgroup.controllers when a controller is unavailable.\n  * exec: always call setsid. Now processes created through exec get the correct process group id.\n\nUpdate to 1.19.1:\n\n  * linux: fix a hang if there are no reads from the tty. Use non blocking\n    sockets to read and write from the tty so that the 'crun exec' process\n    doesn't hang when the terminal is not consuming any data.\n  * linux: remove the workaround needed to mount a cgroup on top of\n    another cgroup mount. The workaround had the disadvantage to temporarily\n    leak a mount on the host. The alternative that is currently used is\n    to mount a temporary tmpfs between the twoo cgroup mounts.\n\nUpdate to 1.19:\n  * wasm: add new handler wamr.\n  * criu: allow passing network lock method to libcriu.\n  * linux: honor exec cpu affinity mask.\n  * build: fix build with musl libc.\n  * crun: use mount API to self-clone.\n  * cgroup, systemd: do not override devices on update. If the 'update' request has no device block configured, do not reset the previously configuration.\n  * cgroup: handle case where cgroup v1 freezer is disabled. On systems without the freezer controller, containers were mistakenly reported as paused.\n  * cgroup: do not stop process on exec. The cpu mask is configured on the systemd scope, the previous workaround to stop the container until the cgroup is fully configured is no longer needed.\n\n- Update to crun v1.18.2 Upstream changelog is available from\n  \u003chttps://github.com/containers/crun/releases/tag/1.18.2\u003e\n\n- Update to crun v1.18. Upstream changelog is available from\n  \u003chttps://github.com/containers/crun/releases/tag/1.18\u003e\n\nUpdate to 1.17:\n\n  * Add --log-level option. It accepts error, warning and error.\n  * Add debug logs for container creation.\n  * Fix double-free in crun exec code that could lead to a crash.\n  * Allow passing an ID to the journald log driver.\n  * Report 'executable not found' errors after tty has been setup.\n  * Do not treat EPIPE from hooks as an error.\n  * Make sure DefaultDependencies is correctly set in the systemd scope.\n  * Improve the error message when the container process is not found.\n  * Improve error handling for the mnt namespace restoration.\n  * Fix error handling for getpwuid_r, recvfrom and libcrun_kill_linux.\n  * Fix handling of device paths with trailing slashes.\n- add url for keyring\n- enable leap by disabling wasmedge (not packaged for leap)\n\nUpstream release 1.16.1:\n \n- fix a regression introduced by 1.16 where using 'rshared' rootfs mount propagation and the rootfs itself is a mountpoint.\n- inherit user from original process on exec, if not overridden.\n\nUpdate to 1.16:\n\n- build: fix build for s390x.\n- linux: fix mount of special files with rro.  Open the mount target with O_PATH to prevent open(2) failures with special files like FIFOs or UNIX sockets.\n- Fix sd-bus error handling for cpu quota and period props update.\n- container: use relative path for rootfs if possible.  If the rootfs cannot be resolved and it is below the current working directory, only use its relative path.\n- wasmedge: access container environment variables for the WasmEdge configuration.\n- cgroup, systemd: use MemoryMax instead of MemoryLimit.  Fixes a warning for using an old configuration name.\n- cgroup, systemd: improve checks for sd_bus_message_append errors\n\nNew upstream release 1.15:\n\n  * fix a mount point leak under /run/crun, add a retry mechanism to unmount the directory if the removal failed with EBUSY.\n  * linux: cgroups: fix potential mount leak when /sys/fs/cgroup is already mounted, causing the posthooks to not run.\n  * release: build s390x binaries using musl libc.\n  * features: add support for potentiallyUnsafeConfigAnnotations.\n  * handlers: add option to load wasi-nn plugin for wasmedge.\n  * linux: fix 'harden chdir()' security measure. The previous check was not correct.\n  * crun: add option --keep to the run command. When specified the container is not automatically deleted when it exits.\n\nNew upstream release 1.14.4:\n\n- linux: fix mount of file with recursive flags.  Do not assume it is\n  a directory, but check the source type.\n\n- follow up for 1.14.2.  Drop the version check for each command.\n\n- crun: drop check for OCI version.  A recent bump in the OCI runtime\n  specs caused crun to fail with every config file.  Just drop the\n  check since it doesn't add any value.\n\n- there was recently a security vulnerability (CVE-2024-21626) in runc\n  that allowed a malicious user to chdir(2) to a /proc/*/fd entry that is\n  outside the container rootfs.  While crun is not affected directly,\n  harden chdir by validating that we are still inside the container\n  rootfs.\n- container: attempt to close all the files before execv(2).\n  if we leak any fd, it prevents execv to gain access to files outside\n  the container rootfs through /proc/self/fd/$fd.\n- fix a regression caused by 1.14 when installing the ebpf filter on a\n  kernel older than 5.11.\n- cgroup, systemd: fix segfault if the resources block is not specified.\n\nUpdate to 1.14:\n\n  * build: drop dependency on libgcrypt. Use blake3 to compute the cache key.\n  * cpuset: don't clobber parent cgroup value when writing the cpuset value.\n  * linux: force umask(0). It ensures that the mknodat syscall is not affected by the umask of the calling process,\n    allowing file permissions to be set as specified in the OCI configuration.\n  * ebpf: do not require MEMLOCK for eBPF programs. This requirement was relaxed in Linux 5.11.\n- update to 1.13:\n  * src: use O_CLOEXEC for all open/openat calls\n  * cgroup v1: use 'max' when pids limit \u003c 0.\n  * improve error message when idmap mount fails because the underlying file system has no support for it.\n  * libcrun: fix compilation when building without libseccomp and libcap.\n  * fix relative idmapped mount when using the custom annotation.\n\n- New upstream release 1.12:\n  * add new WebAssembly handler: spin.\n  * systemd: fallback to system bus if session bus is not available.\n  * configure the cpu rt and cpuset controllers before joining them to\n    avoid running temporarily the workload on the wrong cpus.\n  * preconfigure the cpuset with required resources instead of using the\n    parent's set.  This prevents needless churn in the kernel as it\n    tracks which CPUs have load balancing disabled.\n  * try attr/\u003clsm\u003e/* before the attr/* files.  Writes to the attr/*\n    files may fail if apparmor is not the first 'major' LSM in the list\n    of loaded LSMs (e.g. lsm=apparmor,bpf vs lsm=bpf,apparmor).\n- New upstream release 1.11.2:\n  * fix a regression caused by 1.11.1 where the process crashes if there\n    are no CPU limits configured on cgroup v1. (boo#1217590)\n  * fix error code check for the ptsname_r function.\n\n- update to 1.11.1:\n  * force a remount operation with bind mounts from the host to\n    correctly set all the mount flags.\n  * cgroup: honor cpu burst.\n  * systemd: set CPUQuota and CPUPeriod on the scope cgroup.\n  * linux: append tmpfs mode if missing for mounts.  This is the\n    same behavior of runc.\n  * cgroup: always use the user session for rootless.\n  * support for Intel Resource Director Technology (RDT).\n  * new mount option 'copy-symlink'.  When provided for a mount,\n    if the source is a symlink, then it is copied in the container\n    instead of attempting a mount.\n  * linux: open mounts before setgroups if in a userns.  This\n    solves a problem where a directory that was previously\n    accessible to the user, become inaccessible after setgroups\n    causing the bind mount to fail.\n\n- New upstream release 1.9.2:\n  * cgroup: reset the inherited cpu affinity after moving to cgroup. Old kernels\n    do that automatically, but new kernels remember the affinity that was set\n    before the cgroup move, so we need to reset it in order to honor the cpuset\n    configuration.\n- New upstream release 1.9.1:\n  * utils: ignore ENOTSUP when chmod a symlink. It fixes a problem on Linux 6.6\n    that always refuses chmod on a symlink.\n  * build: fix build on CentOS 7\n  * linux: add new fallback when mount fails with EBUSY, so that there is not an\n    additional tmpfs mount if not needed.\n  * utils: improve error message when a directory cannot be created as a\n    component of the path is already existing as a non directory.\n- Only build with wasmedge on x86_64 \u0026 aarch64\n\n- Add crun-wasm symlink for platform 'wasi/wasm'\n\n- Update to 1.9:\n  * linux: support arbitrary idmapped mounts.\n  * linux: add support for 'ridmap' mount option to support recursive\n    idmapped mounts.\n  * crun delete: call systemd's reset-failed.\n  * linux: fix check for oom_score_adj.\n  * features: Support mountExtensions.\n  * linux: correctly handle unknown signal string when it doesn't start with\n    a digit.\n  * linux: do not attempt to join again already joined namespace.\n  * wasmer: use latest wasix API.\n\n- Enable WasmEdge support to run Wasm compat containers.\n\n  * linux: idmapped mounts expect the same configuration as\n    mapping. It is a breaking change, but the behavior was aligned\n  * cgroup: always delete the cgroup on errors.\n  ° exec: fix double free when using --apparmor and",
      "Title": "Details",
      "Type": "General"
    },
    {
      "Text": "The CVRF data is provided by SUSE under the Creative Commons License 4.0 with Attribution (CC-BY-4.0).",
      "Title": "Terms of Use",
      "Type": "Legal Disclaimer"
    },
    {
      "Text": "openSUSE-2025-74",
      "Title": "Patchnames",
      "Type": "Details"
    }
  ],
  "ProductTree": {
    "Relationships": [
      {
        "ProductReference": "crun-1.20-bp156.2.3.1",
        "RelatesToProductReference": "SUSE Package Hub 15 SP6",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "crun-1.20-bp156.2.3.1",
        "RelatesToProductReference": "openSUSE Leap 15.6",
        "RelationType": "Default Component Of"
      }
    ]
  },
  "References": [
    {
      "URL": "https://lists.opensuse.org/archives/list/security-announce@lists.opensuse.org/thread/MFFSKUX256PEK52RLQGT33MIN3ZQO27D/",
      "Description": "E-Mail link for openSUSE-SU-2025:0074-1"
    },
    {
      "URL": "https://www.suse.com/support/security/rating/",
      "Description": "SUSE Security Ratings"
    },
    {
      "URL": "https://bugzilla.suse.com/1217590",
      "Description": "SUSE Bug 1217590"
    },
    {
      "URL": "https://bugzilla.suse.com/1218894",
      "Description": "SUSE Bug 1218894"
    },
    {
      "URL": "https://bugzilla.suse.com/1237421",
      "Description": "SUSE Bug 1237421"
    },
    {
      "URL": "https://www.suse.com/security/cve/CVE-2024-21626/",
      "Description": "SUSE CVE CVE-2024-21626 page"
    },
    {
      "URL": "https://www.suse.com/security/cve/CVE-2025-24965/",
      "Description": "SUSE CVE CVE-2025-24965 page"
    }
  ],
  "Vulnerabilities": [
    {
      "CVE": "CVE-2024-21626",
      "Description": "runc is a CLI tool for spawning and running containers on Linux according to the OCI specification. In runc 1.1.11 and earlier, due to an internal file descriptor leak, an attacker could cause a newly-spawned container process (from runc exec) to have a working directory in the host filesystem namespace, allowing for a container escape by giving access to the host filesystem (\"attack 2\"). The same attack could be used by a malicious image to allow a container process to gain access to the host filesystem through runc run (\"attack 1\"). Variants of attacks 1 and 2 could be also be used to overwrite semi-arbitrary host binaries, allowing for complete container escapes (\"attack 3a\" and \"attack 3b\"). runc 1.1.12 includes patches for this issue. ",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "important"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2024-21626.html",
          "Description": "CVE-2024-21626"
        },
        {
          "URL": "https://bugzilla.suse.com/1218894",
          "Description": "SUSE Bug 1218894"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": [
            "SUSE Package Hub 15 SP6:crun-1.20-bp156.2.3.1",
            "openSUSE Leap 15.6:crun-1.20-bp156.2.3.1"
          ]
        }
      ],
      "CVSSScoreSets": {}
    },
    {
      "CVE": "CVE-2025-24965",
      "Description": "crun is an open source OCI Container Runtime fully written in C. In affected versions A malicious container image could trick the krun handler into escaping the root filesystem, allowing file creation or modification on the host. No special permissions are needed, only the ability for the current user to write to the target file. The problem is fixed in crun 1.20 and all users are advised to upgrade. There are no known workarounds for this vulnerability.",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "moderate"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2025-24965.html",
          "Description": "CVE-2025-24965"
        },
        {
          "URL": "https://bugzilla.suse.com/1237421",
          "Description": "SUSE Bug 1237421"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": [
            "SUSE Package Hub 15 SP6:crun-1.20-bp156.2.3.1",
            "openSUSE Leap 15.6:crun-1.20-bp156.2.3.1"
          ]
        }
      ],
      "CVSSScoreSets": {}
    }
  ]
}