{
  "id": "GHSA-f77q-r5qm-w4m8",
  "modified": "2024-10-29T15:37:50Z",
  "published": "2024-10-29T15:37:50Z",
  "summary": "sp1-recursion-gnark-ffi has insufficient range checks of BabyBear arithmetic ",
  "details": "The Gnark recursion circuit constrains arithmetic over BabyBear when the native field of the ZKP circuit is the BN254 scalar field. Proper implementation of this logic requires range checking Bn254 values to be less than the BabyBear modulus.\n\nIn versions \u003c 1.2.0, functions like `InvF` and `InvE` used values generated by hints that were not appropriately range checked. These issues are resolved in versions 1.2.0 and higher, by adding range checks in the appropriate places. This code was covered under the original audit scope of the recursion circuit audit by Veridise, and both Veridise and Kalos revisited the code for similar issues and found no additional vulnerabilities.\n\nThis issue was discovered by the Succinct team on September 3rd. The issue was fixed and resolved within 48 hours, and released with V1.2.0 (note that a later V2.0.0 release has the same contents as V1.2.0 to respect semver), with production SP1 users being notified and upgraded immediately. The V1.1.0 verifier was frozen on September 4th to ensure that no one uses versions of SP1 with this bug.",
  "affected": [
    {
      "package": {
        "ecosystem": "crates.io",
        "name": "sp1-recursion-gnark-ffi",
        "purl": "pkg:cargo/sp1-recursion-gnark-ffi"
      },
      "ranges": [
        {
          "type": "SEMVER",
          "events": [
            {
              "introduced": "0"
            },
            {
              "fixed": "1.2.0"
            }
          ]
        }
      ],
      "database_specific": {
        "source": "https://github.com/github/advisory-database/blob/main/advisories/github-reviewed/2024/10/GHSA-f77q-r5qm-w4m8/GHSA-f77q-r5qm-w4m8.json"
      }
    }
  ],
  "references": [
    {
      "type": "WEB",
      "url": "https://github.com/succinctlabs/sp1/security/advisories/GHSA-f77q-r5qm-w4m8"
    },
    {
      "type": "WEB",
      "url": "https://github.com/succinctlabs/sp1/commit/8600d4aa63184ce3df7ccd30c79ac0388eacca52"
    },
    {
      "type": "PACKAGE",
      "url": "https://github.com/succinctlabs/sp1"
    }
  ]
}