{
  "Severity": "MODERATE",
  "UpdatedAt": "2025-02-11T18:12:34Z",
  "Package": {
    "Ecosystem": "ERLANG",
    "Name": "ash_authentication"
  },
  "Advisory": {
    "DatabaseId": 279829,
    "Id": "GSA_kwCzR0hTQS1xcm05LWY3NXctaGc0Y84ABEUV",
    "GhsaId": "GHSA-qrm9-f75w-hg4c",
    "References": [
      {
        "Url": "https://github.com/team-alembic/ash_authentication/security/advisories/GHSA-qrm9-f75w-hg4c"
      },
      {
        "Url": "https://github.com/team-alembic/ash_authentication/commit/2dee55252df26fe3d990ff1199397cdcf1bfea8a"
      },
      {
        "Url": "https://nvd.nist.gov/vuln/detail/CVE-2025-25202"
      },
      {
        "Url": "https://github.com/advisories/GHSA-qrm9-f75w-hg4c"
      }
    ],
    "Identifiers": [
      {
        "Type": "GHSA",
        "Value": "GHSA-qrm9-f75w-hg4c"
      },
      {
        "Type": "CVE",
        "Value": "CVE-2025-25202"
      }
    ],
    "Description": "### Impact\n\nApplications which have been bootstrapped by the new igniter installer (since AshAuthentication v4.1.0) and who have used the magic link strategy, password resets, confirmation, or are manually revoking tokens are affected by revoked tokens being allowed to verify as valid. If you did not use the new installer, then you are absolutely not affected.\n\nAdditionally, unless you have implemented any kind of custom token revocation feature in your application (in which case even cursory testing would have uncovered this issue), then you will not be significantly affected. \n\nThe impact here for users is as follows:\n\n  - For users using the magic link strategy, magic link tokens are reusable until they expire instead of being immediately revoked. By default magic link tokens are valid for 10 minutes.\n  - For users of password resets in the password strategy, password reset tokens are reusable until they expire instead of being immediately revoked. By default password reset tokens are valid for 3 days.\n  - For users of the confirmation add-on, confirmation tokens are reusable until they expire instead of being immediately revoked. By default password reset tokens are valid for 3 days.\n\n### Patches\n\nThe flaw is patched in version 4.4.9. Additionally a compile time warning is shown to users with remediation instructions if they upgrade. 4.4.9 ships with an upgrader, so if you use `mix igniter.upgrade ash_authentication` the necessary patch will be applied for you. Otherwise you can run the upgrader manually as described in the error message\n\n#### Example\n```elixir\n[warning] Warning while compiling Tunez.Accounts.Token:\n\nThe `:jti` and `:token` options to the `:revoked?` action must allow nil values and it must return a `:boolean`.\n\nThis was an error in our igniter installer previous to version 4.4.9, which allowed revoked tokens to be reused.\n\nTo fix this, run the following command in your shell:\n\n    mix ash_authentication.upgrade 4.4.8 4.4.9\n\nOr:\n\n  - remove `allow_nil?: false` from these action arguments, and\n  - ensure that the action returns `:boolean`.\n\n  like so:\n\n    action :revoked?, :boolean do\n      description \"Returns true if a revocation token is found for the provided token\"\n      argument :token, :string, sensitive?: true\n      argument :jti, :string, sensitive?: true\n\n      run AshAuthentication.TokenResource.IsRevoked\n    end\n```\n\n### Workarounds\n\nDelete the generated `:revoked?` generic action in your token resource This will cause it to use the one internal to AshAuthentication which has always been correct. Alternatively,  manually make the changes described above.\n\n### References\n\nSee the `#ash_authentication` channel on the Ash Discord.",
    "Origin": "UNSPECIFIED",
    "PublishedAt": "2025-02-11T18:12:33Z",
    "Severity": "MODERATE",
    "Summary": "Ash Authentication has flawed token revocation checking logic in actions generated by `mix ash_authentication.install`",
    "UpdatedAt": "2025-02-11T21:40:10Z",
    "WithdrawnAt": "",
    "CVSS": {
      "Score": 0,
      "VectorString": ""
    }
  },
  "Versions": [
    {
      "FirstPatchedVersion": {
        "Identifier": "4.4.9"
      },
      "VulnerableVersionRange": "\u003e= 4.1.0, \u003c 4.4.9"
    }
  ]
}