{
  "Severity": "MODERATE",
  "UpdatedAt": "2025-06-10T20:13:42Z",
  "Package": {
    "Ecosystem": "PIP",
    "Name": "OctoPrint"
  },
  "Advisory": {
    "DatabaseId": 298612,
    "Id": "GSA_kwCzR0hTQS1tOWpoLWpmOWgteDNoMs4ABI50",
    "GhsaId": "GHSA-m9jh-jf9h-x3h2",
    "References": [
      {
        "Url": "https://github.com/OctoPrint/OctoPrint/security/advisories/GHSA-m9jh-jf9h-x3h2"
      },
      {
        "Url": "https://nvd.nist.gov/vuln/detail/CVE-2025-48067"
      },
      {
        "Url": "https://github.com/OctoPrint/OctoPrint/commit/9984b20773f5895a432f965b759999b16c57f7d8"
      },
      {
        "Url": "https://github.com/advisories/GHSA-m9jh-jf9h-x3h2"
      }
    ],
    "Identifiers": [
      {
        "Type": "GHSA",
        "Value": "GHSA-m9jh-jf9h-x3h2"
      },
      {
        "Type": "CVE",
        "Value": "CVE-2025-48067"
      }
    ],
    "Description": "### Impact\n\nOctoPrint versions up until and including 1.11.1 contain a vulnerability that allows an attacker with the `FILE_UPLOAD` permission to exfiltrate files from the host that OctoPrint has read access to, by moving them into the upload folder where they then can be downloaded from.\n\nThe primary risk lies in the potential exfiltration of secrets stored inside OctoPrint's config, or further system files. By removing important runtime files, this could also be used to impact the availability of the host. Given that the attacker requires a user account with file upload permissions, the actual impact of this should however hopefully be minimal in most cases.\n\n### Patches\n\nThe vulnerability has been patched in version 1.11.2.\n\n### Details\n\nA specially crafted HTTP Request to an affected upload endpoint that contains some form inputs only supposed to be used internally can be used to make OctoPrint move a file that it thinks is a freshly uploaded temporary one into its upload folder.\n\nThe following endpoints in OctoPrint are affected:\n\n- `/api/files/{local|sdcard}`\n- `/api/languages`\n- `/plugin/backup/restore`\n- `/plugin/pluginmanager/upload_file`\n\nFurther upload endpoints in third party plugins might be affected too.\n\nThe fix removes any internal-only form inputs from incoming requests in the central file upload processor component.\n\n### Credits\n\nThis vulnerability was discovered and responsibly disclosed to OctoPrint by Jacopo Tediosi",
    "Origin": "UNSPECIFIED",
    "PublishedAt": "2025-06-10T20:13:40Z",
    "Severity": "MODERATE",
    "Summary": "OctoPrint vulnerable to possible file extraction via upload endpoints",
    "UpdatedAt": "2025-06-10T20:13:42Z",
    "WithdrawnAt": "",
    "CVSS": {
      "Score": 5.4,
      "VectorString": "CVSS:3.1/AV:A/AC:L/PR:L/UI:N/S:C/C:L/I:N/A:L"
    }
  },
  "Versions": [
    {
      "FirstPatchedVersion": {
        "Identifier": "1.11.2"
      },
      "VulnerableVersionRange": "\u003c 1.11.2"
    }
  ]
}