{
  "Severity": "MODERATE",
  "UpdatedAt": "2024-11-05T15:05:55Z",
  "Package": {
    "Ecosystem": "PIP",
    "Name": "OctoPrint"
  },
  "Advisory": {
    "DatabaseId": 266130,
    "Id": "GSA_kwCzR0hTQS14dnhxLWc4aHctZng0Z84ABA-S",
    "GhsaId": "GHSA-xvxq-g8hw-fx4g",
    "References": [
      {
        "Url": "https://github.com/OctoPrint/OctoPrint/security/advisories/GHSA-xvxq-g8hw-fx4g"
      },
      {
        "Url": "https://github.com/OctoPrint/OctoPrint/commit/b8a6b0a75202edac3bb142a8e4f9041a0b6825bf"
      },
      {
        "Url": "https://nvd.nist.gov/vuln/detail/CVE-2024-49377"
      },
      {
        "Url": "https://github.com/pypa/advisory-database/tree/main/vulns/octoprint/PYSEC-2024-201.yaml"
      },
      {
        "Url": "https://github.com/advisories/GHSA-xvxq-g8hw-fx4g"
      }
    ],
    "Identifiers": [
      {
        "Type": "GHSA",
        "Value": "GHSA-xvxq-g8hw-fx4g"
      },
      {
        "Type": "CVE",
        "Value": "CVE-2024-49377"
      }
    ],
    "Description": "### Impact\n\nOctoPrint versions up until and including 1.10.2 are vulnerable to reflected XSS vulnerabilities through its Jinja2 template system, as this is not configured to enforce automatic escaping. This affects, among other places, the login dialog and the standalone application key confirmation dialog. \n\nAn attacker who successfully talked a victim into clicking on or through a malicious third party app successfully redirected a victim to a specially crafted link could use this to retrieve or modify sensitive configuration settings, interrupt prints or otherwise interact with the OctoPrint instance in a malicious way.\n\n### Patches\n\nThe above mentioned specific vulnerabilities of the login dialog and the standalone application key confirmation dialog will be patched in the bugfix release 1.10.3 by individual escaping of the detected locations. A global change throughout all of OctoPrint's templating system with the upcoming 1.11.0 release will handle this further, switching to globally enforced automatic escaping and thus reducing the attack surface in general.\n\nThe latter will also improve the security of third party plugins. During a transition period, third party plugins will be able to opt into the automatic escaping. With OctoPrint 1.13.0, automatic escaping will be switched over to be enforced even for third party plugins, unless they explicitly opt-out.\n\n### Credits\n\nThis vulnerability was discovered and responsibly disclosed to OctoPrint by Jacopo Tediosi.\n",
    "Origin": "UNSPECIFIED",
    "PublishedAt": "2024-11-05T15:05:55Z",
    "Severity": "MODERATE",
    "Summary": "OctoPrint Vulnerable to Reflected XSS in Jinja2 Templates",
    "UpdatedAt": "2025-01-21T17:56:24Z",
    "WithdrawnAt": "",
    "CVSS": {
      "Score": 5.5,
      "VectorString": "CVSS:3.1/AV:A/AC:L/PR:N/UI:R/S:U/C:L/I:L/A:L"
    }
  },
  "Versions": [
    {
      "FirstPatchedVersion": {
        "Identifier": "1.10.3"
      },
      "VulnerableVersionRange": "\u003c= 1.10.2"
    }
  ]
}