{
 "ID": 400,
 "Name": "Uncontrolled Resource Consumption",
 "Description": "The product does not properly control the allocation and maintenance of a limited resource, thereby enabling an actor to influence the amount of resources consumed, eventually leading to the exhaustion of available resources.",
 "PotentialMitigations": {
  "Mitigation": [
   {
    "Phase": [
     "Architecture and Design"
    ],
    "Strategy": "",
    "Description": null
   },
   {
    "Phase": [
     "Architecture and Design"
    ],
    "Strategy": "",
    "Description": [
     "Mitigation of resource exhaustion attacks requires that the target system either:",
     "\n                        \n                        \n                     ",
     "The first of these solutions is an issue in itself though, since it may allow attackers to prevent the use of the system by a particular valid user. If the attacker impersonates the valid user, they may be able to prevent the user from accessing the server in question.",
     "The second solution is simply difficult to effectively institute -- and even when properly done, it does not provide a full solution. It simply makes the attack require more resources on the part of the attacker."
    ]
   },
   {
    "Phase": [
     "Architecture and Design"
    ],
    "Strategy": "",
    "Description": null
   },
   {
    "Phase": [
     "Implementation"
    ],
    "Strategy": "",
    "Description": null
   }
  ]
 },
 "RelatedAttackPatterns": {
  "RelatedAttackPattern": [
   {
    "CAPECID": 147
   },
   {
    "CAPECID": 227
   },
   {
    "CAPECID": 492
   }
  ]
 },
 "CommonConsequences": {
  "Consequence": [
   {
    "Scope": [
     "Availability"
    ],
    "Impact": [
     "DoS: Crash, Exit, or Restart",
     "DoS: Resource Consumption (CPU)",
     "DoS: Resource Consumption (Memory)",
     "DoS: Resource Consumption (Other)"
    ]
   },
   {
    "Scope": [
     "Access Control",
     "Other"
    ],
    "Impact": [
     "Bypass Protection Mechanism",
     "Other"
    ]
   }
  ]
 },
 "ExtendedDescription": [
  "Limited resources include memory, file system storage, database connection pool entries, and CPU. If an attacker can trigger the allocation of these limited resources, but the number or size of the resources is not controlled, then the attacker could cause a denial of service that consumes all available resources. This would prevent valid users from accessing the product, and it could potentially have an impact on the surrounding environment. For example, a memory exhaustion attack against an application could slow down the application as well as its host operating system.",
  "There are at least three distinct scenarios which can commonly lead to resource exhaustion:",
  "\n                  \n                  \n                  \n               ",
  "Resource exhaustion problems are often result due to an incorrect implementation of the following situations:",
  "\n                  \n                  \n               "
 ]
}