{
 "ID": 1351,
 "Name": "Improper Handling of Hardware Behavior in Exceptionally Cold Environments",
 "Description": "A hardware device, or the firmware running on it, is\n                missing or has incorrect protection features to maintain\n                goals of security primitives when the device is cooled below\n                standard operating temperatures.",
 "PotentialMitigations": {
  "Mitigation": [
   {
    "Phase": [
     "Architecture and Design"
    ],
    "Strategy": "",
    "Description": null
   }
  ]
 },
 "RelatedAttackPatterns": {
  "RelatedAttackPattern": [
   {
    "CAPECID": 624
   },
   {
    "CAPECID": 625
   }
  ]
 },
 "CommonConsequences": {
  "Consequence": [
   {
    "Scope": [
     "Integrity",
     "Authentication"
    ],
    "Impact": [
     "Varies by Context",
     "Unexpected State"
    ]
   }
  ]
 },
 "ExtendedDescription": [
  "The hardware designer may improperly anticipate\n                    hardware behavior when exposed to exceptionally cold\n                    conditions. As a result they may introduce a weakness by not\n                    accounting for the modified behavior of critical components\n                    when in extreme environments.",
  "An example of a change in behavior is that power loss\n                    won't clear/reset any volatile state when cooled below\n                    standard operating temperatures. This may result in\n                    a weakness when the starting state of the volatile memory is\n                    being relied upon for a security decision. For example, a\n                    Physical Unclonable Function (PUF) may be supplied as a\n                    security primitive to improve confidentiality,\n                    authenticity, and integrity guarantees. However, when the\n                    PUF is paired with DRAM, SRAM, or another temperature\n                    sensitive entropy source, the system designer may introduce\n                    weakness by failing to account for the chosen entropy\n                    source's behavior at exceptionally low temperatures. In the\n                    case of DRAM and SRAM, when power is cycled at low\n                    temperatures, the device will not contain the bitwise\n                    biasing caused by inconsistencies in manufacturing and will\n                    instead contain the data from previous boot. Should the PUF\n                    primitive be used in a cryptographic construction which\n                    does not account for full adversary control of PUF seed\n                    data, weakness would arise.",
  "This weakness does not cover \"Cold Boot Attacks\"\n                    wherein RAM or other external storage is super cooled and\n                    read externally by an attacker."
 ]
}