{
 "ID": 1269,
 "Name": "Product Released in Non-Release Configuration",
 "Description": "The product released to market is released in pre-production or manufacturing configuration.",
 "PotentialMitigations": {
  "Mitigation": [
   {
    "Phase": [
     "Implementation"
    ],
    "Strategy": "",
    "Description": null
   },
   {
    "Phase": [
     "Integration"
    ],
    "Strategy": "",
    "Description": null
   },
   {
    "Phase": [
     "Manufacturing"
    ],
    "Strategy": "",
    "Description": null
   }
  ]
 },
 "RelatedAttackPatterns": {
  "RelatedAttackPattern": [
   {
    "CAPECID": 439
   }
  ]
 },
 "CommonConsequences": {
  "Consequence": [
   {
    "Scope": [
     "Confidentiality",
     "Integrity",
     "Availability",
     "Access Control",
     "Accountability",
     "Authentication",
     "Authorization",
     "Non-Repudiation"
    ],
    "Impact": [
     "Other"
    ]
   }
  ]
 },
 "ExtendedDescription": [
  "Products in the pre-production or manufacturing stages are configured to have many debug hooks and debug capabilities, including but not limited to:",
  "\n\t\t\t\t\n\t\t\t\t\n\t\t\t\t\n\t\t\t\t",
  "The above is by no means an exhaustive list, but it alludes to the greater capability and the greater state of vulnerability of a product during it's preproduction or manufacturing state.",
  "Complexity increases when multiple parties are involved in executing the tests before the final production version. For example, a chipmaker might fabricate a chip and run its own preproduction tests, following which the chip would be delivered to the Original Equipment Manufacturer (OEM), who would now run a second set of different preproduction tests on the same chip. Only after both of these sets of activities are complete, can the overall manufacturing phase be called \"complete\" and have the \"Manufacturing Complete\" fuse blown. However, if the OEM forgets to blow the Manufacturing Complete fuse, then the system remains in the manufacturing stage, rendering the system both exposed and vulnerable."
 ]
}