{
 "ID": 772,
 "Name": "Missing Release of Resource after Effective Lifetime",
 "Description": "The product does not release a resource after its effective lifetime has ended, i.e., after the resource is no longer needed.",
 "PotentialMitigations": {
  "Mitigation": [
   {
    "Phase": [
     "Requirements"
    ],
    "Strategy": "Language Selection",
    "Description": [
     "Use a language that does not allow this weakness to occur or provides constructs that make this weakness easier to avoid.",
     "For example, languages such as Java, Ruby, and Lisp perform automatic garbage collection that releases memory for objects that have been deallocated."
    ]
   },
   {
    "Phase": [
     "Implementation"
    ],
    "Strategy": "",
    "Description": null
   },
   {
    "Phase": [
     "Operation",
     "Architecture and Design"
    ],
    "Strategy": "Resource Limitation",
    "Description": [
     "Use resource-limiting settings provided by the operating system or environment. For example, when managing system resources in POSIX, setrlimit() can be used to set limits for certain types of resources, and getrlimit() can determine how many resources are available. However, these functions are not available on all operating systems.",
     "When the current levels get close to the maximum that is defined for the application (see CWE-770), then limit the allocation of further resources to privileged users; alternately, begin releasing resources for less-privileged users. While this mitigation may protect the system from attack, it will not necessarily stop attackers from adversely impacting other users.",
     "Ensure that the application performs the appropriate error checks and error handling in case resources become unavailable (CWE-703)."
    ]
   }
  ]
 },
 "RelatedAttackPatterns": {
  "RelatedAttackPattern": [
   {
    "CAPECID": 469
   }
  ]
 },
 "CommonConsequences": {
  "Consequence": [
   {
    "Scope": [
     "Availability"
    ],
    "Impact": [
     "DoS: Resource Consumption (Other)"
    ]
   }
  ]
 },
 "ExtendedDescription": null
}