{
 "ID": 1267,
 "Name": "Policy Uses Obsolete Encoding",
 "Description": "The product uses an obsolete encoding mechanism to implement access controls.",
 "PotentialMitigations": {
  "Mitigation": [
   {
    "Phase": [
     "Architecture and Design",
     "Implementation"
    ],
    "Strategy": "",
    "Description": [
     "Security Token Decoders should be reviewed for design inconsistency and common weaknesses.",
     "Access and programming flows should be tested in both pre-silicon and post-silicon testing."
    ]
   }
  ]
 },
 "RelatedAttackPatterns": {
  "RelatedAttackPattern": [
   {
    "CAPECID": 121
   },
   {
    "CAPECID": 681
   }
  ]
 },
 "CommonConsequences": {
  "Consequence": [
   {
    "Scope": [
     "Confidentiality",
     "Integrity",
     "Availability",
     "Access Control"
    ],
    "Impact": [
     "Modify Memory",
     "Read Memory",
     "Modify Files or Directories",
     "Read Files or Directories",
     "DoS: Resource Consumption (Other)",
     "Execute Unauthorized Code or Commands",
     "Gain Privileges or Assume Identity",
     "Bypass Protection Mechanism",
     "Reduce Reliability"
    ]
   }
  ]
 },
 "ExtendedDescription": [
  "Within a System-On-a-Chip (SoC), various circuits and hardware engines generate transactions for the purpose of accessing (read/write) assets or performing various actions (e.g., reset, fetch, compute, etc.). Among various types of message information, a typical transaction is comprised of source identity (identifying the originator of the transaction) and a destination identity (routing the transaction to the respective entity). Sometimes the transactions are qualified with a Security Token. This Security Token helps the destination agent decide on the set of allowed actions (e.g., access to an asset for reads and writes). A policy encoder is used to map the bus transactions to Security Tokens that in turn are used as access-controls/protection mechanisms. A common weakness involves using an encoding which is no longer trusted, i.e., an obsolete encoding."
 ]
}