{
 "ID": 364,
 "Name": "Signal Handler Race Condition",
 "Description": "The product uses a signal handler that introduces a race condition.",
 "PotentialMitigations": {
  "Mitigation": [
   {
    "Phase": [
     "Requirements"
    ],
    "Strategy": "Language Selection",
    "Description": null
   },
   {
    "Phase": [
     "Architecture and Design"
    ],
    "Strategy": "",
    "Description": null
   },
   {
    "Phase": [
     "Implementation"
    ],
    "Strategy": "",
    "Description": null
   }
  ]
 },
 "RelatedAttackPatterns": {
  "RelatedAttackPattern": null
 },
 "CommonConsequences": {
  "Consequence": [
   {
    "Scope": [
     "Integrity",
     "Confidentiality",
     "Availability"
    ],
    "Impact": [
     "Modify Application Data",
     "Modify Memory",
     "DoS: Crash, Exit, or Restart",
     "Execute Unauthorized Code or Commands"
    ]
   },
   {
    "Scope": [
     "Access Control"
    ],
    "Impact": [
     "Gain Privileges or Assume Identity"
    ]
   }
  ]
 },
 "ExtendedDescription": [
  "Race conditions frequently occur in signal handlers, since signal handlers support asynchronous actions. These race conditions have a variety of root causes and symptoms. Attackers may be able to exploit a signal handler race condition to cause the product state to be corrupted, possibly leading to a denial of service or even code execution.",
  "These issues occur when non-reentrant functions, or state-sensitive actions occur in the signal handler, where they may be called at any time. These behaviors can violate assumptions being made by the \"regular\" code that is interrupted, or by other signal handlers that may also be invoked. If these functions are called at an inopportune moment - such as while a non-reentrant function is already running - memory corruption could occur that may be exploitable for code execution. Another signal race condition commonly found occurs when free is called within a signal handler, resulting in a double free and therefore a write-what-where condition. Even if a given pointer is set to NULL after it has been freed, a race condition still exists between the time the memory was freed and the pointer was set to NULL. This is especially problematic if the same signal handler has been set for more than one signal -- since it means that the signal handler itself may be reentered.",
  "There are several known behaviors related to signal handlers that have received the label of \"signal handler race condition\":",
  "\n              \n              \n              \n              \n              \n              \n            ",
  "Signal handler vulnerabilities are often classified based on the absence of a specific protection mechanism, although this style of classification is discouraged in CWE because programmers often have a choice of several different mechanisms for addressing the weakness. Such protection mechanisms may preserve exclusivity of access to the shared resource, and behavioral atomicity for the relevant code:",
  "\n              \n              \n              \n              \n            "
 ]
}