{
 "ID": 1297,
 "Name": "Unprotected Confidential Information on Device is Accessible by OSAT Vendors",
 "Description": "The product does not adequately protect confidential information on the device from being accessed by Outsourced Semiconductor Assembly and Test (OSAT) vendors.",
 "PotentialMitigations": {
  "Mitigation": [
   {
    "Phase": [
     "Architecture and Design"
    ],
    "Strategy": "",
    "Description": [
     "\n\t\t\t\t\t  \n\t\t\t\t\t  \n\t\t\t\t\t  \n\t\t\t\t\t"
    ]
   }
  ]
 },
 "RelatedAttackPatterns": {
  "RelatedAttackPattern": [
   {
    "CAPECID": 1
   },
   {
    "CAPECID": 180
   }
  ]
 },
 "CommonConsequences": {
  "Consequence": [
   {
    "Scope": [
     "Confidentiality",
     "Integrity",
     "Access Control",
     "Authentication",
     "Authorization",
     "Availability",
     "Accountability",
     "Non-Repudiation"
    ],
    "Impact": [
     "Gain Privileges or Assume Identity",
     "Bypass Protection Mechanism",
     "Execute Unauthorized Code or Commands",
     "Modify Memory",
     "Modify Files or Directories"
    ]
   }
  ]
 },
 "ExtendedDescription": [
  "In contrast to complete vertical integration of architecting, designing, manufacturing, assembling, and testing chips all within a single organization, an organization can choose to simply architect and design a chip before outsourcing the rest of the process to OSAT entities (e.g., external foundries and test houses). In the latter example, the device enters an OSAT facility in a much more vulnerable pre-production stage where many debug and test modes are accessible. Therefore, the chipmaker must place a certain level of trust with the OSAT. To counter this, the chipmaker often requires the OSAT partner to enter into restrictive non-disclosure agreements (NDAs). Nonetheless, OSAT vendors likely have many customers, which increases the risk of accidental sharing of information. There may also be a security vulnerability in the information technology (IT) system of the OSAT facility. Alternatively, a malicious insider at the OSAT facility may carry out an insider attack. Considering these factors, it behooves the chipmaker to minimize any confidential information in the device that may be accessible to the OSAT vendor.",
  "Logic errors during design or synthesis could misconfigure the interconnection of the debug components, which could provide improper authorization to sensitive information."
 ]
}