{
 "ID": 200,
 "Name": "Exposure of Sensitive Information to an Unauthorized Actor",
 "Description": "The product exposes sensitive information to an actor that is not explicitly authorized to have access to that information.",
 "PotentialMitigations": {
  "Mitigation": [
   {
    "Phase": [
     "Architecture and Design"
    ],
    "Strategy": "Separation of Privilege",
    "Description": [
     "Compartmentalize the system to have \"safe\" areas where trust boundaries can be unambiguously drawn. Do not allow sensitive data to go outside of the trust boundary and always be careful when interfacing with a compartment outside of the safe area.",
     "Ensure that appropriate compartmentalization is built into the system design, and the compartmentalization allows for and reinforces privilege separation functionality. Architects and designers should rely on the principle of least privilege to decide the appropriate time to use privileges and the time to drop privileges."
    ]
   }
  ]
 },
 "RelatedAttackPatterns": {
  "RelatedAttackPattern": [
   {
    "CAPECID": 116
   },
   {
    "CAPECID": 13
   },
   {
    "CAPECID": 169
   },
   {
    "CAPECID": 22
   },
   {
    "CAPECID": 224
   },
   {
    "CAPECID": 285
   },
   {
    "CAPECID": 287
   },
   {
    "CAPECID": 290
   },
   {
    "CAPECID": 291
   },
   {
    "CAPECID": 292
   },
   {
    "CAPECID": 293
   },
   {
    "CAPECID": 294
   },
   {
    "CAPECID": 295
   },
   {
    "CAPECID": 296
   },
   {
    "CAPECID": 297
   },
   {
    "CAPECID": 298
   },
   {
    "CAPECID": 299
   },
   {
    "CAPECID": 300
   },
   {
    "CAPECID": 301
   },
   {
    "CAPECID": 302
   },
   {
    "CAPECID": 303
   },
   {
    "CAPECID": 304
   },
   {
    "CAPECID": 305
   },
   {
    "CAPECID": 306
   },
   {
    "CAPECID": 307
   },
   {
    "CAPECID": 308
   },
   {
    "CAPECID": 309
   },
   {
    "CAPECID": 310
   },
   {
    "CAPECID": 312
   },
   {
    "CAPECID": 313
   },
   {
    "CAPECID": 317
   },
   {
    "CAPECID": 318
   },
   {
    "CAPECID": 319
   },
   {
    "CAPECID": 320
   },
   {
    "CAPECID": 321
   },
   {
    "CAPECID": 322
   },
   {
    "CAPECID": 323
   },
   {
    "CAPECID": 324
   },
   {
    "CAPECID": 325
   },
   {
    "CAPECID": 326
   },
   {
    "CAPECID": 327
   },
   {
    "CAPECID": 328
   },
   {
    "CAPECID": 329
   },
   {
    "CAPECID": 330
   },
   {
    "CAPECID": 472
   },
   {
    "CAPECID": 497
   },
   {
    "CAPECID": 508
   },
   {
    "CAPECID": 573
   },
   {
    "CAPECID": 574
   },
   {
    "CAPECID": 575
   },
   {
    "CAPECID": 576
   },
   {
    "CAPECID": 577
   },
   {
    "CAPECID": 59
   },
   {
    "CAPECID": 60
   },
   {
    "CAPECID": 616
   },
   {
    "CAPECID": 643
   },
   {
    "CAPECID": 646
   },
   {
    "CAPECID": 651
   },
   {
    "CAPECID": 79
   }
  ]
 },
 "CommonConsequences": {
  "Consequence": [
   {
    "Scope": [
     "Confidentiality"
    ],
    "Impact": [
     "Read Application Data"
    ]
   }
  ]
 },
 "ExtendedDescription": [
  "There are many different kinds of mistakes that introduce information exposures. The severity of the error can range widely, depending on the context in which the product operates, the type of sensitive information that is revealed, and the benefits it may provide to an attacker.  Some kinds of sensitive information include:",
  "\n         \n         \n\t\t \n\t\t \n\t\t \n         \n\t\t \n       ",
  "Information might be sensitive to different parties, each of which may have their own expectations for whether the information should be protected.  These parties include:",
  "\n                  \n                  \n\t\t  \n                  \n               ",
  "Information exposures can occur in different ways:",
  "\n                  \n                  \n                  \n               ",
  "It is common practice to describe any loss of confidentiality as an \"information exposure,\" but this can lead to overuse of CWE-200 in CWE mapping. From the CWE perspective, loss of confidentiality is a technical impact that can arise from dozens of different weaknesses, such as insecure file permissions or out-of-bounds read.  CWE-200 and its lower-level descendants are intended to cover the mistakes that occur in behaviors that explicitly manage, store, transfer, or cleanse sensitive information."
 ]
}