{
  "Severity": "CRITICAL",
  "UpdatedAt": "2025-03-12T19:29:13Z",
  "Package": {
    "Ecosystem": "GO",
    "Name": "github.com/cosmos/ibc-go/v2"
  },
  "Advisory": {
    "DatabaseId": 284284,
    "Id": "GSA_kwCzR0hTQS00d2YzLTVxajktMzY4ds4ABFZ8",
    "GhsaId": "GHSA-4wf3-5qj9-368v",
    "References": [
      {
        "Url": "https://github.com/cosmos/ibc-go/security/advisories/GHSA-4wf3-5qj9-368v"
      },
      {
        "Url": "https://github.com/cosmos/ibc-go/releases/tag/v7.10.0"
      },
      {
        "Url": "https://github.com/cosmos/ibc-go/releases/tag/v8.7.0"
      },
      {
        "Url": "https://github.com/advisories/GHSA-4wf3-5qj9-368v"
      }
    ],
    "Identifiers": [
      {
        "Type": "GHSA",
        "Value": "GHSA-4wf3-5qj9-368v"
      }
    ],
    "Description": "Name: ISA-2025-001: Non-deterministic JSON Unmarshalling of IBC Acknowledgement can result in a chain halt\nComponent: IBC-Go\nCriticality: High (Considerable Impact; Likely Likelihood per [ACMv1.2](https://github.com/interchainio/security/blob/main/resources/CLASSIFICATION_MATRIX.md))\nAffected versions: IBC-Go \u003e= v7; Earlier IBC-Go versions MAY also be affected.\nAffected users: Validators, Full nodes, IBC Middleware authors\n\n### Description\n\nAn issue was discovered in IBC-Go's deserialization of acknowledgements that results in non-deterministic behavior which can halt a chain. Any user that can open an IBC channel can introduce this state to the chain. The following patch is in addition to the previous patch which now extends the same protection to all applications beyond transfer.\n\n### Patches\n\nThe new IBC-Go releases below address this issue:\n\n* [v7.10.0](https://github.com/cosmos/ibc-go/releases/tag/v7.10.0)\n* [v8.7.0](https://github.com/cosmos/ibc-go/releases/tag/v8.7.0)\n\n### Workarounds\n\nTo prevent this state from being introduced to a chain, it is possible to permission Channel Opening as a workaround.\n\n### Notes on Re-Release\n\nThis is an extension of the previous patch, please update to the latest patch to get full coverage against the reported issue.\n\n#### Is this state breaking?\n\nThis patch is not state breaking unless an exploit is submitted before the patch is applied across the network in which case the chain will halt just as if it was unpatched. Thus, you can safely apply this patch in a rolling manner and encourage validators to patch as soon as possible in order to prevent any chain halts (and we've already cut new versions of these for you).\n\n#### Testing we have done to gain more confidence in this release\n* In addition to testing ibc-go, we also did the following:\n* Tested PFM v7 and v8 after bumping dependencies\n* Tested ibc-hooks v7 and v8 after bumping dependencies\n* Ran a patched node on Cosmos Hub Mainnet and triggered failing and successful transactions that used PFM\n* Ran a patched node on Osmosis mainnet and triggered failing and successful transactions that used ibc-hooks\nThis is a more thorough process than before, so we have higher confidence.\n\nThis issue was reported to the Cosmos Bug Bounty Program by swelf19 on HackerOne on February 18, 2025. If you believe you have found a bug in the Interchain Stack or would like to contribute to the program by reporting a bug, please see https://hackerone.com/cosmos.\n\nIf you have questions about Interchain security efforts, please reach out to our official communication channel at [security@interchain.io](mailto:security@interchain.io). For more information about the Interchain Foundation’s engagement with Amulet, and to sign up for security notification emails, please see https://github.com/interchainio/security.  \n\nA Github Security Advisory for this issue is available in the IBC-Go [repository](https://github.com/cosmos/ibc-go/security/advisories/GHSA-4wf3-5qj9-368v).",
    "Origin": "UNSPECIFIED",
    "PublishedAt": "2025-03-12T19:29:11Z",
    "Severity": "CRITICAL",
    "Summary": "IBC-Go: Non-deterministic JSON Unmarshalling of IBC Acknowledgement can result in a chain halt",
    "UpdatedAt": "2025-03-12T19:29:13Z",
    "WithdrawnAt": "",
    "CVSS": {
      "Score": 0,
      "VectorString": ""
    }
  },
  "Versions": [
    {
      "FirstPatchedVersion": {
        "Identifier": "7.10.0"
      },
      "VulnerableVersionRange": "\u003c 7.10.0"
    }
  ]
}