{
  "id": "GHSA-3g75-q268-r9r6",
  "modified": "2025-12-18T21:26:19.648224Z",
  "published": "2025-12-18T18:50:42Z",
  "aliases": [
    "CVE-2025-14764"
  ],
  "summary": "Amazon S3 Encryption Client has a Key Commitment Issue",
  "details": "## Summary\n\nS3 Encryption Client for Go is an open-source client-side encryption library used to facilitate writing and reading encrypted records to S3.  \n\nWhen the encrypted data key (EDK) is stored in an \"Instruction File\" instead of S3's metadata record, the EDK is exposed to an \"Invisible Salamanders\" attack  (https://eprint.iacr.org/2019/016), which could allow the EDK to be replaced with a new key. \n\n\n\n## Impact\n\n### Background - Key Commitment\n\nThere is a cryptographic property whereby under certain conditions, a single ciphertext can be decrypted into 2 different plaintexts by using different encryption keys.  To address this issue, strong encryption schemes use what is known as \"key commitment\", a process by which an encrypted message can only be decrypted by one key; the key used to originally encrypt the message. \n\nIn older versions of S3EC, when customers are also using a feature called \"Instruction File\" to store EDKs, key commitment is not implemented because multiple EDKs could be associated to an underlying encrypted message object.  For such customers an attack that leverages the lack of key commitment is possible.  A bad actor would need two things to leverage this issue: (i) the ability to create a separate, rogue, EDK that will also decrypt the underlying object to produce desired plaintext, and (ii) permission to upload a new instruction file to the S3 bucket to replace the existing instruction file placed there by the user using the S3C.  Any future attempt to decrypt the underlying encrypted message with the S3EC will unwittingly use the rogue EDK to produce a valid plaintext message.\n\nImpacted versions: \u003c= v3.1\n\n\n### Patches\n\nAmazon S3 Encryption Client is introducing the concept of \"key commitment\" to S3EC where the EDK is cryptographically bound to the ciphertext in order to address this issue.  In order to maintain compatibility for in-flight messages we are releasing the fix in two versions.  A code-compatible minor version that can read messages with key-commitment but not write them, and a new major version that can both read and write messages with key-commitment.  For maximum safety customers are asked to upgrade to the latest major version: v4.0.0 or later.\n\n## Workarounds\n\nThere are no workarounds, please upgrade to the suggested version of S3EC.\n\n## References\n\nIf customers have any questions or comments about this advisory, Amazon S3 Encryption Client asks that they contact AWS Security through the issue reporting page or directly via email to [aws-security@amazon.com](mailto:aws-security@amazon.com). Please do not create a public GitHub issue.",
  "affected": [
    {
      "package": {
        "ecosystem": "Go",
        "name": "github.com/aws/amazon-s3-encryption-client-go/v3",
        "purl": "pkg:golang/github.com/aws/amazon-s3-encryption-client-go/v3"
      },
      "ranges": [
        {
          "type": "SEMVER",
          "events": [
            {
              "introduced": "0"
            },
            {
              "fixed": "4.0.0"
            }
          ]
        }
      ],
      "database_specific": {
        "source": "https://github.com/github/advisory-database/blob/main/advisories/github-reviewed/2025/12/GHSA-3g75-q268-r9r6/GHSA-3g75-q268-r9r6.json"
      }
    }
  ],
  "references": [
    {
      "type": "WEB",
      "url": "https://github.com/aws/amazon-s3-encryption-client-go/security/advisories/GHSA-3g75-q268-r9r6"
    },
    {
      "type": "ADVISORY",
      "url": "https://nvd.nist.gov/vuln/detail/CVE-2025-14764"
    },
    {
      "type": "WEB",
      "url": "https://github.com/aws/amazon-s3-encryption-client-go/commit/3e1740ec014e234e6d454291615011122e642b5d"
    },
    {
      "type": "WEB",
      "url": "https://aws.amazon.com/security/security-bulletins/AWS-2025-032"
    },
    {
      "type": "PACKAGE",
      "url": "https://github.com/aws/amazon-s3-encryption-client-go"
    },
    {
      "type": "WEB",
      "url": "https://github.com/aws/amazon-s3-encryption-client-go/releases/tag/v4.0.0"
    }
  ]
}