{
  "Severity": "HIGH",
  "UpdatedAt": "2025-01-14T15:42:15Z",
  "Package": {
    "Ecosystem": "COMPOSER",
    "Name": "typo3/cms-scheduler"
  },
  "Advisory": {
    "DatabaseId": 275701,
    "Id": "GSA_kwCzR0hTQS03ODM1LWZjdjMtZzI1Ns4ABDT1",
    "GhsaId": "GHSA-7835-fcv3-g256",
    "References": [
      {
        "Url": "https://github.com/TYPO3/typo3/security/advisories/GHSA-7835-fcv3-g256"
      },
      {
        "Url": "https://typo3.org/security/advisory/typo3-core-sa-2025-009"
      },
      {
        "Url": "https://nvd.nist.gov/vuln/detail/CVE-2024-55924"
      },
      {
        "Url": "https://github.com/advisories/GHSA-7835-fcv3-g256"
      }
    ],
    "Identifiers": [
      {
        "Type": "GHSA",
        "Value": "GHSA-7835-fcv3-g256"
      },
      {
        "Type": "CVE",
        "Value": "CVE-2024-55924"
      }
    ],
    "Description": "### Problem\nA vulnerability has been identified in the backend user interface functionality involving deep links. Specifically, this functionality is susceptible to Cross-Site Request Forgery (CSRF). Additionally, state-changing actions in downstream components incorrectly accepted submissions via HTTP GET and did not enforce the appropriate HTTP method.\n\nSuccessful exploitation of this vulnerability requires the victim to have an active session on the backend user interface and to be deceived into interacting with a malicious URL targeting the backend, which can occur under the following conditions:\n\n* the user opens a malicious link, such as one sent via email.\n* the user visits a compromised or manipulated website while the following settings are misconfigured:\n  + `security.backend.enforceReferrer` feature is disabled,\n  + `BE/cookieSameSite` configuration is set to `lax` or `none`\n\nThe vulnerability in the affected downstream component “Scheduler Module” allows attackers to trigger pre-defined command classes - which can lead to unauthorized import or export of data in the worst case.\n\n### Solution\nUpdate to TYPO3 versions 11.5.42 ELTS that fixes the problem described.\n\n### Credits\nThanks to Gabriel Dimitrov who reported this issue and to TYPO3 core and security members Benjamin Franzke, Oliver Hader, Andreas Kienast, Torben Hansen, Elias Häußler who fixed the issue.",
    "Origin": "UNSPECIFIED",
    "PublishedAt": "2025-01-14T15:42:12Z",
    "Severity": "HIGH",
    "Summary": "TYPO3 Scheduler Module vulnerable to Cross-Site Request Forgery",
    "UpdatedAt": "2025-06-02T07:45:07Z",
    "WithdrawnAt": "",
    "CVSS": {
      "Score": 8,
      "VectorString": "CVSS:3.1/AV:N/AC:L/PR:L/UI:R/S:U/C:H/I:H/A:H"
    }
  },
  "Versions": [
    {
      "FirstPatchedVersion": {
        "Identifier": "11.5.42"
      },
      "VulnerableVersionRange": "\u003e= 11.0.0, \u003c= 11.5.41"
    }
  ]
}