{
  "Identifier": "GHSA-9vx8-f5c4-862x",
  "PackageSlug": "maven/org.neo4j.procedure/apoc",
  "Title": "XML External Entity (XXE) vulnerability in apoc.import.graphml",
  "Description": "### Impact\nA XML External Entity (XXE) vulnerability found in the apoc.import.graphml procedure of APOC core plugin in Neo4j graph database. XML External Entity (XXE) injection occurs when the XML parser allows external entities to be resolved. The XML parser used by the apoc.import.graphml procedure was not configured in a secure way and therefore allowed this.\n\nExternal entities can be used to read local files, send HTTP requests, and perform denial-of-service attacks on the application.\n\nAbusing the XXE vulnerability enabled assessors to read local files remotely. Although with the level of privileges assessors had this was limited to one-line files. With the ability to write to the database, any file could have been read. Additionally, assessors noted, with local testing, the server could be crashed by passing in improperly formatted XML. \n\n### Patches\nThe users should aim to use the latest released version compatible with their Neo4j version. The minimum versions containing patch for this vulnerability is 4.4.0.14. \n\n### Workarounds\nIf you cannot upgrade the library, you can control the allowlist of the procedures that can be used in your system.\n\n### For more information\nIf you have any questions or comments about this advisory:\n* Open an issue in neo4j-apoc-procedures\n* Email us at [security@neo4j.com](mailto:security@neo4j.com)\n",
  "Date": "2023-03-31",
  "Pubdate": "2023-02-24",
  "AffectedRange": "(,4.4.0.14),[5.0.0,5.5.0)",
  "FixedVersions": [
    "4.4.0.14",
    "5.5.0"
  ],
  "AffectedVersions": "All versions before 4.4.0.14, all versions starting from 5.0.0 before 5.5.0",
  "NotImpacted": "All versions starting from 4.4.0.14 before 5.0.0, all versions starting from 5.5.0",
  "Solution": "Upgrade to versions 4.4.0.14, 5.5.0 or above.",
  "Urls": [
    "https://github.com/neo4j-contrib/neo4j-apoc-procedures/security/advisories/GHSA-9vx8-f5c4-862x",
    "https://github.com/neo4j/apoc/security/advisories/GHSA-6wxg-wh7f-rqpr",
    "https://nvd.nist.gov/vuln/detail/CVE-2023-23926",
    "https://github.com/neo4j-contrib/neo4j-apoc-procedures/commit/c3e2a29020497acf9417879f38e8af4e8c6d5783",
    "https://github.com/neo4j-contrib/neo4j-apoc-procedures/releases/tag/4.4.0.14",
    "https://github.com/advisories/GHSA-9vx8-f5c4-862x"
  ],
  "CvssV2": "",
  "CvssV3": "",
  "UUID": "c8990a58-31a6-4a6c-84b0-36a4c5e44d24"
}