{
  "Title": "Security update for unbound",
  "Tracking": {
    "ID": "SUSE-SU-2025:20024-1",
    "Status": "Final",
    "Version": "1",
    "InitialReleaseDate": "2025-02-03T08:50:28Z",
    "CurrentReleaseDate": "2025-02-03T08:50:28Z",
    "RevisionHistory": [
      {
        "Number": "1",
        "Date": "2025-02-03T08:50:28Z",
        "Description": "current"
      }
    ]
  },
  "Notes": [
    {
      "Text": "Security update for unbound",
      "Title": "Topic",
      "Type": "Summary"
    },
    {
      "Text": "This update for unbound fixes the following issues:\n\n- Update to 1.20.0:\n  Features:\n  * The config for discard-timeout, wait-limit, wait-limit-cookie,\n    wait-limit-netblock and wait-limit-cookie-netblock was added,\n    for the fix to the DNSBomb issue.\n  * Merge GH#1027: Introduce 'cache-min-negative-ttl' option.\n  * Merge GH#1043 from xiaoxiaoafeifei: Add loongarch support;\n    updates config.guess(2024-01-01) and config.sub(2024-01-01),\n    verified with upstream.\n  * Implement cachedb-check-when-serve-expired: yes option, default\n    is enabled. When serve expired is enabled with cachedb, it\n    first checks cachedb before serving the expired response.\n  * Fix GH#876: [FR] can unbound-checkconf be silenced when\n    configuration is valid?\n\n  Bug Fixes:\n  * Fix for the DNSBomb vulnerability CVE-2024-33655. Thanks to\n    Xiang Li from the Network and Information Security Lab of\n    Tsinghua University for reporting it.\n  * Update doc/unbound.doxygen with 'doxygen -u'. Fixes option\n    deprecation warnings and updates with newer defaults.\n  * Remove unused portion from iter_dname_ttl unit test.\n  * Fix validator classification of qtype DNAME for positive and\n    redirection answers, and fix validator signature routine for\n    dealing with the synthesized CNAME for a DNAME without\n    previously encountering it and also for when the qtype is\n    DNAME.\n  * Fix qname minimisation for reply with a DNAME for qtype CNAME\n    that answers it.\n  * Fix doc test so it ignores but outputs unsupported doxygen\n    options.\n  * Fix GH#1021 Inconsistent Behavior with Changing\n    rpz-cname-override and doing a unbound-control reload.\n  * Merge GH#1028: Clearer documentation for tcp-idle-timeout and\n    edns-tcp-keepalive-timeout.\n  * Fix GH#1029: rpz trigger clientip and action rpz-passthru not\n    working as expected.\n  * Fix rpz that the rpz override is taken in case of clientip\n    triggers. Fix that the clientip passthru action is logged. Fix\n    that the clientip localdata action is logged. Fix rpz override\n    action cname for the clientip trigger.\n  * Fix to unify codepath for local alias for rpz cname action\n    override.\n  * Fix rpz for cname override action after nsdname and nsip\n    triggers.\n  * Fix that addrinfo is not kept around but copied and freed, so\n    that log-destaddr uses a copy of the information, much like NSD\n    does.\n  * Merge GH#1030: Persist the openssl and expat directories for\n    repeated Windows builds.\n  * Fix that rpz CNAME content is limited to the max number of\n    cnames.\n  * Fix rpz, it follows iterator CNAMEs for nsip and nsdname and\n    sets the reply query_info values, that is better for debug\n    logging.\n  * Fix rpz that copies the cname override completely to the temp\n    region, so there are no references to the rpz region.\n  * Add rpz unit test for nsip action override.\n  * Fix rpz for qtype CNAME after nameserver trigger.\n  * Fix rpz so that rpz CNAME can apply after rpz CNAME. And fix\n    that clientip and nsip can give a CNAME.\n  * Fix localdata and rpz localdata to match CNAME only if no\n    direct type match is available.\n  * Merge GH#831 from Pierre4012: Improve Windows NSIS installer\n    script (setup.nsi).\n  * For GH#831: Format text, use exclamation icon and explicit label\n    names.\n  * Fix name of unit test for subnet cache response.\n  * Fix GH#1032: The size of subnet_msg_cache calculation mistake\n    cause memory usage increased beyond expectations.\n  * Fix for GH#1032, add safeguard to make table space positive.\n  * Fix comment in lruhash space function.\n  * Fix to add unit test for lruhash space that exercises the\n    routines.\n  * Fix that when the server truncates the pidfile, it does not\n    follow symbolic links.\n  * Fix that the server does not chown the pidfile.\n  * Fix GH#1034: DoT forward-zone via unbound-control.\n  * Fix for crypto related failures to have a better error string.\n  * Fix GH#1035: Potential Bug while parsing port from the\n    \"stub-host\" string; also affected forward-zones and\n    remote-control host directives.\n  * Fix GH#369: dnstap showing extra responses; for client responses\n    right from the cache when replying with expired data or\n    prefetching.\n  * Fix GH#1040: fix heap-buffer-overflow issue in function\n    cfg_mark_ports of file util/config_file.c.\n  * For GH#1040: adjust error text and disallow negative ports in\n    other parts of cfg_mark_ports.\n  * Fix comment syntax for view function views_find_view.\n  * Fix GH#595: unbound-anchor cannot deal with full disk; it will\n    now first write out to a temp file before replacing the\n    original one, like Unbound already does for\n    auto-trust-anchor-file.\n  * Fixup compile without cachedb.\n  * Add test for cachedb serve expired.\n  * Extended test for cachedb serve expired.\n  * Fix makefile dependencies for fake_event.c.\n  * Fix cachedb for serve-expired with serve-expired-reply-ttl.\n  * Fix to not reply serve expired unless enabled for cachedb.\n  * Fix cachedb for serve-expired with\n    serve-expired-client-timeout.\n  * Fixup unit test for cachedb server expired client timeout with\n    a check if response if from upstream or from cachedb.\n  * Fixup cachedb to not refetch when serve-expired-client-timeout\n    is used.\n  * Merge GH#1049 from Petr Menšík: Py_NoSiteFlag is not needed since\n    Python 3.8\n  * Fix GH#1048: Update ax_pkg_swig.m4 and ax_pthread.m4.\n  * Fix configure, autoconf for GH#1048.\n  * Add checklock feature verbose_locking to trace locks and\n    unlocks.\n  * Fix edns subnet to sort rrset references when storing messages\n    in the cache. This fixes a race condition in the rrset locks.\n  * Merge GH#1053: Remove child delegations from cache when\n    grandchild delegations are returned from parent.\n  * Fix ci workflow for macos for moved install locations.\n  * Fix configure flto check error, by finding grep for it.\n  * Merge GH#1041: Stub and Forward unshare. This has one structure\n    for them and fixes GH#1038: fatal error: Could not initialize\n    thread / error: reading root hints.\n  * Fix to disable fragmentation on systems with IP_DONTFRAG, with\n    a nonzero value for the socket option argument.\n  * Fix doc unit test for out of directory build.\n  * Fix cachedb with serve-expired-client-timeout disabled. The\n    edns subnet module deletes global cache and cachedb cache when\n    it stores a result, and serve-expired is enabled, so that the\n    global reply, that is older than the ecs reply, does not return\n    after the ecs reply expires.\n  * Add unit tests for cachedb and subnet cache expired data.\n  * Man page entry for unbound-checkconf -q.\n  * Cleanup unnecessary strdup calls for EDE strings.\n  * Fix doxygen comment for errinf_to_str_bogus.\n\n- Update to 1.19.3:\n  * Features:\n    - Merge PR #973: Use the origin (DNAME) TTL for synthesized\n      CNAMEs as per RFC 6672.\n  * Bug Fixes\n    - Fix unit test parse of origin syntax.\n    - Use 127.0.0.1 explicitly in tests to avoid delays and errors\n      on newer systems.\n    - Fix #964: config.h.in~ backup file in release tar balls.\n    - Merge #968: Replace the obsolescent fgrep with grep -F in\n      tests.\n    - Merge #971: fix 'WARNING: Message has 41 extra bytes at end'.\n    - Fix #969: [FR] distinguish Do53, DoT and DoH in the logs.\n    - Fix dnstap that assertion failed on logging other than UDP\n      and TCP traffic. It lists it as TCP traffic.\n    - Fix to sync the tests script file common.sh.\n    - iana portlist update.\n    - Updated IPv4 and IPv6 address for b.root-servers.net in root\n      hints.\n    - Update test script file common.sh.\n    - Fix tests to use new common.sh functions, wait_logfile and\n      kill_from_pidfile.\n    - Fix #974: doc: default number of outgoing ports without\n      libevent.\n    - Merge #975: Fixed some syntax errors in rpl files.\n    - Fix root_zonemd unit test, it checks that the root ZONEMD\n      verifies, now that the root has a valid ZONEMD.\n    - Update example.conf with cookie options.\n    - Merge #980: DoH: reject non-h2 early. To fix #979: Improve\n      errors for non-HTTP/2 DoH clients.\n    - Merge #985: Add DoH and DoT to dnstap message.\n    - Fix #983: Sha1 runtime insecure change was incomplete.\n    - Remove unneeded newlines and improve indentation in remote\n      control code.\n    - Merge #987: skip edns frag retry if advertised udp payload\n      size is not smaller.\n    - Fix unit test for #987 change in udp1xxx retry packet send.\n    - Merge #988: Fix NLnetLabs#981: dump_cache truncates large\n      records.\n    - Fix to link with -lcrypt32 for OpenSSL 3.2.0 on Windows.\n    - Fix to link with libssp for libcrypto and getaddrinfo check\n      for only header. Also update crosscompile to remove ssp for\n      32bit.\n    - Merge #993: Update b.root-servers.net also in example config\n      file.\n    - Update workflow for ports to use newer openssl on windows\n      compile.\n    - Fix warning for windres on resource files due to\n      redefinition.\n    - Fix for #997: Print details for SSL certificate failure.\n    - Update error printout for duplicate trust anchors to include\n      the trust anchor name (relates to #920).\n    - Update message TTL when using cached RRSETs. It could result\n      in non-expired messages with expired RRSETs (non-usable\n      messages by Unbound).\n    - Merge #999: Search for protobuf-c with pkg-config.\n    - Fix #1006: Can't find protobuf-c package since #999.\n    - Fix documentation for access-control in the unbound.conf man\n      page.\n    - Merge #1010: Mention REFUSED has the TC bit set with\n      unmatched allow_cookie acl in the manpage. It also fixes the\n      code to match the documentation about clients with a valid\n      cookie that bypass the ratelimit regardless of the\n      allow_cookie acl.\n    - Document the suspend argument for process_ds_response().\n    - Move github workflows to use checkoutv4.\n    - Fix edns subnet replies for scope zero answers to not get\n      stored in the global cache, and in cachedb, when the upstream\n      replies without an EDNS record.\n    - Fix for #1022: Fix ede prohibited in access control refused\n      answers.\n    - Fix unbound-control-setup.cmd to use 3072 bits so that\n      certificates are long enough for newer OpenSSL versions.\n    - Fix TTL of synthesized CNAME when a DNAME is used from cache.\n    - Fix unbound-control-setup.cmd to have CA v3 basicConstraints,\n      like unbound-control-setup.sh has.\n\n- Update to 1.19.2:\n  * Bug Fixes:\n    - Fix CVE-2024-1931, Denial of service when trimming EDE text\n      on positive replies.\n      [bsc#1221164]\n\n- Update to 1.19.1:\n  * Bug Fixes: [bsc#1219823, CVE-2023-50387][bsc#1219826, CVE-2023-50868]\n    - Fix CVE-2023-50387, DNSSEC verification complexity can be\n      exploited to exhaust CPU resources and stall DNS resolvers.\n    - Fix CVE-2023-50868, NSEC3 closest encloser proof can exhaust CPU.\n\n- as we use --disable-explicit-port-randomisation, also disable\n  outgoing-port-permit and outgoing-port-avoid in config file to\n  suppress the related unbound-checkconf warnings on every start\n\n- Update to 1.19.0:\n  * Features:\n    - Fix #850: [FR] Ability to use specific database in Redis, with\n      new redis-logical-db configuration option.\n    - Merge #944: Disable EDNS DO. Disable the EDNS DO flag in upstream\n      requests. This can be helpful for devices that cannot handle\n      DNSSEC information. But it should not be enabled otherwise, because\n      that would stop DNSSEC validation. The DNSSEC validation would not\n      work for Unbound itself, and also not for downstream users. Default\n      is no. The option is disable-edns-do: no\n    - Expose the script filename in the Python module environment 'mod_env'\n      instead of the config_file structure which includes the linked list\n      of scripts in a multi Python module setup; fixes #79.\n    - Expose the configured listening and outgoing interfaces, if any, as\n      a list of strings in the Python 'config_file' class instead of the\n      current Swig object proxy; fixes #79.\n    - Mailing list patches from Daniel Gröber for DNS64 fallback to plain\n      AAAA when no A record exists for synthesis, and minor DNS64 code\n      refactoring for better readability.\n    - Merge #951: Cachedb no store. The cachedb-no-store: yes option is\n      used to stop cachedb from writing messages to the backend storage.\n      It reads messages when data is available from the backend.\n      The default is no.\n  * Bug Fixes:\n    - Fix for version generation race condition that ignored changes.\n    - Fix #942: 1.18.0 libunbound DNS regression when built without OpenSSL.\n    - Fix for WKS call to getservbyname that creates allocation on exit in\n      unit test by testing numbers first and testing from the services list later.\n    - Fix autoconf 2.69 warnings in configure.\n    - Fix #927: unbound 1.18.0 make test error. Fix make test without SHA1.\n    - Merge #931: Prevent warnings from -Wmissing-prototypes.\n    - Fix to scrub resource records of type A and AAAA that have an\n      inappropriate size. They are removed from responses.\n    - Fix to move msgparse_rrset_remove_rr code to util/msgparse.c.\n    - Fix to add EDE text when RRs have been removed due to length.\n    - Fix to set ede match in unit test for rr length removal.\n    - Fix to print EDE text in readable form in output logs.\n    - Fix send of udp retries when ENOBUFS is returned. It stops looping\n      and also waits for the condition to go away. Reported by Florian Obser.\n    - Fix authority zone answers for obscured DNAMEs and delegations.\n    - Merge #936: Check for c99 with autoconf versions prior to 2.70.\n    - Fix to remove two c99 notations.\n    - Fix rpz tcp-only action with rpz triggers nsdname and nsip.\n    - Fix misplaced comment.\n    - Merge #881: Generalise the proxy protocol code.\n    - Fix #946: Forwarder returns servfail on upstream response noerror no data.\n    - Fix edns subnet so that queries with a source prefix of zero cause the\n      recursor send no edns subnet option to the upstream.\n    - Fix that printout of EDNS options shows the EDNS cookie option by name.\n    - Fix infinite loop when reading multiple lines of input on a broken remote\n      control socket. Addesses #947 and #948.\n    - Fix #949: \"could not create control compt\".\n    - Fix that cachedb does not warn when serve-expired is disabled about use\n      of serve-expired-reply-ttl and serve-expired-client-timeout.\n    - Fix for #949: Fix pythonmod/ubmodule-tst.py for Python 3.x.\n    - Better fix for infinite loop when reading multiple lines of input on a\n      broken remote control socket, by treating a zero byte line the same as\n      transmission end. Addesses #947 and #948.\n    - For multi Python module setups, clean previously parsed module functions\n      in __main__'s dictionary, if any, so that only current module functions\n      are registered.\n    - Fix #954: Inconsistent RPZ handling for A record returned along with CNAME.\n    - Fixes for the DNS64 patches.\n    - Update the dns64_lookup.rpl test for the DNS64 fallback patch.\n    - Merge #955 from buevsan: fix ipset wrong behavior.\n    - Update testdata/ipset.tdir test for ipset fix.\n    - Fix to print detailed errors when an SSL IO routine fails via SSL_get_error.\n    - Clearer configure text for missing protobuf-c development libraries.\n    - autoconf.\n    - Merge #930 from Stuart Henderson: add void to log_ident_revert_to_default\n      declaration.\n    - Fix #941: dnscrypt doesn't work after upgrade to 1.18 with suggestion by\n      dukeartem to also fix the udp_ancil with dnscrypt.\n    - Fix SSL compile failure for definition in log_crypto_err_io_code_arg.\n    - Fix SSL compile failure for other missing definitions in log_crypto_err_io_code_arg.\n    - Fix compilation without openssl, remove unused function warning.\n    - Mention flex and bison in README.md when building from repository source.\n\n- Update to 1.18.0:\n  * Features:\n    - Аdd a metric about the maximum number of collisions in lrushah.\n    - Set max-udp-size default to 1232. This is the same default value\n      as the default value for edns-buffer-size. It restricts client\n      edns buffer size choices, and makes unbound behave similar to\n      other DNS resolvers.\n    - Add harden-unknown-additional option. It removes unknown records\n      from the authority section and additional section.\n    - Added new static zone type block_a to suppress all A queries for\n      specific zones.\n    - [FR] Ability to use Redis unix sockets.\n    - [FR] Ability to set the Redis password.\n    - Features/dropqueuedpackets, with sock-queue-timeout option that\n      drops packets that have been in the socket queue for too long.\n      Added statistics num.queries_timed_out and query.queue_time_us.max\n      that track the socket queue timeouts.\n    - 'eqvinox' Lamparter: NAT64 support.\n    - [FR] Use kernel timestamps for dnstap.\n    - Add cachedb hit stat. Introduces 'num.query.cachedb' as a new\n      statistical counter.\n    - Add SVCB dohpath support.\n    - Add validation EDEs to queries where the CD bit is set.\n    - Add prefetch support for subnet cache entries.\n    - Add EDE (RFC8914) caching.\n    - Add support for EDE caching in cachedb and subnetcache.\n    - Downstream DNS Server Cookies a la RFC7873 and RFC9018. Create server\n      cookies for clients that send client cookies. This needs to be explicitly\n      turned on in the config file with: `answer-cookie: yes`.\n  * Bug Fixes\n    - Response change to NODATA for some ANY queries since 1.12.\n    - Fix not following cleared RD flags potentially enables\n      amplification DDoS attacks.\n    - Set default for harden-unknown-additional to no. So that it\n      does not hamper future protocol developments.\n    - Fix to ignore entirely empty responses, and try at another authority.\n      This turns completely empty responses, a type of noerror/nodata into\n      a servfail, but they do not conform to RFC2308, and the retry can fetch\n      improved content.\n    - Allow TTL refresh of expired error responses.\n    - Fix: Unexpected behavior with client-subnet-always-forward and serve-expired\n    - Fix unbound-dnstap-socket test program to reply the finish frame over\n      a TLS connection correctly.\n    - Fix: reserved identifier violation\n    - Fix: Unencrypted query is sent when forward-tls-upstream: yes is used\n      without tls-cert-bundle\n    - Extra consistency check to make sure that when TLS is requested,\n      either we set up a TLS connection or we return an error.\n    - Fix: NXDOMAIN instead of NOERROR rcode when asked for existing CNAME record.\n    - Fix: Bad interaction with 0 TTL records and serve-expired\n    - Fix RPZ IP responses with trigger rpz-drop on cache entries.\n    - Fix RPZ removal of client-ip, nsip, nsdname triggers from IXFR.\n    - Fix dereference of NULL variable warning in mesh_do_callback.\n    - Fix ip_ratelimit test to work with dig that enables DNS cookies.\n    - Fix for iter_dec_attempts that could cause a hang, part of capsforid\n      and qname minimisation, depending on the settings.\n    - Fix uninitialized memory passed in padding bytes of cmsg to sendmsg.\n    - Fix stat_values test to work with dig that enables DNS cookies.\n    - unbound.service: Main process exited, code=killed, status=11/SEGV.\n      Fixes cachedb configuration handling.\n    - Fix: processQueryResponse() THROWAWAY should be mindful of fail_reply.\n\n- Update to 1.20.0:\n  Features:\n  * The config for discard-timeout, wait-limit, wait-limit-cookie,\n    wait-limit-netblock and wait-limit-cookie-netblock was added,\n    for the fix to the DNSBomb issue.\n  * Merge GH#1027: Introduce 'cache-min-negative-ttl' option.\n  * Merge GH#1043 from xiaoxiaoafeifei: Add loongarch support;\n    updates config.guess(2024-01-01) and config.sub(2024-01-01),\n    verified with upstream.\n  * Implement cachedb-check-when-serve-expired: yes option, default\n    is enabled. When serve expired is enabled with cachedb, it\n    first checks cachedb before serving the expired response.\n  * Fix GH#876: [FR] can unbound-checkconf be silenced when\n    configuration is valid?\n\n  Bug Fixes:\n  * Fix for the DNSBomb vulnerability CVE-2024-33655. Thanks to\n    Xiang Li from the Network and Information Security Lab of\n    Tsinghua University for reporting it.\n  * Update doc/unbound.doxygen with 'doxygen -u'. Fixes option\n    deprecation warnings and updates with newer defaults.\n  * Remove unused portion from iter_dname_ttl unit test.\n  * Fix validator classification of qtype DNAME for positive and\n    redirection answers, and fix validator signature routine for\n    dealing with the synthesized CNAME for a DNAME without\n    previously encountering it and also for when the qtype is\n    DNAME.\n  * Fix qname minimisation for reply with a DNAME for qtype CNAME\n    that answers it.\n  * Fix doc test so it ignores but outputs unsupported doxygen\n    options.\n  * Fix GH#1021 Inconsistent Behavior with Changing\n    rpz-cname-override and doing a unbound-control reload.\n  * Merge GH#1028: Clearer documentation for tcp-idle-timeout and\n    edns-tcp-keepalive-timeout.\n  * Fix GH#1029: rpz trigger clientip and action rpz-passthru not\n    working as expected.\n  * Fix rpz that the rpz override is taken in case of clientip\n    triggers. Fix that the clientip passthru action is logged. Fix\n    that the clientip localdata action is logged. Fix rpz override\n    action cname for the clientip trigger.\n  * Fix to unify codepath for local alias for rpz cname action\n    override.\n  * Fix rpz for cname override action after nsdname and nsip\n    triggers.\n  * Fix that addrinfo is not kept around but copied and freed, so\n    that log-destaddr uses a copy of the information, much like NSD\n    does.\n  * Merge GH#1030: Persist the openssl and expat directories for\n    repeated Windows builds.\n  * Fix that rpz CNAME content is limited to the max number of\n    cnames.\n  * Fix rpz, it follows iterator CNAMEs for nsip and nsdname and\n    sets the reply query_info values, that is better for debug\n    logging.\n  * Fix rpz that copies the cname override completely to the temp\n    region, so there are no references to the rpz region.\n  * Add rpz unit test for nsip action override.\n  * Fix rpz for qtype CNAME after nameserver trigger.\n  * Fix rpz so that rpz CNAME can apply after rpz CNAME. And fix\n    that clientip and nsip can give a CNAME.\n  * Fix localdata and rpz localdata to match CNAME only if no\n    direct type match is available.\n  * Merge GH#831 from Pierre4012: Improve Windows NSIS installer\n    script (setup.nsi).\n  * For GH#831: Format text, use exclamation icon and explicit label\n    names.\n  * Fix name of unit test for subnet cache response.\n  * Fix GH#1032: The size of subnet_msg_cache calculation mistake\n    cause memory usage increased beyond expectations.\n  * Fix for GH#1032, add safeguard to make table space positive.\n  * Fix comment in lruhash space function.\n  * Fix to add unit test for lruhash space that exercises the\n    routines.\n  * Fix that when the server truncates the pidfile, it does not\n    follow symbolic links.\n  * Fix that the server does not chown the pidfile.\n  * Fix GH#1034: DoT forward-zone via unbound-control.\n  * Fix for crypto related failures to have a better error string.\n  * Fix GH#1035: Potential Bug while parsing port from the\n    \"stub-host\" string; also affected forward-zones and\n    remote-control host directives.\n  * Fix GH#369: dnstap showing extra responses; for client responses\n    right from the cache when replying with expired data or\n    prefetching.\n  * Fix GH#1040: fix heap-buffer-overflow issue in function\n    cfg_mark_ports of file util/config_file.c.\n  * For GH#1040: adjust error text and disallow negative ports in\n    other parts of cfg_mark_ports.\n  * Fix comment syntax for view function views_find_view.\n  * Fix GH#595: unbound-anchor cannot deal with full disk; it will\n    now first write out to a temp file before replacing the\n    original one, like Unbound already does for\n    auto-trust-anchor-file.\n  * Fixup compile without cachedb.\n  * Add test for cachedb serve expired.\n  * Extended test for cachedb serve expired.\n  * Fix makefile dependencies for fake_event.c.\n  * Fix cachedb for serve-expired with serve-expired-reply-ttl.\n  * Fix to not reply serve expired unless enabled for cachedb.\n  * Fix cachedb for serve-expired with\n    serve-expired-client-timeout.\n  * Fixup unit test for cachedb server expired client timeout with\n    a check if response if from upstream or from cachedb.\n  * Fixup cachedb to not refetch when serve-expired-client-timeout\n    is used.\n  * Merge GH#1049 from Petr Menšík: Py_NoSiteFlag is not needed since\n    Python 3.8\n  * Fix GH#1048: Update ax_pkg_swig.m4 and ax_pthread.m4.\n  * Fix configure, autoconf for GH#1048.\n  * Add checklock feature verbose_locking to trace locks and\n    unlocks.\n  * Fix edns subnet to sort rrset references when storing messages\n    in the cache. This fixes a race condition in the rrset locks.\n  * Merge GH#1053: Remove child delegations from cache when\n    grandchild delegations are returned from parent.\n  * Fix ci workflow for macos for moved install locations.\n  * Fix configure flto check error, by finding grep for it.\n  * Merge GH#1041: Stub and Forward unshare. This has one structure\n    for them and fixes GH#1038: fatal error: Could not initialize\n    thread / error: reading root hints.\n  * Fix to disable fragmentation on systems with IP_DONTFRAG, with\n    a nonzero value for the socket option argument.\n  * Fix doc unit test for out of directory build.\n  * Fix cachedb with serve-expired-client-timeout disabled. The\n    edns subnet module deletes global cache and cachedb cache when\n    it stores a result, and serve-expired is enabled, so that the\n    global reply, that is older than the ecs reply, does not return\n    after the ecs reply expires.\n  * Add unit tests for cachedb and subnet cache expired data.\n  * Man page entry for unbound-checkconf -q.\n  * Cleanup unnecessary strdup calls for EDE strings.\n  * Fix doxygen comment for errinf_to_str_bogus.\n\n- Update to 1.19.3:\n  * Features:\n    - Merge PR #973: Use the origin (DNAME) TTL for synthesized\n      CNAMEs as per RFC 6672.\n  * Bug Fixes\n    - Fix unit test parse of origin syntax.\n    - Use 127.0.0.1 explicitly in tests to avoid delays and errors\n      on newer systems.\n    - Fix #964: config.h.in~ backup file in release tar balls.\n    - Merge #968: Replace the obsolescent fgrep with grep -F in\n      tests.\n    - Merge #971: fix 'WARNING: Message has 41 extra bytes at end'.\n    - Fix #969: [FR] distinguish Do53, DoT and DoH in the logs.\n    - Fix dnstap that assertion failed on logging other than UDP\n      and TCP traffic. It lists it as TCP traffic.\n    - Fix to sync the tests script file common.sh.\n    - iana portlist update.\n    - Updated IPv4 and IPv6 address for b.root-servers.net in root\n      hints.\n    - Update test script file common.sh.\n    - Fix tests to use new common.sh functions, wait_logfile and\n      kill_from_pidfile.\n    - Fix #974: doc: default number of outgoing ports without\n      libevent.\n    - Merge #975: Fixed some syntax errors in rpl files.\n    - Fix root_zonemd unit test, it checks that the root ZONEMD\n      verifies, now that the root has a valid ZONEMD.\n    - Update example.conf with cookie options.\n    - Merge #980: DoH: reject non-h2 early. To fix #979: Improve\n      errors for non-HTTP/2 DoH clients.\n    - Merge #985: Add DoH and DoT to dnstap message.\n    - Fix #983: Sha1 runtime insecure change was incomplete.\n    - Remove unneeded newlines and improve indentation in remote\n      control code.\n    - Merge #987: skip edns frag retry if advertised udp payload\n      size is not smaller.\n    - Fix unit test for #987 change in udp1xxx retry packet send.\n    - Merge #988: Fix NLnetLabs#981: dump_cache truncates large\n      records.\n    - Fix to link with -lcrypt32 for OpenSSL 3.2.0 on Windows.\n    - Fix to link with libssp for libcrypto and getaddrinfo check\n      for only header. Also update crosscompile to remove ssp for\n      32bit.\n    - Merge #993: Update b.root-servers.net also in example config\n      file.\n    - Update workflow for ports to use newer openssl on windows\n      compile.\n    - Fix warning for windres on resource files due to\n      redefinition.\n    - Fix for #997: Print details for SSL certificate failure.\n    - Update error printout for duplicate trust anchors to include\n      the trust anchor name (relates to #920).\n    - Update message TTL when using cached RRSETs. It could result\n      in non-expired messages with expired RRSETs (non-usable\n      messages by Unbound).\n    - Merge #999: Search for protobuf-c with pkg-config.\n    - Fix #1006: Can't find protobuf-c package since #999.\n    - Fix documentation for access-control in the unbound.conf man\n      page.\n    - Merge #1010: Mention REFUSED has the TC bit set with\n      unmatched allow_cookie acl in the manpage. It also fixes the\n      code to match the documentation about clients with a valid\n      cookie that bypass the ratelimit regardless of the\n      allow_cookie acl.\n    - Document the suspend argument for process_ds_response().\n    - Move github workflows to use checkoutv4.\n    - Fix edns subnet replies for scope zero answers to not get\n      stored in the global cache, and in cachedb, when the upstream\n      replies without an EDNS record.\n    - Fix for #1022: Fix ede prohibited in access control refused\n      answers.\n    - Fix unbound-control-setup.cmd to use 3072 bits so that\n      certificates are long enough for newer OpenSSL versions.\n    - Fix TTL of synthesized CNAME when a DNAME is used from cache.\n    - Fix unbound-control-setup.cmd to have CA v3 basicConstraints,\n      like unbound-control-setup.sh has.\n\n- Update to 1.19.2:\n  * Bug Fixes:\n    - Fix CVE-2024-1931, Denial of service when trimming EDE text\n      on positive replies.\n      [bsc#1221164]\n\n- Update to 1.19.1:\n  * Bug Fixes: [bsc#1219823, CVE-2023-50387][bsc#1219826, CVE-2023-50868]\n    - Fix CVE-2023-50387, DNSSEC verification complexity can be\n      exploited to exhaust CPU resources and stall DNS resolvers.\n    - Fix CVE-2023-50868, NSEC3 closest encloser proof can exhaust CPU.\n\n- as we use --disable-explicit-port-randomisation, also disable\n  outgoing-port-permit and outgoing-port-avoid in config file to\n  suppress the related unbound-checkconf warnings on every start\n\n- Use prefixes instead of sudo in unbound.service (bsc#1215628)\n\n- Update to 1.19.0:\n  * Features:\n    - Fix #850: [FR] Ability to use specific database in Redis, with\n      new redis-logical-db configuration option.\n    - Merge #944: Disable EDNS DO. Disable the EDNS DO flag in upstream\n      requests. This can be helpful for devices that cannot handle\n      DNSSEC information. But it should not be enabled otherwise, because\n      that would stop DNSSEC validation. The DNSSEC validation would not\n      work for Unbound itself, and also not for downstream users. Default\n      is no. The option is disable-edns-do: no\n    - Expose the script filename in the Python module environment 'mod_env'\n      instead of the config_file structure which includes the linked list\n      of scripts in a multi Python module setup; fixes #79.\n    - Expose the configured listening and outgoing interfaces, if any, as\n      a list of strings in the Python 'config_file' class instead of the\n      current Swig object proxy; fixes #79.\n    - Mailing list patches from Daniel Gröber for DNS64 fallback to plain\n      AAAA when no A record exists for synthesis, and minor DNS64 code\n      refactoring for better readability.\n    - Merge #951: Cachedb no store. The cachedb-no-store: yes option is\n      used to stop cachedb from writing messages to the backend storage.\n      It reads messages when data is available from the backend.\n      The default is no.\n  * Bug Fixes:\n    - Fix for version generation race condition that ignored changes.\n    - Fix #942: 1.18.0 libunbound DNS regression when built without OpenSSL.\n    - Fix for WKS call to getservbyname that creates allocation on exit in\n      unit test by testing numbers first and testing from the services list later.\n    - Fix autoconf 2.69 warnings in configure.\n    - Fix #927: unbound 1.18.0 make test error. Fix make test without SHA1.\n    - Merge #931: Prevent warnings from -Wmissing-prototypes.\n    - Fix to scrub resource records of type A and AAAA that have an\n      inappropriate size. They are removed from responses.\n    - Fix to move msgparse_rrset_remove_rr code to util/msgparse.c.\n    - Fix to add EDE text when RRs have been removed due to length.\n    - Fix to set ede match in unit test for rr length removal.\n    - Fix to print EDE text in readable form in output logs.\n    - Fix send of udp retries when ENOBUFS is returned. It stops looping\n      and also waits for the condition to go away. Reported by Florian Obser.\n    - Fix authority zone answers for obscured DNAMEs and delegations.\n    - Merge #936: Check for c99 with autoconf versions prior to 2.70.\n    - Fix to remove two c99 notations.\n    - Fix rpz tcp-only action with rpz triggers nsdname and nsip.\n    - Fix misplaced comment.\n    - Merge #881: Generalise the proxy protocol code.\n    - Fix #946: Forwarder returns servfail on upstream response noerror no data.\n    - Fix edns subnet so that queries with a source prefix of zero cause the\n      recursor send no edns subnet option to the upstream.\n    - Fix that printout of EDNS options shows the EDNS cookie option by name.\n    - Fix infinite loop when reading multiple lines of input on a broken remote\n      control socket. Addesses #947 and #948.\n    - Fix #949: \"could not create control compt\".\n    - Fix that cachedb does not warn when serve-expired is disabled about use\n      of serve-expired-reply-ttl and serve-expired-client-timeout.\n    - Fix for #949: Fix pythonmod/ubmodule-tst.py for Python 3.x.\n    - Better fix for infinite loop when reading multiple lines of input on a\n      broken remote control socket, by treating a zero byte line the same as\n      transmission end. Addesses #947 and #948.\n    - For multi Python module setups, clean previously parsed module functions\n      in __main__'s dictionary, if any, so that only current module functions\n      are registered.\n    - Fix #954: Inconsistent RPZ handling for A record returned along with CNAME.\n    - Fixes for the DNS64 patches.\n    - Update the dns64_lookup.rpl test for the DNS64 fallback patch.\n    - Merge #955 from buevsan: fix ipset wrong behavior.\n    - Update testdata/ipset.tdir test for ipset fix.\n    - Fix to print detailed errors when an SSL IO routine fails via SSL_get_error.\n    - Clearer configure text for missing protobuf-c development libraries.\n    - autoconf.\n    - Merge #930 from Stuart Henderson: add void to log_ident_revert_to_default\n      declaration.\n    - Fix #941: dnscrypt doesn't work after upgrade to 1.18 with suggestion by\n      dukeartem to also fix the udp_ancil with dnscrypt.\n    - Fix SSL compile failure for definition in log_crypto_err_io_code_arg.\n    - Fix SSL compile failure for other missing definitions in log_crypto_err_io_code_arg.\n    - Fix compilation without openssl, remove unused function warning.\n    - Mention flex and bison in README.md when building from repository source.\n\n- Update to 1.18.0:\n  * Features:\n    - Аdd a metric about the maximum number of collisions in lrushah.\n    - Set max-udp-size default to 1232. This is the same default value\n      as the default value for edns-buffer-size. It restricts client\n      edns buffer size choices, and makes unbound behave similar to\n      other DNS resolvers.\n    - Add harden-unknown-additional option. It removes unknown records\n      from the authority section and additional section.\n    - Added new static zone type block_a to suppress all A queries for\n      specific zones.\n    - [FR] Ability to use Redis unix sockets.\n    - [FR] Ability to set the Redis password.\n    - Features/dropqueuedpackets, with sock-queue-timeout option that\n      drops packets that have been in the socket queue for too long.\n      Added statistics num.queries_timed_out and query.queue_time_us.max\n      that track the socket queue timeouts.\n    - 'eqvinox' Lamparter: NAT64 support.\n    - [FR] Use kernel timestamps for dnstap.\n    - Add cachedb hit stat. Introduces 'num.query.cachedb' as a new\n      statistical counter.\n    - Add SVCB dohpath support.\n    - Add validation EDEs to queries where the CD bit is set.\n    - Add prefetch support for subnet cache entries.\n    - Add EDE (RFC8914) caching.\n    - Add support for EDE caching in cachedb and subnetcache.\n    - Downstream DNS Server Cookies a la RFC7873 and RFC9018. Create server\n      cookies for clients that send client cookies. This needs to be explicitly\n      turned on in the config file with: `answer-cookie: yes`.\n  * Bug Fixes\n    - Response change to NODATA for some ANY queries since 1.12.\n    - Fix not following cleared RD flags potentially enables\n      amplification DDoS attacks.\n    - Set default for harden-unknown-additional to no. So that it\n      does not hamper future protocol developments.\n    - Fix to ignore entirely empty responses, and try at another authority.\n      This turns completely empty responses, a type of noerror/nodata into\n      a servfail, but they do not conform to RFC2308, and the retry can fetch\n      improved content.\n    - Allow TTL refresh of expired error responses.\n    - Fix: Unexpected behavior with client-subnet-always-forward and serve-expired\n    - Fix unbound-dnstap-socket test program to reply the finish frame over\n      a TLS connection correctly.\n    - Fix: reserved identifier violation\n    - Fix: Unencrypted query is sent when forward-tls-upstream: yes is used\n      without tls-cert-bundle\n    - Extra consistency check to make sure that when TLS is requested,\n      either we set up a TLS connection or we return an error.\n    - Fix: NXDOMAIN instead of NOERROR rcode when asked for existing CNAME record.\n    - Fix: Bad interaction with 0 TTL records and serve-expired\n    - Fix RPZ IP responses with trigger rpz-drop on cache entries.\n    - Fix RPZ removal of client-ip, nsip, nsdname triggers from IXFR.\n    - Fix dereference of NULL variable warning in mesh_do_callback.\n    - Fix ip_ratelimit test to work with dig that enables DNS cookies.\n    - Fix for iter_dec_attempts that could cause a hang, part of capsforid\n      and qname minimisation, depending on the settings.\n    - Fix uninitialized memory passed in padding bytes of cmsg to sendmsg.\n    - Fix stat_values test to work with dig that enables DNS cookies.\n    - unbound.service: Main process exited, code=killed, status=11/SEGV.\n      Fixes cachedb configuration handling.\n    - Fix: processQueryResponse() THROWAWAY should be mindful of fail_reply.\n\n",
      "Title": "Details",
      "Type": "General"
    },
    {
      "Text": "The CVRF data is provided by SUSE under the Creative Commons License 4.0 with Attribution (CC-BY-4.0).",
      "Title": "Terms of Use",
      "Type": "Legal Disclaimer"
    },
    {
      "Text": "SUSE-SLE-Micro-6.0-31",
      "Title": "Patchnames",
      "Type": "Details"
    }
  ],
  "ProductTree": {
    "Relationships": [
      {
        "ProductReference": "libunbound8-1.21.0-1.1",
        "RelatesToProductReference": "SUSE Linux Micro 6.0",
        "RelationType": "Default Component Of"
      },
      {
        "ProductReference": "unbound-anchor-1.21.0-1.1",
        "RelatesToProductReference": "SUSE Linux Micro 6.0",
        "RelationType": "Default Component Of"
      }
    ]
  },
  "References": [
    {
      "URL": "https://www.suse.com/support/update/announcement/2025/suse-su-202520024-1/",
      "Description": "Link for SUSE-SU-2025:20024-1"
    },
    {
      "URL": "https://lists.suse.com/pipermail/sle-security-updates/2025-June/021370.html",
      "Description": "E-Mail link for SUSE-SU-2025:20024-1"
    },
    {
      "URL": "https://www.suse.com/support/security/rating/",
      "Description": "SUSE Security Ratings"
    },
    {
      "URL": "https://bugzilla.suse.com/1215628",
      "Description": "SUSE Bug 1215628"
    },
    {
      "URL": "https://bugzilla.suse.com/1219823",
      "Description": "SUSE Bug 1219823"
    },
    {
      "URL": "https://bugzilla.suse.com/1219826",
      "Description": "SUSE Bug 1219826"
    },
    {
      "URL": "https://bugzilla.suse.com/1221164",
      "Description": "SUSE Bug 1221164"
    },
    {
      "URL": "https://www.suse.com/security/cve/CVE-2023-50387/",
      "Description": "SUSE CVE CVE-2023-50387 page"
    },
    {
      "URL": "https://www.suse.com/security/cve/CVE-2023-50868/",
      "Description": "SUSE CVE CVE-2023-50868 page"
    },
    {
      "URL": "https://www.suse.com/security/cve/CVE-2024-1931/",
      "Description": "SUSE CVE CVE-2024-1931 page"
    },
    {
      "URL": "https://www.suse.com/security/cve/CVE-2024-33655/",
      "Description": "SUSE CVE CVE-2024-33655 page"
    }
  ],
  "Vulnerabilities": [
    {
      "CVE": "CVE-2023-50387",
      "Description": "Certain DNSSEC aspects of the DNS protocol (in RFC 4033, 4034, 4035, 6840, and related RFCs) allow remote attackers to cause a denial of service (CPU consumption) via one or more DNSSEC responses, aka the \"KeyTrap\" issue. One of the concerns is that, when there is a zone with many DNSKEY and RRSIG records, the protocol specification implies that an algorithm must evaluate all combinations of DNSKEY and RRSIG records.",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "important"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2023-50387.html",
          "Description": "CVE-2023-50387"
        },
        {
          "URL": "https://bugzilla.suse.com/1219823",
          "Description": "SUSE Bug 1219823"
        },
        {
          "URL": "https://bugzilla.suse.com/1220717",
          "Description": "SUSE Bug 1220717"
        },
        {
          "URL": "https://bugzilla.suse.com/1221586",
          "Description": "SUSE Bug 1221586"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": [
            "SUSE Linux Micro 6.0:libunbound8-1.21.0-1.1",
            "SUSE Linux Micro 6.0:unbound-anchor-1.21.0-1.1"
          ]
        }
      ],
      "CVSSScoreSets": {}
    },
    {
      "CVE": "CVE-2023-50868",
      "Description": "The Closest Encloser Proof aspect of the DNS protocol (in RFC 5155 when RFC 9276 guidance is skipped) allows remote attackers to cause a denial of service (CPU consumption for SHA-1 computations) via DNSSEC responses in a random subdomain attack, aka the \"NSEC3\" issue. The RFC 5155 specification implies that an algorithm must perform thousands of iterations of a hash function in certain situations.",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "important"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2023-50868.html",
          "Description": "CVE-2023-50868"
        },
        {
          "URL": "https://bugzilla.suse.com/1219823",
          "Description": "SUSE Bug 1219823"
        },
        {
          "URL": "https://bugzilla.suse.com/1219826",
          "Description": "SUSE Bug 1219826"
        },
        {
          "URL": "https://bugzilla.suse.com/1221586",
          "Description": "SUSE Bug 1221586"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": [
            "SUSE Linux Micro 6.0:libunbound8-1.21.0-1.1",
            "SUSE Linux Micro 6.0:unbound-anchor-1.21.0-1.1"
          ]
        }
      ],
      "CVSSScoreSets": {}
    },
    {
      "CVE": "CVE-2024-1931",
      "Description": "NLnet Labs Unbound version 1.18.0 up to and including version 1.19.1 contain a vulnerability that can cause denial of service by a certain code path that can lead to an infinite loop. Unbound 1.18.0 introduced a feature that removes EDE records from responses with size higher than the client's advertised buffer size. Before removing all the EDE records however, it would try to see if trimming the extra text fields on those records would result in an acceptable size while still retaining the EDE codes. Due to an unchecked condition, the code that trims the text of the EDE records could loop indefinitely. This happens when Unbound would reply with attached EDE information on a positive reply and the client's buffer size is smaller than the needed space to include EDE records. The vulnerability can only be triggered when the 'ede: yes' option is used; non default configuration. From version 1.19.2 on, the code is fixed to avoid looping indefinitely.",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "important"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2024-1931.html",
          "Description": "CVE-2024-1931"
        },
        {
          "URL": "https://bugzilla.suse.com/1221164",
          "Description": "SUSE Bug 1221164"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": [
            "SUSE Linux Micro 6.0:libunbound8-1.21.0-1.1",
            "SUSE Linux Micro 6.0:unbound-anchor-1.21.0-1.1"
          ]
        }
      ],
      "CVSSScoreSets": {}
    },
    {
      "CVE": "CVE-2024-33655",
      "Description": "The DNS protocol in RFC 1035 and updates allows remote attackers to cause a denial of service (resource consumption) by arranging for DNS queries to be accumulated for seconds, such that responses are later sent in a pulsing burst (which can be considered traffic amplification in some cases), aka the \"DNSBomb\" issue.",
      "Threats": [
        {
          "Type": "Impact",
          "Severity": "important"
        }
      ],
      "References": [
        {
          "URL": "https://www.suse.com/security/cve/CVE-2024-33655.html",
          "Description": "CVE-2024-33655"
        },
        {
          "URL": "https://bugzilla.suse.com/1224102",
          "Description": "SUSE Bug 1224102"
        }
      ],
      "ProductStatuses": [
        {
          "Type": "Fixed",
          "ProductID": [
            "SUSE Linux Micro 6.0:libunbound8-1.21.0-1.1",
            "SUSE Linux Micro 6.0:unbound-anchor-1.21.0-1.1"
          ]
        }
      ],
      "CVSSScoreSets": {}
    }
  ]
}