{
  "Severity": "HIGH",
  "UpdatedAt": "2025-10-08T12:43:33Z",
  "Package": {
    "Ecosystem": "RUST",
    "Name": "fuel-vm"
  },
  "Advisory": {
    "DatabaseId": 315911,
    "Id": "GSA_kwCzR0hTQS0ycGdqLTVjdjItNnh4d84ABNIH",
    "GhsaId": "GHSA-2pgj-5cv2-6xxw",
    "References": [
      {
        "Url": "https://github.com/FuelLabs/fuel-vm/security/advisories/GHSA-2pgj-5cv2-6xxw"
      },
      {
        "Url": "https://github.com/FuelLabs/fuel-vm/pull/941"
      },
      {
        "Url": "https://github.com/FuelLabs/fuel-vm/commit/9c97c2bf782626b35ba48e154f210f91c847a513"
      },
      {
        "Url": "https://github.com/advisories/GHSA-2pgj-5cv2-6xxw"
      }
    ],
    "Identifiers": [
      {
        "Type": "GHSA",
        "Value": "GHSA-2pgj-5cv2-6xxw"
      }
    ],
    "Description": "### Impact\n\nA memory safety vulnerability was present in the Fuel Virtual Machine (FuelVM), where memory reads could bypass expected access controls. Specifically, when a smart contract performed a `mload` (or other opcodes which access memory) on memory that had been deallocated using `ret`, it was still able to access the old memory contents. This occurred because the memory region was not zeroed out or otherwise marked as invalid. As a result, smart contracts could potentially read sensitive data left over from other contracts if the same memory was reallocated, violating isolation guarantees between contracts and enabling unintended data leakage.\n\nAll users running affected versions of FuelVM that relied on strict memory isolation between smart contracts were impacted.\n\n### Patches\n\nThe vulnerability was patched by modifying the FuelVM to ensure that memory deallocated with `ret` was zeroed out or made inaccessible. The fix was included in FuelVM version `v0.60.1` and back-ported to `v0.59.3`. This patch was released to the Fuel network on Friday, April 18th, 2025.\n\n### Workarounds\n\nThere were no reliable workarounds that fully mitigated the vulnerability. While developers could manually zero out sensitive memory regions before returning from a function, this approach was error-prone and could not be enforced at the VM level. Upgrading to a patched version remained the recommended course of action.\n\n### References\n\n- Fix implemented in the FuelVM GitHub repository (https://github.com/FuelLabs/fuel-vm/pull/941)",
    "Origin": "UNSPECIFIED",
    "PublishedAt": "2025-10-08T12:43:30Z",
    "Severity": "HIGH",
    "Summary": "FuelVM is vulnerable to heap memory allocation re-use bug",
    "UpdatedAt": "2025-10-08T12:43:33Z",
    "WithdrawnAt": "",
    "CVSS": {
      "Score": 0,
      "VectorString": ""
    }
  },
  "Versions": [
    {
      "FirstPatchedVersion": {
        "Identifier": "0.60.1"
      },
      "VulnerableVersionRange": "\u003e= 0.60.0, \u003c 0.60.1"
    },
    {
      "FirstPatchedVersion": {
        "Identifier": "0.59.3"
      },
      "VulnerableVersionRange": "\u003c 0.59.3"
    }
  ]
}