{
  "Severity": "LOW",
  "UpdatedAt": "2020-01-24T21:09:38Z",
  "Package": {
    "Ecosystem": "COMPOSER",
    "Name": "simplesamlphp/simplesamlphp"
  },
  "Advisory": {
    "DatabaseId": 1882,
    "Id": "MDE2OlNlY3VyaXR5QWR2aXNvcnlHSFNBLW1qOXAtdjJyOC13Zjh3",
    "GhsaId": "GHSA-mj9p-v2r8-wf8w",
    "References": [
      {
        "Url": "https://github.com/simplesamlphp/simplesamlphp/security/advisories/GHSA-mj9p-v2r8-wf8w"
      },
      {
        "Url": "https://simplesamlphp.org/security/202001-01"
      },
      {
        "Url": "https://nvd.nist.gov/vuln/detail/CVE-2020-5226"
      },
      {
        "Url": "https://github.com/advisories/GHSA-mj9p-v2r8-wf8w"
      }
    ],
    "Identifiers": [
      {
        "Type": "GHSA",
        "Value": "GHSA-mj9p-v2r8-wf8w"
      },
      {
        "Type": "CVE",
        "Value": "CVE-2020-5226"
      }
    ],
    "Description": "### Background\n\nSimpleSAMLphp allows users to report errors and failures to the system administrators via a web form. This web form gathers some contextual information automatically, but it also allows the user to provide their email address for follow-ups and a free-text explanation of what happened. Once submitted, the report is sent as an email to the administrative email address configured in the software.\n\n### Description\n\nThe `www/erroreport.php` script allows error reports to be submitted and sent to the system administrator. Starting with SimpleSAMLphp  1.18.0, a new `SimpleSAML\\Utils\\EMail` class was introduced to handle sending emails, implemented as a wrapper of an external dependency.\n\nThis new wrapper allows us to use Twig templates in order to create the email sent with an error report. Since Twig provides automatic escaping of variables, manual escaping of the free-text field in `www/errorreport.php` was removed to avoid double escaping. However, for those not using the new user interface yet, an email template is hardcoded into the class itself in plain PHP. Since no escaping is provided in this template, it is then possible to inject HTML inside the template by manually crafting the contents of the free-text field.\n\n### Affected versions\n\nSimpleSAMLphp versions 1.18.0 to 1.18.3, both inclusive.\n\n### Impact\n\nAn attacker may take advantage of this issue to manually craft a modified email sent via the error reporting mechanism, such as this email might trick a system administrator into performing an action, such as introducing their credentials into a phishing web site that resembles the original.\n\nRemote execution of javascript code is considered unfeasible since email clients do not run javascript present in emails, although there might be email clients which don't follow this rule, making the attack surface grow.\n\n### Resolution\n\nUpgrade the SimpleSAMLphp installation to version 1.18.4.\n\n### Credit\n\nThis vulnerability was discovered and reported by Frederic Vleminckx.",
    "Origin": "UNSPECIFIED",
    "PublishedAt": "2020-01-24T21:26:54Z",
    "Severity": "LOW",
    "Summary": "Cross-site scripting in SimpleSAMLphp",
    "UpdatedAt": "2023-01-09T05:01:59Z",
    "WithdrawnAt": "",
    "CVSS": {
      "Score": 4.4,
      "VectorString": "CVSS:3.1/AV:N/AC:H/PR:L/UI:R/S:C/C:L/I:L/A:N"
    }
  },
  "Versions": [
    {
      "FirstPatchedVersion": {
        "Identifier": "1.18.4"
      },
      "VulnerableVersionRange": "\u003e= 1.18.0, \u003c 1.18.4"
    }
  ]
}