{
  "Severity": "HIGH",
  "UpdatedAt": "2025-11-14T22:09:54Z",
  "Package": {
    "Ecosystem": "GO",
    "Name": "github.com/usememos/memos"
  },
  "Advisory": {
    "DatabaseId": 321801,
    "Id": "GSA_kwCzR0hTQS1tcjM0LTg3MzMtZ3JyMs4ABOkJ",
    "GhsaId": "GHSA-mr34-8733-grr2",
    "References": [
      {
        "Url": "https://github.com/usememos/memos/security/advisories/GHSA-mr34-8733-grr2"
      },
      {
        "Url": "https://nvd.nist.gov/vuln/detail/CVE-2024-21635"
      },
      {
        "Url": "https://owasp.org/Top10/A04_2021-Insecure_Design"
      },
      {
        "Url": "http://owasp.org/Top10/A07_2021-Identification_and_Authentication_Failures"
      },
      {
        "Url": "https://github.com/advisories/GHSA-mr34-8733-grr2"
      }
    ],
    "Identifiers": [
      {
        "Type": "GHSA",
        "Value": "GHSA-mr34-8733-grr2"
      },
      {
        "Type": "CVE",
        "Value": "CVE-2024-21635"
      }
    ],
    "Description": "### Summary\nAccess Tokens are used to authenticate application access. When a user changes their password, the existing list of Access Tokens stay valid instead of expiring. If a user finds that their account has been compromised, they can update their password. \n\nThe bad actor though will still have access to their account because the bad actor's Access Token stays on the list as a valid token. The user will have to manually delete the bad actor's Access Token to secure their account. The list of Access Tokens has a generic Description which makes it hard to pinpoint a bad actor in a list of Access Tokens. \n\n### Details\n\nTo improve Memos security, all Access Tokens will need to be revoked when a user changes their password. This removes the session for all the user's devices and prompts the user to log in again. You can treat the old Access Tokens as \"invalid\" because those Access Tokens were created with the older password.\n\n### PoC\n\n1. Have 2 devices on hand\n2. Log onto your Memos account on both devices. Notice how Access Tokens are created for each.\n3. On one device, successfully change the password. Refresh the page on the 2nd device and notice how it doesn't log out the user.\n4. On the 2nd device, change the password again. Refresh the page on the 1st device and notice how it doesn't log out the user.\n\n### Impact\n\nA bad actor will still have access to the user's account because the Access Token does not expire on a password update. Having multi-factor authentication will vastly improve account security in Account Takeover cases instead of just relying on a password.",
    "Origin": "UNSPECIFIED",
    "PublishedAt": "2025-11-14T22:09:54Z",
    "Severity": "HIGH",
    "Summary": "Memos' Access Tokens Stay Valid after User Password Change",
    "UpdatedAt": "2025-11-14T22:09:54Z",
    "WithdrawnAt": "",
    "CVSS": {
      "Score": 0,
      "VectorString": ""
    }
  },
  "Versions": [
    {
      "FirstPatchedVersion": {
        "Identifier": ""
      },
      "VulnerableVersionRange": "\u003c= 0.18.1"
    }
  ]
}