{
  "id": "ALAS-2018-1107",
  "title": "Amazon Linux AMI 2014.03 - ALAS-2018-1107: medium priority package update for zsh",
  "issued": {
    "date": "2018-12-06 00:20"
  },
  "updated": {
    "date": "2018-12-07 00:44"
  },
  "severity": "medium",
  "description": "Package updates are available for Amazon Linux AMI that fix the following vulnerabilities:\nCVE-2018-7549:\n\tIn params.c in zsh through 5.4.2, there is a crash during a copy of an empty hash table, as demonstrated by typeset -p.\nA NULL pointer dereference flaw was found in the code responsible for saving hashtables of the zsh package. An attacker could use this flaw to cause a denial of service by crashing the user shell.\n1549858: \nCVE-2018-7549 zsh: crash on copying empty hash table\n\nCVE-2018-1100:\n\tA buffer overflow flaw was found in the zsh shell check path functionality. A local, unprivileged user can create a specially crafted message file, which, if used to set a custom \u0026quot;you have new mail\u0026quot; message, leads to code execution in the context of the user who receives the message. If the user affected is privileged, this leads to privilege escalation.\n1563395: \nCVE-2018-1100 zsh: buffer overflow in utils.c:checkmailpath() can lead to local arbitrary code execution\n\nCVE-2018-1083:\n\tA buffer overflow flaw was found in the zsh shell auto-complete functionality. A local, unprivileged user can create a specially crafted directory path which leads to code execution in the context of the user who tries to use auto-complete to traverse the before mentioned path. If the user affected is privileged, this leads to privilege escalation.\n1557382: \nCVE-2018-1083 zsh: Stack-based buffer overflow in gen_matches_files() at compctl.c\n\nCVE-2018-1071:\n\tzsh through version 5.4.2 is vulnerable to a stack-based buffer overflow in the exec.c:hashcmd() function. A local attacker could exploit this to cause a denial of service.\n1553531: \nCVE-2018-1071 zsh: Stack-based buffer overflow in exec.c:hashcmd()\n\nCVE-2017-18206:\n\tIn utils.c in zsh before 5.4, symlink expansion had a buffer overflow.\nA buffer overflow flaw was found in the zsh shell symbolic link resolver. A local, unprivileged user can create a specially crafted directory path which leads to a buffer overflow in the context of the user trying to do a symbolic link resolution in the aforementioned path. If the user affected is privileged, this leads to privilege escalation.\n1549861: \nCVE-2017-18206 zsh: buffer overrun in xsymlinks\n1549861: \nCVE-2017-18206 zsh: buffer overrun in symlinks\n\nCVE-2017-18205:\n\tIn builtin.c in zsh before 5.4, when sh compatibility mode is used, there is a NULL pointer dereference during processing of the cd command with no argument if HOME is not set.\nA NULL pointer dereference flaw was found in the code responsible for the cd builtin command of the zsh package. An attacker could use this flaw to cause a denial of service by crashing the user shell.\n1549862: \nCVE-2017-18205 zsh: NULL dereference in cd in sh compatibility mode under given circumstances\n\nCVE-2014-10072:\n\tA buffer overflow flaw was found in the zsh shell symbolic link resolver. A local, unprivileged user can create a specially crafted directory path which leads to a buffer overflow in the context of the user trying to do symbolic link resolution in the aforementioned path. An attacker could exploit this vulnerability to cause a denial of service condition on the target.\n1549836: \nCVE-2014-10072 zsh: buffer overflow when scanning very long directory paths for symbolic links\n\nCVE-2014-10071:\n\tA buffer overflow flaw was found in the zsh shell file descriptor redirection functionality. An attacker could use this flaw to cause a denial of service by crashing the user shell.\n1549855: \nCVE-2014-10071 zsh: buffer overflow for very long fds in \u003e\u0026 fd syntax\n",
  "packages": [
    {
      "name": "zsh",
      "epoch": "0",
      "version": "5.0.2",
      "release": "31.17.amzn1",
      "arch": "x86_64",
      "filename": "Packages/zsh-5.0.2-31.17.amzn1.x86_64.rpm"
    },
    {
      "name": "zsh-debuginfo",
      "epoch": "0",
      "version": "5.0.2",
      "release": "31.17.amzn1",
      "arch": "x86_64",
      "filename": "Packages/zsh-debuginfo-5.0.2-31.17.amzn1.x86_64.rpm"
    },
    {
      "name": "zsh-html",
      "epoch": "0",
      "version": "5.0.2",
      "release": "31.17.amzn1",
      "arch": "x86_64",
      "filename": "Packages/zsh-html-5.0.2-31.17.amzn1.x86_64.rpm"
    },
    {
      "name": "zsh",
      "epoch": "0",
      "version": "5.0.2",
      "release": "31.17.amzn1",
      "arch": "i686",
      "filename": "Packages/zsh-5.0.2-31.17.amzn1.i686.rpm"
    },
    {
      "name": "zsh-html",
      "epoch": "0",
      "version": "5.0.2",
      "release": "31.17.amzn1",
      "arch": "i686",
      "filename": "Packages/zsh-html-5.0.2-31.17.amzn1.i686.rpm"
    },
    {
      "name": "zsh-debuginfo",
      "epoch": "0",
      "version": "5.0.2",
      "release": "31.17.amzn1",
      "arch": "i686",
      "filename": "Packages/zsh-debuginfo-5.0.2-31.17.amzn1.i686.rpm"
    }
  ],
  "references": [
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2014-10071",
      "id": "CVE-2014-10071",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2014-10072",
      "id": "CVE-2014-10072",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2017-18205",
      "id": "CVE-2017-18205",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2017-18206",
      "id": "CVE-2017-18206",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2018-1071",
      "id": "CVE-2018-1071",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2018-1083",
      "id": "CVE-2018-1083",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2018-1100",
      "id": "CVE-2018-1100",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2018-7549",
      "id": "CVE-2018-7549",
      "type": "cve"
    }
  ],
  "cveids": [
    "CVE-2014-10071",
    "CVE-2014-10072",
    "CVE-2017-18205",
    "CVE-2017-18206",
    "CVE-2018-1071",
    "CVE-2018-1083",
    "CVE-2018-1100",
    "CVE-2018-7549"
  ]
}