{
  "id": "ALAS-2016-684",
  "title": "Amazon Linux AMI 2014.03 - ALAS-2016-684: important priority package update for mysql56",
  "issued": {
    "date": "2016-04-06 14:40"
  },
  "updated": {
    "date": "2016-04-06 14:40"
  },
  "severity": "important",
  "description": "Package updates are available for Amazon Linux AMI that fix the following vulnerabilities:\nCVE-2016-0616:\n\tUnspecified vulnerability in Oracle MySQL 5.5.46 and earlier and MariaDB before 5.5.47, 10.0.x before 10.0.23, and 10.1.x before 10.1.10 allows remote authenticated users to affect availability via unknown vectors related to Optimizer.\n1301510: \nCVE-2016-0616 mysql: unspecified vulnerability in subcomponent: Server: Optimizer (CPU January 2016)\n\nCVE-2016-0611:\n\tUnspecified vulnerability in Oracle MySQL 5.6.27 and earlier and 5.7.9 allows remote authenticated users to affect availability via unknown vectors related to Optimizer.\n1301509: \nCVE-2016-0611 mysql: unspecified vulnerability in subcomponent: Server: Optimizer (CPU January 2016)\n\nCVE-2016-0610:\n\tUnspecified vulnerability in Oracle MySQL 5.6.27 and earlier and MariaDB before 10.0.22 and 10.1.x before 10.1.9 allows remote authenticated users to affect availability via unknown vectors related to InnoDB.\n1301508: \nCVE-2016-0610 mysql: unspecified vulnerability in subcomponent: Server: InnoDB (CPU January 2016)\n\nCVE-2016-0609:\n\tUnspecified vulnerability in Oracle MySQL 5.5.46 and earlier, 5.6.27 and earlier, and 5.7.9 and MariaDB before 5.5.47, 10.0.x before 10.0.23, and 10.1.x before 10.1.10 allows remote authenticated users to affect availability via unknown vectors related to privileges.\n1301507: \nCVE-2016-0609 mysql: unspecified vulnerability in subcomponent: Server: Security: Privileges (CPU January 2016)\n\nCVE-2016-0608:\n\tUnspecified vulnerability in Oracle MySQL 5.5.46 and earlier, 5.6.27 and earlier, and 5.7.9 and MariaDB before 5.5.47, 10.0.x before 10.0.23, and 10.1.x before 10.1.10 allows remote authenticated users to affect availability via vectors related to UDF.\n1301506: \nCVE-2016-0608 mysql: unspecified vulnerability in subcomponent: Server: UDF (CPU January 2016)\n\nCVE-2016-0607:\n\tUnspecified vulnerability in Oracle MySQL 5.6.27 and earlier and 5.7.9 allows remote authenticated users to affect availability via unknown vectors related to replication.\n1301505: \nCVE-2016-0607 mysql: unspecified vulnerability in subcomponent: Server: Replication (CPU January 2016)\n\nCVE-2016-0606:\n\tUnspecified vulnerability in Oracle MySQL 5.5.46 and earlier, 5.6.27 and earlier, and 5.7.9 and MariaDB before 5.5.47, 10.0.x before 10.0.23, and 10.1.x before 10.1.10 allows remote authenticated users to affect integrity via unknown vectors related to encryption.\n1301504: \nCVE-2016-0606 mysql: unspecified vulnerability in subcomponent: Server: Security: Encryption (CPU January 2016)\n\nCVE-2016-0605:\n\tUnspecified vulnerability in Oracle MySQL 5.6.26 and earlier allows remote authenticated users to affect availability via unknown vectors.\n1301503: \nCVE-2016-0605 mysql: unspecified vulnerability in subcomponent: Server: General (CPU January 2016)\n\nCVE-2016-0601:\n\tUnspecified vulnerability in Oracle MySQL 5.7.9 allows remote authenticated users to affect availability via unknown vectors related to Partition.\n1301502: \nCVE-2016-0601 mysql: unspecified vulnerability in subcomponent: Server: Partition (CPU January 2016)\n\nCVE-2016-0600:\n\tUnspecified vulnerability in Oracle MySQL 5.5.46 and earlier, 5.6.27 and earlier, and 5.7.9 and MariaDB before 5.5.47, 10.0.x before 10.0.23, and 10.1.x before 10.1.10 allows remote authenticated users to affect availability via unknown vectors related to InnoDB.\n1301501: \nCVE-2016-0600 mysql: unspecified vulnerability in subcomponent: Server: InnoDB (CPU January 2016)\n\nCVE-2016-0599:\n\tUnspecified vulnerability in Oracle MySQL 5.7.9 allows remote authenticated users to affect availability via unknown vectors related to Optimizer.\n1301500: \nCVE-2016-0599 mysql: unspecified vulnerability in subcomponent: Server: Optimizer (CPU January 2016)\n\nCVE-2016-0598:\n\tUnspecified vulnerability in Oracle MySQL 5.5.46 and earlier, 5.6.27 and earlier, and 5.7.9 and MariaDB before 5.5.47, 10.0.x before 10.0.23, and 10.1.x before 10.1.10 allows remote authenticated users to affect availability via vectors related to DML.\n1301498: \nCVE-2016-0598 mysql: unspecified vulnerability in subcomponent: Server: DML (CPU January 2016)\n\nCVE-2016-0597:\n\tUnspecified vulnerability in Oracle MySQL 5.5.46 and earlier, 5.6.27 and earlier, and 5.7.9 and MariaDB before 5.5.47, 10.0.x before 10.0.23, and 10.1.x before 10.1.10 allows remote authenticated users to affect availability via unknown vectors related to Optimizer.\n1301497: \nCVE-2016-0597 mysql: unspecified vulnerability in subcomponent: Server: Optimizer (CPU January 2016)\n\nCVE-2016-0596:\n\tUnspecified vulnerability in Oracle MySQL 5.5.46 and earlier and 5.6.27 and earlier and MariaDB before 5.5.47, 10.0.x before 10.0.23, and 10.1.x before 10.1.10 allows remote authenticated users to affect availability via vectors related to DML.\n1301496: \nCVE-2016-0596 mysql: unspecified vulnerability in subcomponent: Server: DML (CPU January 2016)\n\nCVE-2016-0595:\n\tUnspecified vulnerability in Oracle MySQL 5.6.27 and earlier allows remote authenticated users to affect availability via vectors related to DML.\n1301495: \nCVE-2016-0595 mysql: unspecified vulnerability in subcomponent: Server: DML (CPU January 2016)\n\nCVE-2016-0594:\n\tUnspecified vulnerability in Oracle MySQL 5.6.21 and earlier allows remote authenticated users to affect availability via vectors related to DML.\n1301494: \nCVE-2016-0594 mysql: unspecified vulnerability in subcomponent: Server: DML (CPU January 2016)\n\nCVE-2016-0546:\n\tUnspecified vulnerability in Oracle MySQL 5.5.46 and earlier, 5.6.27 and earlier, and 5.7.9 and MariaDB before 5.5.47, 10.0.x before 10.0.23, and 10.1.x before 10.1.10 allows local users to affect confidentiality, integrity, and availability via unknown vectors related to Client.\n1301493: \nCVE-2016-0546 mysql: unspecified vulnerability in subcomponent: Client (CPU January 2016)\n\nCVE-2016-0505:\n\tUnspecified vulnerability in Oracle MySQL 5.5.46 and earlier, 5.6.27 and earlier, and 5.7.9 and MariaDB before 5.5.47, 10.0.x before 10.0.23, and 10.1.x before 10.1.10 allows remote authenticated users to affect availability via unknown vectors related to Options.\n1301492: \nCVE-2016-0505 mysql: unspecified vulnerability in subcomponent: Server: Options (CPU January 2016)\n\nCVE-2016-0504:\n\tUnspecified vulnerability in Oracle MySQL 5.6.27 and earlier and 5.7.9 allows remote authenticated users to affect availability via vectors related to DML, a different vulnerability than CVE-2016-0503.\n1301491: \nCVE-2016-0504 mysql: unspecified vulnerability in subcomponent: Server: DML (CPU January 2016)\n\nCVE-2016-0503:\n\tUnspecified vulnerability in Oracle MySQL 5.6.27 and earlier and 5.7.9 allows remote authenticated users to affect availability via vectors related to DML, a different vulnerability than CVE-2016-0504.\n1301490: \nCVE-2016-0503 mysql: unspecified vulnerability in subcomponent: Server: DML (CPU January 2016)\n\nCVE-2016-0502:\n\tUnspecified vulnerability in Oracle MySQL 5.5.31 and earlier and 5.6.11 and earlier allows remote authenticated users to affect availability via unknown vectors related to Optimizer.\n1301489: \nCVE-2016-0502 mysql: unspecified vulnerability in subcomponent: Server: Optimizer (CPU January 2016)\n\nCVE-2015-7744:\n\twolfSSL (formerly CyaSSL) before 3.6.8 does not properly handle faults associated with the Chinese Remainder Theorem (CRT) process when allowing ephemeral key exchange without low memory optimizations on a server, which makes it easier for remote attackers to obtain private RSA keys by capturing TLS handshakes, aka a Lenstra attack.\n1301488: \nCVE-2015-7744 yaSSL, wolfSSL: insufficient hardening of RSA-CRT implementation (Oracle MySQL CPU Jan 2016)\n\nCVE-2015-4913:\n\tUnspecified vulnerability in Oracle MySQL Server 5.5.45 and earlier and 5.6.26 and earlier allows remote authenticated users to affect availability via vectors related to Server : DML, a different vulnerability than CVE-2015-4858.\n1274794: \nCVE-2015-4913 mysql: unspecified vulnerability related to Server:DML (CPU October 2015)\n\nCVE-2015-4910:\n\tUnspecified vulnerability in Oracle MySQL Server 5.6.26 and earlier allows remote authenticated users to affect availability via unknown vectors related to Server : Memcached.\n1274792: \nCVE-2015-4910 mysql: unspecified vulnerability related to Server:Memcached (CPU October 2015)\n\nCVE-2015-4905:\n\tUnspecified vulnerability in Oracle MySQL Server 5.6.23 and earlier allows remote authenticated users to affect availability via vectors related to Server : DML.\n1274790: \nCVE-2015-4905 mysql: unspecified vulnerability related to Server:DML (CPU October 2015)\n\nCVE-2015-4904:\n\tUnspecified vulnerability in Oracle MySQL Server 5.6.25 and earlier allows remote authenticated users to affect availability via unknown vectors related to libmysqld.\n1274787: \nCVE-2015-4904 mysql: unspecified vulnerability related to libmysqld (CPU October 2015)\n\nCVE-2015-4895:\n\tUnspecified vulnerability in Oracle MySQL Server 5.6.25 and earlier allows remote authenticated users to affect availability via unknown vectors related to Server : InnoDB.\n1274786: \nCVE-2015-4895 mysql: unspecified vulnerability related to Server:InnoDB (CPU October 2015)\n\nCVE-2015-4890:\n\tUnspecified vulnerability in Oracle MySQL Server 5.6.26 and earlier allows remote authenticated users to affect availability via unknown vectors related to Server : Replication.\n1274785: \nCVE-2015-4890 mysql: unspecified vulnerability related to Server:Replication (CPU October 2015)\n\nCVE-2015-4879:\n\tUnspecified vulnerability in Oracle MySQL Server 5.5.44 and earlier, and 5.6.25 and earlier, allows remote authenticated users to affect confidentiality, integrity, and availability via vectors related to DML.\n1274783: \nCVE-2015-4879 mysql: unspecified vulnerability related to Server:DML (CPU October 2015)\n\nCVE-2015-4870:\n\tUnspecified vulnerability in Oracle MySQL Server 5.5.45 and earlier, and 5.6.26 and earlier, allows remote authenticated users to affect availability via unknown vectors related to Server : Parser.\n1274781: \nCVE-2015-4870 mysql: unspecified vulnerability related to Server:Parser (CPU October 2015)\n\nCVE-2015-4866:\n\tUnspecified vulnerability in Oracle MySQL Server 5.6.23 and earlier allows remote authenticated users to affect availability via unknown vectors related to Server : InnoDB.\n1274780: \nCVE-2015-4866 mysql: unspecified vulnerability related to Server:InnoDB (CPU October 2015)\n\nCVE-2015-4864:\n\tUnspecified vulnerability in Oracle MySQL Server 5.5.43 and earlier and 5.6.24 and earlier allows remote authenticated users to affect integrity via unknown vectors related to Server : Security : Privileges.\n1274779: \nCVE-2015-4864 mysql: unspecified vulnerability related to Server:Security:Privileges (CPU October 2015)\n\nCVE-2015-4862:\n\tUnspecified vulnerability in Oracle MySQL Server 5.6.26 and earlier allows remote authenticated users to affect availability via vectors related to DML.\n1274778: \nCVE-2015-4862 mysql: unspecified vulnerability related to Server:DML (CPU October 2015)\n\nCVE-2015-4861:\n\tUnspecified vulnerability in Oracle MySQL Server 5.5.45 and earlier, and 5.6.26 and earlier, allows remote authenticated users to affect availability via unknown vectors related to Server : InnoDB.\n1274776: \nCVE-2015-4861 mysql: unspecified vulnerability related to Server:InnoDB (CPU October 2015)\n\nCVE-2015-4858:\n\tUnspecified vulnerability in Oracle MySQL Server 5.5.45 and earlier, and 5.6.26 and earlier, allows remote authenticated users to affect availability via vectors related to DML, a different vulnerability than CVE-2015-4913.\n1274773: \nCVE-2015-4858 mysql: unspecified vulnerability related to Server:DML (CPU October 2015)\n\nCVE-2015-4836:\n\tUnspecified vulnerability in Oracle MySQL Server 5.5.45 and earlier, and 5.6.26 and earlier, allows remote authenticated users to affect availability via unknown vectors related to Server : SP.\n1274771: \nCVE-2015-4836 mysql: unspecified vulnerability related to Server:SP (CPU October 2015)\n\nCVE-2015-4833:\n\tUnspecified vulnerability in Oracle MySQL Server 5.6.25 and earlier allows remote authenticated users to affect availability via unknown vectors related to Server : Partition.\n1274770: \nCVE-2015-4833 mysql: unspecified vulnerability related to Server:Partition (CPU October 2015)\n\nCVE-2015-4830:\n\tUnspecified vulnerability in Oracle MySQL Server 5.5.45 and earlier and 5.6.26 and earlier allows remote authenticated users to affect integrity via unknown vectors related to Server : Security : Privileges.\n1274767: \nCVE-2015-4830 mysql: unspecified vulnerability related to Server:Security:Privileges (CPU October 2015)\n\nCVE-2015-4826:\n\tUnspecified vulnerability in Oracle MySQL Server 5.5.45 and earlier and 5.6.26 and earlier allows remote authenticated users to affect confidentiality via unknown vectors related to Server : Types.\n1274766: \nCVE-2015-4826 mysql: unspecified vulnerability related to Server:Types (CPU October 2015)\n\nCVE-2015-4819:\n\tUnspecified vulnerability in Oracle MySQL Server 5.5.44 and earlier, and 5.6.25 and earlier, allows local users to affect confidentiality, integrity, and availability via unknown vectors related to Client programs.\n1274764: \nCVE-2015-4819 mysql: unspecified vulnerability related to Client programs (CPU October 2015)\n\nCVE-2015-4815:\n\tUnspecified vulnerability in Oracle MySQL Server 5.5.45 and earlier and 5.6.26 and earlier allows remote authenticated users to affect availability via vectors related to Server : DDL.\n1274759: \nCVE-2015-4815 mysql: unspecified vulnerability related to Server:DDL (CPU October 2015)\n\nCVE-2015-4807:\n\tUnspecified vulnerability in Oracle MySQL Server 5.5.45 and earlier and 5.6.26 and earlier, when running on Windows, allows remote authenticated users to affect availability via unknown vectors related to Server : Query Cache.\n1274758: \nCVE-2015-4807 mysql: unspecified vulnerability related to Server:Query Cache (CPU October 2015)\n\nCVE-2015-4802:\n\tUnspecified vulnerability in Oracle MySQL Server 5.5.45 and earlier and 5.6.26 and earlier allows remote authenticated users to affect availability via unknown vectors related to Server : Partition, a different vulnerability than CVE-2015-4792.\n1274756: \nCVE-2015-4802 mysql: unspecified vulnerability related to Server:Partition (CPU October 2015)\n\nCVE-2015-4800:\n\tUnspecified vulnerability in Oracle MySQL Server 5.6.26 and earlier allows remote authenticated users to affect availability via unknown vectors related to Server : Optimizer.\n1274754: \nCVE-2015-4800 mysql: unspecified vulnerability related to Server:Optimizer (CPU October 2015)\n\nCVE-2015-4792:\n\tUnspecified vulnerability in Oracle MySQL Server 5.5.45 and earlier and 5.6.26 and earlier allows remote authenticated users to affect availability via unknown vectors related to Server : Partition, a different vulnerability than CVE-2015-4802.\n1274752: \nCVE-2015-4792 mysql: unspecified vulnerability related to Server:Partition (CPU October 2015)\n\nCVE-2015-4791:\n\tUnspecified vulnerability in Oracle MySQL Server 5.6.26 and earlier allows remote authenticated users to affect availability via unknown vectors related to Server : Security : Privileges.\n1274749: \nCVE-2015-4791 mysql: unspecified vulnerability related to Server:Security:Privileges (CPU October 2015)\n\nCVE-2015-4766:\n\tUnspecified vulnerability in Oracle MySQL Server 5.6.25 and earlier allows local users to affect availability via unknown vectors related to Server : Security : Firewall.\n1274748: \nCVE-2015-4766 mysql: unspecified vulnerability related to Server:Security:Firewall (CPU October 2015)\n",
  "packages": [
    {
      "name": "mysql56-test",
      "epoch": "0",
      "version": "5.6.29",
      "release": "1.14.amzn1",
      "arch": "x86_64",
      "filename": "Packages/mysql56-test-5.6.29-1.14.amzn1.x86_64.rpm"
    },
    {
      "name": "mysql56-bench",
      "epoch": "0",
      "version": "5.6.29",
      "release": "1.14.amzn1",
      "arch": "x86_64",
      "filename": "Packages/mysql56-bench-5.6.29-1.14.amzn1.x86_64.rpm"
    },
    {
      "name": "mysql56-server",
      "epoch": "0",
      "version": "5.6.29",
      "release": "1.14.amzn1",
      "arch": "x86_64",
      "filename": "Packages/mysql56-server-5.6.29-1.14.amzn1.x86_64.rpm"
    },
    {
      "name": "mysql56",
      "epoch": "0",
      "version": "5.6.29",
      "release": "1.14.amzn1",
      "arch": "x86_64",
      "filename": "Packages/mysql56-5.6.29-1.14.amzn1.x86_64.rpm"
    },
    {
      "name": "mysql56-devel",
      "epoch": "0",
      "version": "5.6.29",
      "release": "1.14.amzn1",
      "arch": "x86_64",
      "filename": "Packages/mysql56-devel-5.6.29-1.14.amzn1.x86_64.rpm"
    },
    {
      "name": "mysql56-errmsg",
      "epoch": "0",
      "version": "5.6.29",
      "release": "1.14.amzn1",
      "arch": "x86_64",
      "filename": "Packages/mysql56-errmsg-5.6.29-1.14.amzn1.x86_64.rpm"
    },
    {
      "name": "mysql56-embedded",
      "epoch": "0",
      "version": "5.6.29",
      "release": "1.14.amzn1",
      "arch": "x86_64",
      "filename": "Packages/mysql56-embedded-5.6.29-1.14.amzn1.x86_64.rpm"
    },
    {
      "name": "mysql56-debuginfo",
      "epoch": "0",
      "version": "5.6.29",
      "release": "1.14.amzn1",
      "arch": "x86_64",
      "filename": "Packages/mysql56-debuginfo-5.6.29-1.14.amzn1.x86_64.rpm"
    },
    {
      "name": "mysql56-libs",
      "epoch": "0",
      "version": "5.6.29",
      "release": "1.14.amzn1",
      "arch": "x86_64",
      "filename": "Packages/mysql56-libs-5.6.29-1.14.amzn1.x86_64.rpm"
    },
    {
      "name": "mysql56-common",
      "epoch": "0",
      "version": "5.6.29",
      "release": "1.14.amzn1",
      "arch": "x86_64",
      "filename": "Packages/mysql56-common-5.6.29-1.14.amzn1.x86_64.rpm"
    },
    {
      "name": "mysql56-embedded-devel",
      "epoch": "0",
      "version": "5.6.29",
      "release": "1.14.amzn1",
      "arch": "x86_64",
      "filename": "Packages/mysql56-embedded-devel-5.6.29-1.14.amzn1.x86_64.rpm"
    },
    {
      "name": "mysql56-debuginfo",
      "epoch": "0",
      "version": "5.6.29",
      "release": "1.14.amzn1",
      "arch": "i686",
      "filename": "Packages/mysql56-debuginfo-5.6.29-1.14.amzn1.i686.rpm"
    },
    {
      "name": "mysql56-common",
      "epoch": "0",
      "version": "5.6.29",
      "release": "1.14.amzn1",
      "arch": "i686",
      "filename": "Packages/mysql56-common-5.6.29-1.14.amzn1.i686.rpm"
    },
    {
      "name": "mysql56-test",
      "epoch": "0",
      "version": "5.6.29",
      "release": "1.14.amzn1",
      "arch": "i686",
      "filename": "Packages/mysql56-test-5.6.29-1.14.amzn1.i686.rpm"
    },
    {
      "name": "mysql56-errmsg",
      "epoch": "0",
      "version": "5.6.29",
      "release": "1.14.amzn1",
      "arch": "i686",
      "filename": "Packages/mysql56-errmsg-5.6.29-1.14.amzn1.i686.rpm"
    },
    {
      "name": "mysql56-server",
      "epoch": "0",
      "version": "5.6.29",
      "release": "1.14.amzn1",
      "arch": "i686",
      "filename": "Packages/mysql56-server-5.6.29-1.14.amzn1.i686.rpm"
    },
    {
      "name": "mysql56-devel",
      "epoch": "0",
      "version": "5.6.29",
      "release": "1.14.amzn1",
      "arch": "i686",
      "filename": "Packages/mysql56-devel-5.6.29-1.14.amzn1.i686.rpm"
    },
    {
      "name": "mysql56",
      "epoch": "0",
      "version": "5.6.29",
      "release": "1.14.amzn1",
      "arch": "i686",
      "filename": "Packages/mysql56-5.6.29-1.14.amzn1.i686.rpm"
    },
    {
      "name": "mysql56-libs",
      "epoch": "0",
      "version": "5.6.29",
      "release": "1.14.amzn1",
      "arch": "i686",
      "filename": "Packages/mysql56-libs-5.6.29-1.14.amzn1.i686.rpm"
    },
    {
      "name": "mysql56-bench",
      "epoch": "0",
      "version": "5.6.29",
      "release": "1.14.amzn1",
      "arch": "i686",
      "filename": "Packages/mysql56-bench-5.6.29-1.14.amzn1.i686.rpm"
    },
    {
      "name": "mysql56-embedded-devel",
      "epoch": "0",
      "version": "5.6.29",
      "release": "1.14.amzn1",
      "arch": "i686",
      "filename": "Packages/mysql56-embedded-devel-5.6.29-1.14.amzn1.i686.rpm"
    },
    {
      "name": "mysql56-embedded",
      "epoch": "0",
      "version": "5.6.29",
      "release": "1.14.amzn1",
      "arch": "i686",
      "filename": "Packages/mysql56-embedded-5.6.29-1.14.amzn1.i686.rpm"
    }
  ],
  "references": [
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2015-4766",
      "id": "CVE-2015-4766",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2015-4791",
      "id": "CVE-2015-4791",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2015-4792",
      "id": "CVE-2015-4792",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2015-4800",
      "id": "CVE-2015-4800",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2015-4802",
      "id": "CVE-2015-4802",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2015-4807",
      "id": "CVE-2015-4807",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2015-4815",
      "id": "CVE-2015-4815",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2015-4819",
      "id": "CVE-2015-4819",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2015-4826",
      "id": "CVE-2015-4826",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2015-4830",
      "id": "CVE-2015-4830",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2015-4833",
      "id": "CVE-2015-4833",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2015-4836",
      "id": "CVE-2015-4836",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2015-4858",
      "id": "CVE-2015-4858",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2015-4861",
      "id": "CVE-2015-4861",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2015-4862",
      "id": "CVE-2015-4862",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2015-4864",
      "id": "CVE-2015-4864",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2015-4866",
      "id": "CVE-2015-4866",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2015-4870",
      "id": "CVE-2015-4870",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2015-4879",
      "id": "CVE-2015-4879",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2015-4890",
      "id": "CVE-2015-4890",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2015-4895",
      "id": "CVE-2015-4895",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2015-4904",
      "id": "CVE-2015-4904",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2015-4905",
      "id": "CVE-2015-4905",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2015-4910",
      "id": "CVE-2015-4910",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2015-4913",
      "id": "CVE-2015-4913",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2015-7744",
      "id": "CVE-2015-7744",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2016-0502",
      "id": "CVE-2016-0502",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2016-0503",
      "id": "CVE-2016-0503",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2016-0504",
      "id": "CVE-2016-0504",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2016-0505",
      "id": "CVE-2016-0505",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2016-0546",
      "id": "CVE-2016-0546",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2016-0594",
      "id": "CVE-2016-0594",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2016-0595",
      "id": "CVE-2016-0595",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2016-0596",
      "id": "CVE-2016-0596",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2016-0597",
      "id": "CVE-2016-0597",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2016-0598",
      "id": "CVE-2016-0598",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2016-0599",
      "id": "CVE-2016-0599",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2016-0600",
      "id": "CVE-2016-0600",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2016-0601",
      "id": "CVE-2016-0601",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2016-0605",
      "id": "CVE-2016-0605",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2016-0606",
      "id": "CVE-2016-0606",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2016-0607",
      "id": "CVE-2016-0607",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2016-0608",
      "id": "CVE-2016-0608",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2016-0609",
      "id": "CVE-2016-0609",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2016-0610",
      "id": "CVE-2016-0610",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2016-0611",
      "id": "CVE-2016-0611",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2016-0616",
      "id": "CVE-2016-0616",
      "type": "cve"
    }
  ],
  "cveids": [
    "CVE-2015-4766",
    "CVE-2015-4791",
    "CVE-2015-4792",
    "CVE-2015-4800",
    "CVE-2015-4802",
    "CVE-2015-4807",
    "CVE-2015-4815",
    "CVE-2015-4819",
    "CVE-2015-4826",
    "CVE-2015-4830",
    "CVE-2015-4833",
    "CVE-2015-4836",
    "CVE-2015-4858",
    "CVE-2015-4861",
    "CVE-2015-4862",
    "CVE-2015-4864",
    "CVE-2015-4866",
    "CVE-2015-4870",
    "CVE-2015-4879",
    "CVE-2015-4890",
    "CVE-2015-4895",
    "CVE-2015-4904",
    "CVE-2015-4905",
    "CVE-2015-4910",
    "CVE-2015-4913",
    "CVE-2015-7744",
    "CVE-2016-0502",
    "CVE-2016-0503",
    "CVE-2016-0504",
    "CVE-2016-0505",
    "CVE-2016-0546",
    "CVE-2016-0594",
    "CVE-2016-0595",
    "CVE-2016-0596",
    "CVE-2016-0597",
    "CVE-2016-0598",
    "CVE-2016-0599",
    "CVE-2016-0600",
    "CVE-2016-0601",
    "CVE-2016-0605",
    "CVE-2016-0606",
    "CVE-2016-0607",
    "CVE-2016-0608",
    "CVE-2016-0609",
    "CVE-2016-0610",
    "CVE-2016-0611",
    "CVE-2016-0616"
  ]
}