{
  "id": "ALAS-2017-907",
  "title": "Amazon Linux AMI 2014.03 - ALAS-2017-907: critical priority package update for dnsmasq",
  "issued": {
    "date": "2017-10-02 17:05"
  },
  "updated": {
    "date": "2017-10-02 21:47"
  },
  "severity": "critical",
  "description": "Package updates are available for Amazon Linux AMI that fix the following vulnerabilities:\nCVE-2017-14496:\n\tAn integer underflow flaw leading to a buffer over-read was found in dnsmasq in the EDNS0 code. An attacker could send crafted DNS packets to dnsmasq which would cause it to crash. This issue only affected configurations using one of the options: add-mac, add-cpe-id, or add-subnet.\n1495416: \nCVE-2017-14496 dnsmasq: integer underflow leading to buffer over-read in the EDNS0 code\n\nCVE-2017-14495:\n\tA memory exhaustion flaw was found in dnsmasq in the EDNS0 code. An attacker could send crafted DNS packets which would trigger memory allocations which would never be freed, leading to unbounded memory consumption and eventually a crash. This issue only affected configurations using one of the options: add-mac, add-cpe-id, or add-subnet.\n1495415: \nCVE-2017-14495 dnsmasq: memory exhaustion vulnerability in the EDNS0 code\n\nCVE-2017-14494:\n\tAn information leak was found in dnsmasq in the DHCPv6 relay code. An attacker on the local network could send crafted DHCPv6 packets to dnsmasq causing it to forward the contents of process memory, potentially leaking sensitive data.\n1495412: \nCVE-2017-14494 dnsmasq: information leak in the DHCPv6 relay code\n\nCVE-2017-14493:\n\tA stack buffer overflow was found in dnsmasq in the DHCPv6 code. An attacker on the local network could send a crafted DHCPv6 request to dnsmasq which would cause it to a crash or, potentially, execute arbitrary code.\n1495411: \nCVE-2017-14493 dnsmasq: stack buffer overflow in the DHCPv6 code\n\nCVE-2017-14492:\n\tA heap buffer overflow was discovered in dnsmasq in the IPv6 router advertisement (RA) handling code. An attacker on the local network segment could send crafted RAs to dnsmasq which would cause it to crash or, potentially, execute arbitrary code. This issue only affected configurations using one of these options: enable-ra, ra-only, slaac, ra-names, ra-advrouter, or ra-stateless.\n1495410: \nCVE-2017-14492 dnsmasq: heap overflow in the IPv6 router advertisement code\n\nCVE-2017-14491:\n\tA heap buffer overflow was found in dnsmasq in the code responsible for building DNS replies. An attacker could send crafted DNS packets to dnsmasq which would cause it to crash or, potentially, execute arbitrary code.\n1495409: \nCVE-2017-14491 dnsmasq: heap overflow in the code responsible for building DNS replies\n",
  "packages": [
    {
      "name": "dnsmasq-utils",
      "epoch": "0",
      "version": "2.76",
      "release": "2.14.amzn1",
      "arch": "x86_64",
      "filename": "Packages/dnsmasq-utils-2.76-2.14.amzn1.x86_64.rpm"
    },
    {
      "name": "dnsmasq-debuginfo",
      "epoch": "0",
      "version": "2.76",
      "release": "2.14.amzn1",
      "arch": "x86_64",
      "filename": "Packages/dnsmasq-debuginfo-2.76-2.14.amzn1.x86_64.rpm"
    },
    {
      "name": "dnsmasq",
      "epoch": "0",
      "version": "2.76",
      "release": "2.14.amzn1",
      "arch": "x86_64",
      "filename": "Packages/dnsmasq-2.76-2.14.amzn1.x86_64.rpm"
    },
    {
      "name": "dnsmasq",
      "epoch": "0",
      "version": "2.76",
      "release": "2.14.amzn1",
      "arch": "i686",
      "filename": "Packages/dnsmasq-2.76-2.14.amzn1.i686.rpm"
    },
    {
      "name": "dnsmasq-debuginfo",
      "epoch": "0",
      "version": "2.76",
      "release": "2.14.amzn1",
      "arch": "i686",
      "filename": "Packages/dnsmasq-debuginfo-2.76-2.14.amzn1.i686.rpm"
    },
    {
      "name": "dnsmasq-utils",
      "epoch": "0",
      "version": "2.76",
      "release": "2.14.amzn1",
      "arch": "i686",
      "filename": "Packages/dnsmasq-utils-2.76-2.14.amzn1.i686.rpm"
    }
  ],
  "references": [
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2017-14491",
      "id": "CVE-2017-14491",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2017-14492",
      "id": "CVE-2017-14492",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2017-14493",
      "id": "CVE-2017-14493",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2017-14494",
      "id": "CVE-2017-14494",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2017-14495",
      "id": "CVE-2017-14495",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2017-14496",
      "id": "CVE-2017-14496",
      "type": "cve"
    }
  ],
  "cveids": [
    "CVE-2017-14491",
    "CVE-2017-14492",
    "CVE-2017-14493",
    "CVE-2017-14494",
    "CVE-2017-14495",
    "CVE-2017-14496"
  ]
}