{
  "id": "ALAS-2012-147",
  "title": "Amazon Linux - ALAS-2012-147: medium priority package update for libtiff",
  "issued": {
    "date": "2012-12-20 13:55"
  },
  "updated": {
    "date": "2014-09-14 17:20"
  },
  "severity": "medium",
  "description": "Package updates are available for Amazon Linux that fix the following vulnerabilities:\nCVE-2012-5581:\n\tStack-based buffer overflow in tif_dir.c in LibTIFF before 4.0.2 allows remote attackers to cause a denial of service (crash) and possibly execute arbitrary code via a crafted DOTRANGE tag in a TIFF image.\nA stack-based buffer overflow flaw was found in the way libtiff handled DOTRANGE tags. An attacker could use this flaw to create a specially-crafted TIFF file that, when opened, would cause an application linked against libtiff to crash or, possibly, execute arbitrary code.\n867235: \nCVE-2012-5581 libtiff: Stack-based buffer overflow when reading a tiled tiff file\n\nCVE-2012-4564:\n\tppm2tiff does not check the return value of the TIFFScanlineSize function, which allows remote attackers to cause a denial of service (crash) and possibly execute arbitrary code via a crafted PPM image that triggers an integer overflow, a zero-memory allocation, and a heap-based buffer overflow.\nA missing return value check flaw, leading to a heap-based buffer overflow, was found in the ppm2tiff tool. An attacker could use this flaw to create a specially-crafted PPM (Portable Pixel Map) file that would cause ppm2tiff to crash or, possibly, execute arbitrary code.\n871700: \nCVE-2012-4564 libtiff: Missing return value check in ppm2tiff leading to heap-buffer overflow when reading a tiff file\n\nCVE-2012-4447:\n\tHeap-based buffer overflow in tif_pixarlog.c in LibTIFF before 4.0.3 allows remote attackers to cause a denial of service (application crash) and possibly execute arbitrary code via a crafted TIFF image using the PixarLog Compression format.\nA heap-based buffer overflow flaw was found in the way libtiff processed certain TIFF images using the Pixar Log Format encoding. An attacker could create a specially-crafted TIFF file that, when opened, could cause an application using libtiff to crash or, possibly, execute arbitrary code with the privileges of the user running the application.\n860198: \nCVE-2012-4447 libtiff: Heap-buffer overflow when processing a TIFF image with PixarLog Compression\n\nCVE-2012-3401:\n\tThe t2p_read_tiff_init function in tiff2pdf (tools/tiff2pdf.c) in LibTIFF 4.0.2 and earlier does not properly initialize the T2P context struct pointer in certain error conditions, which allows context-dependent attackers to cause a denial of service (crash) and possibly execute arbitrary code via a crafted TIFF image that triggers a heap-based buffer overflow.\nA heap-based buffer overflow flaw was found in the tiff2pdf tool. An attacker could use this flaw to create a specially-crafted TIFF file that would cause tiff2pdf to crash or, possibly, execute arbitrary code.\n837577: \nCVE-2012-3401 libtiff (tiff2pdf): Heap-based buffer overflow due to improper initialization of T2P context struct pointer\n",
  "packages": [
    {
      "name": "libtiff-static",
      "epoch": "0",
      "version": "3.9.4",
      "release": "9.11.amzn1",
      "arch": "i686",
      "filename": "Packages/libtiff-static-3.9.4-9.11.amzn1.i686.rpm"
    },
    {
      "name": "libtiff-debuginfo",
      "epoch": "0",
      "version": "3.9.4",
      "release": "9.11.amzn1",
      "arch": "i686",
      "filename": "Packages/libtiff-debuginfo-3.9.4-9.11.amzn1.i686.rpm"
    },
    {
      "name": "libtiff",
      "epoch": "0",
      "version": "3.9.4",
      "release": "9.11.amzn1",
      "arch": "i686",
      "filename": "Packages/libtiff-3.9.4-9.11.amzn1.i686.rpm"
    },
    {
      "name": "libtiff-devel",
      "epoch": "0",
      "version": "3.9.4",
      "release": "9.11.amzn1",
      "arch": "i686",
      "filename": "Packages/libtiff-devel-3.9.4-9.11.amzn1.i686.rpm"
    },
    {
      "name": "libtiff-debuginfo",
      "epoch": "0",
      "version": "3.9.4",
      "release": "9.11.amzn1",
      "arch": "x86_64",
      "filename": "Packages/libtiff-debuginfo-3.9.4-9.11.amzn1.x86_64.rpm"
    },
    {
      "name": "libtiff",
      "epoch": "0",
      "version": "3.9.4",
      "release": "9.11.amzn1",
      "arch": "x86_64",
      "filename": "Packages/libtiff-3.9.4-9.11.amzn1.x86_64.rpm"
    },
    {
      "name": "libtiff-static",
      "epoch": "0",
      "version": "3.9.4",
      "release": "9.11.amzn1",
      "arch": "x86_64",
      "filename": "Packages/libtiff-static-3.9.4-9.11.amzn1.x86_64.rpm"
    },
    {
      "name": "libtiff-devel",
      "epoch": "0",
      "version": "3.9.4",
      "release": "9.11.amzn1",
      "arch": "x86_64",
      "filename": "Packages/libtiff-devel-3.9.4-9.11.amzn1.x86_64.rpm"
    }
  ],
  "references": [
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2012-3401",
      "id": "CVE-2012-3401",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2012-4447",
      "id": "CVE-2012-4447",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2012-4564",
      "id": "CVE-2012-4564",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2012-5581",
      "id": "CVE-2012-5581",
      "type": "cve"
    },
    {
      "href": "https://rhn.redhat.com/errata/RHSA-2012:1590.html",
      "id": "RHSA-2012:1590",
      "type": "redhat"
    }
  ],
  "cveids": [
    "CVE-2012-3401",
    "CVE-2012-4447",
    "CVE-2012-4564",
    "CVE-2012-5581"
  ]
}