{
  "id": "ALAS-2020-1353",
  "title": "Amazon Linux AMI 2014.03 - ALAS-2020-1353: important priority package update for tomcat8",
  "issued": {
    "date": "2020-03-09 19:21"
  },
  "updated": {
    "date": "2021-08-20 19:22"
  },
  "severity": "important",
  "description": "Package updates are available for Amazon Linux AMI that fix the following vulnerabilities:\nCVE-2020-1938:\n\tWhen using the Apache JServ Protocol (AJP), care must be taken when trusting incoming connections to Apache Tomcat. Tomcat treats AJP connections as having higher trust than, for example, a similar HTTP connection. If such connections are available to an attacker, they can be exploited in ways that may be surprising. In Apache Tomcat 9.0.0.M1 to 9.0.0.30, 8.5.0 to 8.5.50 and 7.0.0 to 7.0.99, Tomcat shipped with an AJP Connector enabled by default that listened on all configured IP addresses. It was expected (and recommended in the security guide) that this Connector would be disabled if not required. This vulnerability report identified a mechanism that allowed: - returning arbitrary files from anywhere in the web application - processing any file in the web application as a JSP Further, if the web application allowed file upload and stored those files within the web application (or the attacker was able to control the content of the web application by some other means) then this, along with the ability to process a file as a JSP, made remote code execution possible. It is important to note that mitigation is only required if an AJP port is accessible to untrusted users. Users wishing to take a defence-in-depth approach and block the vector that permits returning arbitrary files and execution as JSP may upgrade to Apache Tomcat 9.0.31, 8.5.51 or 7.0.100 or later. A number of changes were made to the default AJP Connector configuration in 9.0.31 to harden the default configuration. It is likely that users upgrading to 9.0.31, 8.5.51 or 7.0.100 or later will need to make small changes to their configurations.\n1806398: CVE-2020-1938 tomcat: Apache Tomcat AJP File Read/Inclusion Vulnerability\n\nCVE-2020-1935:\n\tIn Apache Tomcat 9.0.0.M1 to 9.0.30, 8.5.0 to 8.5.50 and 7.0.0 to 7.0.99 the HTTP header parsing code used an approach to end-of-line parsing that allowed some invalid HTTP headers to be parsed as valid. This led to a possibility of HTTP Request Smuggling if Tomcat was located behind a reverse proxy that incorrectly handled the invalid Transfer-Encoding header in a particular manner. Such a reverse proxy is considered unlikely.\n1806835: CVE-2020-1935 tomcat: Mishandling of Transfer-Encoding header allows for HTTP request smuggling\n\nCVE-2019-17569:\n\tThe refactoring present in Apache Tomcat 9.0.28 to 9.0.30, 8.5.48 to 8.5.50 and 7.0.98 to 7.0.99 introduced a regression. The result of the regression was that invalid Transfer-Encoding headers were incorrectly processed leading to a possibility of HTTP Request Smuggling if Tomcat was located behind a reverse proxy that incorrectly handled the invalid Transfer-Encoding header in a particular manner. Such a reverse proxy is considered unlikely.\n1806849: CVE-2019-17569 tomcat: Regression in handling of Transfer-Encoding header allows for HTTP request smuggling\n",
  "packages": [
    {
      "name": "tomcat8-javadoc",
      "epoch": "0",
      "version": "8.5.51",
      "release": "1.83.amzn1",
      "arch": "noarch",
      "filename": "Packages/tomcat8-javadoc-8.5.51-1.83.amzn1.noarch.rpm"
    },
    {
      "name": "tomcat8-el-3.0-api",
      "epoch": "0",
      "version": "8.5.51",
      "release": "1.83.amzn1",
      "arch": "noarch",
      "filename": "Packages/tomcat8-el-3.0-api-8.5.51-1.83.amzn1.noarch.rpm"
    },
    {
      "name": "tomcat8-jsp-2.3-api",
      "epoch": "0",
      "version": "8.5.51",
      "release": "1.83.amzn1",
      "arch": "noarch",
      "filename": "Packages/tomcat8-jsp-2.3-api-8.5.51-1.83.amzn1.noarch.rpm"
    },
    {
      "name": "tomcat8-servlet-3.1-api",
      "epoch": "0",
      "version": "8.5.51",
      "release": "1.83.amzn1",
      "arch": "noarch",
      "filename": "Packages/tomcat8-servlet-3.1-api-8.5.51-1.83.amzn1.noarch.rpm"
    },
    {
      "name": "tomcat8-docs-webapp",
      "epoch": "0",
      "version": "8.5.51",
      "release": "1.83.amzn1",
      "arch": "noarch",
      "filename": "Packages/tomcat8-docs-webapp-8.5.51-1.83.amzn1.noarch.rpm"
    },
    {
      "name": "tomcat8-log4j",
      "epoch": "0",
      "version": "8.5.51",
      "release": "1.83.amzn1",
      "arch": "noarch",
      "filename": "Packages/tomcat8-log4j-8.5.51-1.83.amzn1.noarch.rpm"
    },
    {
      "name": "tomcat8-webapps",
      "epoch": "0",
      "version": "8.5.51",
      "release": "1.83.amzn1",
      "arch": "noarch",
      "filename": "Packages/tomcat8-webapps-8.5.51-1.83.amzn1.noarch.rpm"
    },
    {
      "name": "tomcat8",
      "epoch": "0",
      "version": "8.5.51",
      "release": "1.83.amzn1",
      "arch": "noarch",
      "filename": "Packages/tomcat8-8.5.51-1.83.amzn1.noarch.rpm"
    },
    {
      "name": "tomcat8-admin-webapps",
      "epoch": "0",
      "version": "8.5.51",
      "release": "1.83.amzn1",
      "arch": "noarch",
      "filename": "Packages/tomcat8-admin-webapps-8.5.51-1.83.amzn1.noarch.rpm"
    },
    {
      "name": "tomcat8-lib",
      "epoch": "0",
      "version": "8.5.51",
      "release": "1.83.amzn1",
      "arch": "noarch",
      "filename": "Packages/tomcat8-lib-8.5.51-1.83.amzn1.noarch.rpm"
    }
  ],
  "references": [
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2019-17569",
      "id": "CVE-2019-17569",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-1935",
      "id": "CVE-2020-1935",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-1938",
      "id": "CVE-2020-1938",
      "type": "cve"
    }
  ],
  "cveids": [
    "CVE-2019-17569",
    "CVE-2020-1935",
    "CVE-2020-1938"
  ]
}