{
  "id": "ALAS-2023-1863",
  "title": "Amazon Linux AMI 2014.03 - ALAS-2023-1863: important priority package update for apache-ivy",
  "issued": {
    "date": "2023-10-12 15:48"
  },
  "updated": {
    "date": "2023-10-24 21:37"
  },
  "severity": "important",
  "description": "Package updates are available for Amazon Linux AMI that fix the following vulnerabilities:\nCVE-2022-46751:\n\tImproper Restriction of XML External Entity Reference, XML Injection (aka Blind XPath Injection) vulnerability in Apache Software Foundation Apache Ivy.This issue affects any version of Apache Ivy prior to 2.5.2.\n\nWhen Apache Ivy prior to 2.5.2 parses XML files - either its own configuration, Ivy files or Apache Maven POMs - it will allow downloading external document type definitions and expand any entity references contained therein when used.\n\nThis can be used to exfiltrate data, access resources only the machine running Ivy has access to or disturb the execution of Ivy in different ways.\n\nStarting with Ivy 2.5.2 DTD processing is disabled by default except when parsing Maven POMs where the default is to allow DTD processing but only to include a DTD snippet shipping with Ivy that is needed to deal with existing Maven POMs that are not valid XML files but are nevertheless accepted by Maven. Access can be be made more lenient via newly introduced system properties where needed.\n\nUsers of Ivy prior to version 2.5.2 can use Java system properties to restrict processing of external DTDs, see the section about \"JAXP Properties for External Access restrictions\" inside Oracle's \"Java API for XML Processing (JAXP) Security Guide\".\n",
  "packages": [
    {
      "name": "apache-ivy-javadoc",
      "epoch": "0",
      "version": "2.2.0",
      "release": "5.2.amzn1",
      "arch": "noarch",
      "filename": "Packages/apache-ivy-javadoc-2.2.0-5.2.amzn1.noarch.rpm"
    },
    {
      "name": "apache-ivy",
      "epoch": "0",
      "version": "2.2.0",
      "release": "5.2.amzn1",
      "arch": "noarch",
      "filename": "Packages/apache-ivy-2.2.0-5.2.amzn1.noarch.rpm"
    }
  ],
  "references": [
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-46751",
      "id": "CVE-2022-46751",
      "type": "cve"
    }
  ],
  "cveids": [
    "CVE-2022-46751"
  ]
}