{
  "id": "ALAS-2024-1948",
  "title": "Amazon Linux AMI 2014.03 - ALAS-2024-1948: medium priority package update for amazon-ssm-agent",
  "issued": {
    "date": "2024-09-26 00:30:00"
  },
  "updated": {
    "date": "2024-10-03 10:50:00"
  },
  "severity": "medium",
  "description": "Package updates are available for Amazon Linux AMI that fix the following vulnerabilities:\nCVE-2024-24790:\n\tThe various Is methods (IsPrivate, IsLoopback, etc) did not work as expected for IPv4-mapped IPv6 addresses, returning false for addresses which would return true in their traditional IPv4 forms.\n\nCVE-2023-45288:\n\tAn attacker may cause an HTTP/2 endpoint to read arbitrary amounts of header data by sending an excessive number of CONTINUATION frames. Maintaining HPACK state requires parsing and processing all HEADERS and CONTINUATION frames on a connection. When a request's headers exceed MaxHeaderBytes, no memory is allocated to store the excess headers, but they are still parsed. This permits an attacker to cause an HTTP/2 endpoint to read arbitrary amounts of header data, all associated with a request which is going to be rejected. These headers can include Huffman-encoded data which is significantly more expensive for the receiver to decode than for an attacker to send. The fix sets a limit on the amount of excess header frames we will process before closing a connection.\n",
  "packages": [
    {
      "name": "amazon-ssm-agent",
      "epoch": "0",
      "version": "3.3.859.0",
      "release": "1.amzn1",
      "arch": "x86_64",
      "filename": "Packages/amazon-ssm-agent-3.3.859.0-1.amzn1.x86_64.rpm"
    }
  ],
  "references": [
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-45288",
      "id": "CVE-2023-45288",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-24790",
      "id": "CVE-2024-24790",
      "type": "cve"
    }
  ],
  "cveids": [
    "CVE-2023-45288",
    "CVE-2024-24790"
  ]
}