{
  "id": "ALAS-2018-1070",
  "title": "Amazon Linux AMI 2014.03 - ALAS-2018-1070: medium priority package update for mysql57",
  "issued": {
    "date": "2018-08-22 19:35"
  },
  "updated": {
    "date": "2018-08-23 18:26"
  },
  "severity": "medium",
  "description": "Package updates are available for Amazon Linux AMI that fix the following vulnerabilities:\nCVE-2018-3081:\n\tVulnerability in the MySQL Client component of Oracle MySQL (subcomponent: Client programs). Supported versions that are affected are 5.5.60 and prior, 5.6.40 and prior, 5.7.22 and prior and 8.0.11 and prior. Difficult to exploit vulnerability allows high privileged attacker with network access via multiple protocols to compromise MySQL Client. Successful attacks of this vulnerability can result in unauthorized ability to cause a hang or frequently repeatable crash (complete DOS) of MySQL Client as well as unauthorized update, insert or delete access to some of MySQL Client accessible data. CVSS 3.0 Base Score 5.0 (Integrity and Availability impacts). CVSS Vector: (CVSS:3.0/AV:N/AC:H/PR:H/UI:N/S:U/C:N/I:L/A:H).\n1602424: \nCVE-2018-3081 mysql: Client programs unspecified vulnerability (CPU Jul 2018)\n\nCVE-2018-3077:\n\tVulnerability in the MySQL Server component of Oracle MySQL (subcomponent: Server: DDL). Supported versions that are affected are 5.7.22 and prior and 8.0.11 and prior. Easily exploitable vulnerability allows high privileged attacker with network access via multiple protocols to compromise MySQL Server. Successful attacks of this vulnerability can result in unauthorized ability to cause a hang or frequently repeatable crash (complete DOS) of MySQL Server. CVSS 3.0 Base Score 4.9 (Availability impacts). CVSS Vector: (CVSS:3.0/AV:N/AC:L/PR:H/UI:N/S:U/C:N/I:N/A:H).\n1602375: \nCVE-2018-3077 mysql: Server: DDL unspecified vulnerability (CPU Jul 2018)\n\nCVE-2018-3071:\n\tVulnerability in the MySQL Server component of Oracle MySQL (subcomponent: Audit Log). Supported versions that are affected are 5.7.22 and prior. Easily exploitable vulnerability allows high privileged attacker with network access via multiple protocols to compromise MySQL Server. Successful attacks of this vulnerability can result in unauthorized ability to cause a hang or frequently repeatable crash (complete DOS) of MySQL Server. CVSS 3.0 Base Score 4.9 (Availability impacts). CVSS Vector: (CVSS:3.0/AV:N/AC:L/PR:H/UI:N/S:U/C:N/I:N/A:H).\n1602370: \nCVE-2018-3071 mysql: Audit Log unspecified vulnerability (CPU Jul 2018)\n\nCVE-2018-3070:\n\tVulnerability in the MySQL Server component of Oracle MySQL (subcomponent: Client mysqldump). Supported versions that are affected are 5.5.60 and prior, 5.6.40 and prior and 5.7.22 and prior. Easily exploitable vulnerability allows low privileged attacker with network access via multiple protocols to compromise MySQL Server. Successful attacks of this vulnerability can result in unauthorized ability to cause a hang or frequently repeatable crash (complete DOS) of MySQL Server. CVSS 3.0 Base Score 6.5 (Availability impacts). CVSS Vector: (CVSS:3.0/AV:N/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H).\n1602369: \nCVE-2018-3070 mysql: Client mysqldump unspecified vulnerability (CPU Jul 2018)\n\nCVE-2018-3066:\n\tVulnerability in the MySQL Server component of Oracle MySQL (subcomponent: Server: Options). Supported versions that are affected are 5.5.60 and prior, 5.6.40 and prior and 5.7.22 and prior. Difficult to exploit vulnerability allows high privileged attacker with network access via multiple protocols to compromise MySQL Server. Successful attacks of this vulnerability can result in unauthorized update, insert or delete access to some of MySQL Server accessible data as well as unauthorized read access to a subset of MySQL Server accessible data. CVSS 3.0 Base Score 3.3 (Confidentiality and Integrity impacts). CVSS Vector: (CVSS:3.0/AV:N/AC:H/PR:H/UI:N/S:U/C:L/I:L/A:N).\n1602366: \nCVE-2018-3066 mysql: Server: Options unspecified vulnerability (CPU Jul 2018)\n\nCVE-2018-3065:\n\tVulnerability in the MySQL Server component of Oracle MySQL (subcomponent: Server: DML). Supported versions that are affected are 5.7.22 and prior and 8.0.11 and prior. Easily exploitable vulnerability allows low privileged attacker with network access via multiple protocols to compromise MySQL Server. Successful attacks of this vulnerability can result in unauthorized ability to cause a hang or frequently repeatable crash (complete DOS) of MySQL Server. CVSS 3.0 Base Score 6.5 (Availability impacts). CVSS Vector: (CVSS:3.0/AV:N/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H).\n1602365: \nCVE-2018-3065 mysql: Server: DML unspecified vulnerability (CPU Jul 2018)\n\nCVE-2018-3064:\n\tVulnerability in the MySQL Server component of Oracle MySQL (subcomponent: InnoDB). Supported versions that are affected are 5.6.40 and prior, 5.7.22 and prior and 8.0.11 and prior. Easily exploitable vulnerability allows low privileged attacker with network access via multiple protocols to compromise MySQL Server. Successful attacks of this vulnerability can result in unauthorized ability to cause a hang or frequently repeatable crash (complete DOS) of MySQL Server as well as unauthorized update, insert or delete access to some of MySQL Server accessible data. CVSS 3.0 Base Score 7.1 (Integrity and Availability impacts). CVSS Vector: (CVSS:3.0/AV:N/AC:L/PR:L/UI:N/S:U/C:N/I:L/A:H).\n1602364: \nCVE-2018-3064 mysql: InnoDB unspecified vulnerability (CPU Jul 2018)\n\nCVE-2018-3062:\n\tVulnerability in the MySQL Server component of Oracle MySQL (subcomponent: Server: Memcached). Supported versions that are affected are 5.6.40 and prior, 5.7.22 and prior and 8.0.11 and prior. Difficult to exploit vulnerability allows low privileged attacker with network access via memcached to compromise MySQL Server. Successful attacks of this vulnerability can result in unauthorized ability to cause a hang or frequently repeatable crash (complete DOS) of MySQL Server. CVSS 3.0 Base Score 5.3 (Availability impacts). CVSS Vector: (CVSS:3.0/AV:N/AC:H/PR:L/UI:N/S:U/C:N/I:N/A:H).\n1602360: \nCVE-2018-3062 mysql: Server: Memcached unspecified vulnerability (CPU Jul 2018)\n\nCVE-2018-3061:\n\tVulnerability in the MySQL Server component of Oracle MySQL (subcomponent: Server: DML). Supported versions that are affected are 5.7.22 and prior. Easily exploitable vulnerability allows high privileged attacker with network access via multiple protocols to compromise MySQL Server. Successful attacks of this vulnerability can result in unauthorized ability to cause a hang or frequently repeatable crash (complete DOS) of MySQL Server. CVSS 3.0 Base Score 4.9 (Availability impacts). CVSS Vector: (CVSS:3.0/AV:N/AC:L/PR:H/UI:N/S:U/C:N/I:N/A:H).\n1602359: \nCVE-2018-3061 mysql: Server: DML unspecified vulnerability (CPU Jul 2018)\n\nCVE-2018-3060:\n\tVulnerability in the MySQL Server component of Oracle MySQL (subcomponent: InnoDB). Supported versions that are affected are 5.7.22 and prior and 8.0.11 and prior. Easily exploitable vulnerability allows high privileged attacker with network access via multiple protocols to compromise MySQL Server. Successful attacks of this vulnerability can result in unauthorized creation, deletion or modification access to critical data or all MySQL Server accessible data and unauthorized ability to cause a hang or frequently repeatable crash (complete DOS) of MySQL Server. CVSS 3.0 Base Score 6.5 (Integrity and Availability impacts). CVSS Vector: (CVSS:3.0/AV:N/AC:L/PR:H/UI:N/S:U/C:N/I:H/A:H).\n1602357: \nCVE-2018-3060 mysql: InnoDB unspecified vulnerability (CPU Jul 2018)\n\nCVE-2018-3058:\n\tVulnerability in the MySQL Server component of Oracle MySQL (subcomponent: MyISAM). Supported versions that are affected are 5.5.60 and prior, 5.6.40 and prior and 5.7.22 and prior. Easily exploitable vulnerability allows low privileged attacker with network access via multiple protocols to compromise MySQL Server. Successful attacks of this vulnerability can result in unauthorized update, insert or delete access to some of MySQL Server accessible data. CVSS 3.0 Base Score 4.3 (Integrity impacts). CVSS Vector: (CVSS:3.0/AV:N/AC:L/PR:L/UI:N/S:U/C:N/I:L/A:N).\n1602356: \nCVE-2018-3058 mysql: MyISAM unspecified vulnerability (CPU Jul 2018)\n\nCVE-2018-3056:\n\tVulnerability in the MySQL Server component of Oracle MySQL (subcomponent: Server: Security: Privileges). Supported versions that are affected are 5.7.22 and prior and 8.0.11 and prior. Easily exploitable vulnerability allows low privileged attacker with network access via multiple protocols to compromise MySQL Server. Successful attacks of this vulnerability can result in unauthorized read access to a subset of MySQL Server accessible data. CVSS 3.0 Base Score 4.3 (Confidentiality impacts). CVSS Vector: (CVSS:3.0/AV:N/AC:L/PR:L/UI:N/S:U/C:L/I:N/A:N).\n1602355: \nCVE-2018-3056 mysql: Server: Security: Privileges unspecified vulnerability (CPU Jul 2018)\n\nCVE-2018-3054:\n\tVulnerability in the MySQL Server component of Oracle MySQL (subcomponent: Server: DDL). Supported versions that are affected are 5.7.22 and prior and 8.0.11 and prior. Easily exploitable vulnerability allows high privileged attacker with network access via multiple protocols to compromise MySQL Server. Successful attacks of this vulnerability can result in unauthorized ability to cause a hang or frequently repeatable crash (complete DOS) of MySQL Server. CVSS 3.0 Base Score 4.9 (Availability impacts). CVSS Vector: (CVSS:3.0/AV:N/AC:L/PR:H/UI:N/S:U/C:N/I:N/A:H).\n1602354: \nCVE-2018-3054 mysql: Server: DDL unspecified vulnerability (CPU Jul 2018)\n\nCVE-2018-2767:\n\tVulnerability in the MySQL Server component of Oracle MySQL (subcomponent: Server: Security: Encryption). Supported versions that are affected are 5.5.60 and prior, 5.6.40 and prior and 5.7.22 and prior. Difficult to exploit vulnerability allows low privileged attacker with network access via multiple protocols to compromise MySQL Server. Successful attacks of this vulnerability can result in unauthorized read access to a subset of MySQL Server accessible data. CVSS 3.0 Base Score 3.1 (Confidentiality impacts). CVSS Vector: (CVSS:3.0/AV:N/AC:H/PR:L/UI:N/S:U/C:L/I:N/A:N).\n1564965: \nCVE-2018-2767 mysql: use of SSL/TLS not enforced in libmysqld (Return of BACKRONYM)\n\nCVE-2018-0739:\n\tConstructed ASN.1 types with a recursive definition (such as can be found in PKCS7) could eventually exceed the stack given malicious input with excessive recursion. This could result in a Denial Of Service attack. There are no such structures used within SSL/TLS that come from untrusted sources so this is considered safe. Fixed in OpenSSL 1.1.0h (Affected 1.1.0-1.1.0g). Fixed in OpenSSL 1.0.2o (Affected 1.0.2b-1.0.2n).\n1561266: \nCVE-2018-0739 openssl: Handling of crafted recursive ASN.1 structures can cause a stack overflow and resulting denial of service\n",
  "packages": [
    {
      "name": "mysql57-server",
      "epoch": "0",
      "version": "5.7.23",
      "release": "2.8.amzn1",
      "arch": "x86_64",
      "filename": "Packages/mysql57-server-5.7.23-2.8.amzn1.x86_64.rpm"
    },
    {
      "name": "mysql57-devel",
      "epoch": "0",
      "version": "5.7.23",
      "release": "2.8.amzn1",
      "arch": "x86_64",
      "filename": "Packages/mysql57-devel-5.7.23-2.8.amzn1.x86_64.rpm"
    },
    {
      "name": "mysql57-embedded",
      "epoch": "0",
      "version": "5.7.23",
      "release": "2.8.amzn1",
      "arch": "x86_64",
      "filename": "Packages/mysql57-embedded-5.7.23-2.8.amzn1.x86_64.rpm"
    },
    {
      "name": "mysql57",
      "epoch": "0",
      "version": "5.7.23",
      "release": "2.8.amzn1",
      "arch": "x86_64",
      "filename": "Packages/mysql57-5.7.23-2.8.amzn1.x86_64.rpm"
    },
    {
      "name": "mysql57-debuginfo",
      "epoch": "0",
      "version": "5.7.23",
      "release": "2.8.amzn1",
      "arch": "x86_64",
      "filename": "Packages/mysql57-debuginfo-5.7.23-2.8.amzn1.x86_64.rpm"
    },
    {
      "name": "mysql57-errmsg",
      "epoch": "0",
      "version": "5.7.23",
      "release": "2.8.amzn1",
      "arch": "x86_64",
      "filename": "Packages/mysql57-errmsg-5.7.23-2.8.amzn1.x86_64.rpm"
    },
    {
      "name": "mysql57-test",
      "epoch": "0",
      "version": "5.7.23",
      "release": "2.8.amzn1",
      "arch": "x86_64",
      "filename": "Packages/mysql57-test-5.7.23-2.8.amzn1.x86_64.rpm"
    },
    {
      "name": "mysql57-embedded-devel",
      "epoch": "0",
      "version": "5.7.23",
      "release": "2.8.amzn1",
      "arch": "x86_64",
      "filename": "Packages/mysql57-embedded-devel-5.7.23-2.8.amzn1.x86_64.rpm"
    },
    {
      "name": "mysql57-libs",
      "epoch": "0",
      "version": "5.7.23",
      "release": "2.8.amzn1",
      "arch": "x86_64",
      "filename": "Packages/mysql57-libs-5.7.23-2.8.amzn1.x86_64.rpm"
    },
    {
      "name": "mysql57-common",
      "epoch": "0",
      "version": "5.7.23",
      "release": "2.8.amzn1",
      "arch": "x86_64",
      "filename": "Packages/mysql57-common-5.7.23-2.8.amzn1.x86_64.rpm"
    },
    {
      "name": "mysql57",
      "epoch": "0",
      "version": "5.7.23",
      "release": "2.8.amzn1",
      "arch": "i686",
      "filename": "Packages/mysql57-5.7.23-2.8.amzn1.i686.rpm"
    },
    {
      "name": "mysql57-embedded-devel",
      "epoch": "0",
      "version": "5.7.23",
      "release": "2.8.amzn1",
      "arch": "i686",
      "filename": "Packages/mysql57-embedded-devel-5.7.23-2.8.amzn1.i686.rpm"
    },
    {
      "name": "mysql57-debuginfo",
      "epoch": "0",
      "version": "5.7.23",
      "release": "2.8.amzn1",
      "arch": "i686",
      "filename": "Packages/mysql57-debuginfo-5.7.23-2.8.amzn1.i686.rpm"
    },
    {
      "name": "mysql57-server",
      "epoch": "0",
      "version": "5.7.23",
      "release": "2.8.amzn1",
      "arch": "i686",
      "filename": "Packages/mysql57-server-5.7.23-2.8.amzn1.i686.rpm"
    },
    {
      "name": "mysql57-common",
      "epoch": "0",
      "version": "5.7.23",
      "release": "2.8.amzn1",
      "arch": "i686",
      "filename": "Packages/mysql57-common-5.7.23-2.8.amzn1.i686.rpm"
    },
    {
      "name": "mysql57-test",
      "epoch": "0",
      "version": "5.7.23",
      "release": "2.8.amzn1",
      "arch": "i686",
      "filename": "Packages/mysql57-test-5.7.23-2.8.amzn1.i686.rpm"
    },
    {
      "name": "mysql57-errmsg",
      "epoch": "0",
      "version": "5.7.23",
      "release": "2.8.amzn1",
      "arch": "i686",
      "filename": "Packages/mysql57-errmsg-5.7.23-2.8.amzn1.i686.rpm"
    },
    {
      "name": "mysql57-libs",
      "epoch": "0",
      "version": "5.7.23",
      "release": "2.8.amzn1",
      "arch": "i686",
      "filename": "Packages/mysql57-libs-5.7.23-2.8.amzn1.i686.rpm"
    },
    {
      "name": "mysql57-embedded",
      "epoch": "0",
      "version": "5.7.23",
      "release": "2.8.amzn1",
      "arch": "i686",
      "filename": "Packages/mysql57-embedded-5.7.23-2.8.amzn1.i686.rpm"
    },
    {
      "name": "mysql57-devel",
      "epoch": "0",
      "version": "5.7.23",
      "release": "2.8.amzn1",
      "arch": "i686",
      "filename": "Packages/mysql57-devel-5.7.23-2.8.amzn1.i686.rpm"
    }
  ],
  "references": [
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2018-0739",
      "id": "CVE-2018-0739",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2018-2767",
      "id": "CVE-2018-2767",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2018-3054",
      "id": "CVE-2018-3054",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2018-3056",
      "id": "CVE-2018-3056",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2018-3058",
      "id": "CVE-2018-3058",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2018-3060",
      "id": "CVE-2018-3060",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2018-3061",
      "id": "CVE-2018-3061",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2018-3062",
      "id": "CVE-2018-3062",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2018-3064",
      "id": "CVE-2018-3064",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2018-3065",
      "id": "CVE-2018-3065",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2018-3066",
      "id": "CVE-2018-3066",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2018-3070",
      "id": "CVE-2018-3070",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2018-3071",
      "id": "CVE-2018-3071",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2018-3077",
      "id": "CVE-2018-3077",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2018-3081",
      "id": "CVE-2018-3081",
      "type": "cve"
    }
  ],
  "cveids": [
    "CVE-2018-0739",
    "CVE-2018-2767",
    "CVE-2018-3054",
    "CVE-2018-3056",
    "CVE-2018-3058",
    "CVE-2018-3060",
    "CVE-2018-3061",
    "CVE-2018-3062",
    "CVE-2018-3064",
    "CVE-2018-3065",
    "CVE-2018-3066",
    "CVE-2018-3070",
    "CVE-2018-3071",
    "CVE-2018-3077",
    "CVE-2018-3081"
  ]
}