{
  "id": "ALAS-2012-43",
  "title": "Amazon Linux - ALAS-2012-43: critical priority package update for java-1.6.0-openjdk",
  "issued": {
    "date": "2012-02-15 17:12"
  },
  "updated": {
    "date": "2014-09-14 15:19"
  },
  "severity": "critical",
  "description": "Package updates are available for Amazon Linux that fix the following vulnerabilities:\nCVE-2012-0506:\n\tUnspecified vulnerability in the Java Runtime Environment (JRE) component in Oracle Java SE 7 Update 2 and earlier, 6 Update 30 and earlier, 5.0 Update 33 and earlier, and 1.4.2_35 and earlier allows remote untrusted Java Web Start applications and untrusted Java applets to affect integrity via unknown vectors related to CORBA.\nIt was discovered that the CORBA (Common Object Request Broker Architecture) implementation in Java did not properly protect repository identifiers on certain CORBA objects. This could have been used to modify immutable object data.\n\nCVE-2012-0505:\n\tUnspecified vulnerability in the Java Runtime Environment (JRE) component in Oracle Java SE 7 Update 2 and earlier, 6 Update 30 and earlier, 5 Update 33 and earlier, and 1.4.2_35 and earlier allows remote untrusted Java Web Start applications and untrusted Java applets to affect confidentiality, integrity, and availability via unknown vectors related to Serialization.\nIt was discovered that the exception thrown on deserialization failure did not always contain a proper identification of the cause of the failure. An untrusted Java application or applet could use this flaw to bypass Java sandbox restrictions.\n\nCVE-2012-0503:\n\tUnspecified vulnerability in the Java Runtime Environment (JRE) component in Oracle Java SE 7 Update 2 and earlier, 6 Update 30 and earlier, 5.0 Update 33 and earlier, and 1.4.2_35 and earlier allows remote untrusted Java Web Start applications and untrusted Java applets to affect confidentiality, integrity, and availability, related to I18n.\nIt was discovered that the use of TimeZone.setDefault() was not restricted by the SecurityManager, allowing an untrusted Java application or applet to set a new default time zone, and hence bypass Java sandbox restrictions.\n\nCVE-2012-0502:\n\tUnspecified vulnerability in the Java Runtime Environment (JRE) component in Oracle Java SE 7 Update 2 and earlier, 6 Update 30 and earlier, 5.0 Update 33 and earlier, and 1.4.2_35 and earlier allows remote untrusted Java Web Start applications and untrusted Java applets to affect confidentiality and availability, related to AWT.\nA flaw was found in the AWT KeyboardFocusManager that could allow an untrusted Java application or applet to acquire keyboard focus and possibly steal sensitive information.\n\nCVE-2012-0501:\n\tUnspecified vulnerability in the Java Runtime Environment (JRE) component in Oracle Java SE 7 Update 2 and earlier, 6 Update 30 and earlier, and 5.0 Update 33 and earlier allows remote attackers to affect availability via unknown vectors.\nAn off-by-one flaw, causing a stack overflow, was found in the unpacker for ZIP files. A specially-crafted ZIP archive could cause the Java Virtual Machine (JVM) to crash when opened.\n\nCVE-2012-0497:\n\tUnspecified vulnerability in the Java Runtime Environment (JRE) component in Oracle Java SE 7 Update 2 and earlier, and 6 Update 30 and earlier, allows remote attackers to affect confidentiality, integrity, and availability via unknown vectors related to 2D.\nIt was discovered that Java2D did not properly check graphics rendering objects before passing them to the native renderer. Malicious input, or an untrusted Java application or applet could use this flaw to crash the Java Virtual Machine (JVM), or bypass Java sandbox restrictions.\n\nCVE-2011-5035:\n\tThe HttpServer class did not limit the number of headers read from HTTP requests. A remote attacker could use this flaw to make an application using HttpServer use an excessive amount of CPU time via a specially-crafted request. This update introduces a header count limit controlled using the sun.net.httpserver.maxReqHeaders property. The default value is 200.\nOracle Glassfish 2.1.1, 3.0.1, and 3.1.1, as used in Communications Server 2.0, Sun Java System Application Server 8.1 and 8.2, and possibly other products, computes hash values for form parameters without restricting the ability to trigger hash collisions predictably, which allows remote attackers to cause a denial of service (CPU consumption) by sending many crafted parameters, aka Oracle security ticket S0104869.\n\nCVE-2011-3571:\n\tUnspecified vulnerability in the Virtual Desktop Infrastructure (VDI) component in Oracle Virtualization 3.2 allows remote authenticated users to affect confidentiality and integrity via unknown vectors related to Session.\nThe AtomicReferenceArray class implementation did not properly check if the array was of the expected Object[] type. A malicious Java application or applet could use this flaw to bypass Java sandbox restrictions.\n\nCVE-2011-3563:\n\tUnspecified vulnerability in the Java Runtime Environment (JRE) component in Oracle Java SE 7 Update 2 and earlier, 6 Update 30 and earlier, 5.0 Update 33 and earlier, and 1.4.2_35 and earlier allows remote attackers to affect confidentiality and availability via unknown vectors related to Sound.\nThis update fixes several vulnerabilities in the Sun Java 6 Runtime Environment and the Sun Java 6 Software Development Kit. Further information about these flaws can be found on the Oracle Java SE Critical Patch page, listed in the References section.\nThis update fixes several vulnerabilities in the IBM Java 6 Runtime Environment and the IBM Java 6 Software Development Kit. Detailed vulnerability descriptions are linked from the IBM \"Security alerts\" page, listed in the References section.\nThis update fixes several vulnerabilities in the IBM Java 1.4.2 Runtime Environment and the IBM Java 1.4.2 Software Development Kit. Detailed vulnerability descriptions are linked from the IBM \"Security alerts\" page, listed in the References section.\nThe Java Sound component did not properly check buffer boundaries. Malicious input, or an untrusted Java application or applet could use this flaw to cause the Java Virtual Machine (JVM) to crash or disclose a portion of its memory.\n",
  "packages": [
    {
      "name": "java-1.6.0-openjdk-src",
      "epoch": "1",
      "version": "1.6.0.0",
      "release": "52.1.10.6.41.amzn1",
      "arch": "i686",
      "filename": "Packages/java-1.6.0-openjdk-src-1.6.0.0-52.1.10.6.41.amzn1.i686.rpm"
    },
    {
      "name": "java-1.6.0-openjdk-devel",
      "epoch": "1",
      "version": "1.6.0.0",
      "release": "52.1.10.6.41.amzn1",
      "arch": "i686",
      "filename": "Packages/java-1.6.0-openjdk-devel-1.6.0.0-52.1.10.6.41.amzn1.i686.rpm"
    },
    {
      "name": "java-1.6.0-openjdk",
      "epoch": "1",
      "version": "1.6.0.0",
      "release": "52.1.10.6.41.amzn1",
      "arch": "i686",
      "filename": "Packages/java-1.6.0-openjdk-1.6.0.0-52.1.10.6.41.amzn1.i686.rpm"
    },
    {
      "name": "java-1.6.0-openjdk-demo",
      "epoch": "1",
      "version": "1.6.0.0",
      "release": "52.1.10.6.41.amzn1",
      "arch": "i686",
      "filename": "Packages/java-1.6.0-openjdk-demo-1.6.0.0-52.1.10.6.41.amzn1.i686.rpm"
    },
    {
      "name": "java-1.6.0-openjdk-debuginfo",
      "epoch": "1",
      "version": "1.6.0.0",
      "release": "52.1.10.6.41.amzn1",
      "arch": "i686",
      "filename": "Packages/java-1.6.0-openjdk-debuginfo-1.6.0.0-52.1.10.6.41.amzn1.i686.rpm"
    },
    {
      "name": "java-1.6.0-openjdk-javadoc",
      "epoch": "1",
      "version": "1.6.0.0",
      "release": "52.1.10.6.41.amzn1",
      "arch": "i686",
      "filename": "Packages/java-1.6.0-openjdk-javadoc-1.6.0.0-52.1.10.6.41.amzn1.i686.rpm"
    },
    {
      "name": "java-1.6.0-openjdk-javadoc",
      "epoch": "1",
      "version": "1.6.0.0",
      "release": "52.1.10.6.41.amzn1",
      "arch": "x86_64",
      "filename": "Packages/java-1.6.0-openjdk-javadoc-1.6.0.0-52.1.10.6.41.amzn1.x86_64.rpm"
    },
    {
      "name": "java-1.6.0-openjdk-src",
      "epoch": "1",
      "version": "1.6.0.0",
      "release": "52.1.10.6.41.amzn1",
      "arch": "x86_64",
      "filename": "Packages/java-1.6.0-openjdk-src-1.6.0.0-52.1.10.6.41.amzn1.x86_64.rpm"
    },
    {
      "name": "java-1.6.0-openjdk",
      "epoch": "1",
      "version": "1.6.0.0",
      "release": "52.1.10.6.41.amzn1",
      "arch": "x86_64",
      "filename": "Packages/java-1.6.0-openjdk-1.6.0.0-52.1.10.6.41.amzn1.x86_64.rpm"
    },
    {
      "name": "java-1.6.0-openjdk-devel",
      "epoch": "1",
      "version": "1.6.0.0",
      "release": "52.1.10.6.41.amzn1",
      "arch": "x86_64",
      "filename": "Packages/java-1.6.0-openjdk-devel-1.6.0.0-52.1.10.6.41.amzn1.x86_64.rpm"
    },
    {
      "name": "java-1.6.0-openjdk-demo",
      "epoch": "1",
      "version": "1.6.0.0",
      "release": "52.1.10.6.41.amzn1",
      "arch": "x86_64",
      "filename": "Packages/java-1.6.0-openjdk-demo-1.6.0.0-52.1.10.6.41.amzn1.x86_64.rpm"
    },
    {
      "name": "java-1.6.0-openjdk-debuginfo",
      "epoch": "1",
      "version": "1.6.0.0",
      "release": "52.1.10.6.41.amzn1",
      "arch": "x86_64",
      "filename": "Packages/java-1.6.0-openjdk-debuginfo-1.6.0.0-52.1.10.6.41.amzn1.x86_64.rpm"
    }
  ],
  "references": [
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2011-3563",
      "id": "CVE-2011-3563",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2011-3571",
      "id": "CVE-2011-3571",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2011-5035",
      "id": "CVE-2011-5035",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2012-0497",
      "id": "CVE-2012-0497",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2012-0501",
      "id": "CVE-2012-0501",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2012-0502",
      "id": "CVE-2012-0502",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2012-0503",
      "id": "CVE-2012-0503",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2012-0505",
      "id": "CVE-2012-0505",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2012-0506",
      "id": "CVE-2012-0506",
      "type": "cve"
    },
    {
      "href": "https://rhn.redhat.com/errata/RHSA-2012:0135.html",
      "id": "RHSA-2012:0135",
      "type": "redhat"
    }
  ],
  "cveids": [
    "CVE-2011-3563",
    "CVE-2011-3571",
    "CVE-2011-5035",
    "CVE-2012-0497",
    "CVE-2012-0501",
    "CVE-2012-0502",
    "CVE-2012-0503",
    "CVE-2012-0505",
    "CVE-2012-0506"
  ]
}