{
  "id": "ALAS-2012-40",
  "title": "Amazon Linux - ALAS-2012-40: medium priority package update for t1lib",
  "issued": {
    "date": "2012-02-02 14:26"
  },
  "updated": {
    "date": "2014-09-14 15:15"
  },
  "severity": "medium",
  "description": "Package updates are available for Amazon Linux that fix the following vulnerabilities:\nCVE-2011-1554:\n\tOff-by-one error in t1lib 5.1.2 and earlier, as used in Xpdf before 3.02pl6 and other products, allows remote attackers to cause a denial of service (application crash) via a PDF document containing a crafted Type 1 font that triggers an invalid memory read, integer overflow, and invalid pointer dereference, a different vulnerability than CVE-2011-0764.\nAn off-by-one flaw was found in t1lib. A specially-crafted font file could, when opened, cause teTeX to crash or, potentially, execute arbitrary code with the privileges of the user running teTeX.\nAn off-by-one flaw was found in t1lib. A specially-crafted font file could, when opened, cause an application linked against t1lib to crash or, potentially, execute arbitrary code with the privileges of the user running the application.\nAn off-by-one flaw was found in t1lib. A specially-crafted font file could, when opened, cause a TeX Live utility to crash or, potentially, execute arbitrary code with the privileges of the user running the utility.\n\nCVE-2011-1553:\n\tUse-after-free vulnerability in t1lib 5.1.2 and earlier, as used in Xpdf before 3.02pl6 and other products, allows remote attackers to cause a denial of service (application crash) via a PDF document containing a crafted Type 1 font that triggers an invalid memory write, a different vulnerability than CVE-2011-0764.\nA use-after-free flaw was found in t1lib. A specially-crafted font file could, when opened, cause teTeX to crash or, potentially, execute arbitrary code with the privileges of the user running teTeX.\nA use-after-free flaw was found in t1lib. A specially-crafted font file could, when opened, cause an application linked against t1lib to crash or, potentially, execute arbitrary code with the privileges of the user running the application.\nA use-after-free flaw was found in t1lib. A specially-crafted font file could, when opened, cause a TeX Live utility to crash or, potentially, execute arbitrary code with the privileges of the user running the utility.\n\nCVE-2011-1552:\n\tt1lib 5.1.2 and earlier, as used in Xpdf before 3.02pl6 and other products, reads from invalid memory locations, which allows remote attackers to cause a denial of service (application crash) via a crafted Type 1 font in a PDF document, a different vulnerability than CVE-2011-0764.\nAn out-of-bounds memory read flaw was found in t1lib. A specially-crafted font file could, when opened, cause teTeX to crash.\nAn out-of-bounds memory read flaw was found in t1lib. A specially-crafted font file could, when opened, cause an application linked against t1lib to crash.\nAn out-of-bounds memory read flaw was found in t1lib. A specially-crafted font file could, when opened, cause a TeX Live utility to crash.\n\nCVE-2011-0764:\n\tt1lib 5.1.2 and earlier, as used in Xpdf before 3.02pl6 and other products, uses an invalid pointer in conjunction with a dereference operation, which allows remote attackers to execute arbitrary code via a crafted Type 1 font in a PDF document, as demonstrated by testz.2184122398.pdf.\nAn invalid pointer dereference flaw was found in t1lib. A specially-crafted font file could, when opened, cause teTeX to crash or, potentially, execute arbitrary code with the privileges of the user running teTeX.\nAn invalid pointer dereference flaw was found in t1lib. A specially-crafted font file could, when opened, cause an application linked against t1lib to crash or, potentially, execute arbitrary code with the privileges of the user running the application.\nAn invalid pointer dereference flaw was found in t1lib. A specially-crafted font file could, when opened, cause a TeX Live utility to crash or, potentially, execute arbitrary code with the privileges of the user running the utility.\n\nCVE-2010-2642:\n\tTwo heap-based buffer overflow flaws were found in the way t1lib processed Adobe Font Metrics (AFM) files. If a specially-crafted font file was opened by teTeX, it could cause teTeX to crash or, potentially, execute arbitrary code with the privileges of the user running teTeX.\nTwo heap-based buffer overflow flaws were found in the way t1lib processed Adobe Font Metrics (AFM) files. If a specially-crafted font file was opened by an application linked against t1lib, it could cause the application to crash or, potentially, execute arbitrary code with the privileges of the user running the application.\nTwo heap-based buffer overflow flaws were found in the way t1lib processed Adobe Font Metrics (AFM) files. If a specially-crafted font file was opened by a TeX Live utility, it could cause the utility to crash or, potentially, execute arbitrary code with the privileges of the user running the utility.\nHeap-based buffer overflow in the AFM font parser in the dvi-backend component in Evince 2.32 and earlier, teTeX 3.0, t1lib 5.1.2, and possibly other products allows remote attackers to cause a denial of service (application crash) or possibly execute arbitrary code via a crafted font in conjunction with a DVI file that is processed by the thumbnailer.\nA heap-based buffer overflow flaw was found in the DVI renderer's AFM font file parser. A DVI file that references a specially-crafted font file could, when opened, cause Evince to crash or, potentially, execute arbitrary code with the privileges of the user running Evince.\n",
  "packages": [
    {
      "name": "t1lib-debuginfo",
      "epoch": "0",
      "version": "5.1.2",
      "release": "6.5.amzn1",
      "arch": "i686",
      "filename": "Packages/t1lib-debuginfo-5.1.2-6.5.amzn1.i686.rpm"
    },
    {
      "name": "t1lib",
      "epoch": "0",
      "version": "5.1.2",
      "release": "6.5.amzn1",
      "arch": "i686",
      "filename": "Packages/t1lib-5.1.2-6.5.amzn1.i686.rpm"
    },
    {
      "name": "t1lib-static",
      "epoch": "0",
      "version": "5.1.2",
      "release": "6.5.amzn1",
      "arch": "i686",
      "filename": "Packages/t1lib-static-5.1.2-6.5.amzn1.i686.rpm"
    },
    {
      "name": "t1lib-devel",
      "epoch": "0",
      "version": "5.1.2",
      "release": "6.5.amzn1",
      "arch": "i686",
      "filename": "Packages/t1lib-devel-5.1.2-6.5.amzn1.i686.rpm"
    },
    {
      "name": "t1lib-apps",
      "epoch": "0",
      "version": "5.1.2",
      "release": "6.5.amzn1",
      "arch": "i686",
      "filename": "Packages/t1lib-apps-5.1.2-6.5.amzn1.i686.rpm"
    },
    {
      "name": "t1lib-static",
      "epoch": "0",
      "version": "5.1.2",
      "release": "6.5.amzn1",
      "arch": "x86_64",
      "filename": "Packages/t1lib-static-5.1.2-6.5.amzn1.x86_64.rpm"
    },
    {
      "name": "t1lib-debuginfo",
      "epoch": "0",
      "version": "5.1.2",
      "release": "6.5.amzn1",
      "arch": "x86_64",
      "filename": "Packages/t1lib-debuginfo-5.1.2-6.5.amzn1.x86_64.rpm"
    },
    {
      "name": "t1lib-apps",
      "epoch": "0",
      "version": "5.1.2",
      "release": "6.5.amzn1",
      "arch": "x86_64",
      "filename": "Packages/t1lib-apps-5.1.2-6.5.amzn1.x86_64.rpm"
    },
    {
      "name": "t1lib-devel",
      "epoch": "0",
      "version": "5.1.2",
      "release": "6.5.amzn1",
      "arch": "x86_64",
      "filename": "Packages/t1lib-devel-5.1.2-6.5.amzn1.x86_64.rpm"
    },
    {
      "name": "t1lib",
      "epoch": "0",
      "version": "5.1.2",
      "release": "6.5.amzn1",
      "arch": "x86_64",
      "filename": "Packages/t1lib-5.1.2-6.5.amzn1.x86_64.rpm"
    }
  ],
  "references": [
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2010-2642",
      "id": "CVE-2010-2642",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2011-0764",
      "id": "CVE-2011-0764",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2011-1552",
      "id": "CVE-2011-1552",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2011-1553",
      "id": "CVE-2011-1553",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2011-1554",
      "id": "CVE-2011-1554",
      "type": "cve"
    },
    {
      "href": "https://rhn.redhat.com/errata/RHSA-2012:0062.html",
      "id": "RHSA-2012:0062",
      "type": "redhat"
    }
  ],
  "cveids": [
    "CVE-2010-2642",
    "CVE-2011-0764",
    "CVE-2011-1552",
    "CVE-2011-1553",
    "CVE-2011-1554"
  ]
}