{
  "id": "ALAS-2019-1316",
  "title": "Amazon Linux AMI 2014.03 - ALAS-2019-1316: medium priority package update for docker",
  "issued": {
    "date": "2019-11-04 18:12"
  },
  "updated": {
    "date": "2019-11-07 00:23"
  },
  "severity": "medium",
  "description": "Package updates are available for Amazon Linux AMI that fix the following vulnerabilities:\nCVE-2019-13509:\n\tIn Docker CE and EE before 18.09.8 (as well as Docker EE before 17.06.2-ee-23 and 18.x before 18.03.1-ee-10), Docker Engine in debug mode may sometimes add secrets to the debug log. This applies to a scenario where docker stack deploy is run to redeploy a stack that includes (non external) secrets. It potentially applies to other API users of the stack API if they resend the secret.\n99999: \nCVE-2019-13509 docker: Docker Engine in debug mode may sometimes add secrets to the debug log leading to information disclosure\n\nCVE-2019-13139:\n\tA command injection flaw was discovered in Docker during the `docker build` command. By providing a specially crafted path argument for the container to build, it is possible to inject command options to the `git fetch`/`git checkout` commands that are executed by Docker and to execute code with the privileges of the user running Docker. A local attacker who can run `docker build` with a controlled build path, or a remote attacker who has control over the docker build path, could elevate their privileges or execute code.\n99999: \nCVE-2019-13139 docker: command injection due to a missing validation of the git ref command\n",
  "packages": [
    {
      "name": "docker-debuginfo",
      "epoch": "0",
      "version": "18.09.9ce",
      "release": "2.52.amzn1",
      "arch": "x86_64",
      "filename": "Packages/docker-debuginfo-18.09.9ce-2.52.amzn1.x86_64.rpm"
    },
    {
      "name": "docker",
      "epoch": "0",
      "version": "18.09.9ce",
      "release": "2.52.amzn1",
      "arch": "x86_64",
      "filename": "Packages/docker-18.09.9ce-2.52.amzn1.x86_64.rpm"
    }
  ],
  "references": [
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2019-13139",
      "id": "CVE-2019-13139",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2019-13509",
      "id": "CVE-2019-13509",
      "type": "cve"
    }
  ],
  "cveids": [
    "CVE-2019-13139",
    "CVE-2019-13509"
  ]
}