{
  "id": "ALAS-2015-620",
  "title": "Amazon Linux AMI 2014.03 - ALAS-2015-620: medium priority package update for binutils",
  "issued": {
    "date": "2015-12-14 10:00"
  },
  "updated": {
    "date": "2015-12-13 14:21"
  },
  "severity": "medium",
  "description": "Package updates are available for Amazon Linux AMI that fix the following vulnerabilities:\nCVE-2014-8738:\n\tA heap-based buffer overflow flaw was found in the way certain binutils utilities processed archive files. If a user were tricked into processing a specially crafted archive file, it could cause the utility used to process that archive to crash or, potentially, execute arbitrary code with the privileges of the user running that utility.\n1162666: \nCVE-2014-8738 binutils: out of bounds memory write\n\nCVE-2014-8737:\n\tA directory traversal flaw was found in the strip and objcopy utilities. A specially crafted file could cause strip or objdump to overwrite an arbitrary file writable by the user running either of these utilities.\n1162655: \nCVE-2014-8737 binutils: directory traversal vulnerability\n\nCVE-2014-8504:\n\tA stack-based buffer overflow flaw was found in the SREC parser of the libbfd library. A specially crafted file could cause an application using the libbfd library to crash or, potentially, execute arbitrary code with the privileges of the user running that application.\n1162621: \nCVE-2014-8504 binutils: stack overflow in the SREC parser\n\nCVE-2014-8503:\n\tA stack-based buffer overflow flaw was found in the way objdump processed IHEX files. A specially crafted IHEX file could cause objdump to crash or, potentially, execute arbitrary code with the privileges of the user running objdump.\n1162607: \nCVE-2014-8503 binutils: stack overflow in objdump when parsing specially crafted ihex file\n\nCVE-2014-8502:\n\tIt was found that the fix for the CVE-2014-8485 issue was incomplete: a heap-based buffer overflow in the objdump utility could cause it to crash or, potentially, execute arbitrary code with the privileges of the user running objdump when processing specially crafted files.\n1162594: \nCVE-2014-8502 binutils: heap overflow in objdump when parsing a crafted ELF/PE binary file (incomplete fix for CVE-2014-8485)\n\nCVE-2014-8501:\n\tA stack-based buffer overflow flaw was found in the way various binutils utilities processed certain files. If a user were tricked into processing a specially crafted file, it could cause the utility used to process that file to crash or, potentially, execute arbitrary code with the privileges of the user running that utility.\n1162570: \nCVE-2014-8501 binutils: out-of-bounds write when parsing specially crafted PE executable\n\nCVE-2014-8485:\n\tA buffer overflow flaw was found in the way various binutils utilities processed certain files. If a user were tricked into processing a specially crafted file, it could cause the utility used to process that file to crash or, potentially, execute arbitrary code with the privileges of the user running that utility.\n1157276: \nCVE-2014-8485 binutils: lack of range checking leading to controlled write in _bfd_elf_setup_sections()\n\nCVE-2014-8484:\n\tAn integer overflow flaw was found in the way the strings utility processed certain files. If a user were tricked into running the strings utility on a specially crafted file, it could cause the strings executable to crash.\n1156272: \nCVE-2014-8484 binutils: invalid read flaw in libbfd\n",
  "packages": [
    {
      "name": "binutils-debuginfo",
      "epoch": "0",
      "version": "2.23.52.0.1",
      "release": "55.65.amzn1",
      "arch": "x86_64",
      "filename": "Packages/binutils-debuginfo-2.23.52.0.1-55.65.amzn1.x86_64.rpm"
    },
    {
      "name": "binutils-devel",
      "epoch": "0",
      "version": "2.23.52.0.1",
      "release": "55.65.amzn1",
      "arch": "x86_64",
      "filename": "Packages/binutils-devel-2.23.52.0.1-55.65.amzn1.x86_64.rpm"
    },
    {
      "name": "binutils",
      "epoch": "0",
      "version": "2.23.52.0.1",
      "release": "55.65.amzn1",
      "arch": "x86_64",
      "filename": "Packages/binutils-2.23.52.0.1-55.65.amzn1.x86_64.rpm"
    },
    {
      "name": "binutils-devel",
      "epoch": "0",
      "version": "2.23.52.0.1",
      "release": "55.65.amzn1",
      "arch": "i686",
      "filename": "Packages/binutils-devel-2.23.52.0.1-55.65.amzn1.i686.rpm"
    },
    {
      "name": "binutils-debuginfo",
      "epoch": "0",
      "version": "2.23.52.0.1",
      "release": "55.65.amzn1",
      "arch": "i686",
      "filename": "Packages/binutils-debuginfo-2.23.52.0.1-55.65.amzn1.i686.rpm"
    },
    {
      "name": "binutils",
      "epoch": "0",
      "version": "2.23.52.0.1",
      "release": "55.65.amzn1",
      "arch": "i686",
      "filename": "Packages/binutils-2.23.52.0.1-55.65.amzn1.i686.rpm"
    }
  ],
  "references": [
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2014-8484",
      "id": "CVE-2014-8484",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2014-8485",
      "id": "CVE-2014-8485",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2014-8501",
      "id": "CVE-2014-8501",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2014-8502",
      "id": "CVE-2014-8502",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2014-8503",
      "id": "CVE-2014-8503",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2014-8504",
      "id": "CVE-2014-8504",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2014-8737",
      "id": "CVE-2014-8737",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2014-8738",
      "id": "CVE-2014-8738",
      "type": "cve"
    }
  ],
  "cveids": [
    "CVE-2014-8484",
    "CVE-2014-8485",
    "CVE-2014-8501",
    "CVE-2014-8502",
    "CVE-2014-8503",
    "CVE-2014-8504",
    "CVE-2014-8737",
    "CVE-2014-8738"
  ]
}