{
  "id": "ALAS-2014-278",
  "title": "Amazon Linux AMI 2012.09 - ALAS-2014-278: medium priority package update for gnupg",
  "issued": {
    "date": "2014-01-14 16:18"
  },
  "updated": {
    "date": "2014-09-16 22:19"
  },
  "severity": "medium",
  "description": "Package updates are available for Amazon Linux AMI that fix the following vulnerabilities:\nCVE-2013-4576:\n\tIt was found that GnuPG was vulnerable to side-channel attacks via acoustic cryptanalysis. An attacker in close range to a target system that is decrypting ciphertexts could possibly use this flaw to recover the RSA secret key from that system.\nGnuPG 1.x before 1.4.16 generates RSA keys using sequences of introductions with certain patterns that introduce a side channel, which allows physically proximate attackers to extract RSA keys via a chosen-ciphertext attack and acoustic cryptanalysis during decryption. NOTE: applications are not typically expected to protect themselves from acoustic side-channel attacks, since this is arguably the responsibility of the physical device. Accordingly, issues of this type would not normally receive a CVE identifier. However, for this issue, the developer has specified a security policy in which GnuPG should offer side-channel resistance, and developer-specified security-policy violations are within the scope of CVE.\n1043327: \nCVE-2013-4576 gnupg: RSA secret key recovery via acoustic cryptanalysis\n",
  "packages": [
    {
      "name": "gnupg-debuginfo",
      "epoch": "0",
      "version": "1.4.16",
      "release": "2.23.amzn1",
      "arch": "x86_64",
      "filename": "Packages/gnupg-debuginfo-1.4.16-2.23.amzn1.x86_64.rpm"
    },
    {
      "name": "gnupg",
      "epoch": "0",
      "version": "1.4.16",
      "release": "2.23.amzn1",
      "arch": "x86_64",
      "filename": "Packages/gnupg-1.4.16-2.23.amzn1.x86_64.rpm"
    },
    {
      "name": "gnupg",
      "epoch": "0",
      "version": "1.4.16",
      "release": "2.23.amzn1",
      "arch": "i686",
      "filename": "Packages/gnupg-1.4.16-2.23.amzn1.i686.rpm"
    },
    {
      "name": "gnupg-debuginfo",
      "epoch": "0",
      "version": "1.4.16",
      "release": "2.23.amzn1",
      "arch": "i686",
      "filename": "Packages/gnupg-debuginfo-1.4.16-2.23.amzn1.i686.rpm"
    }
  ],
  "references": [
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2013-4576",
      "id": "CVE-2013-4576",
      "type": "cve"
    }
  ],
  "cveids": [
    "CVE-2013-4576"
  ]
}