{
  "id": "ALAS-2015-604",
  "title": "Amazon Linux AMI 2014.03 - ALAS-2015-604: important priority package update for libwmf",
  "issued": {
    "date": "2015-10-27 13:51"
  },
  "updated": {
    "date": "2015-10-27 14:16"
  },
  "severity": "important",
  "description": "Package updates are available for Amazon Linux AMI that fix the following vulnerabilities:\nCVE-2015-4696:\n\tIt was discovered that libwmf did not properly process certain WMF files. By tricking a victim into opening a specially crafted WMF file in an application using libwmf, a remote attacker could possibly exploit this flaw to cause a crash or execute arbitrary code with the privileges of the user running the application.\n\nCVE-2015-4695:\n\tIt was discovered that libwmf did not properly process certain WMF files. By tricking a victim into opening a specially crafted WMF file in an application using libwmf, a remote attacker could possibly exploit this flaw to cause a crash.\n\nCVE-2015-4588:\n\tIt was discovered that libwmf did not correctly process certain WMF (Windows Metafiles) with embedded BMP images. By tricking a victim into opening a specially crafted WMF file in an application using libwmf, a remote attacker could possibly use this flaw to execute arbitrary code with the privileges of the user running the application.\n\nCVE-2015-0848:\n\tIt was discovered that libwmf did not correctly process certain WMF (Windows Metafiles) with embedded BMP images. By tricking a victim into opening a specially crafted WMF file in an application using libwmf, a remote attacker could possibly use this flaw to execute arbitrary code with the privileges of the user running the application.\n\nCVE-2009-3546:\n\tThe _gdGetColors function in gd_gd.c in PHP 5.2.11 and 5.3.x before 5.3.1, and the GD Graphics Library 2.x, does not properly verify a certain colorsTotal structure member, which might allow remote attackers to conduct buffer overflow or buffer over-read attacks via a crafted GD file, a different vulnerability than CVE-2009-3293. NOTE: some of these details are obtained from third party information.\nA missing input sanitization flaw, leading to a buffer overflow, was discovered in the gd library. A specially-crafted GD image file could cause an application using the gd library to crash or, possibly, execute arbitrary code when opened.\nA missing input sanitization flaw, leading to a buffer overflow, was discovered in PHP's gd library. A specially-crafted GD image file could cause the PHP interpreter to crash or, possibly, execute arbitrary code when opened.\n529213: \nCVE-2009-3546 gd: insufficient input validation in _gdGetColors()\n\nCVE-2007-3473:\n\tThe gdImageCreateXbm function in the GD Graphics Library (libgd) before 2.0.35 allows user-assisted remote attackers to cause a denial of service (crash) via unspecified vectors involving a gdImageCreate failure.\nA flaw was discovered in the gd X BitMap (XBM) image-handling code. A malformed or truncated XBM image could cause a crash in an application using the gd library.\n276791: \nCVE-2007-3473 libgd NULL pointer dereference when reading a corrupt X bitmap\n\nCVE-2007-3472:\n\tInteger overflow in gdImageCreateTrueColor function in the GD Graphics Library (libgd) before 2.0.35 allows user-assisted remote attackers to have unspecified attack vectors and impact.\nAn integer overflow was discovered in the gdImageCreateTrueColor() function, leading to incorrect memory allocations. A carefully crafted image could cause a crash or possibly execute code with the privileges of the application using the gd library.\n276751: \nCVE-2007-3472 libgd Integer overflow in TrueColor code\n\nCVE-2007-2756:\n\tThe gdPngReadData function in libgd 2.0.34 allows user-assisted attackers to cause a denial of service (CPU consumption) via a crafted PNG image with truncated data, which causes an infinite loop in the png_read_info function in libpng.\nAn infinite-loop flaw was discovered in the PHP gd extension. A script that could be forced to process PNG images from an untrusted source could allow a remote attacker to cause a denial of service.\nA flaw was discovered in the gd PNG image handling code. A truncated PNG image could cause an infinite loop in an application using the gd library.\n242033: \nCVE-2007-2756 gd / php-gd ImageCreateFromPng infinite loop caused by truncated PNG\n\nCVE-2007-0455:\n\tBuffer overflow in the gdImageStringFTEx function in gdft.c in GD Graphics Library 2.0.33 and earlier allows remote attackers to cause a denial of service (application crash) and possibly execute arbitrary code via a crafted string with a JIS encoded font.\nA buffer over-read flaw was discovered. This could cause a crash in an application using the gd library to render certain strings using a JIS-encoded font.\nA buffer over-read flaw was discovered in PHP's gd extension. A script that could be forced to write arbitrary string using a JIS font from an untrusted source could cause the PHP interpreter to crash.\n224607: \nCVE-2007-0455 gd buffer overrun\n",
  "packages": [
    {
      "name": "libwmf-lite",
      "epoch": "0",
      "version": "0.2.8.4",
      "release": "41.11.amzn1",
      "arch": "x86_64",
      "filename": "Packages/libwmf-lite-0.2.8.4-41.11.amzn1.x86_64.rpm"
    },
    {
      "name": "libwmf-devel",
      "epoch": "0",
      "version": "0.2.8.4",
      "release": "41.11.amzn1",
      "arch": "x86_64",
      "filename": "Packages/libwmf-devel-0.2.8.4-41.11.amzn1.x86_64.rpm"
    },
    {
      "name": "libwmf-debuginfo",
      "epoch": "0",
      "version": "0.2.8.4",
      "release": "41.11.amzn1",
      "arch": "x86_64",
      "filename": "Packages/libwmf-debuginfo-0.2.8.4-41.11.amzn1.x86_64.rpm"
    },
    {
      "name": "libwmf",
      "epoch": "0",
      "version": "0.2.8.4",
      "release": "41.11.amzn1",
      "arch": "x86_64",
      "filename": "Packages/libwmf-0.2.8.4-41.11.amzn1.x86_64.rpm"
    },
    {
      "name": "libwmf-debuginfo",
      "epoch": "0",
      "version": "0.2.8.4",
      "release": "41.11.amzn1",
      "arch": "i686",
      "filename": "Packages/libwmf-debuginfo-0.2.8.4-41.11.amzn1.i686.rpm"
    },
    {
      "name": "libwmf-devel",
      "epoch": "0",
      "version": "0.2.8.4",
      "release": "41.11.amzn1",
      "arch": "i686",
      "filename": "Packages/libwmf-devel-0.2.8.4-41.11.amzn1.i686.rpm"
    },
    {
      "name": "libwmf",
      "epoch": "0",
      "version": "0.2.8.4",
      "release": "41.11.amzn1",
      "arch": "i686",
      "filename": "Packages/libwmf-0.2.8.4-41.11.amzn1.i686.rpm"
    },
    {
      "name": "libwmf-lite",
      "epoch": "0",
      "version": "0.2.8.4",
      "release": "41.11.amzn1",
      "arch": "i686",
      "filename": "Packages/libwmf-lite-0.2.8.4-41.11.amzn1.i686.rpm"
    }
  ],
  "references": [
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2007-0455",
      "id": "CVE-2007-0455",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2007-2756",
      "id": "CVE-2007-2756",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2007-3472",
      "id": "CVE-2007-3472",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2007-3473",
      "id": "CVE-2007-3473",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2009-3546",
      "id": "CVE-2009-3546",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2015-0848",
      "id": "CVE-2015-0848",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2015-4588",
      "id": "CVE-2015-4588",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2015-4695",
      "id": "CVE-2015-4695",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2015-4696",
      "id": "CVE-2015-4696",
      "type": "cve"
    },
    {
      "href": "https://rhn.redhat.com/errata/RHSA-2015:1917.html",
      "id": "RHSA-2015:1917",
      "type": "redhat"
    }
  ],
  "cveids": [
    "CVE-2007-0455",
    "CVE-2007-2756",
    "CVE-2007-3472",
    "CVE-2007-3473",
    "CVE-2009-3546",
    "CVE-2015-0848",
    "CVE-2015-4588",
    "CVE-2015-4695",
    "CVE-2015-4696"
  ]
}