{
  "id": "ALAS-2021-1537",
  "title": "Amazon Linux AMI 2014.03 - ALAS-2021-1537: medium priority package update for docker",
  "issued": {
    "date": "2021-09-30 19:22"
  },
  "updated": {
    "date": "2021-10-04 22:22"
  },
  "severity": "medium",
  "description": "Package updates are available for Amazon Linux AMI that fix the following vulnerabilities:\nCVE-2021-41092:\n\tCVE-2021-41092 docker:\nA bug was found in the Docker CLI where running docker login my-private-registry.example.com with a misconfigured configuration file (typically ~/.docker/config.json) listing a credsStore or credHelpers that could not be executed would result in any provided credentials being sent to registry-1.docker.io rather than the intended private registry.\n\nCVE-2021-41091:\n\tCVE-2021-41091 docker:\nA bug was found in Moby (Docker Engine) where the data directory (typically /var/lib/docker) contained subdirectories with insufficiently restricted permissions, allowing otherwise unprivileged Linux users to traverse directory contents and execute programs. When containers included executable programs with extended permission bits (such as setuid), unprivileged Linux users could discover and execute those programs. When the UID of an unprivileged Linux user on the host collided with the file owner or group inside a container, the unprivileged Linux user on the host could discover, read, and modify those files.\n\nCVE-2021-41089:\n\tCVE-2021-41089 docker:\nA bug was found in Moby (Docker Engine) where attempting to copy files using docker cp into a specially-crafted container can result in Unix file permission changes for existing files in the host 2019s filesystem, widening access to others. This bug does not directly allow files to be read, modified, or executed without an additional cooperating process.\n",
  "packages": [
    {
      "name": "docker",
      "epoch": "0",
      "version": "20.10.7",
      "release": "3.71.amzn1",
      "arch": "x86_64",
      "filename": "Packages/docker-20.10.7-3.71.amzn1.x86_64.rpm"
    },
    {
      "name": "docker-debuginfo",
      "epoch": "0",
      "version": "20.10.7",
      "release": "3.71.amzn1",
      "arch": "x86_64",
      "filename": "Packages/docker-debuginfo-20.10.7-3.71.amzn1.x86_64.rpm"
    }
  ],
  "references": [
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-41089",
      "id": "CVE-2021-41089",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-41091",
      "id": "CVE-2021-41091",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-41092",
      "id": "CVE-2021-41092",
      "type": "cve"
    }
  ],
  "cveids": [
    "CVE-2021-41089",
    "CVE-2021-41091",
    "CVE-2021-41092"
  ]
}