{
  "id": "ALAS-2016-682",
  "title": "Amazon Linux AMI 2014.03 - ALAS-2016-682: important priority package update for openssl098e",
  "issued": {
    "date": "2016-04-06 14:40"
  },
  "updated": {
    "date": "2016-04-06 14:40"
  },
  "severity": "important",
  "description": "Package updates are available for Amazon Linux AMI that fix the following vulnerabilities:\nCVE-2016-0800:\n\tA padding oracle flaw was found in the Secure Sockets Layer version 2.0 (SSLv2) protocol. An attacker could potentially use this flaw to decrypt RSA-encrypted cipher text from a connection using a newer SSL/TLS protocol version, allowing them to decrypt such connections. This cross-protocol attack is publicly referred to as DROWN.\nA padding oracle flaw was found in the Secure Sockets Layer version 2.0 (SSLv2) protocol. An attacker can potentially use this flaw to decrypt RSA-encrypted cipher text from a connection using a newer SSL/TLS protocol version, allowing them to decrypt such connections. This cross-protocol attack is publicly referred to as DROWN.\n1310593: \nCVE-2016-0800 SSL/TLS: Cross-protocol attack on TLS using SSLv2 (DROWN)\n\nCVE-2016-0704:\n\tIt was discovered that the SSLv2 protocol implementation in OpenSSL did not properly implement the Bleichenbacher protection for export cipher suites. An attacker could use a SSLv2 server using OpenSSL as a Bleichenbacher oracle.\n1310814: \nCVE-2016-0704 openssl: SSLv2 Bleichenbacher protection overwrites wrong bytes for export ciphers\n\nCVE-2016-0703:\n\tIt was discovered that the SSLv2 servers using OpenSSL accepted SSLv2 connection handshakes that indicated non-zero clear key length for non-export cipher suites. An attacker could use this flaw to decrypt recorded SSLv2 sessions with the server by using it as a decryption oracle.\n1310811: \nCVE-2016-0703 openssl: Divide-and-conquer session key recovery in SSLv2\n\nCVE-2015-3197:\n\tA flaw was found in the way malicious SSLv2 clients could negotiate SSLv2 ciphers that were disabled on the server. This could result in weak SSLv2 ciphers being used for SSLv2 connections, making them vulnerable to man-in-the-middle attacks.\nA flaw was found in the way malicious SSLv2 clients could negotiate SSLv2 ciphers that have been disabled on the server. This could result in weak SSLv2 ciphers being used for SSLv2 connections, making them vulnerable to man-in-the-middle attacks.\n1301846: \nCVE-2015-3197 OpenSSL: SSLv2 doesn't block disabled ciphers\n\nCVE-2015-0293:\n\tA denial of service flaw was found in the way OpenSSL handled certain SSLv2 messages. A malicious client could send a specially crafted SSLv2 CLIENT-MASTER-KEY message that would cause an OpenSSL server that both supports SSLv2 and enables EXPORT-grade cipher suites to crash.\nA denial of service flaw was found in the way OpenSSL handled SSLv2 handshake messages. A remote attacker could use this flaw to cause a TLS/SSL server using OpenSSL to exit on a failed assertion if it had both the SSLv2 protocol and EXPORT-grade cipher suites enabled.\n1202404: \nCVE-2015-0293 openssl: assertion failure in SSLv2 servers\n",
  "packages": [
    {
      "name": "openssl098e",
      "epoch": "0",
      "version": "0.9.8e",
      "release": "29.19.amzn1",
      "arch": "x86_64",
      "filename": "Packages/openssl098e-0.9.8e-29.19.amzn1.x86_64.rpm"
    },
    {
      "name": "openssl098e-debuginfo",
      "epoch": "0",
      "version": "0.9.8e",
      "release": "29.19.amzn1",
      "arch": "x86_64",
      "filename": "Packages/openssl098e-debuginfo-0.9.8e-29.19.amzn1.x86_64.rpm"
    },
    {
      "name": "openssl098e",
      "epoch": "0",
      "version": "0.9.8e",
      "release": "29.19.amzn1",
      "arch": "i686",
      "filename": "Packages/openssl098e-0.9.8e-29.19.amzn1.i686.rpm"
    },
    {
      "name": "openssl098e-debuginfo",
      "epoch": "0",
      "version": "0.9.8e",
      "release": "29.19.amzn1",
      "arch": "i686",
      "filename": "Packages/openssl098e-debuginfo-0.9.8e-29.19.amzn1.i686.rpm"
    }
  ],
  "references": [
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2015-0293",
      "id": "CVE-2015-0293",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2015-3197",
      "id": "CVE-2015-3197",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2016-0703",
      "id": "CVE-2016-0703",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2016-0704",
      "id": "CVE-2016-0704",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2016-0800",
      "id": "CVE-2016-0800",
      "type": "cve"
    }
  ],
  "cveids": [
    "CVE-2015-0293",
    "CVE-2015-3197",
    "CVE-2016-0703",
    "CVE-2016-0704",
    "CVE-2016-0800"
  ]
}