{
  "id": "ALAS-2025-1955",
  "title": "Amazon Linux AMI 2014.03 - ALAS-2025-1955: important priority package update for rsync",
  "issued": {
    "date": "2025-01-16 06:35:00"
  },
  "updated": {
    "date": "2025-01-16 18:42:00"
  },
  "severity": "important",
  "description": "Package updates are available for Amazon Linux AMI that fix the following vulnerabilities:\nCVE-2024-12747:\n\tA flaw was found in rsync. This vulnerability arises from a race condition during rsync's handling of symbolic links. Rsync's default behavior when encountering symbolic links is to skip them. If an attacker replaced a regular file with a symbolic link at the right time, it was possible to bypass the default behavior and traverse symbolic links. Depending on the privileges of the rsync process, an attacker could leak sensitive information, potentially leading to privilege escalation.\n\nCVE-2024-12088:\n\tA flaw was found in rsync. When using the `--safe-links` option, rsync fails to properly verify if a symbolic link destination contains another symbolic link within it. This results in a path traversal vulnerability, which may lead to arbitrary file write outside the desired directory.\n\nCVE-2024-12087:\n\tA path traversal vulnerability exists in rsync. It stems from behavior enabled by the `--inc-recursive` option, a default-enabled option for many client options and can be enabled by the server even if not explicitly enabled by the client. When using the `--inc-recursive` option, a lack of proper symlink verification coupled with deduplication checks occurring on a per-file-list basis could allow a server to write files outside of the client's intended destination directory. A malicious server could write malicious files to arbitrary locations named after valid directories/paths on the client.\n\nCVE-2024-12086:\n\tA flaw was found in rsync. It could allow a server to enumerate the contents of an arbitrary file from the client's machine. This issue occurs when files are being copied from a client to a server. During this process, the rsync server will send checksums of local data to the client to compare with in order to determine what data needs to be sent to the server. By sending specially constructed checksum values for arbitrary files, an attacker may be able to reconstruct the data of those files byte-by-byte based on the responses from the client.\n\nCVE-2024-12085:\n\tA flaw was found in the rsync daemon which could be triggered when rsync compares file checksums. This flaw allows an attacker to manipulate the checksum length (s2length) to cause a comparison between a checksum and uninitialized memory and leak one byte of uninitialized stack data at a time.\n",
  "packages": [
    {
      "name": "rsync-debuginfo",
      "epoch": "0",
      "version": "3.0.6",
      "release": "12.17.amzn1",
      "arch": "x86_64",
      "filename": "Packages/rsync-debuginfo-3.0.6-12.17.amzn1.x86_64.rpm"
    },
    {
      "name": "rsync",
      "epoch": "0",
      "version": "3.0.6",
      "release": "12.17.amzn1",
      "arch": "x86_64",
      "filename": "Packages/rsync-3.0.6-12.17.amzn1.x86_64.rpm"
    },
    {
      "name": "rsync",
      "epoch": "0",
      "version": "3.0.6",
      "release": "12.17.amzn1",
      "arch": "i686",
      "filename": "Packages/rsync-3.0.6-12.17.amzn1.i686.rpm"
    },
    {
      "name": "rsync-debuginfo",
      "epoch": "0",
      "version": "3.0.6",
      "release": "12.17.amzn1",
      "arch": "i686",
      "filename": "Packages/rsync-debuginfo-3.0.6-12.17.amzn1.i686.rpm"
    }
  ],
  "references": [
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-12085",
      "id": "CVE-2024-12085",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-12086",
      "id": "CVE-2024-12086",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-12087",
      "id": "CVE-2024-12087",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-12088",
      "id": "CVE-2024-12088",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-12747",
      "id": "CVE-2024-12747",
      "type": "cve"
    }
  ],
  "cveids": [
    "CVE-2024-12085",
    "CVE-2024-12086",
    "CVE-2024-12087",
    "CVE-2024-12088",
    "CVE-2024-12747"
  ]
}