{
  "id": "ALAS-2023-1862",
  "title": "Amazon Linux AMI 2014.03 - ALAS-2023-1862: important priority package update for cacti",
  "issued": {
    "date": "2023-10-12 15:48"
  },
  "updated": {
    "date": "2023-10-24 21:37"
  },
  "severity": "important",
  "description": "Package updates are available for Amazon Linux AMI that fix the following vulnerabilities:\nCVE-2023-39364:\n\tCacti is an open source operational monitoring and fault management framework. In Cacti 1.2.24, users with console access can be redirected to an arbitrary website after a change password performed via a specifically crafted URL. The `auth_changepassword.php` file accepts `ref` as a URL parameter and reflects it in the form used to perform the change password. It's value is used to perform a redirect via `header` PHP function. A user can be tricked in performing the change password operation, e.g., via a phishing message, and then interacting with the malicious website where the redirection has been performed, e.g., downloading malwares, providing credentials, etc. This issue has been addressed in version 1.2.25. Users are advised to upgrade. There are no known workarounds for this vulnerability.\n\nCVE-2023-39362:\n\tCacti is an open source operational monitoring and fault management framework. In Cacti 1.2.24, under certain conditions, an authenticated privileged user, can use a malicious string in the SNMP options of a Device, performing command injection and obtaining remote code execution on the underlying server. The `lib/snmp.php` file has a set of functions, with similar behavior, that accept in input some variables and place them into an `exec` call without a proper escape or validation. This issue has been addressed in version 1.2.25. Users are advised to upgrade. There are no known workarounds for this vulnerability.\n",
  "packages": [
    {
      "name": "cacti",
      "epoch": "0",
      "version": "1.1.19",
      "release": "5.23.amzn1",
      "arch": "noarch",
      "filename": "Packages/cacti-1.1.19-5.23.amzn1.noarch.rpm"
    }
  ],
  "references": [
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-39362",
      "id": "CVE-2023-39362",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-39364",
      "id": "CVE-2023-39364",
      "type": "cve"
    }
  ],
  "cveids": [
    "CVE-2023-39362",
    "CVE-2023-39364"
  ]
}