{
  "id": "ALAS-2011-17",
  "title": "Amazon Linux - ALAS-2011-17: medium priority package update for perl-libwww-perl",
  "issued": {
    "date": "2011-10-31 18:34"
  },
  "updated": {
    "date": "2014-09-14 14:40"
  },
  "severity": "medium",
  "description": "Package updates are available for Amazon Linux that fix the following vulnerabilities:\nCVE-2011-0633:\n\tThe Net::HTTPS module in libwww-perl (LWP) before 6.00, as used in WWW::Mechanize, LWP::UserAgent, and other products, when running in environments that do not set the If-SSL-Cert-Subject header, does not enable full validation of SSL certificates by default, which allows remote attackers to spoof servers via man-in-the-middle (MITM) attacks involving hostnames that are not properly validated. NOTE: it could be argued that this is a design limitation of the Net::HTTPS API, and separate implementations should be independently assigned CVE identifiers for not working around this limitation. However, because this API was modified within LWP, a single CVE identifier has been assigned.\nThe Net::HTTPS module in libwww-perl (LWP) before 6.00, as used in WWW::Mechanize, LWP::UserAgent, and other products, when running in environments that do not set the If-SSL-Cert-Subject header, does not enable full validation of SSL certificates by default, which allows remote attackers to spoof servers via man-in-the-middle (MITM) attacks involving hostnames that are not properly validated.  NOTE: it could be argued that this is a design limitation of the Net::HTTPS API, and separate implementations should be independently assigned CVE identifiers for not working around this limitation. However, because this API was modified within LWP, a single CVE identifier has been assigned.\n",
  "packages": [
    {
      "name": "perl-libwww-perl",
      "epoch": "0",
      "version": "5.837",
      "release": "4.1.amzn1",
      "arch": "noarch",
      "filename": "Packages/perl-libwww-perl-5.837-4.1.amzn1.noarch.rpm"
    }
  ],
  "references": [
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2011-0633",
      "id": "CVE-2011-0633",
      "type": "cve"
    }
  ],
  "cveids": [
    "CVE-2011-0633"
  ]
}