{
  "Severity": "LOW",
  "UpdatedAt": "2021-09-28T17:57:51Z",
  "Package": {
    "Ecosystem": "PIP",
    "Name": "cryptoauthlib"
  },
  "Advisory": {
    "DatabaseId": 3121,
    "Id": "MDE2OlNlY3VyaXR5QWR2aXNvcnlHSFNBLWYzNjYtNHJ2di05NXgy",
    "GhsaId": "GHSA-f366-4rvv-95x2",
    "References": [
      {
        "Url": "https://github.com/MicrochipTech/cryptoauthlib/security/advisories/GHSA-f366-4rvv-95x2"
      },
      {
        "Url": "https://github.com/advisories/GHSA-f366-4rvv-95x2"
      }
    ],
    "Identifiers": [
      {
        "Type": "GHSA",
        "Value": "GHSA-f366-4rvv-95x2"
      }
    ],
    "Description": "### Impact\n1) If an application is making use of the deprecated kit protocol HALs as the communication channel to the target device an attacker can masquerade as a device and return malformed packets of arbitrary length which the protocol stack will write to the stack. HALs intended for production use are unaffected (I2C, SWI, \u0026 SPI) as well as the hidapi HAL (hal_all_platforms_kit_hidapi.c).\n\n2) The hidapi HAL can be made to overrun the application stack by attaching more than 10 (real or virtual) devices likely resulting in an application crash as this does not allow arbitrary data to be written to the stack.\n\n### Patches\nUSB kit enumeration has been patched in v3.2.3 for the hidapi HAL (hal_all_platforms_kit_hidapi.c).\n\n### Removal of deprecated HALs\nDeprecated usb kit HALs have been removed in v3.2.3.\n\n### Workarounds\nThis vulnerability is limited to users of the kit protocol which is used with Microchip kits and kit firmware to bridge communication from USB-HID to I2C or SWI. It is not expected that kits would be used in an production environment. This is an optional component for users as well so they can always compile the library without the usb support option.\n\n### Special python packaging notes\nThe python package for cryptoauthlib uses date codes for identifying versions. The patched version for python packages is 20200912\n\n### References\nPlease see [Microchip PSIRT](https://www.microchip.com/design-centers/embedded-security/how-to-report-potential-product-security-vulnerabilities) for Microchip's security policy and reporting procedures\n\n### Credits\nSpecial thanks to Ruben Santamarta of [IOActive](https://blogs.ioactive.com/) for reporting",
    "Origin": "UNSPECIFIED",
    "PublishedAt": "2020-10-02T16:33:19Z",
    "Severity": "LOW",
    "Summary": "Buffer overflow in deprecated USB HALs and stack overflow in USB enumeration",
    "UpdatedAt": "2023-01-09T05:04:27Z",
    "WithdrawnAt": "",
    "CVSS": {
      "Score": 0,
      "VectorString": ""
    }
  },
  "Versions": [
    {
      "FirstPatchedVersion": {
        "Identifier": "20200912"
      },
      "VulnerableVersionRange": "\u003c 20200912"
    }
  ]
}