{
  "Severity": "HIGH",
  "UpdatedAt": "2025-03-16T17:19:26Z",
  "Package": {
    "Ecosystem": "COMPOSER",
    "Name": "getformwork/formwork"
  },
  "Advisory": {
    "DatabaseId": 282256,
    "Id": "GSA_kwCzR0hTQS1jODV3LXgyNnEtY2g4N84ABE6Q",
    "GhsaId": "GHSA-c85w-x26q-ch87",
    "References": [
      {
        "Url": "https://github.com/getformwork/formwork/security/advisories/GHSA-c85w-x26q-ch87"
      },
      {
        "Url": "https://github.com/getformwork/formwork/commit/d9f0c1feb3b9855d5bdc8bb189c0aaab2792e7ca"
      },
      {
        "Url": "https://github.com/advisories/GHSA-c85w-x26q-ch87"
      }
    ],
    "Identifiers": [
      {
        "Type": "GHSA",
        "Value": "GHSA-c85w-x26q-ch87"
      }
    ],
    "Description": "### Summary\n\nImproper validation of select fields allows attackers to craft an input that crashes the system, resulting in a 500 status and making the entire site and administration panel unavailable.\nThis clearly impacts the Availability aspect of the CIA triad (confidentiality, integrity, and availability), although the attack still has certain limitations.\n\n### Details\n\nThe attack involves injecting any invalid user role value (e.g. \"\u003e\") into the Role=User parameter in the /panel/users/{name}/profile page, which is the user profile update page.\nDoing this will change the users data in a way that prevents users and then the entire site from loading. Even though the actual data change is minimal, the error is unrecoverable until a valid role parameter is restored by direct modification of the user account file.\nProper validation of select fields will prevent extraneous valid from being accepted and making the entire site and administration panel unavailable.\n\n### Patches\n- [**Formwork 2.x** (d9f0c1f)](https://github.com/getformwork/formwork/commit/d9f0c1feb3b9855d5bdc8bb189c0aaab2792e7ca) adds proper validation to select fields.\n\n### Impact\n\nThe condition for this attack is having high privileges or Admin access, which means it could be exploited by an Insider Threat. Alternatively, if an attacker gains access to a privileged user account, they can execute the attack as well.\nOverall, the attack is relatively difficult to carry out, but if successful, the impact and damage would be significant.\n\n### PoC\n\n![2025-02-27_10-25](https://github.com/user-attachments/assets/4b5a2d71-3397-4a5b-8464-35752376115a)\n\n1. Intercept the request and inject an input that will trigger an error.\n\n![2025-02-27_10-25_1](https://github.com/user-attachments/assets/a888c109-a724-4478-ae80-d9e8b05ef1aa)\n\n![image](https://github.com/user-attachments/assets/e81bb9fc-8c92-413c-8cc0-0bcffd2e2922)\n\n2.After that, it will be observed that the system is shut down or completely broken. Even changing the browser or resetting the server will not be able to restore it.",
    "Origin": "UNSPECIFIED",
    "PublishedAt": "2025-03-01T00:11:52Z",
    "Severity": "HIGH",
    "Summary": "Formwork improperly validates input of User role preventing site and panel availability",
    "UpdatedAt": "2025-03-16T17:19:26Z",
    "WithdrawnAt": "",
    "CVSS": {
      "Score": 8.2,
      "VectorString": "CVSS:3.1/AV:N/AC:L/PR:H/UI:N/S:C/C:L/I:L/A:H"
    }
  },
  "Versions": [
    {
      "FirstPatchedVersion": {
        "Identifier": "2.0.0-beta.4"
      },
      "VulnerableVersionRange": "\u003e= 2.0.0-beta.1, \u003c 2.0.0-beta.4"
    }
  ]
}