{
  "id": "ALAS2023-2025-914",
  "title": "Amazon Linux 2023 - ALAS2023-2025-914: Important priority package update for runfinch-finch",
  "issued": {
    "date": "2025-03-26 20:44:00"
  },
  "updated": {
    "date": "2025-04-01 11:34:00"
  },
  "severity": "Important",
  "description": "Package updates are available for Amazon Linux 2023 that fix the following vulnerabilities:\nCVE-2025-27144:\n\tGo JOSE provides an implementation of the Javascript Object Signing and Encryption set of standards in Go, including support for JSON Web Encryption (JWE), JSON Web Signature (JWS), and JSON Web Token (JWT) standards. In versions on the 4.x branch prior to version 4.0.5, when parsing compact JWS or JWE input, Go JOSE could use excessive memory. The code used strings.Split(token, \".\") to split JWT tokens, which is vulnerable to excessive memory consumption when processing maliciously crafted tokens with a large number of `.` characters.  An attacker could exploit this by sending numerous malformed tokens, leading to memory exhaustion and a Denial of Service. Version 4.0.5 fixes this issue. As a workaround, applications could pre-validate that payloads passed to Go JOSE do not contain an excessive number of `.` characters.\n\nCVE-2025-22869:\n\tSSH servers which implement file transfer protocols are vulnerable to a denial of service attack from clients which complete the key exchange slowly, or not at all, causing pending content to be read into memory, but never transmitted.\n",
  "packages": [
    {
      "name": "runfinch-finch",
      "epoch": "0",
      "version": "1.7.1",
      "release": "1.amzn2023.0.1",
      "arch": "x86_64",
      "filename": "Packages/runfinch-finch-1.7.1-1.amzn2023.0.1.x86_64.rpm"
    },
    {
      "name": "runfinch-finch",
      "epoch": "0",
      "version": "1.7.1",
      "release": "1.amzn2023.0.1",
      "arch": "aarch64",
      "filename": "Packages/runfinch-finch-1.7.1-1.amzn2023.0.1.aarch64.rpm"
    }
  ],
  "references": [
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2025-22869",
      "id": "CVE-2025-22869",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2025-27144",
      "id": "CVE-2025-27144",
      "type": "cve"
    }
  ],
  "cveids": [
    "CVE-2025-22869",
    "CVE-2025-27144"
  ]
}