{
  "id": "ALAS2023-2023-125",
  "title": "Amazon Linux 2023 - ALAS2023-2023-125: Important priority package update for python-werkzeug",
  "issued": {
    "date": "2023-03-06 17:51:00"
  },
  "updated": {
    "date": "2023-03-08 00:51:00"
  },
  "severity": "Important",
  "description": "Package updates are available for Amazon Linux 2023 that fix the following vulnerabilities:\nCVE-2023-25577:\n\tWerkzeug is a comprehensive WSGI web application library. Prior to version 2.2.3, Werkzeug's multipart form data parser will parse an unlimited number of parts, including file parts. Parts can be a small amount of bytes, but each requires CPU time to parse and may use more memory as Python data. If a request can be made to an endpoint that accesses `request.data`, `request.form`, `request.files`, or `request.get_data(parse_form_data=False)`, it can cause unexpectedly high resource usage. This allows an attacker to cause a denial of service by sending crafted multipart data to an endpoint that will parse it. The amount of CPU time required can block worker processes from handling legitimate requests. The amount of RAM required can trigger an out of memory kill of the process. Unlimited file parts can use up memory and file handles. If many concurrent requests are sent continuously, this can exhaust or kill all available workers. Version 2.2.3 contains a patch for this issue.\n",
  "packages": [
    {
      "name": "python3-werkzeug-doc",
      "epoch": "0",
      "version": "1.0.1",
      "release": "5.amzn2023.0.3",
      "arch": "noarch",
      "filename": "Packages/python3-werkzeug-doc-1.0.1-5.amzn2023.0.3.noarch.rpm"
    },
    {
      "name": "python3-werkzeug",
      "epoch": "0",
      "version": "1.0.1",
      "release": "5.amzn2023.0.3",
      "arch": "noarch",
      "filename": "Packages/python3-werkzeug-1.0.1-5.amzn2023.0.3.noarch.rpm"
    }
  ],
  "references": [
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-25577",
      "id": "CVE-2023-25577",
      "type": "cve"
    }
  ],
  "cveids": [
    "CVE-2023-25577"
  ]
}