{
  "id": "ALAS2023-2023-421",
  "title": "Amazon Linux 2023 - ALAS2023-2023-421: Important priority package update for plexus-archiver",
  "issued": {
    "date": "2023-10-30 23:44:00"
  },
  "updated": {
    "date": "2023-11-03 22:40:00"
  },
  "severity": "Important",
  "description": "Package updates are available for Amazon Linux 2023 that fix the following vulnerabilities:\nCVE-2023-37460:\n\tPlexis Archiver is a collection of Plexus components to create archives or extract archives to a directory with a unified `Archiver`/`UnArchiver` API. Prior to version 4.8.0, using AbstractUnArchiver for extracting an archive might lead to an arbitrary file creation and possibly remote code execution. When extracting an archive with an entry that already exists in the destination directory as a symbolic link whose target does not exist - the `resolveFile()` function will return the symlink's source instead of its target, which will pass the verification that ensures the file will not be extracted outside of the destination directory. Later `Files.newOutputStream()`, that follows symlinks by default,  will actually write the entry's content to the symlink's target. Whoever uses plexus archiver to extract an untrusted archive is vulnerable to an arbitrary file creation and possibly remote code execution. Version 4.8.0 contains a patch for this issue.\n",
  "packages": [
    {
      "name": "plexus-archiver",
      "epoch": "0",
      "version": "4.2.7",
      "release": "4.amzn2023.0.1",
      "arch": "noarch",
      "filename": "Packages/plexus-archiver-4.2.7-4.amzn2023.0.1.noarch.rpm"
    },
    {
      "name": "plexus-archiver-javadoc",
      "epoch": "0",
      "version": "4.2.7",
      "release": "4.amzn2023.0.1",
      "arch": "noarch",
      "filename": "Packages/plexus-archiver-javadoc-4.2.7-4.amzn2023.0.1.noarch.rpm"
    }
  ],
  "references": [
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-37460",
      "id": "CVE-2023-37460",
      "type": "cve"
    }
  ],
  "cveids": [
    "CVE-2023-37460"
  ]
}