{
  "id": "ALAS2023-2026-1367",
  "title": "Amazon Linux 2023 - ALAS2023-2026-1367: Medium priority package update for python3.12-pip",
  "issued": {
    "date": "2026-01-12 23:17:00"
  },
  "updated": {
    "date": "2026-01-12 23:17:00"
  },
  "severity": "Medium",
  "description": "Package updates are available for Amazon Linux 2023 that fix the following vulnerabilities:\nCVE-2025-66471:\n\turllib3 is a user-friendly HTTP client library for Python. Starting in version 1.0 and prior to 2.6.0, the Streaming API improperly handles highly compressed data. urllib3's streaming API is designed for the efficient handling of large HTTP responses by reading the content in chunks, rather than loading the entire response body into memory at once. When streaming a compressed response, urllib3 can perform decoding or decompression based on the HTTP Content-Encoding header (e.g., gzip, deflate, br, or zstd). The library must read compressed data from the network and decompress it until the requested chunk size is met. Any resulting decompressed data that exceeds the requested amount is held in an internal buffer for the next read operation. The decompression logic could cause urllib3 to fully decode a small amount of highly compressed data in a single operation. This can result in excessive resource consumption (high CPU usage and massive memory allocation for the decompressed data.\n\nCVE-2025-66418:\n\turllib3 is a user-friendly HTTP client library for Python. Starting in version 1.24 and prior to 2.6.0, the number of links in the decompression chain was unbounded allowing a malicious server to insert a virtually unlimited number of compression steps leading to high CPU usage and massive memory allocation for the decompressed data. This vulnerability is fixed in 2.6.0.\n",
  "packages": [
    {
      "name": "python3.12-pip-wheel",
      "epoch": "0",
      "version": "23.2.1",
      "release": "4.amzn2023.0.6",
      "arch": "noarch",
      "filename": "Packages/python3.12-pip-wheel-23.2.1-4.amzn2023.0.6.noarch.rpm"
    },
    {
      "name": "python3.12-pip",
      "epoch": "0",
      "version": "23.2.1",
      "release": "4.amzn2023.0.6",
      "arch": "noarch",
      "filename": "Packages/python3.12-pip-23.2.1-4.amzn2023.0.6.noarch.rpm"
    }
  ],
  "references": [
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2025-66418",
      "id": "CVE-2025-66418",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2025-66471",
      "id": "CVE-2025-66471",
      "type": "cve"
    }
  ],
  "cveids": [
    "CVE-2025-66418",
    "CVE-2025-66471"
  ]
}