{
  "id": "ALAS2023-2024-498",
  "title": "Amazon Linux 2023 - ALAS2023-2024-498: Important priority package update for amazon-cloudwatch-agent",
  "issued": {
    "date": "2024-01-19 01:31:00"
  },
  "updated": {
    "date": "2024-01-22 20:30:00"
  },
  "severity": "Important",
  "description": "Package updates are available for Amazon Linux 2023 that fix the following vulnerabilities:\nCVE-2023-45142:\n\tOpenTelemetry-Go Contrib is a collection of third-party packages for OpenTelemetry-Go. A handler wrapper out of the box adds labels `http.user_agent` and `http.method` that have unbound cardinality. It leads to the server's potential memory exhaustion when many malicious requests are sent to it. HTTP header User-Agent or HTTP method for requests can be easily set by an attacker to be random and long. The library internally uses `httpconv.ServerRequest` that records every value for HTTP `method` and `User-Agent`. In order to be affected, a program has to use the `otelhttp.NewHandler` wrapper and not filter any unknown HTTP methods or User agents on the level of CDN, LB, previous middleware, etc. Version 0.44.0 fixed this issue when the values collected for attribute `http.request.method` were changed to be restricted to a set of well-known values and other high cardinality attributes were removed. As a workaround to stop being affected, `otelhttp.WithFilter()` can be used, but it requires manual careful configuration to not log certain requests entirely. For convenience and safe usage of this library, it should by default mark with the label `unknown` non-standard HTTP methods and User agents to show that such requests were made but do not increase cardinality. In case someone wants to stay with the current behavior, library API should allow to enable it.\n\nCVE-2023-39326:\n\tA malicious HTTP sender can use chunk extensions to cause a receiver reading from a request or response body to read many more bytes from the network than are in the body. A malicious HTTP client can further exploit this to cause a server to automatically read a large amount of data (up to about 1GiB) when a handler fails to read the entire body of a request. Chunk extensions are a little-used HTTP feature which permit including additional metadata in a request or response body sent using the chunked encoding. The net/http chunked encoding reader discards this metadata. A sender can exploit this by inserting a large metadata segment with each byte transferred. The chunk reader now produces an error if the ratio of real body to encoded bytes grows too small.\n\nCVE-2023-39325:\n\tThe HTTP/2 protocol allows a denial of service (server resource consumption) because request cancellation can reset many streams quickly, as exploited in the wild in August through October 2023.\n",
  "packages": [
    {
      "name": "amazon-cloudwatch-agent",
      "epoch": "0",
      "version": "1.300032.3",
      "release": "1.amzn2023",
      "arch": "x86_64",
      "filename": "Packages/amazon-cloudwatch-agent-1.300032.3-1.amzn2023.x86_64.rpm"
    },
    {
      "name": "amazon-cloudwatch-agent",
      "epoch": "0",
      "version": "1.300032.3",
      "release": "1.amzn2023",
      "arch": "aarch64",
      "filename": "Packages/amazon-cloudwatch-agent-1.300032.3-1.amzn2023.aarch64.rpm"
    }
  ],
  "references": [
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-39325",
      "id": "CVE-2023-39325",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-39326",
      "id": "CVE-2023-39326",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-45142",
      "id": "CVE-2023-45142",
      "type": "cve"
    }
  ],
  "cveids": [
    "CVE-2023-39325",
    "CVE-2023-39326",
    "CVE-2023-45142"
  ]
}