{
  "id": "ALAS2023-2025-1278",
  "title": "Amazon Linux 2023 - ALAS2023-2025-1278: Important priority package update for nerdctl",
  "issued": {
    "date": "2025-11-05 17:49:00"
  },
  "updated": {
    "date": "2025-11-05 17:49:00"
  },
  "severity": "Important",
  "description": "Package updates are available for Amazon Linux 2023 that fix the following vulnerabilities:\nCVE-2025-61725:\n\tnet/mail: excessive CPU consumption in ParseAddress\n\nThe ParseAddress function constructed domain-literal address components through repeated string concatenation. When parsing large domain-literal components, this could cause excessive CPU consumption.\n\nCVE-2025-61724:\n\tnet/textproto: excessive CPU consumption in Reader.ReadResponse\n\nThe Reader.ReadResponse function constructed a response string through\nrepeated string concatenation of lines. When the number of lines in a response is large,\nthis could cause excessive CPU consumption.\n\nCVE-2025-61723:\n\tencoding/pem: quadratic complexity when parsing some invalid inputs\n\nDue to the design of the PEM parsing function, the processing time for some\ninputs scales non-linearly with respect to the size of the input.\n\nThis affects programs which parse untrusted PEM inputs.\n\nCVE-2025-58189:\n\tcrypto/tls: ALPN negotiation errors can contain arbitrary text\n\nThe crypto/tls conn.Handshake method returns an error on the server-side when ALPN negotation fails which can contain arbitrary attacker controlled information provided by the client-side of the connection which is not escaped.\n\nThis affects programs which log these errors without any additional form of sanitization, and may allow injection of attacker controlled information into logs.\n\nCVE-2025-58188:\n\tcrypto/x509: panic when validating certificates with DSA public keys\n\nValidating certificate chains which contain DSA public keys can cause programs\nto panic, due to a interface cast that assumes they implement the Equal method.\n\nThis affects programs which validate arbitrary certificate chains.\n\nCVE-2025-58187:\n\tcrypto/x509: quadratic complexity when checking name constraints\n\nDue to the design of the name constraint checking algorithm, the processing time\nof some inputs scales non-linearly with respect to the size of the certificate.\n\nThis affects programs which validate arbitrary certificate chains.\n\nCVE-2025-58186:\n\tnet/http: lack of limit when parsing cookies can cause memory exhaustion\n\nDespite HTTP headers having a default limit of 1 MB, the number of cookies that can be parsed did not have a limit.\nBy sending a lot of very small cookies such as \"a=;\", an attacker can make an HTTP server allocate a large amount of structs, causing large memory consumption.\n\nnet/http now limits the number of cookies accepted to 3000, which can be adjusted using the httpcookiemaxnum GODEBUG option.\n\nCVE-2025-58185:\n\tencoding/asn1: pre-allocating memory when parsing DER payload can cause memory exhaustion\n\nWhen parsing DER payloads, memories were being allocated prior to fully validating the payloads.\nThis permits an attacker to craft a big empty DER payload to cause memory exhaustion in functions such as asn1.Unmarshal, x509.ParseCertificateRequest, and ocsp.ParseResponse.\n\nCVE-2025-58183:\n\tarchive/tar: unbounded allocation when parsing GNU sparse map\n\ntar.Reader did not set a maximum size on the number of sparse region data blocks in GNU tar pax 1.0 sparse files. A maliciously-crafted archive containing a large number of sparse regions could cause a Reader to read an unbounded amount of data from the archive into memory. When reading from a compressed source, a small compressed input could result in large allocations.\n\nCVE-2025-47912:\n\tnet/url: insufficient validation of bracketed IPv6 hostnames\n\nThe Parse function permitted values other than IPv6 addresses to be included in square brackets within the host component of a URL. RFC 3986 permits IPv6 addresses to be included within the host component, enclosed within square brackets. For example: \"http://[::1]/\". IPv4 addresses and hostnames must not appear within square brackets. Parse did not enforce this requirement.\n",
  "packages": [
    {
      "name": "nerdctl",
      "epoch": "0",
      "version": "2.1.5",
      "release": "1.amzn2023.0.2",
      "arch": "x86_64",
      "filename": "Packages/nerdctl-2.1.5-1.amzn2023.0.2.x86_64.rpm"
    },
    {
      "name": "nerdctl",
      "epoch": "0",
      "version": "2.1.5",
      "release": "1.amzn2023.0.2",
      "arch": "aarch64",
      "filename": "Packages/nerdctl-2.1.5-1.amzn2023.0.2.aarch64.rpm"
    }
  ],
  "references": [
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2025-47912",
      "id": "CVE-2025-47912",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2025-58183",
      "id": "CVE-2025-58183",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2025-58185",
      "id": "CVE-2025-58185",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2025-58186",
      "id": "CVE-2025-58186",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2025-58187",
      "id": "CVE-2025-58187",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2025-58188",
      "id": "CVE-2025-58188",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2025-58189",
      "id": "CVE-2025-58189",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2025-61723",
      "id": "CVE-2025-61723",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2025-61724",
      "id": "CVE-2025-61724",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2025-61725",
      "id": "CVE-2025-61725",
      "type": "cve"
    }
  ],
  "cveids": [
    "CVE-2025-47912",
    "CVE-2025-58183",
    "CVE-2025-58185",
    "CVE-2025-58186",
    "CVE-2025-58187",
    "CVE-2025-58188",
    "CVE-2025-58189",
    "CVE-2025-61723",
    "CVE-2025-61724",
    "CVE-2025-61725"
  ]
}