{
  "id": "ALAS2023-2023-420",
  "title": "Amazon Linux 2023 - ALAS2023-2023-420: Important priority package update for ecs-service-connect-agent",
  "issued": {
    "date": "2023-10-30 23:44:00"
  },
  "updated": {
    "date": "2023-11-03 22:40:00"
  },
  "severity": "Important",
  "description": "Package updates are available for Amazon Linux 2023 that fix the following vulnerabilities:\nCVE-2023-44487:\n\tThe HTTP/2 protocol allows a denial of service (server resource consumption) because request cancellation can reset many streams quickly, as exploited in the wild in August through October 2023.\n\nCVE-2023-39323:\n\tLine directives (\"//line\") can be used to bypass the restrictions on \"//go:cgo_\" directives, allowing blocked linker and compiler flags to be passed during compilation. This can result in unexpected execution of arbitrary code when running \"go build\". The line directive requires the absolute path of the file in which the directive lives, which makes exploiting this issue significantly more complex.\n\nCVE-2023-38546:\n\tAn issue was found in libcurl which allows cookies to be inserted into a running program if specific conditions are met. The libcurl provided function, curl_easy_duphandle(), is used to duplicate the easy_handle associated with a transfer. If a duplicated transfer's easy_handle has cookies enabled when it is duplicated, the cookie-enabled state is cloned but the actual cookies are not. If the source easy_handle didn't read cookies from disk, the cloned easy_handle will attempt to read cookies from a file named 'none' in the local directory, potentially allowing arbitrary cookies to be loaded.\n",
  "packages": [
    {
      "name": "ecs-service-connect-agent",
      "epoch": "0",
      "version": "v1.27.2.0",
      "release": "1.amzn2023",
      "arch": "x86_64",
      "filename": "Packages/ecs-service-connect-agent-v1.27.2.0-1.amzn2023.x86_64.rpm"
    },
    {
      "name": "ecs-service-connect-agent",
      "epoch": "0",
      "version": "v1.27.2.0",
      "release": "1.amzn2023",
      "arch": "aarch64",
      "filename": "Packages/ecs-service-connect-agent-v1.27.2.0-1.amzn2023.aarch64.rpm"
    }
  ],
  "references": [
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-38546",
      "id": "CVE-2023-38546",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-39323",
      "id": "CVE-2023-39323",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-44487",
      "id": "CVE-2023-44487",
      "type": "cve"
    }
  ],
  "cveids": [
    "CVE-2023-38546",
    "CVE-2023-39323",
    "CVE-2023-44487"
  ]
}