{
  "id": "ALAS2023-2023-315",
  "title": "Amazon Linux 2023 - ALAS2023-2023-315: Medium priority package update for jsoup",
  "issued": {
    "date": "2023-08-17 11:20:00"
  },
  "updated": {
    "date": "2023-08-23 22:30:00"
  },
  "severity": "Medium",
  "description": "Package updates are available for Amazon Linux 2023 that fix the following vulnerabilities:\nCVE-2022-36033:\n\tjsoup is a Java HTML parser, built for HTML editing, cleaning, scraping, and cross-site scripting (XSS) safety. jsoup may incorrectly sanitize HTML including `javascript:` URL expressions, which could allow XSS attacks when a reader subsequently clicks that link. If the non-default `SafeList.preserveRelativeLinks` option is enabled, HTML including `javascript:` URLs that have been crafted with control characters will not be sanitized. If the site that this HTML is published on does not set a Content Security Policy, an XSS attack is then possible. This issue is patched in jsoup 1.15.3. Users should upgrade to this version. Additionally, as the unsanitized input may have been persisted, old content should be cleaned again using the updated version. To remediate this issue without immediately upgrading: - disable `SafeList.preserveRelativeLinks`, which will rewrite input URLs as absolute URLs - ensure an appropriate [Content Security Policy](https://developer.mozilla.org/en-US/docs/Web/HTTP/CSP) is defined. (This should be used regardless of upgrading, as a defence-in-depth best practice.)\n",
  "packages": [
    {
      "name": "jsoup",
      "epoch": "0",
      "version": "1.13.1",
      "release": "9.amzn2023.0.5",
      "arch": "noarch",
      "filename": "Packages/jsoup-1.13.1-9.amzn2023.0.5.noarch.rpm"
    },
    {
      "name": "jsoup-javadoc",
      "epoch": "0",
      "version": "1.13.1",
      "release": "9.amzn2023.0.5",
      "arch": "noarch",
      "filename": "Packages/jsoup-javadoc-1.13.1-9.amzn2023.0.5.noarch.rpm"
    }
  ],
  "references": [
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-36033",
      "id": "CVE-2022-36033",
      "type": "cve"
    }
  ],
  "cveids": [
    "CVE-2022-36033"
  ]
}