{
  "id": "ALAS2023-2023-174",
  "title": "Amazon Linux 2023 - ALAS2023-2023-174: Important priority package update for apache-ivy",
  "issued": {
    "date": "2023-04-27 20:00:00"
  },
  "updated": {
    "date": "2023-05-03 13:23:00"
  },
  "severity": "Important",
  "description": "Package updates are available for Amazon Linux 2023 that fix the following vulnerabilities:\nCVE-2022-37866:\n\tWhen Apache Ivy downloads artifacts from a repository it stores them in the local file system based on a user-supplied \"pattern\" that may include placeholders for artifacts coordinates like the organisation, module or version. If said coordinates contain \"../\" sequences - which are valid characters for Ivy coordinates in general - it is possible the artifacts are stored outside of Ivy's local cache or repository or can overwrite different artifacts inside of the local cache. In order to exploit this vulnerability an attacker needs collaboration by the remote repository as Ivy will issue http requests containing \"..\" sequences and a \"normal\" repository will not interpret them as part of the artifact coordinates. Users of Apache Ivy 2.0.0 to 2.5.1 should upgrade to Ivy 2.5.1.\n\nCVE-2022-37865:\n\tA flaw was found in Apache Ivy. With Apache Ivy 2.4.0, an optional packaging attribute was introduced that allows artifacts to be unpacked on the fly if pack200 or zip packaging was used. This issue could allow a malicious user to have unwanted access. Ivy users of version 2.4.0 to 2.5.0 should upgrade to Ivy 2.5.1.\n",
  "packages": [
    {
      "name": "apache-ivy",
      "epoch": "0",
      "version": "2.5.1",
      "release": "1.amzn2023.0.1",
      "arch": "noarch",
      "filename": "Packages/apache-ivy-2.5.1-1.amzn2023.0.1.noarch.rpm"
    },
    {
      "name": "apache-ivy-javadoc",
      "epoch": "0",
      "version": "2.5.1",
      "release": "1.amzn2023.0.1",
      "arch": "noarch",
      "filename": "Packages/apache-ivy-javadoc-2.5.1-1.amzn2023.0.1.noarch.rpm"
    }
  ],
  "references": [
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-37865",
      "id": "CVE-2022-37865",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-37866",
      "id": "CVE-2022-37866",
      "type": "cve"
    }
  ],
  "cveids": [
    "CVE-2022-37865",
    "CVE-2022-37866"
  ]
}