{
  "id": "ALAS2023-2025-811",
  "title": "Amazon Linux 2023 - ALAS2023-2025-811: Important priority package update for ansible-core",
  "issued": {
    "date": "2025-01-21 23:11:00"
  },
  "updated": {
    "date": "2025-01-24 13:15:00"
  },
  "severity": "Important",
  "description": "Package updates are available for Amazon Linux 2023 that fix the following vulnerabilities:\nCVE-2024-56326:\n\tJinja is an extensible templating engine. Prior to 3.1.5, An oversight in how the Jinja sandboxed environment detects calls to str.format allows an attacker that controls the content of a template to execute arbitrary Python code. To exploit the vulnerability, an attacker needs to control the content of a template. Whether that is the case depends on the type of application using Jinja. This vulnerability impacts users of applications which execute untrusted templates. Jinja's sandbox does catch calls to str.format and ensures they don't escape the sandbox. However, it's possible to store a reference to a malicious string's format method, then pass that to a filter that calls it. No such filters are built-in to Jinja, but could be present through custom filters in an application. After the fix, such indirect calls are also handled by the sandbox. This vulnerability is fixed in 3.1.5.\n\nCVE-2024-56201:\n\tJinja is an extensible templating engine. Prior to 3.1.5, a bug in the Jinja compiler allows an attacker that controls both the content and filename of a template to execute arbitrary Python code, regardless of if Jinja's sandbox is used. To exploit the vulnerability, an attacker needs to control both the filename and the contents of a template. Whether that is the case depends on the type of application using Jinja. This vulnerability impacts users of applications which execute untrusted templates where the template author can also choose the template filename. This vulnerability is fixed in 3.1.5.\n",
  "packages": [
    {
      "name": "ansible-test",
      "epoch": "0",
      "version": "2.15.3",
      "release": "1.amzn2023.0.5",
      "arch": "x86_64",
      "filename": "Packages/ansible-test-2.15.3-1.amzn2023.0.5.x86_64.rpm"
    },
    {
      "name": "ansible-core",
      "epoch": "0",
      "version": "2.15.3",
      "release": "1.amzn2023.0.5",
      "arch": "x86_64",
      "filename": "Packages/ansible-core-2.15.3-1.amzn2023.0.5.x86_64.rpm"
    },
    {
      "name": "ansible-test",
      "epoch": "0",
      "version": "2.15.3",
      "release": "1.amzn2023.0.5",
      "arch": "aarch64",
      "filename": "Packages/ansible-test-2.15.3-1.amzn2023.0.5.aarch64.rpm"
    },
    {
      "name": "ansible-core",
      "epoch": "0",
      "version": "2.15.3",
      "release": "1.amzn2023.0.5",
      "arch": "aarch64",
      "filename": "Packages/ansible-core-2.15.3-1.amzn2023.0.5.aarch64.rpm"
    }
  ],
  "references": [
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-56201",
      "id": "CVE-2024-56201",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-56326",
      "id": "CVE-2024-56326",
      "type": "cve"
    }
  ],
  "cveids": [
    "CVE-2024-56201",
    "CVE-2024-56326"
  ]
}