{
  "id": "ALAS2023-2025-880",
  "title": "Amazon Linux 2023 - ALAS2023-2025-880: Important priority package update for amazon-cloudwatch-agent",
  "issued": {
    "date": "2025-02-26 23:14:00"
  },
  "updated": {
    "date": "2025-03-05 16:33:00"
  },
  "severity": "Important",
  "description": "Package updates are available for Amazon Linux 2023 that fix the following vulnerabilities:\nCVE-2024-45338:\n\tAn attacker can craft an input to the Parse functions that would be processed non-linearly with respect to its length, resulting in extremely slow parsing. This could cause a denial of service.\n\nCVE-2024-45337:\n\tApplications and libraries which misuse the ServerConfig.PublicKeyCallback callback may be susceptible to an authorization bypass. The documentation for ServerConfig.PublicKeyCallback says that \"A call to this function does not guarantee that the key offered is in fact used to authenticate.\" Specifically, the SSH protocol allows clients to inquire about whether a public key is acceptable before proving control of the corresponding private key. PublicKeyCallback may be called with multiple keys, and the order in which the keys were provided cannot be used to infer which key the client successfully authenticated with, if any. Some applications, which store the key(s) passed to PublicKeyCallback (or derived information) and make security relevant determinations based on it once the connection is established, may make incorrect assumptions. For example, an attacker may send public keys A and B, and then authenticate with A. PublicKeyCallback would be called only twice, first with A and then with B. A vulnerable application may then make authorization decisions based on key B for which the attacker does not actually control the private key. Since this API is widely misused, as a partial mitigation golang.org/x/cry...@v0.31.0 enforces the property that, when successfully authenticating via public key, the last key passed to ServerConfig.PublicKeyCallback will be the key used to authenticate the connection. PublicKeyCallback will now be called multiple times with the same key, if necessary. Note that the client may still not control the last key passed to PublicKeyCallback if the connection is then authenticated with a different method, such as PasswordCallback, KeyboardInteractiveCallback, or NoClientAuth. Users should be using the Extensions field of the Permissions return value from the various authentication callbacks to record data associated with the authentication attempt instead of referencing external state. Once the connection is established the state corresponding to the successful authentication attempt can be retrieved via the ServerConn.Permissions field. Note that some third-party libraries misuse the Permissions type by sharing it across authentication attempts; users of third-party libraries should refer to the relevant projects for guidance.\n\nCVE-2024-34158:\n\tCalling Parse on a \"// +build\" build tag line with deeply nested expressions can cause a panic due to stack exhaustion.\n\nCVE-2024-34156:\n\tCalling Decoder.Decode on a message which contains deeply nested structures can cause a panic due to stack exhaustion. This is a follow-up to CVE-2022-30635.\n\nCVE-2024-34155:\n\tCalling any of the Parse functions on Go source code which contains deeply nested literals can cause a panic due to stack exhaustion.\n",
  "packages": [
    {
      "name": "amazon-cloudwatch-agent",
      "epoch": "0",
      "version": "1.300052.1",
      "release": "1.amzn2023",
      "arch": "x86_64",
      "filename": "Packages/amazon-cloudwatch-agent-1.300052.1-1.amzn2023.x86_64.rpm"
    },
    {
      "name": "amazon-cloudwatch-agent",
      "epoch": "0",
      "version": "1.300052.1",
      "release": "1.amzn2023",
      "arch": "aarch64",
      "filename": "Packages/amazon-cloudwatch-agent-1.300052.1-1.amzn2023.aarch64.rpm"
    }
  ],
  "references": [
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-34155",
      "id": "CVE-2024-34155",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-34156",
      "id": "CVE-2024-34156",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-34158",
      "id": "CVE-2024-34158",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-45337",
      "id": "CVE-2024-45337",
      "type": "cve"
    },
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-45338",
      "id": "CVE-2024-45338",
      "type": "cve"
    }
  ],
  "cveids": [
    "CVE-2024-34155",
    "CVE-2024-34156",
    "CVE-2024-34158",
    "CVE-2024-45337",
    "CVE-2024-45338"
  ]
}