{
  "id": "ALAS2023-2025-999",
  "title": "Amazon Linux 2023 - ALAS2023-2025-999: Important priority package update for apache-commons-beanutils",
  "issued": {
    "date": "2025-06-04 19:08:00"
  },
  "updated": {
    "date": "2025-06-10 14:22:00"
  },
  "severity": "Important",
  "description": "Package updates are available for Amazon Linux 2023 that fix the following vulnerabilities:\nCVE-2025-48734:\n\tImproper Access Control vulnerability in Apache Commons.\n\n\n\nA special BeanIntrospector class was added in version 1.9.2. This can be used to stop attackers from using the declared class property of Java enum objects to get access to the classloader. However this protection was not enabled by default. PropertyUtilsBean (and consequently BeanUtilsBean) now disallows declared class level property access by default.\n\n\n\n\n\nReleases 1.11.0 and 2.0.0-M2 address a potential security issue when accessing enum properties in an uncontrolled way. If an application using Commons BeanUtils passes property paths from an external source directly to the getProperty() method of PropertyUtilsBean, an attacker can access the enum's class loader via the \"declaredClass\" property available on all Java \"enum\" objects. Accessing the enum's \"declaredClass\" allows remote attackers to access the ClassLoader and execute arbitrary code. The same issue exists with PropertyUtilsBean.getNestedProperty().\nStarting in versions 1.11.0 and 2.0.0-M2 a special BeanIntrospector suppresses the \"declaredClass\" property. Note that this new BeanIntrospector is enabled by default, but you can disable it to regain the old behavior; see section 2.5 of the user's guide and the unit tests.\n\nThis issue affects Apache Commons BeanUtils 1.x before 1.11.0, and 2.x before 2.0.0-M2.Users of the artifact commons-beanutils:commons-beanutils\n\n 1.x are recommended to upgrade to version 1.11.0, which fixes the issue.\n\n\nUsers of the artifact org.apache.commons:commons-beanutils2\n\n 2.x are recommended to upgrade to version 2.0.0-M2, which fixes the issue.\n",
  "packages": [
    {
      "name": "apache-commons-beanutils",
      "epoch": "0",
      "version": "1.11.0",
      "release": "10.amzn2023.0.1",
      "arch": "noarch",
      "filename": "Packages/apache-commons-beanutils-1.11.0-10.amzn2023.0.1.noarch.rpm"
    },
    {
      "name": "apache-commons-beanutils-javadoc",
      "epoch": "0",
      "version": "1.11.0",
      "release": "10.amzn2023.0.1",
      "arch": "noarch",
      "filename": "Packages/apache-commons-beanutils-javadoc-1.11.0-10.amzn2023.0.1.noarch.rpm"
    }
  ],
  "references": [
    {
      "href": "http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2025-48734",
      "id": "CVE-2025-48734",
      "type": "cve"
    }
  ],
  "cveids": [
    "CVE-2025-48734"
  ]
}