{
  "id": "GHSA-4grw-m28r-q285",
  "modified": "2024-12-05T19:05:49Z",
  "published": "2024-12-05T17:31:35Z",
  "aliases": [
    "CVE-2024-53857"
  ],
  "summary": "rPGP Potential Resource Exhaustion when handling Untrusted Messages",
  "details": "During a security audit, [Radically Open Security](https://www.radicallyopensecurity.com/) discovered two vulnerabilities which allow attackers to trigger resource exhaustion vulnerabilities in `rpgp` by providing crafted messages. This affects general message parsing and decryption with symmetric keys.\n\n### Impact\nAffected `rpgp` versions do not correctly set upper limits on the total reserved amount of memory when parsing long sequences of partial OpenPGP packets, which can grow to to several GiB in size. Additionally, up to 4GiB of memory is reserved for OpenPGP packets of fixed size with large length fields, even if less data is received. \nDepending on existing message size restrictions and available system resources, this can cause out-of-memory conditions and crash the `rpgp` process or cause other system instability through memory resource exhaustion when parsing crafted messages.\n\nAffected `rpgp` versions are susceptible to excessive memory allocation with values of up to 2TiB or long processing times for some decryption operations which involve the [Argon2 function](https://datatracker.ietf.org/doc/html/rfc9580.html#name-argon2). An attacker can provide a valid `Symmetric Key Encrypted Session Key` packet (SKESK) which uses `Argon2` for String-to-Key hashing with parameters that are excessive, but within specification limits of the RFC9580 OpenPGP standard. Since `rpgp` did not further restrict the Argon2 parameters, this can cause out-of-memory conditions and crash the `rpgp` process. Under some conditions,   the memory resource exhaustion may trigger other system instability. Alternatively, this can make the program unresponsive via long computations. The attacker needs to trick a victim into attempting decryption, but does not require knowledge of the symmetric secret used by the victim.\n\nThere is no impact to confidentiality or integrity security properties.\n\n### Versions and Patches\n\nThe impact details on the message parsing component varies with different versions. We've confirmed some of the problematic behavior on older versions such as `v0.10.0` and see all recent versions as affected in some form.  \n\nThe affected `Argon2` functionality was introduced with `v0.12.0-alpha.1`, earlier versions are not vulnerable.\n\nThe vulnerabilities have been fixed with version `0.14.2`. We recommend all users to upgrade to this version.\n\n### References\n\n\nThe security audit was made possible by the [NLnet Foundation NGI Zero Core](https://nlnet.nl/core/) grant program [for rpgp](https://nlnet.nl/project/rPGP-cryptorefresh/).",
  "affected": [
    {
      "package": {
        "ecosystem": "crates.io",
        "name": "pgp",
        "purl": "pkg:cargo/pgp"
      },
      "ranges": [
        {
          "type": "SEMVER",
          "events": [
            {
              "introduced": "0"
            },
            {
              "fixed": "0.14.2"
            }
          ]
        }
      ],
      "database_specific": {
        "source": "https://github.com/github/advisory-database/blob/main/advisories/github-reviewed/2024/12/GHSA-4grw-m28r-q285/GHSA-4grw-m28r-q285.json"
      }
    }
  ],
  "references": [
    {
      "type": "WEB",
      "url": "https://github.com/rpgp/rpgp/security/advisories/GHSA-4grw-m28r-q285"
    },
    {
      "type": "ADVISORY",
      "url": "https://nvd.nist.gov/vuln/detail/CVE-2024-53857"
    },
    {
      "type": "PACKAGE",
      "url": "https://github.com/rpgp/rpgp"
    }
  ]
}