{
  "Title": "ELSA-2008-0061:  setroubleshoot security and bug fix update (MODERATE)",
  "Description": "setroubleshoot:\n[2.0.5-3.0.1.el5]\n- replace missed references to bugzilla.redhat.com with linux.oracle.com\n\n[2.0.5-3]\n- Resolve: bug #436564: socket.getsockopt() on ppc generates exception\n  Fix typo in original setroubleshoot-get_credentials.patch\n\n[2.0.5-2]\n- Resolve: bug #437857: python error in system shutdown\n        - Resolve: bug #436564: socket.getsockopt() on ppc generates exception\n\n[2.0.5-1]\n- Resolve: bug #431768: parser error in xmlParseDoc()\n\n[2.0.3-3]\n- Resolve: bug #429179: notification-daemon crashes when a notification is removed from the display\n\n[2.0.3-2]\n- remove libuser-python dependency\n        - Related: bug #224351\n\n[2.0.2-1]\n- Resolve bug #428252: Problem with update/remove old version\n        - Add code to validate xml database version, if file is incompatible it is not read,\n          the next time the database is written it will be in the new version format.\n          This means the database contents are not preserved across database version upgrades.\n        - Remove postun trigger from spec file used to clear database between incompatible versions\n          the new database version check during database read will handle this instead\n        - bullet proof exit status in init script and rpm scriptlets\n        - Resolve bug #247302: setroubleshoots autostart .desktop file fails to start under a KDE session\n        - Resolve bug #376041: Cannot check setroubleshoot service status as non-root\n        - Resolve bug #332281: remove obsolete translation\n        - Resolve bug #344331: No description in gnome-session-properties\n        - Resolve bug #358581: missing libuser-python dependency\n        - Resolve bug #426586: Renaming translation po file from sr@Latn to sr@latin\n        - Resolve bug #427260: German Translation\n        - enhance the sealert man page\n\n[2.0.1-1]\n- make connection error message persist instead of timeout in browser\n        - updated Brazilian Portuguese translation: Igor Pires Soares \u003cigor@fedoraproject.org\u003e\n        - implement uid,username checks\n        - rpc methods now check for authenticated state\n        - fix html handling of summary string\n        - add 'named' messages to status bar, make sure all messages either timeout or are named\n        - fix ordering of menus, resolves bug #427418\n        - add 'hide quiet' to browser view filtering, resolves bug #427421\n        - tweak siginfo text formatting\n\n[2.0.0-1]\n- prepare for v2 test release\n        - Completed most work for version 2 of setroubleshoot, prepare for test release\n        - import Dans changes from the mainline\n          primarily allow_postfix_local_write_mail_spool plugin\n        - escape html, fix siginfo.format_html(), siginfo.format_text()\n        - add async-error signal\n        - change identity to just username\n        - make sure set_filter user validation works and reports error in browser\n        - fix generation of line numbers and host when connected to audispd\n        - add permissive notification, resolves bug #231334: Wording doesnt change for permissive mode\n        - resolves bug #244345: avc path information incomplete\n        - get the uid,gid when a client connects to the server\n        - set_filter now verifies the filter is owned by the user,\n        - resolves bug #288261: setroubleshoot lack of user authentication\n        - remove filter options which werent being used\n        - change '@' in audit data hostname to '.'\n        - remove restart dialog\n          resolves bug #321171: sealerts dialog after update is higly confusing\n        - fix rpc xml arg\n        - fix handling of host value\n        - tweak what fields are in signature\n        - move data items which had been in 'avc' object into siginfo\n        - clean up siginfo format\n        - large parts of new audit data pipeline working, checkpoint\n        - fix duplicate xml nodes when generating xml tree\n        - audit event can now be xml serialized\n        - switch from using ints for audit record types to strings\n        - avoid conversion headaches and possibilty of not being\n          able to convert a new unknown type\n        - add logic to allow XmlSerialize to be subclassed and init_from_xml_node to be overridden\n        - add support to xml serialize classes AuditEventID, AuditEvent, AuditRecord\n        - use metaclass for xml class init\n        - start adding xml support to audit data classes\n        - Use metaclass to wrap class init\n        - move xml serialization code from signature.py to xml_serialize.py\n        - simplify aspect of the serialization code\n        - add unstructured xml mapping, each xml element name has its content mapped to obj.name\n        - modify xml serialization to be driven by xml contents\n        - general clean up\n        - checkpoint conversion of serialization to use metaclasses\n        - clean up class/data specifications for XmlSerializable\n        - add support for client rpc testing\n        - add changelog entry\n        - add SubProcess class to setroubleshootd in preparation to\n        - run daemon as subprocess so we can gather results and\n          compare them to the expected data we sent\n        - rewrite all plugins to use new v2 audit data\n        - add SubProcess class to setroubleshootd in preparation to \n          run daemon as subprocess so we can gather results and\n          compare them to the expected data we sent\n        - add new test support: add config section 'test', add boolean 'analyze' to\n          config test section, add class TestPluginReportReceiver which is installed\n          if test.analyze is True, it prints analysis report. In test_setroubleshootd\n          send AUDIT_EOE to assure sequential event processing so analysis results\n          have same ordering as events that are sent by test_setroubleshootd\n        - alert signatures now include host information, alerts will be grouped by host\n\n[1.10.7-1]\n- Fix spec file requires for opening an HTML page\n          In configure.ac search for xdg-open and htmlview in priority order,\n          set variable html_browser_open to the one found, in spec file require\n          xdg-utils for fedora and htmlview for RHEL.\n        - add 'Host' column in browser\n          add 'Toggle Column Visibility' menu to toggle display of any column on/off\n        - Resolves bug #310261: setroubleshoot notifications arent throttled\n        - add support for AUDIT_EOE, end-of-event, if AUDIT_EOE immediately\n          emit cached event. Disable timeouts used to flush events if\n          AUDIT_EOE has been seen.\n\n[1.10.6-1]\n- make selinx-policy requires in spec file specific to dist tag\n\n[1.10.5-1]\n- update code for command line log file scanning to work with\n          new log file scanning code introduced for the browser.\n        - update Bulgarian translation (Doncho N. Gunchev (gunchev@gmail.com))\n        - update Polish translation (Piotr Drag (raven@pmail.pl))\n        - Resolves bug #239893: sealert wakes up very often\n          This was caused by the use of threads and pygtks thread signal\n          handling.  The only use of threads in sealert was for log file\n          scanning so that the UI would remain responsive during a\n          scan. Threads in sealert have now been completely\n          removed. Instead the scanning work is performed in a gobject idle\n          function called from the main loop. The idle function is written\n          as a python generator function which allows for the function to\n          perform a small amount of work, save its execution state and\n          return. The next time the idle function is called from the main\n          loop it resumes execution from its last state until it decides\n          to yield control again. This way the long running scan/analysis\n          can be performed in small successive units of work during the\n          time the application is otherwise idle and it does not interfere\n          with the rest of the GUI event processing. Everything now occurs\n          in an event loop, think of it as the applications process/thread\n          scheduler whose event handlers execute time slices.\n        - rewrote parts of the audit input pipeline to use generators\n          instead of callbacks, thus permitting the logfile scanning code\n          to yield control with more granularity. Also updated\n          test_setroubleshootd and audisp_listen to use the new\n          generator/yield logic.\n        - rewrote the dialog used for scanning log files, progress bar\n          updates are now in the dialog, the scan can be terminated part\n          way through, errors from the scan are reported in pop-up dialog,\n          one can only dismiss the dialog with success if the scan had\n          been successfully run to completion, otherwise the user is only\n          left with the option to cancel.\n        - Relates bug #252035  bug #247469, setroubleshootd and sealert should\n          exit if SELinux is disabled.\n        - add utility functions escape_html() and unescape_html()\n        - fix initial sort order in browser, track sort order in browser\n        - modify AVC.get_path() to only return a value if the 'path' field is\n          set, formerly it also considered the fields 'name' \u0026 'file' which were\n          incorrect. get_path() now also looks to see if the string begins with a\n          slash for a fully qualified path, if not it looks to see if its a \n          pseudo path such as 'pipe[12345]' or 'socket[12345]' and if so strips out\n          the instance information inside the brackets and returns just the type of \n          the pseudo path. This is done because we do not want path information\n          in the signature to be unique for each instance of the denial.\n\n        - modify the TimeStamp class to hide its internal datetime member,\n          remove the cmp() method, the internal __cmp__ will be automatically invoked.\n\n        - require selinux policy version in spec file to allow system dbus use\n        \n        - Resolves bug #256601: audit2allow generates incorrect syntax when comma ',' in\n          denied list\n\n        - update po i18n files\n\n        - Add support for pruning database by age and size\n\n[1.10.4-1]\n- fix init script\n\n[1.10.3-1]\n- modify avc_audit.py to use new audit_data.py implementation\n\n        - can listen for audit events on either /var/run/audit_events\n          in bindary protocol mode or /var/run/audisp_events in\n          text protocol mode\n\n[1.10.2-1]\n- remove all copied code from test_setroubleshootd, now we import\n          from setroubleshoot\n        - export ClientConnectionHandler from rpc.py as a base class.\n          Derive SetroubleshootdClientConnectionHandler and\n          AuditClientConnectionHandler from ClientConnectionHandler.\n        - add audisp_listen as test program\n        - create setroubleshoot sym link in top devel directory pointing\n          to src so import setroubleshoot.foo if PYTHONPATH=topdir\n        - add get_option, convert_cfg_type to config.py.in so that one\n          can pass optional dict to override config file settings\n        - rewrite log_init() so its easier for other programs to use it,\n          fix the import logic concering log \u0026 config\n        - remove log code from test_setroubleshoot, now just does import\n          from setroubleshoot.\n        - test_setroubleshootd can now handle audit records in both text\n          and binary formats, can be selected by command line arg. It can now\n          either output to clients connecting on a socket or to stdout. Can\n          now optionally exit after N socket client connections.\n        - remove non audit record lines from test data\n        - remove config_init() and log_init() from package __init__.py\n          It was the wrong place to call them, now call them when the\n          process initializes before the first setroubleshoot imports\n        - add parse_config_setting() and set_config() to config module\n        - setroubleshootd now accepts -c --config command line arg\n        - test_sectroubleshoot: add err defines \u0026 program_error exception\n          add is_valid() tests to assure we read a valid audit record\n          log the unrecognized line if not valid, clean up socket close()\n\n        - Relates Bug #247056, update initscript to LSB standards\n          Note: LSB initscripts in Fedora is not yet a resolved issue,\n          the changes implemented were to add an LSB block and support\n          the new LSB try-restart and force-reload commands. However\n          the new /lib/lsb/init-functions are NOT currently used as this\n          is the unstable part.\n\n[1.10.1-1]\n- add BuildRequires perl-XML-Parser\n\n[1.10.0-1]\n- move all plugins and their translations to independent package\n        - wrap XML generation inside try/except\n        - correct how access list is obtained in avc_auparse.py\n        - add try/except around top level of AnalyzeThread.run so exceptions\n          in the thread get reported and the analysis thread does not just die.\n        - also add try/except around LogfileThread.process_logfile\n        - add new function assure_file_ownership_permissions()\n        - server now forces its database file permissions/ownership to be 0600 root:root\n        - rpm now forces the servers database file permissions/ownership to be 0600 root:root\n        - Resolves Bug #251545: Review Request: setroubleshoot-plugins - analysis plugins for setroubleshoot\n        - clean up some other rpmlint warnings in setroubleshoot.spec\n        - fix missing install of setroubleshoot icon and sym link to it\n        - Resolves Bug #251551, setroubleshoot shows up in in wrong desktop menu\n          also run desktop-file-install in rpm install\n        - add /etc/dbus-1/system.d/setroubleshootd.conf dbus configuration file\n        - Resolves Bug #250979, Bug #250932 Missing dependencies\n        - Restore plugins/Makefile.am which got nuked somehow\n        - remove dus.dbus_bindings.bus_name_has_owner(), deprecated as of F7\n        - wrap rpm transactions in try/except\n\n[1.9.7-1]\n- Resolves Bug# 241739, this bug is the lead bug for several bug reports,\n          all consequences of the same problem, setroubleshootd/sealert when run\n          in a non latin language environment because of incompatibilities in\n          i18n encoding between components.\n\n[1.9.6-1]\n- add avc_auparse.py, now has option to use audit parsing library instead of\n          built-in audit parsing.\n        - fix bug in log file scanning and detail display update\n        - Resolves Bug# 238516, python pkg directory not owned\n\n[1.9.5-1]\n- Update translations\n        - Fix mislabeled file\n\n[1.9.4-1]\n- Remove disable_trans boolean\n        - Check for paths in filesystem before suggesting chcon -R \n        - Remove default to listen on local ports\n\n[1.9.3-1]\n- install icon in /usr/share/icons, refer to icon by name using standard API\n        - Fix performance problems in setroubleshoot browser log file scanning\n        - Significant rewrite of data/view management code in setroubleshoot\n          browser. data and view now cleanly separated, can easily switch\n          between data views while maintaining selections, view state, with\n          proper update of status information in status area\n        - Resolves Bug# 227806: right click context menu resets selection\n        - Logfile scans now operate in independent thread, proper asynchronous\n          updates of browser during scan, browser used to appear to hang\n        - Resolved Bug# 224340: Rewrite Menu/Toobar/Popup to use UIManger instead of glade\n        - Add toobar support\n        - Implement GUI to edit email recipient list in setroubleshoot browser\n        - Added user help to setroubleshoot browser\n        - Related Bug# 224343: Fix setroubleshoot browser to respond to desktop theme changes\n        - improve traceback error reporting in sealert\n        - rewrite AboutDialog, replacing glade version\n        - Resolves bug #229849  Bug# 230115, Related bug #221850: fix uuid code to resolve\n          '_uuid_generate_random' is not defined error\n\n[1.9.2-1]\n- Suck in AuditMsg since audit libs are dropping support\n\n[1.9.1-1]\n- Split into server and gui packages\n\n[1.8.19-1]\n- Remove use of ctypes in uuid, which is causing bad avc messages\n\n[1.8.18-1]\n- Remove avc from Plugin.py\n\n[1.8.17-1]\n- Remove tempfile handling in util.py.  Causes lots of avcs and is not used\n\n[1.8.16-1]\n        - Resolved: Bug# 224343 sealerts 'Aditional Info:' text should be in white box\n        - Resolved: Bug# 224336 sealert should have GtkRadioButtons in menu View\n        - Related: bug #224351\n          Rewrite parts of logging support to better support changing output\n          categories, output destinations. Now -v -V verbose works in sealert.\n        - Resolves bug# 225161, granted AVCs incorrectly identified as a denial\n        - add alert count to status bar\n        - add 'Help' command to Help menu, opens web browser on wiki User FAQ\n    [Dan Walsh  \u003cdwalsh@redhat.com\u003e]\n        - Make setroubleshoot.logrotate correctly\n\n[1.8.15-1]\n- Update po\n        - Additional Plugins\n        - Cleanup Plugins\n\n[1.8.14-1]\n- Resolved: bug# 221850\n          plugin module loading was failing in python 2.5 with the message\n          'SystemError: Parent module 'plugins' not loaded'. This is due to a\n          change in behavior between python 2.4 and 2.5, in python 2.4 the lack\n          of a parent module was silently ignored. The fix is to load\n          plugins.__init__ first.\n\n[1.8.13-1]\n- update translations\n\n        - change SETroubleshootDatabase so it is optional if its backed\n          by a file, this fixes the problem of us littering temporary files\n          when scanning logfiles which does not require persistence.\n\n        - disable the view logfile menu item if no logfile has been opened\n\n        - fix redundant log messages for case where there is no log file and\n          the console flag is set. When there is no log file the logging\n          module opens a console stream, thus the console stream produced\n          by the console flag was redundant.\n\n        - add username and password command line arguments\n          rework startup logic so that all command line args are processed\n          before we do any real work\n        \n        - rework the email preferences so that each email address can\n          have a filter type associated with it.\n\n          add a new filter_type 'Ignore After First Alert' which filters\n          after the first alert has been delivered\n\n        - add UI for setting the email addresses alerts are sent to.\n          Add menu item to edit email list, add email list dialog.\n          Remove 'recipient' config file entry, now list is stored\n          in seperate file. Add rpc to query and set the email list,\n          the GUI calls this to get the current list from the server\n          and set it in the server, it is the server which reads and \n          writes the file. Add 'enable' flag to each email entry.\n          Modify how the server iterates over the email list when it\n          receives an alert. When marking an alert as having been sent\n          the username is the email address but with 'email:' prepended so\n          as not to collide with non-email filtering options for the same user.\n\n[1.8.12-1]\n- remove obsolte requires for python element tree\n\nsetroubleshoot-plugins:\n[2.0.4-2]\n- change requires setroubleshoot to requires setroubleshoot-server\n\n[2.0.4-1]\n- Resolve: bug #431768: parser error in xmlParseDoc()\n\n[2.0.3-2]\n- remove dependency on policycoreutils\n        - Related: bug #224351\n\n[2.0.2-1]\n- Add catchall_boolean.py plugin\n\n[2.0.1-1]\n- Resolve bug #332281: remove obsolete translation\n        - Resolve bug #426586: Renaming translation po file from sr@Latn to sr@latin\n\n[2.0.0-1]\n- prepare for v2 test release\n\n[1.10.4-1]\n- Add allow_postfix_local_write_mail_spool plugin\n        - Fix execute typo\n\n[1.10.3-1]\n- rewrite all plugins to use new v2 audit data\n\n[1.10.3-1]\n- Resolves bug #231762: Original PO strings bugs\n\n[1.10.2-1]\n- Change priority on use_nfs_home_dir to 55\n\n[1.10.1-1]\n- add BuildRequires perl-XML-Parser\n\n[1.10.0-1]\n- move all plugins and their translations from setroubleshoot-server\n          package to this new independent package to allow easier updating\n          of just the plugins",
  "Platform": [
    "Oracle Linux 5"
  ],
  "References": [
    {
      "Source": "elsa",
      "URI": "https://linux.oracle.com/errata/ELSA-2008-0061.html",
      "ID": "ELSA-2008-0061"
    },
    {
      "Source": "CVE",
      "URI": "https://linux.oracle.com/cve/CVE-2007-5495.html",
      "ID": "CVE-2007-5495"
    },
    {
      "Source": "CVE",
      "URI": "https://linux.oracle.com/cve/CVE-2007-5496.html",
      "ID": "CVE-2007-5496"
    }
  ],
  "Criteria": {
    "Operator": "AND",
    "Criterias": [
      {
        "Operator": "OR",
        "Criterias": [
          {
            "Operator": "AND",
            "Criterias": [
              {
                "Operator": "AND",
                "Criterias": null,
                "Criterions": [
                  {
                    "Comment": "setroubleshoot-plugins is earlier than 0:2.0.4-2.el5"
                  },
                  {
                    "Comment": "setroubleshoot-plugins is signed with the Oracle Linux 5 key"
                  }
                ]
              }
            ],
            "Criterions": [
              {
                "Comment": "Oracle Linux arch is ia64"
              }
            ]
          },
          {
            "Operator": "AND",
            "Criterias": [
              {
                "Operator": "OR",
                "Criterias": [
                  {
                    "Operator": "AND",
                    "Criterias": null,
                    "Criterions": [
                      {
                        "Comment": "setroubleshoot is earlier than 0:2.0.5-3.0.1.el5"
                      },
                      {
                        "Comment": "setroubleshoot is signed with the Oracle Linux 5 key"
                      }
                    ]
                  },
                  {
                    "Operator": "AND",
                    "Criterias": null,
                    "Criterions": [
                      {
                        "Comment": "setroubleshoot-plugins is earlier than 0:2.0.4-2.el5"
                      },
                      {
                        "Comment": "setroubleshoot-plugins is signed with the Oracle Linux 5 key"
                      }
                    ]
                  },
                  {
                    "Operator": "AND",
                    "Criterias": null,
                    "Criterions": [
                      {
                        "Comment": "setroubleshoot-server is earlier than 0:2.0.5-3.0.1.el5"
                      },
                      {
                        "Comment": "setroubleshoot-server is signed with the Oracle Linux 5 key"
                      }
                    ]
                  }
                ],
                "Criterions": null
              }
            ],
            "Criterions": [
              {
                "Comment": "Oracle Linux arch is x86_64"
              }
            ]
          },
          {
            "Operator": "AND",
            "Criterias": [
              {
                "Operator": "OR",
                "Criterias": [
                  {
                    "Operator": "AND",
                    "Criterias": null,
                    "Criterions": [
                      {
                        "Comment": "setroubleshoot is earlier than 0:2.0.5-3.0.1.el5"
                      },
                      {
                        "Comment": "setroubleshoot is signed with the Oracle Linux 5 key"
                      }
                    ]
                  },
                  {
                    "Operator": "AND",
                    "Criterias": null,
                    "Criterions": [
                      {
                        "Comment": "setroubleshoot-plugins is earlier than 0:2.0.4-2.el5"
                      },
                      {
                        "Comment": "setroubleshoot-plugins is signed with the Oracle Linux 5 key"
                      }
                    ]
                  },
                  {
                    "Operator": "AND",
                    "Criterias": null,
                    "Criterions": [
                      {
                        "Comment": "setroubleshoot-server is earlier than 0:2.0.5-3.0.1.el5"
                      },
                      {
                        "Comment": "setroubleshoot-server is signed with the Oracle Linux 5 key"
                      }
                    ]
                  }
                ],
                "Criterions": null
              }
            ],
            "Criterions": [
              {
                "Comment": "Oracle Linux arch is i386"
              }
            ]
          }
        ],
        "Criterions": null
      }
    ],
    "Criterions": [
      {
        "Comment": "Oracle Linux 5 is installed"
      }
    ]
  },
  "Severity": "MODERATE",
  "Cves": [
    {
      "Impact": "",
      "Href": "https://linux.oracle.com/cve/CVE-2007-5495.html",
      "ID": "CVE-2007-5495"
    },
    {
      "Impact": "",
      "Href": "https://linux.oracle.com/cve/CVE-2007-5496.html",
      "ID": "CVE-2007-5496"
    }
  ],
  "Issued": {
    "Date": "2008-05-30"
  }
}