{
  "Identifier": "GHSA-7cp4-jw97-3rc2",
  "PackageSlug": "npm/@cloudflare/workers-oauth-provider",
  "Title": "Duplicate Advisory: @cloudflare/workers-oauth-provider missing validation of redirect_uri on authorize endpoint",
  "Description": "# Duplicate Advisory\nThis advisory has been withdrawn because it is a duplicate of GHSA-4pc9-x2fx-p7vj. This link is maintained to preserve external references.\n\n# Original Description\nThe OAuth implementation in workers-oauth-provider that is part of  MCP framework https://github.com/cloudflare/workers-mcp , did not correctly validate that redirect_uri was on the allowed list of redirect URIs for the given client registration.\n\nFixed in:  https://github.com/cloudflare/workers-oauth-provider/pull/26 https://github.com/cloudflare/workers-oauth-provider/pull/26 \n\nImpact:\n\n \n\nUnder certain circumstances (see below), if a victim had previously authorized with a server built on workers-oath-provider, and an attacker could later trick the victim into visiting a malicious web site, then attacker could potentially steal the victim's credentials to the same OAuth server and subsequently impersonate them.\n\nIn order for the attack to be possible, the OAuth server's authorized callback must be designed to auto-approve authorizations that appear to come from an OAuth client that the victim has authorized previously. The authorization flow is not implemented by workers-oauth-provider; it is up to the application built on top to decide whether to implement such automatic re-authorization. However, many applications do implement such logic.\n\nNote: It is a basic, well-known requirement that OAuth servers should verify that the redirect URI is among the allowed list for the client, both during the authorization flow and subsequently when exchanging the authorization code for an access token. workers-oauth-provider implemented only the latter check, not the former. Unfortunately, the former is the much more important check. Readers who are familiar with OAuth may recognize that failing to check redirect URIs against the allowed list is a well-known, basic mistake, covered extensively in the RFC and elsewhere. The author of this library would like everyone to know that he was, in fact, well-aware of this requirement, thought about it a lot while designing the library, and then, somehow, forgot to actually make sure the check was in the code. That is, it's not that he didn't know what he was doing, it's that he knew what he was doing but flubbed it.",
  "Date": "2025-05-01",
  "Pubdate": "2025-05-01",
  "AffectedRange": "\u003c0.0.5",
  "FixedVersions": [
    "0.0.5"
  ],
  "AffectedVersions": "All versions before 0.0.5",
  "NotImpacted": "All versions starting from 0.0.5",
  "Solution": "Upgrade to version 0.0.5 or above.",
  "Urls": [
    "https://github.com/advisories/GHSA-7cp4-jw97-3rc2",
    "https://nvd.nist.gov/vuln/detail/CVE-2025-4143",
    "https://github.com/cloudflare/workers-oauth-provider/pull/26"
  ],
  "CvssV2": "",
  "CvssV3": "",
  "UUID": "2486fd35-b91d-4b5a-8013-e3a5723ba841"
}