{
  "Identifier": "GHSA-7mx2-7q8p-pgmw",
  "PackageSlug": "packagist/symfony/symfony",
  "Title": "Symfony may allow a user to switch to using another user's identity",
  "Description": "Symfony 2.0.6 has just been released. It addresses a security vulnerability in the EntityUserProvider as provided in the Doctrine bridge.\n\nIf you let your users update their login/username from a form, and if you are using Doctrine as a user provider, then you are vulnerable and you should upgrade as soon as possible.\n\nThe issue is that it is possible for a user to switch to another one. Here is how to reproduce it: The current user changes its username via a form to another existing username. When the form is submitted, he will have a validation error (as the username already exists) but the user object in the session will still be modified to the new username. This user from the session will be used for the next requests and so the user will be switched to this other user.\n\nThe fix is to always refresh the user via the primary key (which cannot be updated via a form) instead of the username.\n\nIf you cannot upgrade immediately, please apply the following patch: https://github.com/symfony/symfony/commit/9d2ab9ca9c1762",
  "Date": "2024-05-30",
  "Pubdate": "2024-05-30",
  "AffectedRange": "\u003e=2.0.0 \u003c2.0.6",
  "FixedVersions": [
    "2.0.6"
  ],
  "AffectedVersions": "All versions starting from 2.0.0 before 2.0.6",
  "NotImpacted": "All versions before 2.0.0, all versions starting from 2.0.6",
  "Solution": "Upgrade to version 2.0.6 or above.",
  "Urls": [
    "https://github.com/advisories/GHSA-7mx2-7q8p-pgmw",
    "https://github.com/symfony/symfony/commit/9d2ab9ca9c1762",
    "https://github.com/FriendsOfPHP/security-advisories/blob/master/symfony/symfony/2011-11-16.yaml",
    "https://github.com/symfony/symfony",
    "https://symfony.com/blog/security-release-symfony-2-0-6"
  ],
  "CvssV2": "",
  "CvssV3": "CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:N/I:H/A:N",
  "UUID": "1c9e941c-3055-41c1-8dbf-41910f3d0240"
}