{
  "Identifier": "GHSA-xv2f-5jw4-v95m",
  "PackageSlug": "npm/fsevents",
  "Title": "Malware in fsevents",
  "Description": "This advisory is intended to inform the npm ecosystem with details to resolve a third-party malware incident that may have impacted your infrastructure if you are directly or transitively dependent on the [fsevents](https://www.npmjs.com/package/fsevents) npm package.\n\nfsevents v1.0.0 \u003c= v1.2.10 downloaded binary executables that contained unintended code due to an expired cloud storage resource being reclaimed by a third party.\n\nThe fsevents npm package v1.0.0 through v1.2.10 attempts to fetch a pre-built binary executable artifact (fse.node) from cloud storage. If this fetch fails, fsevents v1.x will attempt to build this artifact directly from source.\n\nVersion 1.x of fsevents has been deprecated for several years and as a result the aforementioned cloud storage resource namespace was available for registration. A third party, unrelated to the fsevents maintainers, subsequently claimed this namespace and in April 2023 this third party started serving modified versions of the “fse.node” binary executable artifact to new fsevents v1.x users.\n\nAs of April 27, 2023 the cloud storage resource in question has been indefinitely suspended and is no longer serving binaries.\n\nThe affected cloud storage pre-fetch was [removed](https://github.com/fsevents/fsevents/commit/909af26846834642c81d19f4148afa3b7557b058) in fsevents version 1.2.11.\n\nThe impact of the modified versions of fse.node appears to be limited to information gathering.\n\nNote that initial analysis was performed for the modified artifact associated with fsevents v1.2.9, which was distributed as fse-v1.2.9-node-v72-darwin-x64.tar.gz prior to the cloud storage resource being suspended.\n\nFor more detailed analysis you may compare a decompilation of the v1.x fse.node artifacts on your systems with the intended fsevents v1.x source as it exists at https://github.com/fsevents/fsevents/tree/v1.x\n\n If you are dependent on the deprecated version of fsevents v1.x, the recommended course of action is to upgrade to fsevents v2.x or remove the dependency altogether as currently maintained versions of Node.js no longer require fsevents for file system watching on macOS.\n\n",
  "Date": "2023-09-07",
  "Pubdate": "2023-04-27",
  "AffectedRange": "\u003e=1.0.0 \u003c1.2.11",
  "FixedVersions": [
    "1.2.11"
  ],
  "AffectedVersions": "All versions starting from 1.0.0 before 1.2.11",
  "NotImpacted": "All versions starting from 1.2.11",
  "Solution": "Upgrade to version 1.2.11 or above.",
  "Urls": [
    "https://github.com/advisories/GHSA-xv2f-5jw4-v95m",
    "https://github.com/fsevents/fsevents/commit/909af26846834642c81d19f4148afa3b7557b058"
  ],
  "CvssV2": "",
  "CvssV3": "",
  "UUID": "d44c8e33-2a10-459f-853e-bd94088a20b9"
}