{
  "Identifier": "GHSA-mh7p-8m2f-qrm6",
  "PackageSlug": "go/github.com/grafana/grafana",
  "Title": "Duplicate Advisory: Grafana vulnerable to authorization bypass",
  "Description": "## Duplicate Advisory\nThis advisory has been withdrawn because it is a duplicate of GHSA-67rv-qpw2-6qrr. This link is maintained to preserve external references.\n\n## Original Description\nIt is possible for a user in a different organization from the owner of a snapshot to bypass authorization and delete a snapshot by issuing a `DELETE` request to `/api/snapshots/\u003ckey\u003e` using its view key. This functionality is intended to only be available to individuals with the permission to write/edit to the snapshot in question, but due to a bug in the authorization logic, deletion requests issued by an unprivileged user in a different organization than the snapshot owner are treated as authorized.\n\nGrafana Labs would like to thank Ravid Mazon and Jay Chen of Palo Alto Research for discovering and disclosing this vulnerability.\n\nThis issue affects Grafana: from 9.5.0 before 9.5.18, from 10.0.0 before 10.0.13, from 10.1.0 before 10.1.9, from 10.2.0 before 10.2.6, from 10.3.0 before 10.3.5.",
  "Date": "2024-06-10",
  "Pubdate": "2024-03-26",
  "AffectedRange": "\u003e=9.5.0 \u003c9.5.18||\u003e=10.0.0 \u003c10.0.13||\u003e=10.1.0 \u003c10.1.9||\u003e=10.2.0 \u003c10.2.6||\u003e=10.3.0 \u003c10.3.5",
  "FixedVersions": [
    "9.5.18",
    "10.0.13",
    "10.1.9",
    "10.2.6",
    "10.3.5"
  ],
  "AffectedVersions": "All versions starting from 9.5.0 before 9.5.18, all versions starting from 10.0.0 before 10.0.13, all versions starting from 10.1.0 before 10.1.9, all versions starting from 10.2.0 before 10.2.6, all versions starting from 10.3.0 before 10.3.5",
  "NotImpacted": "All versions before 9.5.0, all versions starting from 9.5.18 before 10.0.0, all versions starting from 10.0.13 before 10.1.0, all versions starting from 10.1.9 before 10.2.0, all versions starting from 10.2.6 before 10.3.0, all versions starting from 10.3.5",
  "Solution": "Upgrade to versions 10.0.13, 10.1.9, 10.2.6, 10.3.5, 9.5.18 or above.",
  "Urls": [
    "https://github.com/advisories/GHSA-mh7p-8m2f-qrm6",
    "https://nvd.nist.gov/vuln/detail/CVE-2024-1313",
    "https://github.com/grafana/grafana",
    "https://grafana.com/security/security-advisories/cve-2024-1313",
    "https://security.netapp.com/advisory/ntap-20240524-0008"
  ],
  "CvssV2": "",
  "CvssV3": "CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:N/I:H/A:N",
  "UUID": "c8670cec-47fc-4296-a109-90292419ed5e"
}