{
  "Severity": "MODERATE",
  "UpdatedAt": "2024-01-29T22:30:59Z",
  "Package": {
    "Ecosystem": "GO",
    "Name": "goauthentik.io"
  },
  "Advisory": {
    "DatabaseId": 233197,
    "Id": "GSA_kwCzR0hTQS1tcngzLWd4angtaGpxas4AA47t",
    "GhsaId": "GHSA-mrx3-gxjx-hjqj",
    "References": [
      {
        "Url": "https://github.com/goauthentik/authentik/security/advisories/GHSA-mrx3-gxjx-hjqj"
      },
      {
        "Url": "https://github.com/goauthentik/authentik/commit/38e04ae12720e5d81b4f7ac77997eb8d1275d31a"
      },
      {
        "Url": "https://nvd.nist.gov/vuln/detail/CVE-2024-23647"
      },
      {
        "Url": "https://github.com/advisories/GHSA-mrx3-gxjx-hjqj"
      }
    ],
    "Identifiers": [
      {
        "Type": "GHSA",
        "Value": "GHSA-mrx3-gxjx-hjqj"
      },
      {
        "Type": "CVE",
        "Value": "CVE-2024-23647"
      }
    ],
    "Description": "## Summary\n\nPKCE is a very important countermeasure in OAuth2 , both for public and confidential clients. It protects against CSRF attacks and code injection attacks. Because of this bug, an attacker can circumvent the protection PKCE offers.\n\n## Patches\n\nauthentik 2023.8.7 and 2023.10.7 fix this issue.\n\n## Details\n\nThere is a bug in our implementation of PKCE that allows an attacker to circumvent the protection that PKCE offers. PKCE adds the `code_challenge’ parameter to the authorization request and adds the `code_verifier’ parameter to the token request. We recently fixed a downgrade attack (in v2023.8.5 and 2023.10.4) where if the attacker removed the `code_verifier’ parameter in the token request, authentik would allow the request to pass, thus circumventing PKCE’s protection. However, in the latest version of the software, another downgrade scenario is still possible: if the attacker removes the `code_challenge’ parameter from the authorization request, authentik will also not do the PKCE check.\n\nNote that this type of downgrade enables an attacker to perform a code injection attack, even if the OAuth client is using PKCE (which is supposed to protect against code injection attacks). To start the attack, the attacker must initiate the authorization process without that `code_challenge’ parameter in the authorization request. But this is easy to do (just use a phishing site or email to trick the user into clicking on a link that the attacker controls – the authorization link without that `code_challenge’ parameter).\n\nThe OAuth BCP (https://datatracker.ietf.org/doc/html/draft-ietf-oauth-security-topics) explicitly mentions this particular attack in section 2.1.1: “Authorization servers MUST mitigate PKCE Downgrade Attacks by ensuring that a token request containing a code_verifier parameter is accepted only if a code_challenge parameter was present in the authorization request, see Section 4.8.2 for details.”\n\n## For more information\n\nIf you have any questions or comments about this advisory:\n\n-   Email us at [security@goauthentik.io](mailto:security@goauthentik.io)\n",
    "Origin": "UNSPECIFIED",
    "PublishedAt": "2024-01-29T22:30:54Z",
    "Severity": "MODERATE",
    "Summary": "Authentik vulnerable to PKCE downgrade attack",
    "UpdatedAt": "2024-01-30T19:34:59Z",
    "WithdrawnAt": "",
    "CVSS": {
      "Score": 6.5,
      "VectorString": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:N/I:H/A:N"
    }
  },
  "Versions": [
    {
      "FirstPatchedVersion": {
        "Identifier": "2023.8.7"
      },
      "VulnerableVersionRange": "\u003c= 2023.8.6"
    },
    {
      "FirstPatchedVersion": {
        "Identifier": "2023.10.7"
      },
      "VulnerableVersionRange": "\u003e= 2023.10.0, \u003c= 2023.10.6"
    }
  ]
}