{
  "Identifier": "GHSA-4v48-4q5m-8vx4",
  "PackageSlug": "go/github.com/prometheus/prometheus",
  "Title": "Prometheus vulnerable to basic authentication bypass",
  "Description": "### Impact\n\nPrometheus can be secured by a web.yml file that specifies usernames and hashed passwords for basic authentication.\n\nPasswords are hashed with bcrypt, which means that even if you have access to the hash, it is very hard to find the original password back.\n\nHowever, a flaw in the way this mechanism was implemented in the [exporter toolkit](https://github.com/prometheus/exporter-toolkit) makes it possible with people who know the hashed password to authenticate against Prometheus.\n\nA request can be forged by an attacker to poison the internal cache used to cache the computation of hashes and make subsequent requests successful. This cache is used in both happy and unhappy scenarios in order to limit side channel attacks that could tell an attacker if a user is present in the file or not.\n\n### Patches\n\nPrometheus 2.37.4 ([LTS](https://prometheus.io/docs/introduction/release-cycle/)) and 2.40.4 have been released to address this issue.\n\n### Workarounds\n\nThere is no workaround but attacker must have access to the hashed password, stored in disk, to bypass the authentication.",
  "Date": "2022-12-05",
  "Pubdate": "2022-12-05",
  "AffectedRange": "\u003e=2.24.1 \u003c2.37.4||\u003e=2.38.0 \u003c2.40.4",
  "FixedVersions": [
    "2.37.4",
    "2.40.4"
  ],
  "AffectedVersions": "All versions starting from 2.24.1 before 2.37.4, all versions starting from 2.38.0 before 2.40.4",
  "NotImpacted": "All versions before 2.24.1, all versions starting from 2.37.4 before 2.38.0, all versions starting from 2.40.4",
  "Solution": "Upgrade to versions 2.37.4, 2.40.4 or above.",
  "Urls": [
    "https://github.com/prometheus/prometheus/security/advisories/GHSA-4v48-4q5m-8vx4",
    "https://github.com/prometheus/prometheus/commit/31a2db3ae9c0f4b486b6895973beabc1d1beac93",
    "https://github.com/prometheus/prometheus/releases/tag/v2.37.4",
    "https://github.com/prometheus/prometheus/releases/tag/v2.40.4",
    "https://github.com/advisories/GHSA-4v48-4q5m-8vx4"
  ],
  "CvssV2": "",
  "CvssV3": "",
  "UUID": "08e50f23-2ee6-4668-af08-a561fec536ea"
}