{
  "Severity": "HIGH",
  "UpdatedAt": "2023-08-24T22:23:00Z",
  "Package": {
    "Ecosystem": "GO",
    "Name": "github.com/libp2p/go-libp2p"
  },
  "Advisory": {
    "DatabaseId": 219102,
    "Id": "GSA_kwCzR0hTQS1nY3E5LXFxd3gtcmdqM84AA1fe",
    "GhsaId": "GHSA-gcq9-qqwx-rgj3",
    "References": [
      {
        "Url": "https://github.com/libp2p/go-libp2p/security/advisories/GHSA-gcq9-qqwx-rgj3"
      },
      {
        "Url": "https://github.com/libp2p/go-libp2p/commit/45d3c6fff662ddd6938982e7e9309ad5fa2ad8dd"
      },
      {
        "Url": "https://github.com/libp2p/go-libp2p/releases/tag/v0.27.4"
      },
      {
        "Url": "https://nvd.nist.gov/vuln/detail/CVE-2023-40583"
      },
      {
        "Url": "https://github.com/libp2p/go-libp2p/releases/tag/v0.27.7"
      },
      {
        "Url": "https://github.com/advisories/GHSA-gcq9-qqwx-rgj3"
      }
    ],
    "Identifiers": [
      {
        "Type": "GHSA",
        "Value": "GHSA-gcq9-qqwx-rgj3"
      },
      {
        "Type": "CVE",
        "Value": "CVE-2023-40583"
      }
    ],
    "Description": "### Summary\nIn go-libp2p, by using signed peer records a malicious actor can store an arbitrary amount of data in a remote node’s memory. This memory does not get garbage collected and so the victim can run out of memory and crash.\n\nIt is feasible to do this at scale. An attacker would have to transfer ~1/2 as much memory it wants to occupy (2x amplification factor).\n\nThe attacker can perform this attack over time as the target node’s memory will not be garbage collected.\n\nThis can occur because when a signed peer record is received, only the signature validity check is performed but the sender signature is not checked. Signed peer records from randomly generated peers can be sent by a malicious actor. A target node will accept the peer record as long as the signature is valid, and then stored in the peer store.\n\nThere is cleanup logic in the peer store that cleans up data when a peer disconnects, but this cleanup is never triggered for the fake peer (from which signed peer records were accepted) because it was never “connected”.\n\n### Impact\nIf users of go-libp2p in production are not monitoring memory consumption over time, it could be a silent attack i.e. the attacker could bring down nodes over a period of time (how long depends on the node resources i.e. a go-libp2p node on a virtual server with 4 gb of memory takes about 90 sec to bring down; on a larger server, it might take a bit longer.)\n\n### Patches\nUpdate your go-libp2p dependency to the latest release, v0.30.0 at the time of writing.\n\nIf you'd like to stay on the 0.27.x release, we strongly recommend users to update to go-libp2p [0.27.7](https://github.com/libp2p/go-libp2p/releases/tag/v0.27.7). Though this OOM issue was fixed in 0.27.4, there were subsequent patch releases afterwards (important fixes for other issues unrelated to the OOM).\n\n### Workarounds\nNone",
    "Origin": "UNSPECIFIED",
    "PublishedAt": "2023-08-24T22:22:59Z",
    "Severity": "HIGH",
    "Summary": "libp2p nodes vulnerable to OOM attack",
    "UpdatedAt": "2023-11-05T05:01:40Z",
    "WithdrawnAt": "",
    "CVSS": {
      "Score": 7.5,
      "VectorString": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H"
    }
  },
  "Versions": [
    {
      "FirstPatchedVersion": {
        "Identifier": "0.27.4"
      },
      "VulnerableVersionRange": "\u003c= 0.27.3"
    }
  ]
}