{
  "id": "PYSEC-2022-32",
  "modified": "2023-11-08T04:08:26.730610Z",
  "published": "2022-02-23T23:15:00Z",
  "aliases": [
    "CVE-2022-23653",
    "GHSA-8wr4-2wm6-w3pr"
  ],
  "details": "B2 Command Line Tool is the official command line tool for the backblaze cloud storage service. Linux and Mac releases of the B2 command-line tool version 3.2.0 and below contain a key disclosure vulnerability that, in certain conditions, can be exploited by local attackers through a time-of-check-time-of-use (TOCTOU) race condition. The command line tool saves API keys (and bucket name-to-id mapping) in a local database file (`$XDG_CONFIG_HOME/b2/account_info`, `~/.b2_account_info` or a user-defined path) when `b2 authorize-account` is first run. This happens regardless of whether a valid key is provided or not. When first created, the file is world readable and is (typically a few milliseconds) later altered to be private to the user. If the directory is readable by a local attacker and the user did not yet run `b2 authorize-account` then during the brief period between file creation and permission modification, a local attacker can race to open the file and maintain a handle to it. This allows the local attacker to read the contents after the file after the sensitive information has been saved to it. Users that have not yet run `b2 authorize-account` should upgrade to B2 Command-Line Tool v3.2.1 before running it. Users that have run `b2 authorize-account` are safe if at the time of the file creation no other local users had read access to the local configuration file. Users that have run `b2 authorize-account` where the designated path could be opened by another local user should upgrade to B2 Command-Line Tool v3.2.1 and remove the database and regenerate all application keys. Note that `b2 clear-account` does not remove the database file and it should not be used to ensure that all open handles to the file are invalidated. If B2 Command-Line Tool cannot be upgraded to v3.2.1 due to a dependency conflict, a binary release can be used instead. Alternatively a new version could be installed within a virtualenv, or the permissions can be changed to prevent local users from opening the database file.",
  "affected": [
    {
      "package": {
        "ecosystem": "PyPI",
        "name": "b2",
        "purl": "pkg:pypi/b2"
      },
      "ranges": [
        {
          "type": "GIT",
          "repo": "https://github.com/Backblaze/B2_Command_Line_Tool",
          "events": [
            {
              "introduced": "0"
            },
            {
              "fixed": "c74029f9f75065e8f7e3c3ec8e0a23fb8204feeb"
            }
          ]
        },
        {
          "type": "ECOSYSTEM",
          "events": [
            {
              "introduced": "0"
            },
            {
              "fixed": "3.2.1"
            }
          ]
        }
      ],
      "versions": [
        "0.3.14",
        "0.4.0",
        "0.4.10",
        "0.4.2",
        "0.4.4",
        "0.4.6",
        "0.4.8",
        "0.5.0",
        "0.5.2",
        "0.5.4",
        "0.5.6",
        "0.6.0",
        "0.6.2",
        "0.6.4",
        "0.6.6",
        "0.6.8",
        "0.7.0",
        "0.7.2",
        "0.7.4",
        "1.0.0",
        "1.1.0",
        "1.2.0",
        "1.3.0",
        "1.3.2",
        "1.3.4",
        "1.3.6",
        "1.3.8",
        "1.4.0",
        "1.4.2",
        "2.0.0",
        "2.0.2",
        "2.1.0",
        "2.2.0",
        "2.3.0",
        "2.4.0",
        "2.5.0",
        "2.5.1",
        "3.0.0",
        "3.0.1",
        "3.0.2",
        "3.0.3",
        "3.1.0",
        "3.2.0"
      ],
      "database_specific": {
        "source": "https://github.com/pypa/advisory-database/blob/main/vulns/b2/PYSEC-2022-32.yaml"
      }
    }
  ],
  "references": [
    {
      "type": "ADVISORY",
      "url": "https://github.com/Backblaze/B2_Command_Line_Tool/security/advisories/GHSA-8wr4-2wm6-w3pr"
    },
    {
      "type": "FIX",
      "url": "https://github.com/Backblaze/B2_Command_Line_Tool/commit/c74029f9f75065e8f7e3c3ec8e0a23fb8204feeb"
    }
  ]
}