{
  "Identifier": "GHSA-673j-qm5f-xpv8",
  "PackageSlug": "maven/org.postgresql/postgresql",
  "Title": "Improper Neutralization of Special Elements used in an OS Command ('OS Command Injection')",
  "Description": "The connection properties for configuring a pgjdbc connection are not meant to be exposed to an unauthenticated attacker. While allowing an attacker to specify arbitrary connection properties could lead to a compromise of a system, that's a defect of an application that allows unauthenticated attackers that level of control. It's not the job of the pgjdbc driver to decide whether a given log file location is acceptable. End user applications that use the pgjdbc driver must ensure that filenames are valid and restrict unauthenticated attackers from being able to supply arbitrary values. That's not specific to the pgjdbc driver either, it would be true for any library that can write to the application's local file system. While we do not consider this a security issue with the driver, we have decided to remove the `loggerFile` and `loggerLevel` connection properties in the next release of the driver. Removal of those properties does not make exposing the JDBC URL or connection properties to an attacker safe and we continue to suggest that applications do not allow untrusted users to specify arbitrary connection properties. We are removing them to prevent misuse and their functionality can be delegated to `java.util.logging`.",
  "Date": "2022-02-16",
  "Pubdate": "2022-02-16",
  "AffectedRange": "[42.1.0,42.3.3)",
  "FixedVersions": [
    "42.3.3"
  ],
  "AffectedVersions": "All versions starting from 42.1.0 before 42.3.3",
  "NotImpacted": "All versions before 42.1.0, all versions starting from 42.3.3",
  "Solution": "Upgrade to version 42.3.3 or above.",
  "Urls": [
    "https://github.com/pgjdbc/pgjdbc/security/advisories/GHSA-673j-qm5f-xpv8",
    "https://github.com/pgjdbc/pgjdbc/commit/f6d47034a4ce292e1a659fa00963f6f713117064",
    "https://github.com/advisories/GHSA-673j-qm5f-xpv8"
  ],
  "CvssV2": "",
  "CvssV3": "",
  "UUID": "1092a650-efc9-4667-b6c1-2ad4ec6353ad"
}