{
  "Severity": "MODERATE",
  "UpdatedAt": "2025-05-13T20:02:19Z",
  "Package": {
    "Ecosystem": "COMPOSER",
    "Name": "getkirby/cms"
  },
  "Advisory": {
    "DatabaseId": 294097,
    "Id": "GSA_kwCzR0hTQS14Mjc1LWg5ajQtN3A0aM4ABHzR",
    "GhsaId": "GHSA-x275-h9j4-7p4h",
    "References": [
      {
        "Url": "https://github.com/getkirby/kirby/security/advisories/GHSA-x275-h9j4-7p4h"
      },
      {
        "Url": "https://nvd.nist.gov/vuln/detail/CVE-2025-31493"
      },
      {
        "Url": "https://github.com/getkirby/kirby/commit/95a51480a426a8ed0df799cc017403be9b987ced"
      },
      {
        "Url": "https://github.com/getkirby/kirby/releases/tag/3.10.1.2"
      },
      {
        "Url": "https://github.com/getkirby/kirby/releases/tag/3.9.8.3"
      },
      {
        "Url": "https://github.com/getkirby/kirby/releases/tag/4.7.1"
      },
      {
        "Url": "https://github.com/advisories/GHSA-x275-h9j4-7p4h"
      }
    ],
    "Identifiers": [
      {
        "Type": "GHSA",
        "Value": "GHSA-x275-h9j4-7p4h"
      },
      {
        "Type": "CVE",
        "Value": "CVE-2025-31493"
      }
    ],
    "Description": "### TL;DR\n\nThis vulnerability affects all Kirby sites that use the `collection()` helper or `$kirby-\u003ecollection()` method with a dynamic collection name (such as a collection name that depends on request or user data).\n\nSites that only use fixed calls to the `collection()` helper/`$kirby-\u003ecollection()` method (i.e. calls with a simple string for the collection name) are *not* affected.\n\n----\n\n### Introduction\n\nKirby's `collection()` helper and `$kirby-\u003ecollection()` method (in the following abbreviated to the `collection()` helper) allow to load PHP logic files that are normally stored in the `site/collections` folder or registered by plugins through the `collections` plugin extension.\n\nIf the `collection()` helper is called with an arbitrary collection name, Kirby first checks if a file with this name exists in the collections root (which defaults to `site/collections`).\n\nThis logic was vulnerable against path traversal attacks. By using special elements such as `..` and `/` separators, attackers can escape outside of the restricted location to access files or directories that are elsewhere on the system. One of the most common special elements is the `../` sequence, which in most modern operating systems is interpreted as the parent directory of the current location.\n\nBecause Kirby's `collection()` helper did not protect against path traversal, the provided collection name could include special sequences that would cause Kirby to look outside of the configured collections root and access arbitrary files.\n\n### Impact\n\nThe missing path traversal check allowed attackers to navigate and access all files on the server that were accessible to the PHP process, including files outside of the collections root or even outside of the Kirby installation. PHP code within such files was executed.\n\nSuch attacks first require an attack vector in the site code that is caused by dynamic collection names, such as `collection('tags-' . get('tags'))`. It generally also requires knowledge of the site structure and the server's file system by the attacker, although it can be possible to find vulnerable setups through automated methods such as fuzzing.\n\nIn a vulnerable setup, this could cause damage to the confidentiality and integrity of the server, for example:\n\n- it could allow the attacker to build a map of the server's file system for subsequent attacks,\n- it could allow access to configuration files that may contain sensitive information like security tokens or\n- it could cause the unintended execution of PHP scripts.\n\n### Patches\n\nThe problem has been patched in [Kirby 3.9.8.3](https://github.com/getkirby/kirby/releases/tag/3.9.8.3), [Kirby 3.10.1.2](https://github.com/getkirby/kirby/releases/tag/3.10.1.2) and [Kirby 4.7.1](https://github.com/getkirby/kirby/releases/tag/4.7.1). Please update to one of these or a [later version](https://github.com/getkirby/kirby/releases) to fix the vulnerability.\n\nIn all of the mentioned releases, we have added a check for the collection path that ensures that the resulting path is contained within the configured collections root. Collection paths that point outside of the collections root will not be loaded.",
    "Origin": "UNSPECIFIED",
    "PublishedAt": "2025-05-13T20:02:17Z",
    "Severity": "MODERATE",
    "Summary": "Kirby vulnerable to path traversal of collection names during file system lookup",
    "UpdatedAt": "2025-05-13T20:02:19Z",
    "WithdrawnAt": "",
    "CVSS": {
      "Score": 0,
      "VectorString": ""
    }
  },
  "Versions": [
    {
      "FirstPatchedVersion": {
        "Identifier": "4.7.1"
      },
      "VulnerableVersionRange": "\u003e= 4.0.0, \u003c 4.7.1"
    },
    {
      "FirstPatchedVersion": {
        "Identifier": "3.10.1.2"
      },
      "VulnerableVersionRange": "\u003e= 3.10.0, \u003c 3.10.1.2"
    },
    {
      "FirstPatchedVersion": {
        "Identifier": "3.9.8.3"
      },
      "VulnerableVersionRange": "\u003c 3.9.8.3"
    }
  ]
}