{
  "Severity": "MODERATE",
  "UpdatedAt": "2022-10-18T21:16:32Z",
  "Package": {
    "Ecosystem": "COMPOSER",
    "Name": "getkirby/cms"
  },
  "Advisory": {
    "DatabaseId": 194220,
    "Id": "GSA_kwCzR0hTQS1jMjdqLTc2eGctNng0Zs4AAvas",
    "GhsaId": "GHSA-c27j-76xg-6x4f",
    "References": [
      {
        "Url": "https://github.com/getkirby/kirby/security/advisories/GHSA-c27j-76xg-6x4f"
      },
      {
        "Url": "https://github.com/getkirby/kirby/releases/tag/3.5.8.2"
      },
      {
        "Url": "https://github.com/getkirby/kirby/releases/tag/3.6.6.2"
      },
      {
        "Url": "https://github.com/getkirby/kirby/releases/tag/3.7.5.1"
      },
      {
        "Url": "https://github.com/getkirby/kirby/releases/tag/3.8.1"
      },
      {
        "Url": "https://nvd.nist.gov/vuln/detail/CVE-2022-39315"
      },
      {
        "Url": "https://github.com/advisories/GHSA-c27j-76xg-6x4f"
      }
    ],
    "Identifiers": [
      {
        "Type": "GHSA",
        "Value": "GHSA-c27j-76xg-6x4f"
      },
      {
        "Type": "CVE",
        "Value": "CVE-2022-39315"
      }
    ],
    "Description": "### TL;DR\n\nThis vulnerability affects all Kirby sites with user accounts (unless Kirby's API and Panel are disabled in the config). It can only be exploited for targeted attacks because the attack does not scale to brute force.\n\n----\n\n### Introduction\n\nUser enumeration is a type of vulnerability that allows attackers to confirm which users are registered in a Kirby installation. This information can be abused for social engineering attacks against users of the site or to find out the organizational structure of the company.\n\nUser enumeration attacks are performed by entering an existing and a non-existing user into the email address field of the login form. If the system returns a different response or behaves differently depending on whether the user exists, the attacker can enter unknown email addresses and use the different behavior as a clue for the (non-)existing user.\n\n### Impact\n\nKirby comes with a built-in brute force protection. By default, it will prevent further login attempts after 10 failed logins from a single IP address or of a single existing user. After every failed login attempt, Kirby inserts a random delay between one millisecond and two seconds to make automated attacks harder and to avoid leaking whether the user exists. Unfortunately, this random delay was not inserted after the brute force limit was reached.\n\nBecause Kirby only tracks failed login attempts per email address for existing users but always tracks failed login attempts per IP address, this behavior could be abused by attackers for user enumeration. For this to work, an attacker would need to create login requests beyond the trials limit (which is 10 by default) from two or more IP addresses. After the trials limit was reached, the login form immediately blocked further requests for existing users, but not for invalid users.\n\nThis exploit does not scale to brute force attacks because of the delay during the first 10 requests per user, the faint difference between the responses for valid and invalid users and the fact that code-based logins would send an email for every login attempt, which makes the attack easy to spot. The vulnerability is therefore only relevant for targeted attacks.\n\n### Patches\n\nThe problem has been patched in [Kirby 3.5.8.2](https://github.com/getkirby/kirby/releases/tag/3.5.8.2), [Kirby 3.6.6.2](https://github.com/getkirby/kirby/releases/tag/3.6.6.2), [Kirby 3.7.5.1](https://github.com/getkirby/kirby/releases/tag/3.7.5.1) and [Kirby 3.8.1](https://github.com/getkirby/kirby/releases/tag/3.8.1). Please update to one of these or a [later version](https://github.com/getkirby/kirby/releases) to fix the vulnerability.\n\nIn all of the mentioned releases, we have rewritten the affected code so that the delay is also inserted after the brute force limit is reached.",
    "Origin": "UNSPECIFIED",
    "PublishedAt": "2022-10-18T21:16:27Z",
    "Severity": "MODERATE",
    "Summary": "Kirby CMS vulnerable to user enumeration in the brute force protection",
    "UpdatedAt": "2023-07-14T21:52:47Z",
    "WithdrawnAt": "",
    "CVSS": {
      "Score": 6.5,
      "VectorString": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:N"
    }
  },
  "Versions": [
    {
      "FirstPatchedVersion": {
        "Identifier": "3.8.1"
      },
      "VulnerableVersionRange": "= 3.8.0"
    },
    {
      "FirstPatchedVersion": {
        "Identifier": "3.7.5.1"
      },
      "VulnerableVersionRange": "\u003e= 3.7.0, \u003c 3.7.5.1"
    },
    {
      "FirstPatchedVersion": {
        "Identifier": "3.6.6.2"
      },
      "VulnerableVersionRange": "\u003e= 3.6.0, \u003c 3.6.6.2"
    },
    {
      "FirstPatchedVersion": {
        "Identifier": "3.5.8.2"
      },
      "VulnerableVersionRange": "\u003c 3.5.8.2"
    }
  ]
}