{
  "Severity": "MODERATE",
  "UpdatedAt": "2025-11-18T18:01:26Z",
  "Package": {
    "Ecosystem": "COMPOSER",
    "Name": "getkirby/cms"
  },
  "Advisory": {
    "DatabaseId": 322134,
    "Id": "GSA_kwCzR0hTQS04NGhmLThnaDUtNTc1as4ABOpW",
    "GhsaId": "GHSA-84hf-8gh5-575j",
    "References": [
      {
        "Url": "https://github.com/getkirby/kirby/security/advisories/GHSA-84hf-8gh5-575j"
      },
      {
        "Url": "https://github.com/getkirby/kirby/releases/tag/5.1.4"
      },
      {
        "Url": "https://github.com/advisories/GHSA-84hf-8gh5-575j"
      }
    ],
    "Identifiers": [
      {
        "Type": "GHSA",
        "Value": "GHSA-84hf-8gh5-575j"
      },
      {
        "Type": "CVE",
        "Value": "CVE-2025-65012"
      }
    ],
    "Description": "### TL;DR\n\nThis vulnerability affects all Kirby 5 sites that might have potential attackers in the group of authenticated Panel users or that allow external visitors to update page titles or usernames.\n\nThe attack requires user interaction by another Panel user and *cannot* be automated.\n\n----\n\n### Introduction\n\nCross-site scripting (XSS) is a type of vulnerability that allows to execute any kind of JavaScript code inside the Panel session of the same or other users. In the Panel, a harmful script can for example trigger requests to Kirby's API with the permissions of the victim.\n\nSuch vulnerabilities are critical if you might have potential attackers in your group of authenticated Panel users. They can escalate their privileges if they get access to the Panel session of an admin user. Depending on your site, other JavaScript-powered attacks are possible.\n\n### Impact\n\nThe \"Changes\" dialog in the Panel displays all content models (pages, files, users) with changed content, i.e. with content that has not yet been published. Each changed model is listed with its preview image/icon and its title/name.\n\nAttackers could change the title of any page or the name of any user to a malicious string. Then they could modify any content field of the same model without saving, making the model a candidate for display in the \"Changes\" dialog. If another authenticated user subsequently opened the dialog in their Panel, the malicious code would be executed.\n\n### Patches\n\nThe problem has been patched in [Kirby 5.1.4](https://github.com/getkirby/kirby/releases/tag/5.1.4). Please update to this or a [later version](https://github.com/getkirby/kirby/releases) to fix the vulnerability.\n\nIn the patch release, we have added the required escaping code to signal to the browser the intent of displaying plain text instead of code in the places where the model titles are rendered.",
    "Origin": "UNSPECIFIED",
    "PublishedAt": "2025-11-18T18:01:25Z",
    "Severity": "MODERATE",
    "Summary": "Kirby CMS has cross-site scripting (XSS) in the changes dialog",
    "UpdatedAt": "2025-11-18T18:01:26Z",
    "WithdrawnAt": "",
    "CVSS": {
      "Score": 0,
      "VectorString": ""
    }
  },
  "Versions": [
    {
      "FirstPatchedVersion": {
        "Identifier": "5.1.4"
      },
      "VulnerableVersionRange": "\u003e= 5.0.0, \u003c 5.1.4"
    }
  ]
}